#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV_Pod

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AUV_Pod.ABP_AUV_Pod_C.AnimateDoor
// 0x0030 (0x0030 - 0x0000)
struct ABP_AUV_Pod_C_AnimateDoor final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_Pod_C_AnimateDoor) == 0x000008, "Wrong alignment on ABP_AUV_Pod_C_AnimateDoor");
static_assert(sizeof(ABP_AUV_Pod_C_AnimateDoor) == 0x000030, "Wrong size on ABP_AUV_Pod_C_AnimateDoor");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, DeltaTime) == 0x000000, "Member 'ABP_AUV_Pod_C_AnimateDoor::DeltaTime' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_AUV_Pod_C_AnimateDoor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_AUV_Pod_C_AnimateDoor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'ABP_AUV_Pod_C_AnimateDoor::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'ABP_AUV_Pod_C_AnimateDoor::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_AnimateDoor, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'ABP_AUV_Pod_C_AnimateDoor::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");

// Function ABP_AUV_Pod.ABP_AUV_Pod_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AUV_Pod_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AUV_Pod_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AUV_Pod_C_AnimGraph");
static_assert(sizeof(ABP_AUV_Pod_C_AnimGraph) == 0x000010, "Wrong size on ABP_AUV_Pod_C_AnimGraph");
static_assert(offsetof(ABP_AUV_Pod_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_AUV_Pod_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_AUV_Pod.ABP_AUV_Pod_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AUV_Pod_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_Pod_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AUV_Pod_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AUV_Pod_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AUV_Pod_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AUV_Pod_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AUV_Pod_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AUV_Pod.ABP_AUV_Pod_C.ExecuteUbergraph_ABP_AUV_Pod
// 0x0010 (0x0010 - 0x0000)
struct ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AnimateDoor_DeltaTime_ImplicitCast;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod) == 0x000008, "Wrong alignment on ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod");
static_assert(sizeof(ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod) == 0x000010, "Wrong size on ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod");
static_assert(offsetof(ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod, EntryPoint) == 0x000000, "Member 'ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod, CallFunc_AnimateDoor_DeltaTime_ImplicitCast) == 0x000008, "Member 'ABP_AUV_Pod_C_ExecuteUbergraph_ABP_AUV_Pod::CallFunc_AnimateDoor_DeltaTime_ImplicitCast' has a wrong offset!");

}

