#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pistol_G19

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Pistol_G19.ABP_Pistol_G19_C
// 0x05D0 (0x0980 - 0x03B0)
class UABP_Pistol_G19_C final : public UP2WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x03E8(0x0010)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0418(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0438(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0560(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0688(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x07B0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x07F8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0840(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0920(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0930(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pistol_G19_AnimGraphNode_ModifyBone_3492273A4C71D3453ABEB0B9BB5D4392()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pistol_G19_AnimGraphNode_ModifyBone_A651176C4E3F0F4A50C57EB794315837()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Pistol_G19_AnimGraphNode_ModifyBone_B6FF2F55464F256FB64036B949F7C597()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Pistol_G19(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Pistol_G19_C">();
	}
	static class UABP_Pistol_G19_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Pistol_G19_C>();
	}
};
static_assert(alignof(UABP_Pistol_G19_C) == 0x000010, "Wrong alignment on UABP_Pistol_G19_C");
static_assert(sizeof(UABP_Pistol_G19_C) == 0x000980, "Wrong size on UABP_Pistol_G19_C");
static_assert(offsetof(UABP_Pistol_G19_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_Pistol_G19_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_Pistol_G19_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_Pistol_G19_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_Root) == 0x0003C8, "Member 'UABP_Pistol_G19_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_LocalRefPose_1) == 0x0003E8, "Member 'UABP_Pistol_G19_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_LocalToComponentSpace) == 0x0003F8, "Member 'UABP_Pistol_G19_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_ComponentToLocalSpace) == 0x000418, "Member 'UABP_Pistol_G19_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_ModifyBone_2) == 0x000438, "Member 'UABP_Pistol_G19_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_ModifyBone_1) == 0x000560, "Member 'UABP_Pistol_G19_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_ModifyBone) == 0x000688, "Member 'UABP_Pistol_G19_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_Slot_2) == 0x0007B0, "Member 'UABP_Pistol_G19_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_Slot_1) == 0x0007F8, "Member 'UABP_Pistol_G19_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_LayeredBoneBlend) == 0x000840, "Member 'UABP_Pistol_G19_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_LocalRefPose) == 0x000920, "Member 'UABP_Pistol_G19_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_Pistol_G19_C, AnimGraphNode_Slot) == 0x000930, "Member 'UABP_Pistol_G19_C::AnimGraphNode_Slot' has a wrong offset!");

}

