#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AmmoPlant_Belt_01

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_AmmoPlant_Belt_01.ABP_AmmoPlant_Belt_01_C.AnimBlueprintGeneratedConstantData
// 0x0167 (0x0168 - 0x0001)
struct ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_224;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_225;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_226;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_227;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_228;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_229;                               // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_230;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_231;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_232;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_233;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_234;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_235;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_236;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_237;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_238;                               // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_239;                              // 0x0064(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_240;                               // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_241;                                // 0x0094(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_242;                                // 0x0095(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_243;                                // 0x0096(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_244;                                // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_245;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_246;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_247;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0150(0x0018)()
};
static_assert(alignof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData) == 0x000168, "Wrong size on ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_224) == 0x000004, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_224' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_225) == 0x00000C, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_225' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_226) == 0x000014, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_226' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_227) == 0x00001C, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_227' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_228) == 0x000024, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_228' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_229) == 0x00002C, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_229' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_230) == 0x000030, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_230' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __IntProperty_231) == 0x000038, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__IntProperty_231' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_232) == 0x00003C, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_232' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __IntProperty_233) == 0x000044, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__IntProperty_233' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_234) == 0x000048, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_234' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __IntProperty_235) == 0x000050, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__IntProperty_235' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_236) == 0x000054, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_236' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __IntProperty_237) == 0x00005C, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__IntProperty_237' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_238) == 0x000060, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_238' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __StructProperty_239) == 0x000064, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__StructProperty_239' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __FloatProperty_240) == 0x000090, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__FloatProperty_240' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __BoolProperty_241) == 0x000094, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__BoolProperty_241' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __EnumProperty_242) == 0x000095, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__EnumProperty_242' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __ByteProperty_243) == 0x000096, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__ByteProperty_243' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_244) == 0x000098, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_244' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __NameProperty_245) == 0x0000A0, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__NameProperty_245' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __IntProperty_246) == 0x0000A8, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__IntProperty_246' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, __StructProperty_247) == 0x0000B0, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::__StructProperty_247' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D0, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000150, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_AmmoPlant_Belt_01.ABP_AmmoPlant_Belt_01_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

