#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PMC_Hero_TPP_FakeBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph) == 0x000010, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody
// 0x0018 (0x0018 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody) == 0x000018, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, EntryPoint) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000005, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_ExecuteUbergraph_ABP_PMC_Hero_TPP_FakeBody::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.FakeBodyOffsetCurveCheck
// 0x0018 (0x0018 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck final
{
public:
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck) == 0x000018, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck, CallFunc_GetMesh3P_ReturnValue) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck, CallFunc_GetCurveValue_ReturnValue) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_FakeBodyOffsetCurveCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.GetCardinalAimDirection
// 0x0050 (0x0050 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection final
{
public:
	ECardinalDirection                            AimDirection;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            AimDirection_loc;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_3;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_2;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_3;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection) == 0x000050, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, AimDirection) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::AimDirection' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, AimDirection_loc) == 0x000001, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::AimDirection_loc' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000002, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000003, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000005, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000007, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_ReturnValue_3) == 0x000009, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x00000A, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_ReturnValue_3) == 0x00000B, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_BooleanAND_ReturnValue_2) == 0x00000C, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000018, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_A_ImplicitCast_2) == 0x000028, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000030, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_Greater_DoubleDouble_A_ImplicitCast_3) == 0x000038, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_Greater_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2) == 0x000040, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3) == 0x000048, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_GetCardinalAimDirection::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.Setup Dbno HipfireIdle Transition
// 0x0058 (0x0058 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	ECardinalDirection                            Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CallFunc_GetCardinalAimDirection_AimDirection;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequenceWithInertialBlending_ReturnValue; // 0x0048(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition) == 0x000058, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, Context) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::Context' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, Node) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::Node' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, Temp_byte_Variable) == 0x000020, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, CallFunc_GetCardinalAimDirection_AimDirection) == 0x000039, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::CallFunc_GetCardinalAimDirection_AimDirection' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, K2Node_Select_Default) == 0x000040, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition, CallFunc_SetSequenceWithInertialBlending_ReturnValue) == 0x000048, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_HipfireIdle_Transition::CallFunc_SetSequenceWithInertialBlending_ReturnValue' has a wrong offset!");

// Function ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.Setup Dbno IdleHipfire Transition
// 0x0058 (0x0058 - 0x0000)
struct ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	ECardinalDirection                            Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CallFunc_GetCardinalAimDirection_AimDirection;     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequencePlayerReference               CallFunc_SetSequenceWithInertialBlending_ReturnValue; // 0x0048(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition) == 0x000058, "Wrong size on ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, Context) == 0x000000, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::Context' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, Node) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::Node' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, Temp_byte_Variable) == 0x000020, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, CallFunc_GetCardinalAimDirection_AimDirection) == 0x000039, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::CallFunc_GetCardinalAimDirection_AimDirection' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, K2Node_Select_Default) == 0x000040, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition, CallFunc_SetSequenceWithInertialBlending_ReturnValue) == 0x000048, "Member 'ABP_PMC_Hero_TPP_FakeBody_C_Setup_Dbno_IdleHipfire_Transition::CallFunc_SetSequenceWithInertialBlending_ReturnValue' has a wrong offset!");

}

