#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SMG_DBX_M

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SMG_DBX_M.ABP_SMG_DBX_M_C
// 0x04A0 (0x0850 - 0x03B0)
class UABP_SMG_DBX_M_C final : public UP2WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03E8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0408(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0530(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x0550(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0598(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x05A8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05F0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0638(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0648(0x0128)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0770(0x00E0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SMG_DBX_M_AnimGraphNode_ModifyBone_B8E3B52E444AFE62711284A48F62E072()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SMG_DBX_M_AnimGraphNode_ModifyBone_DC47320F4BEF1976D00911A2276D8E3A()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_SMG_DBX_M(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_SMG_DBX_M_C">();
	}
	static class UABP_SMG_DBX_M_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_SMG_DBX_M_C>();
	}
};
static_assert(alignof(UABP_SMG_DBX_M_C) == 0x000010, "Wrong alignment on UABP_SMG_DBX_M_C");
static_assert(sizeof(UABP_SMG_DBX_M_C) == 0x000850, "Wrong size on UABP_SMG_DBX_M_C");
static_assert(offsetof(UABP_SMG_DBX_M_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_SMG_DBX_M_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_SMG_DBX_M_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_SMG_DBX_M_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_Root) == 0x0003C8, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003E8, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_ModifyBone_1) == 0x000408, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_LocalToComponentSpace) == 0x000530, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_Slot_2) == 0x000550, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_LocalRefPose_1) == 0x000598, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_Slot_1) == 0x0005A8, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_Slot) == 0x0005F0, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_LocalRefPose) == 0x000638, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_ModifyBone) == 0x000648, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_SMG_DBX_M_C, AnimGraphNode_LayeredBoneBlend) == 0x000770, "Member 'UABP_SMG_DBX_M_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");

}

