#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_AUV.ABP_AUV_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct ABP_AUV::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_112;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_113;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_114;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_115;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_116;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_117;                              // 0x0024(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_118;                               // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_119;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_120;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_121;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_122;                            // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_123;                            // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_124;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_125;                               // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_126;                                // 0x009C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_127;                                // 0x009D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_128;                            // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_129;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_130;                                // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_131;                                // 0x00AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_132;                                // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(ABP_AUV::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_AUV::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_AUV::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on ABP_AUV::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __NameProperty_112) == 0x000004, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__NameProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __NameProperty_113) == 0x00000C, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__NameProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __IntProperty_114) == 0x000014, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__IntProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __NameProperty_115) == 0x000018, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__NameProperty_115' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __IntProperty_116) == 0x000020, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__IntProperty_116' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __StructProperty_117) == 0x000024, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__StructProperty_117' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __FloatProperty_118) == 0x000050, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__FloatProperty_118' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __NameProperty_119) == 0x000054, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__NameProperty_119' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __IntProperty_120) == 0x00005C, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__IntProperty_120' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_121) == 0x000060, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_121' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_122) == 0x000068, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_122' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_123) == 0x000070, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_123' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __StructProperty_124) == 0x000078, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__StructProperty_124' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __FloatProperty_125) == 0x000098, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__FloatProperty_125' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __ByteProperty_126) == 0x00009C, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__ByteProperty_126' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __BoolProperty_127) == 0x00009D, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__BoolProperty_127' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_128) == 0x0000A0, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_128' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __BoolProperty_129) == 0x0000A8, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__BoolProperty_129' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __EnumProperty_130) == 0x0000A9, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__EnumProperty_130' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __ByteProperty_131) == 0x0000AA, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__ByteProperty_131' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x0000AC, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'ABP_AUV::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_AUV.ABP_AUV_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct ABP_AUV::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_AUV::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_AUV::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on ABP_AUV::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_AUV::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_AUV::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_AUV::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_AUV::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");

}

