#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV_Pod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AUV_Pod.ABP_AUV_Pod_C
// 0x01D0 (0x0520 - 0x0350)
class UABP_AUV_Pod_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0388(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0398(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04E0(0x0020)()
	bool                                          bDoorOpened_Replicated;                            // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoorOpened_Current;                               // 0x0501(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimationIsPlaying;                               // 0x0502(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_503[0x5];                                      // 0x0503(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DoorOpenAlpha;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DoorOpenSpeed;                                     // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateDoor(double DeltaTime)	 // 0xae1e64;
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_AUV_Pod(int32 EntryPoint)	 // 0xae1e64;
	void PlayEnterAnimation()	 // 0xae1e64;
	void PlayExitAnimation()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_AUV_Pod_C">();
	}
	static class UABP_AUV_Pod_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_AUV_Pod_C>();
	}
};
static_assert(alignof(UABP_AUV_Pod_C) == 0x000010, "Wrong alignment on UABP_AUV_Pod_C");
static_assert(sizeof(UABP_AUV_Pod_C) == 0x000520, "Wrong size on UABP_AUV_Pod_C");
static_assert(offsetof(UABP_AUV_Pod_C, UberGraphFrame) == 0x000350, "Member 'UABP_AUV_Pod_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_AUV_Pod_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_AUV_Pod_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_AUV_Pod_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimGraphNode_LocalRefPose) == 0x000388, "Member 'UABP_AUV_Pod_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimGraphNode_ModifyBone) == 0x000398, "Member 'UABP_AUV_Pod_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimGraphNode_LocalToComponentSpace) == 0x0004C0, "Member 'UABP_AUV_Pod_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004E0, "Member 'UABP_AUV_Pod_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, bDoorOpened_Replicated) == 0x000500, "Member 'UABP_AUV_Pod_C::bDoorOpened_Replicated' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, bDoorOpened_Current) == 0x000501, "Member 'UABP_AUV_Pod_C::bDoorOpened_Current' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, bAnimationIsPlaying) == 0x000502, "Member 'UABP_AUV_Pod_C::bAnimationIsPlaying' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, DoorOpenAlpha) == 0x000508, "Member 'UABP_AUV_Pod_C::DoorOpenAlpha' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Pod_C, DoorOpenSpeed) == 0x000510, "Member 'UABP_AUV_Pod_C::DoorOpenSpeed' has a wrong offset!");

}

