#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PMC_Layer_Unarmed_FPP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PMC_Layer_Unarmed_FPP.ABP_PMC_Layer_Unarmed_FPP_C.AnimBlueprintGeneratedConstantData
// 0x01B7 (0x01B8 - 0x0001)
struct ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_183;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_184;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_185;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_186;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_187;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_188;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_189;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_190;                                // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_191;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_192;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_193;                                 // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_194;                                // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_195;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_196;                              // 0x0060(0x002C)(BlueprintVisible, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_197;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_198;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_199;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_200;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_201;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_202;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_203;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_204;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_205;                                // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_206;                                // 0x00C5(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_207;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_208;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_209;                                // 0x00D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_210;                                // 0x00DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_211;                                // 0x00E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_212;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_213;                              // 0x00F8(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_214;                                // 0x0118(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0120(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01A0(0x0018)()
};
static_assert(alignof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData) == 0x0001B8, "Wrong size on ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_183) == 0x000004, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_183' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_184) == 0x00000C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_184' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_185) == 0x000014, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_185' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_186) == 0x00001C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_186' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_187) == 0x000024, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_187' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_188) == 0x00002C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_188' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_189) == 0x000034, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_189' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_190) == 0x00003C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_190' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_191) == 0x000044, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_191' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_192) == 0x000048, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_192' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_193) == 0x000050, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_193' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_194) == 0x000054, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_194' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_195) == 0x00005C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_195' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_196) == 0x000060, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_196' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __BlendProfile_197) == 0x000090, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__BlendProfile_197' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __CurveFloat_198) == 0x000098, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__CurveFloat_198' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_199) == 0x0000A0, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_199' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_200) == 0x0000A1, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_200' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_201) == 0x0000A8, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_201' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_202) == 0x0000B8, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_202' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_203) == 0x0000BC, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_203' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_204) == 0x0000C0, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_204' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_205) == 0x0000C4, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_205' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_206) == 0x0000C5, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_206' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_207) == 0x0000C8, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_207' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_208) == 0x0000D0, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_208' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_209) == 0x0000D4, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_209' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_210) == 0x0000DC, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_210' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_211) == 0x0000E4, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_211' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_212) == 0x0000EC, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_212' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_213) == 0x0000F8, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_213' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_214) == 0x000118, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_214' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000120, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001A0, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_PMC_Layer_Unarmed_FPP.ABP_PMC_Layer_Unarmed_FPP_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000008, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x00000C, "Member 'ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");

}

