#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BOSS_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.AnimBlueprintGeneratedConstantData
// 0x01CF (0x01D0 - 0x0001)
struct ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_374;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_375;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_376;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_377;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_378;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_379;                               // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_380;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_381;                                 // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_382;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_383;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_384;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_385;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_386;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_387;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	struct FInputScaleBiasClampConstants          __StructProperty_388;                              // 0x0070(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_389;                                // 0x009C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_390;                                // 0x009D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_391;                                // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_392;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_393;                               // 0x00B0(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_394;                               // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_395;                                // 0x00C4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_396;                               // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_397;                                // 0x00CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_398;                                // 0x00CD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_399;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_400;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_401;                                // 0x00D9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_402;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_403;                              // 0x00F0(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_404;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_405;                                  // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_406;                                // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_407;                                // 0x0121(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_408;                                // 0x0122(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_409;                               // 0x0128(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0138(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01B8(0x0018)()
};
static_assert(alignof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData) == 0x0001D0, "Wrong size on ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_374) == 0x000004, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_374' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_375) == 0x00000C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_375' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_376) == 0x000014, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_376' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_377) == 0x000018, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_377' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_378) == 0x000020, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_378' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_379) == 0x000024, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_379' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_380) == 0x000028, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_380' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_381) == 0x000030, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_381' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_382) == 0x000034, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_382' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_383) == 0x00003C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_383' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_384) == 0x000040, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_384' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_385) == 0x000050, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_385' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_386) == 0x000058, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_386' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_387) == 0x000060, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_387' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_388) == 0x000070, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_388' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_389) == 0x00009C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_389' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_390) == 0x00009D, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_390' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_391) == 0x0000A0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_391' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __IntProperty_392) == 0x0000A8, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__IntProperty_392' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_393) == 0x0000B0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_393' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_394) == 0x0000C0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_394' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_395) == 0x0000C4, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_395' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __FloatProperty_396) == 0x0000C8, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__FloatProperty_396' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_397) == 0x0000CC, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_397' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ByteProperty_398) == 0x0000CD, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ByteProperty_398' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __NameProperty_399) == 0x0000D0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__NameProperty_399' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_400) == 0x0000D8, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_400' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_401) == 0x0000D9, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_401' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_402) == 0x0000E0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_402' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __StructProperty_403) == 0x0000F0, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__StructProperty_403' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __BlendProfile_404) == 0x000110, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__BlendProfile_404' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __CurveFloat_405) == 0x000118, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__CurveFloat_405' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __BoolProperty_406) == 0x000120, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__BoolProperty_406' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_407) == 0x000121, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_407' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __EnumProperty_408) == 0x000122, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__EnumProperty_408' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, __ArrayProperty_409) == 0x000128, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::__ArrayProperty_409' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000138, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001B8, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_5;                                   // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_7;                                   // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_12;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_13;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_14;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0035(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x00000C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __IntProperty_5) == 0x000010, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__IntProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000014, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __IntProperty_7) == 0x000018, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__IntProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_8) == 0x00001C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_8' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x000020, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000024, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000028, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_12) == 0x00002C, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __FloatProperty_13) == 0x000030, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__FloatProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_14) == 0x000034, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData, __BoolProperty_15) == 0x000035, "Member 'ABP_NPC_BOSS_Template::FAnimBlueprintGeneratedMutableData::__BoolProperty_15' has a wrong offset!");

}

