#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pistol_G19

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Pistol_G19.ABP_Pistol_G19_C.AnimBlueprintGeneratedConstantData
// 0x00CF (0x00D0 - 0x0001)
struct ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_35;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_36;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_37;                                 // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_38;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0038(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B8(0x0018)()
};
static_assert(alignof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData) == 0x0000D0, "Wrong size on ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, __NameProperty_35) == 0x000004, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::__NameProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, __NameProperty_36) == 0x00000C, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::__NameProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, __ByteProperty_37) == 0x000014, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::__ByteProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, __StructProperty_38) == 0x000018, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::__StructProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000038, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B8, "Member 'ABP_Pistol_G19::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

