#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Frag

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Frag.ABP_Frag_C
// 0x0140 (0x04E0 - 0x03A0)
class UABP_Frag_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03B8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0400(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0448(0x0020)()
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Attach_pin;                                        // 0x0470(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unpinned;                                          // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Frag(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Frag_C">();
	}
	static class UABP_Frag_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Frag_C>();
	}
};
static_assert(alignof(UABP_Frag_C) == 0x000010, "Wrong alignment on UABP_Frag_C");
static_assert(sizeof(UABP_Frag_C) == 0x0004E0, "Wrong size on UABP_Frag_C");
static_assert(offsetof(UABP_Frag_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_Frag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UABP_Frag_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UABP_Frag_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, AnimGraphNode_SequencePlayer) == 0x0003B8, "Member 'UABP_Frag_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, AnimGraphNode_Slot) == 0x000400, "Member 'UABP_Frag_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, AnimGraphNode_Root) == 0x000448, "Member 'UABP_Frag_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, Attach_pin) == 0x000470, "Member 'UABP_Frag_C::Attach_pin' has a wrong offset!");
static_assert(offsetof(UABP_Frag_C, Unpinned) == 0x0004D0, "Member 'UABP_Frag_C::Unpinned' has a wrong offset!");

}

