#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Wave

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "ABP_Wave_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Wave.ABP_Wave_C
// 0x00D0 (0x0470 - 0x03A0)
class UABP_Wave_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Wave::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                     // 0x03A8(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03C8(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0410(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0430(0x0040)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Wave_AnimGraphNode_SequenceEvaluator_C8775E0C4980DC6E885A59B69BEADD91()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Wave(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Wave_C">();
	}
	static class UABP_Wave_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Wave_C>();
	}
};
static_assert(alignof(UABP_Wave_C) == 0x000010, "Wrong alignment on UABP_Wave_C");
static_assert(sizeof(UABP_Wave_C) == 0x000470, "Wrong size on UABP_Wave_C");
static_assert(offsetof(UABP_Wave_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_Wave_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, __AnimBlueprintMutables) == 0x0003A8, "Member 'UABP_Wave_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_Wave_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_Wave_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, AnimGraphNode_Slot) == 0x0003C8, "Member 'UABP_Wave_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, AnimGraphNode_Root) == 0x000410, "Member 'UABP_Wave_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Wave_C, AnimGraphNode_SequenceEvaluator) == 0x000430, "Member 'UABP_Wave_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");

}

