#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_TPP

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "ABP_Hero_TPP_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Hero_TPP.ABP_Hero_TPP_C
// 0x6290 (0x6E60 - 0x0BD0)
class UABP_Hero_TPP_C final : public UP2CharacterAnimInstance_TPP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                 // 0x0BD8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_BE4[0x4];                                      // 0x0BE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0BE8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0BF0(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0BF8(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0CA0(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0CA8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0D70(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0D90(0x0108)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_14;                     // 0x0E98(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0EA8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_13;                     // 0x0EC8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0ED8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_12;                     // 0x0EF8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0F08(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0F28(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0F48(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1010(0x0048)()
	uint8                                         Pad_1058[0x8];                                     // 0x1058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1060(0x0250)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x12B0(0x0128)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x13D8(0x0010)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x13E8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x1408(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1428(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1450(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1478(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x14A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x14C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x14F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1518(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1540(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1568(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1590(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x15B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x15E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1608(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1680(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x16A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x16D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x16F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1720(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1748(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1770(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x17C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x17E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x18B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x18D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1928(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x19A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x19C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x19F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1A18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1A40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1A68(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_24;                  // 0x1A90(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x1B58(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_23;                  // 0x1B78(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x1C40(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_22;                  // 0x1C60(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x1D28(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_21;                  // 0x1D48(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1E10(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1E30(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_20;                  // 0x1E58(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1F20(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_19;                  // 0x1F40(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2008(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_18;                  // 0x2028(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x20F0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2110(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_17;                  // 0x2138(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2200(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_16;                  // 0x2220(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x22E8(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_15;                  // 0x2308(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x23D0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x23F8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x24C0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_14;                  // 0x24E0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x25A8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x25D0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2698(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_13;                  // 0x26B8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2780(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x27A8(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2878(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_12;                  // 0x2898(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2960(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2980(0x00C8)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_1;                    // 0x2A48(0x00A8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x2AF0(0x0108)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_11;                  // 0x2BF8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_10;                  // 0x2CC0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x2D88(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x2E50(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x2F18(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x2FE0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x30A8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x31B0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x31D8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x32E0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x3308(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x3350(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x3398(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x3460(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3528(0x0108)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x3630(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3678(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x36A0(0x0470)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x3B10(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x3BF0(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_11;                     // 0x3C38(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x3C48(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x3C90(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3D58(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x3DA0(0x00C8)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone;                      // 0x3E68(0x00A8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x3F10(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x3F58(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4038(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x4060(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x4128(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x41F0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x4238(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4318(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x4420(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4448(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x4470(0x0470)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x48E0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x4928(0x0118)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4A40(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x4B08(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x4C08(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x4C50(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x4C98(0x00F0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4D88(0x0470)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x51F8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_10;                     // 0x5220(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x5230(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x5250(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x5318(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_5;                        // 0x5338(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4;                        // 0x54C8(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x5658(0x0190)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_9;                      // 0x57E8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x57F8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8;                      // 0x5818(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x5828(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x5848(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x59D8(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x5B68(0x0190)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7;                      // 0x5CF8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x5D08(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0x5D28(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x5D38(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0x5D58(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x5D68(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x5D88(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x5D98(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x5DB8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x5DC8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x5DE8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x5DF8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x5E18(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x5EE0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x5F00(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x5FC8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x5FE8(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x5FF8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x6018(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x6028(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x6048(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x6110(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x6130(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x61F8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x6218(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x6238(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x6258(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x6320(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x6340(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x6360(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x6380(0x0028)()
	struct FAnimNode_SlopeWarping                 AnimGraphNode_SlopeWarping;                        // 0x63A8(0x02E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x6688(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x66A8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x66C8(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x6710(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x67D8(0x0020)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x67F8(0x0100)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x68F8(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x6AD0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x6B18(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x6B60(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x6BA8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x6C70(0x0108)()
	double                                        __CustomProperty_Pitch_02FE54174DBDF3552B8AF482491E69C8; // 0x6D78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_SpineOffset_02FE54174DBDF3552B8AF482491E69C8; // 0x6D80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Acceleration_0EA547744CE7F931F14D6CB50B198063; // 0x6D98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_ShouldDoIKTrace_0EA547744CE7F931F14D6CB50B198063; // 0x6DB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DB1[0x7];                                     // 0x6DB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2AttachOffsetAnimContext             __CustomProperty_OffsetContext_72DFC73C42C6DD253B0E2C8FE0C91804; // 0x6DB8(0x0020)()
	float                                         __CustomProperty_LeanOffset_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6DD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_DbnoAim_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6DDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DDD[0x3];                                     // 0x6DDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                __CustomProperty_WeaponAnimLoc_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6DE0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_RightIK_Alpha_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6DF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_LeftIK_Alpha_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6E00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_OffsetDistance_80C80E6B4A270DB6B5D60CB53D34073F; // 0x6E08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_InPitch_0EE2571A4011AC3F8746EBBB7D2A5A81; // 0x6E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_InYaw_0EE2571A4011AC3F8746EBBB7D2A5A81; // 0x6E18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpperBodyOverrideCurveName;                        // 0x6E20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SlideAcceleration;                                 // 0x6E28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CrouchLowering;                                    // 0x6E40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E44[0x4];                                     // 0x6E44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Cinematic_Mesh;                                    // 0x6E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CopyPose_from_Sequencer;                           // 0x6E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E51[0x3];                                     // 0x6E51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MoveMultitoolToItemRName;                          // 0x6E54(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void AnimNotify_Play_LeftHand_LowObstacle()	 // 0xae1e64;
	void AUV(struct FPoseLink* AUV_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_TPP_AnimGraphNode_ControlRig_80C80E6B4A270DB6B5D60CB53D34073F()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_TPP_AnimGraphNode_CopyBone_7A65D0804A935DAEE19A899011CB2237()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_TPP_AnimGraphNode_TransitionResult_05E28D4148C2670E2FC4A987AD588EC3()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_TPP_AnimGraphNode_TransitionResult_077F1870474FC577469472A867E05BCE()	 // 0xae1e64;
