#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_AmmoPlant_Base_01_A

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Facility_AmmoPlant_Base_01_A.ABP_Facility_AmmoPlant_Base_01_A_C
// 0x0230 (0x0580 - 0x0350)
class UABP_Facility_AmmoPlant_Base_01_A_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0388(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03B0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0420(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0440(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0488(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04A8(0x00C8)()
	int32                                         State;                                             // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_AmmoPlant_Base_01_A_AnimGraphNode_TransitionResult_0FD30F2B4BAD5CFCB07815A653D2FEA8()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_AmmoPlant_Base_01_A_AnimGraphNode_TransitionResult_A7E8FA574FCE80E0EB370ABC0CCD80BC()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Facility_AmmoPlant_Base_01_A(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Facility_AmmoPlant_Base_01_A_C">();
	}
	static class UABP_Facility_AmmoPlant_Base_01_A_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Facility_AmmoPlant_Base_01_A_C>();
	}
};
static_assert(alignof(UABP_Facility_AmmoPlant_Base_01_A_C) == 0x000010, "Wrong alignment on UABP_Facility_AmmoPlant_Base_01_A_C");
static_assert(sizeof(UABP_Facility_AmmoPlant_Base_01_A_C) == 0x000580, "Wrong size on UABP_Facility_AmmoPlant_Base_01_A_C");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, UberGraphFrame) == 0x000350, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_TransitionResult_1) == 0x000388, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_TransitionResult) == 0x0003B0, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_SequencePlayer_1) == 0x0003D8, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_StateResult_1) == 0x000420, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_SequencePlayer) == 0x000440, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_StateResult) == 0x000488, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, AnimGraphNode_StateMachine) == 0x0004A8, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Facility_AmmoPlant_Base_01_A_C, State) == 0x000570, "Member 'UABP_Facility_AmmoPlant_Base_01_A_C::State' has a wrong offset!");

}

