#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV_Hero

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_AUV_Hero_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AUV_Hero.ABP_AUV_Hero_C
// 0x03E0 (0x0860 - 0x0480)
class UABP_AUV_Hero_C final : public UP2AnimInstance_AUVHero
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_AUV_Hero::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                 // 0x0488(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04D8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x05F0(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0618(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0658(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0678(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x06C0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x06E0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0720(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0740(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0768(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0830(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0850(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AUV_Hero_AnimGraphNode_SequenceEvaluator_D59C38BE40A7C848EB602988B562E4C4()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AUV_Hero_AnimGraphNode_SequenceEvaluator_FE954E424723BA48EE40B0B5075E1271()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_AUV_Hero(int32 EntryPoint)	 // 0xae1e64;
	void SwimOverride(const struct FPoseLink& InPose, struct FPoseLink* SwimOverride_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_AUV_Hero_C">();
	}
	static class UABP_AUV_Hero_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_AUV_Hero_C>();
	}
};
static_assert(alignof(UABP_AUV_Hero_C) == 0x000010, "Wrong alignment on UABP_AUV_Hero_C");
static_assert(sizeof(UABP_AUV_Hero_C) == 0x000860, "Wrong size on UABP_AUV_Hero_C");
static_assert(offsetof(UABP_AUV_Hero_C, UberGraphFrame) == 0x000480, "Member 'UABP_AUV_Hero_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, __AnimBlueprintMutables) == 0x000488, "Member 'UABP_AUV_Hero_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimBlueprintExtension_PropertyAccess) == 0x0004A8, "Member 'UABP_AUV_Hero_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimBlueprintExtension_Base) == 0x0004B0, "Member 'UABP_AUV_Hero_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_Root_1) == 0x0004B8, "Member 'UABP_AUV_Hero_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_LinkedInputPose) == 0x0004D8, "Member 'UABP_AUV_Hero_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_TransitionResult_3) == 0x0005A0, "Member 'UABP_AUV_Hero_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_TransitionResult_2) == 0x0005C8, "Member 'UABP_AUV_Hero_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_TransitionResult_1) == 0x0005F0, "Member 'UABP_AUV_Hero_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_SequenceEvaluator_1) == 0x000618, "Member 'UABP_AUV_Hero_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_StateResult_2) == 0x000658, "Member 'UABP_AUV_Hero_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_SequencePlayer) == 0x000678, "Member 'UABP_AUV_Hero_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_StateResult_1) == 0x0006C0, "Member 'UABP_AUV_Hero_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_SequenceEvaluator) == 0x0006E0, "Member 'UABP_AUV_Hero_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_StateResult) == 0x000720, "Member 'UABP_AUV_Hero_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_TransitionResult) == 0x000740, "Member 'UABP_AUV_Hero_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_StateMachine) == 0x000768, "Member 'UABP_AUV_Hero_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_Root) == 0x000830, "Member 'UABP_AUV_Hero_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_AUV_Hero_C, AnimGraphNode_LocalRefPose) == 0x000850, "Member 'UABP_AUV_Hero_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

