#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DPV

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_DPV.ABP_DPV_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_DPV_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_DPV_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_DPV_C_AnimGraph");
static_assert(sizeof(ABP_DPV_C_AnimGraph) == 0x000010, "Wrong size on ABP_DPV_C_AnimGraph");
static_assert(offsetof(ABP_DPV_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_DPV_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_DPV.ABP_DPV_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_DPV_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_DPV_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_DPV_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_DPV_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_DPV_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_DPV_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_DPV_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_DPV.ABP_DPV_C.ExecuteUbergraph_ABP_DPV
// 0x0070 (0x0070 - 0x0000)
struct ABP_DPV_C_ExecuteUbergraph_ABP_DPV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2HeroComponent*                       CallFunc_FindHeroComponent_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Hero_C*                             K2Node_DynamicCast_AsBP_Hero;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hero_FPP_C*                        K2Node_DynamicCast_AsABP_Hero_FPP;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast_1;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV) == 0x000008, "Wrong alignment on ABP_DPV_C_ExecuteUbergraph_ABP_DPV");
static_assert(sizeof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV) == 0x000070, "Wrong size on ABP_DPV_C_ExecuteUbergraph_ABP_DPV");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, EntryPoint) == 0x000000, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000011, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_FindHeroComponent_ReturnValue) == 0x000018, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_FindHeroComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, K2Node_DynamicCast_AsBP_Hero) == 0x000028, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::K2Node_DynamicCast_AsBP_Hero' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000031, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_GetMesh1P_ReturnValue) == 0x000038, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_GetMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, K2Node_DynamicCast_AsABP_Hero_FPP) == 0x000048, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::K2Node_DynamicCast_AsABP_Hero_FPP' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000051, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, K2Node_Event_DeltaTimeX) == 0x000054, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_DPV_C_ExecuteUbergraph_ABP_DPV, CallFunc_Greater_DoubleDouble_A_ImplicitCast_1) == 0x000068, "Member 'ABP_DPV_C_ExecuteUbergraph_ABP_DPV::CallFunc_Greater_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

}

