#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_TPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Hero_TPP.ABP_Hero_TPP_C.AnimBlueprintGeneratedConstantData
// 0x051F (0x0520 - 0x0001)
struct ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_652;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_653;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_654;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_655;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_656;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_657;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_658;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_659;                              // 0x0048(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_660;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_661;                                 // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_662;                              // 0x0078(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_663;                              // 0x0098(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_664;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_665;                                 // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_666;                              // 0x00C8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_667;                                // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_668;                                 // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_669;                              // 0x00F8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_670;                              // 0x0118(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_671;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_672;                                 // 0x0140(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_673;                                // 0x0144(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_674;                                 // 0x014C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_675;                                // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_676;                                 // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_677;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_678;                                 // 0x0164(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_679;                                // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_680;                                 // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_681;                                // 0x0174(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_682;                                 // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_683;                              // 0x0180(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_684;                                // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_685;                                 // 0x01A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_686;                              // 0x01B0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_687;                                // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_688;                                 // 0x01D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_689;                              // 0x01E0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_690;                              // 0x0200(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_691;                                // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_692;                                 // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_693;                              // 0x0230(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_694;                                // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_695;                                 // 0x0258(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_696;                              // 0x0260(0x0020)(BlueprintVisible, NoDestructor)
	TArray<float>                                 __ArrayProperty_697;                               // 0x0280(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_698;                               // 0x0290(0x0010)(BlueprintVisible)
	EAlphaBlendOption                             __EnumProperty_699;                                // 0x02A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_700;                               // 0x02A8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_701;                              // 0x02B8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_702;                              // 0x02D8(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_703;                                // 0x02F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_704;                               // 0x02FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_705;                               // 0x0300(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_706;                                // 0x0304(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_707;                                // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_708;                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_709;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_710;                                // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_711;                                // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_712;                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_713;                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_714;                                // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_715;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_716;                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_717;                                // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_718;                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_719;                                // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_720;                                // 0x0370(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_721;                                // 0x0374(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_722;                                // 0x037C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_723;                                // 0x0384(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_724;                                // 0x038C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_725;                                // 0x0394(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_726;                                // 0x039C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_727;                                // 0x03A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_728;                                // 0x03AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_729;                                // 0x03B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_730;                                // 0x03BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_731;                                // 0x03C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_732;                                // 0x03CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_733;                                // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_734;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_735;                                // 0x03E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_736;                                // 0x03E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_737;                                // 0x03EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB[0x5];                                      // 0x03EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_738;                               // 0x03F0(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_739;                              // 0x0400(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0420(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0480(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0500(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0508(0x0018)()
};
static_assert(alignof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData) == 0x000520, "Wrong size on ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_652) == 0x000004, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_652' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_653) == 0x00000C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_653' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_654) == 0x000014, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_654' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_655) == 0x00001C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_655' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_656) == 0x000024, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_656' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_657) == 0x000030, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_657' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_658) == 0x000040, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_658' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_659) == 0x000048, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_659' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_660) == 0x000068, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_660' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_661) == 0x000070, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_661' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_662) == 0x000078, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_662' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_663) == 0x000098, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_663' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_664) == 0x0000B8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_664' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_665) == 0x0000C0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_665' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_666) == 0x0000C8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_666' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_667) == 0x0000E8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_667' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_668) == 0x0000F0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_668' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_669) == 0x0000F8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_669' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_670) == 0x000118, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_670' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_671) == 0x000138, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_671' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_672) == 0x000140, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_672' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_673) == 0x000144, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_673' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_674) == 0x00014C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_674' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_675) == 0x000150, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_675' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_676) == 0x000158, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_676' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_677) == 0x00015C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_677' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_678) == 0x000164, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_678' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_679) == 0x000168, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_679' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_680) == 0x000170, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_680' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_681) == 0x000174, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_681' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_682) == 0x00017C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_682' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_683) == 0x000180, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_683' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_684) == 0x0001A0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_684' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_685) == 0x0001A8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_685' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_686) == 0x0001B0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_686' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_687) == 0x0001D0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_687' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_688) == 0x0001D8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_688' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_689) == 0x0001E0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_689' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_690) == 0x000200, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_690' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_691) == 0x000220, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_691' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_692) == 0x000228, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_692' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_693) == 0x000230, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_693' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_694) == 0x000250, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_694' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __IntProperty_695) == 0x000258, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__IntProperty_695' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_696) == 0x000260, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_696' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_697) == 0x000280, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_697' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_698) == 0x000290, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_698' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_699) == 0x0002A0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_699' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_700) == 0x0002A8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_700' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_701) == 0x0002B8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_701' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_702) == 0x0002D8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_702' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_703) == 0x0002F8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_703' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_704) == 0x0002FC, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_704' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_705) == 0x000300, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_705' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_706) == 0x000304, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_706' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_707) == 0x000308, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_707' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_708) == 0x000310, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_708' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_709) == 0x000318, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_709' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_710) == 0x000320, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_710' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_711) == 0x000328, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_711' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_712) == 0x000330, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_712' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_713) == 0x000338, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_713' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_714) == 0x000340, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_714' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_715) == 0x000348, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_715' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_716) == 0x000350, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_716' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_717) == 0x000358, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_717' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_718) == 0x000360, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_718' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_719) == 0x000368, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_719' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_720) == 0x000370, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_720' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_721) == 0x000374, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_721' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_722) == 0x00037C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_722' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_723) == 0x000384, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_723' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_724) == 0x00038C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_724' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_725) == 0x000394, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_725' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_726) == 0x00039C, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_726' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_727) == 0x0003A4, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_727' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_728) == 0x0003AC, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_728' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_729) == 0x0003B4, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_729' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_730) == 0x0003BC, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_730' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_731) == 0x0003C4, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_731' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __NameProperty_732) == 0x0003CC, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__NameProperty_732' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __BlendProfile_733) == 0x0003D8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__BlendProfile_733' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __CurveFloat_734) == 0x0003E0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__CurveFloat_734' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_735) == 0x0003E8, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_735' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_736) == 0x0003E9, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_736' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_737) == 0x0003EA, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_737' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_738) == 0x0003F0, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_738' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, __StructProperty_739) == 0x000400, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::__StructProperty_739' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000420, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000480, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000500, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000508, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Hero_TPP.ABP_Hero_TPP_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000002, "Member 'ABP_Hero_TPP::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
