#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AKN12

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AKN12.ABP_AKN12_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AKN12_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AKN12_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AKN12_C_AnimGraph");
static_assert(sizeof(ABP_AKN12_C_AnimGraph) == 0x000010, "Wrong size on ABP_AKN12_C_AnimGraph");
static_assert(offsetof(ABP_AKN12_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_AKN12_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_AKN12.ABP_AKN12_C.ExecuteUbergraph_ABP_AKN12
// 0x0004 (0x0004 - 0x0000)
struct ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12) == 0x000004, "Wrong alignment on ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12");
static_assert(sizeof(ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12) == 0x000004, "Wrong size on ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12");
static_assert(offsetof(ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12, EntryPoint) == 0x000000, "Member 'ABP_AKN12_C_ExecuteUbergraph_ABP_AKN12::EntryPoint' has a wrong offset!");

}

