#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hideout_Hatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Hideout_Hatch.ABP_Hideout_Hatch_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

// ScriptStruct ABP_Hideout_Hatch.ABP_Hideout_Hatch_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_24;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_27;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_28;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_29;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_30;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_31;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_32;                               // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_33;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_34;                                   // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_36;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_37;                                 // 0x0082(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_38;                                // 0x0088(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_24) == 0x000004, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __FloatProperty_25) == 0x00000C, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__FloatProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __FloatProperty_26) == 0x000010, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__FloatProperty_26' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __StructProperty_27) == 0x000014, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__StructProperty_27' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __FloatProperty_28) == 0x000040, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__FloatProperty_28' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __EnumProperty_29) == 0x000044, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__EnumProperty_29' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __ByteProperty_30) == 0x000045, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__ByteProperty_30' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __NameProperty_31) == 0x000048, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__NameProperty_31' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __StructProperty_32) == 0x000050, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__StructProperty_32' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __BlendProfile_33) == 0x000070, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__BlendProfile_33' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __CurveFloat_34) == 0x000078, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__CurveFloat_34' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x000080, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000081, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __EnumProperty_37) == 0x000082, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__EnumProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, __ArrayProperty_38) == 0x000088, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::__ArrayProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_Hideout_Hatch::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

