#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Muntjac

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Muntjac.ABP_Muntjac_C.AnimBlueprintGeneratedConstantData
// 0x030F (0x0310 - 0x0001)
struct ABP_Muntjac::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_456;                              // 0x0008(0x0020)(BlueprintVisible, NoDestructor)
	class UAnimSequenceBase*                      __AnimSequenceBase_457;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_458;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_459;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_460;                            // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_461;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_462;                                // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_463;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_464;                            // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_465;                              // 0x0068(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_466;                              // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	class UAnimSequenceBase*                      __AnimSequenceBase_467;                            // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_468;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_469;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_470;                               // 0x00C0(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<int32>                                 __ArrayProperty_471;                               // 0x00D0(0x0010)(BlueprintVisible)
	TArray<float>                                 __ArrayProperty_472;                               // 0x00E0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_473;                                // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_474;                                // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_475;                                // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_476;                              // 0x0108(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_477;                                // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_478;                                 // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_479;                                // 0x0134(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_480;                                 // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_481;                                // 0x0140(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_482;                            // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_483;                                // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_484;                                 // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_485;                                // 0x015C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_486;                                // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_487;                                  // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_488;                                // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_489;                                // 0x0179(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_490;                               // 0x0180(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_491;                                // 0x0190(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_492;                               // 0x0194(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_493;                              // 0x0198(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_494;                               // 0x01C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_495;                                // 0x01C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_496;                                // 0x01C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_497;                                // 0x01CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_498;                                 // 0x01D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_499;                                // 0x01D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_500;                                // 0x01DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_501;                                // 0x01E4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               __StructProperty_502;                              // 0x01F0(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __StructProperty_503;                              // 0x0208(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_504;                               // 0x0220(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_505;                                // 0x0224(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_506;                               // 0x0228(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_507;                               // 0x022C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_508;                               // 0x0230(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOffsetRootBoneMode                           __EnumProperty_509;                                // 0x0234(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWarpingEvaluationMode                        __EnumProperty_510;                                // 0x0235(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_511;                              // 0x0238(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0258(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x02D8(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x02E0(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x02F8(0x0018)()
};
static_assert(alignof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Muntjac::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData) == 0x000310, "Wrong size on ABP_Muntjac::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_456) == 0x000008, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_456' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_457) == 0x000028, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_457' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_458) == 0x000030, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_458' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_459) == 0x000038, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_459' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_460) == 0x000040, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_460' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_461) == 0x000048, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_461' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ByteProperty_462) == 0x000050, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ByteProperty_462' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_463) == 0x000058, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_463' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_464) == 0x000060, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_464' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_465) == 0x000068, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_465' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_466) == 0x000088, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_466' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_467) == 0x0000A8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_467' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_468) == 0x0000B0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_468' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_469) == 0x0000B8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_469' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ArrayProperty_470) == 0x0000C0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ArrayProperty_470' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ArrayProperty_471) == 0x0000D0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ArrayProperty_471' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ArrayProperty_472) == 0x0000E0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ArrayProperty_472' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_473) == 0x0000F0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_473' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_474) == 0x0000F8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_474' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_475) == 0x0000FC, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_475' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_476) == 0x000108, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_476' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_477) == 0x000128, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_477' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __IntProperty_478) == 0x000130, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__IntProperty_478' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_479) == 0x000134, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_479' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __IntProperty_480) == 0x00013C, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__IntProperty_480' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ByteProperty_481) == 0x000140, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ByteProperty_481' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_482) == 0x000148, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_482' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_483) == 0x000150, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_483' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __IntProperty_484) == 0x000158, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__IntProperty_484' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_485) == 0x00015C, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_485' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __BlendProfile_486) == 0x000168, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__BlendProfile_486' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __CurveFloat_487) == 0x000170, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__CurveFloat_487' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_488) == 0x000178, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_488' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_489) == 0x000179, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_489' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ArrayProperty_490) == 0x000180, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ArrayProperty_490' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __BoolProperty_491) == 0x000190, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__BoolProperty_491' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_492) == 0x000194, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_492' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_493) == 0x000198, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_493' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_494) == 0x0001C4, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_494' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_495) == 0x0001C8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_495' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ByteProperty_496) == 0x0001C9, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ByteProperty_496' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_497) == 0x0001CC, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_497' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __IntProperty_498) == 0x0001D4, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__IntProperty_498' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __ByteProperty_499) == 0x0001D8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__ByteProperty_499' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_500) == 0x0001DC, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_500' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __NameProperty_501) == 0x0001E4, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__NameProperty_501' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_502) == 0x0001F0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_502' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_503) == 0x000208, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_503' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_504) == 0x000220, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_504' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __BoolProperty_505) == 0x000224, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__BoolProperty_505' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_506) == 0x000228, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_506' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_507) == 0x00022C, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_507' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __FloatProperty_508) == 0x000230, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__FloatProperty_508' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_509) == 0x000234, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_509' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __EnumProperty_510) == 0x000235, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__EnumProperty_510' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, __StructProperty_511) == 0x000238, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::__StructProperty_511' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000258, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x0002D8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x0002E0, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0002F8, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Muntjac.ABP_Muntjac_C.AnimBlueprintGeneratedMutableData
// 0x003B (0x003C - 0x0001)
struct ABP_Muntjac::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         __ByteProperty_7;                                  // 0x0024(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_8;                                  // 0x0025(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_9;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_12;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOffsetRootBoneMode                           __EnumProperty_14;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Muntjac::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Muntjac::FAnimBlueprintGeneratedMutableData) == 0x00003C, "Wrong size on ABP_Muntjac::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac::FAnimBlueprintGeneratedMutableData, __ByteProperty_0) == 0x000008, "Member 'ABP_Muntjac::FAnimBlueprintGeneratedMutableData::__ByteProperty_0' has a wrong offset!");
