#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Template_OrientAnimManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.AnimBlueprintGeneratedConstantData
// 0x020F (0x0210 - 0x0001)
struct ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_148;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_149;                              // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_150;                              // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_151;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_152;                                  // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_153;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_154;                                // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_155;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	float                                         __FloatProperty_156;                               // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_157;                              // 0x007C(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_158;                               // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_159;                                // 0x00AC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_160;                                // 0x00AD(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_161;                                // 0x00AE(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_162;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_163;                                 // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_164;                              // 0x00C0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_165;                              // 0x00E0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_166;                              // 0x0100(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_167;                                // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_168;                                // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_169;                                 // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_170;                              // 0x0138(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0158(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x01D8(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x01E0(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01F8(0x0018)()
};
static_assert(alignof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData) == 0x000210, "Wrong size on ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __NameProperty_148) == 0x000004, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__NameProperty_148' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_149) == 0x000010, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_149' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_150) == 0x000030, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_150' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __BlendProfile_151) == 0x000050, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__BlendProfile_151' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __CurveFloat_152) == 0x000058, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__CurveFloat_152' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __EnumProperty_153) == 0x000060, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__EnumProperty_153' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __EnumProperty_154) == 0x000061, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__EnumProperty_154' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __ArrayProperty_155) == 0x000068, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__ArrayProperty_155' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __FloatProperty_156) == 0x000078, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__FloatProperty_156' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_157) == 0x00007C, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_157' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __FloatProperty_158) == 0x0000A8, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__FloatProperty_158' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __BoolProperty_159) == 0x0000AC, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__BoolProperty_159' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __EnumProperty_160) == 0x0000AD, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__EnumProperty_160' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __ByteProperty_161) == 0x0000AE, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__ByteProperty_161' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __NameProperty_162) == 0x0000B0, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__NameProperty_162' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __IntProperty_163) == 0x0000B8, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__IntProperty_163' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_164) == 0x0000C0, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_164' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_165) == 0x0000E0, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_165' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_166) == 0x000100, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_166' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __NameProperty_167) == 0x000120, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__NameProperty_167' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __NameProperty_168) == 0x000128, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__NameProperty_168' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __IntProperty_169) == 0x000130, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__IntProperty_169' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, __StructProperty_170) == 0x000138, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::__StructProperty_170' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000158, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x0001D8, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x0001E0, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001F8, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Template_OrientAnimManager::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

