#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Flamethrower

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Flamethrower.ABP_Flamethrower_C
// 0x0800 (0x0BA0 - 0x03A0)
class UABP_Flamethrower_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03B8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x03F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0520(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0648(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0770(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0898(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x09C0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0A08(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B30(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B50(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_1488E14C4F9B6143F8484DA3B202658C()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_A0DE061F41D5696F60A9ACB828ACCB72()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_E03E6A1E477062A7BFC1138DDEC64D33()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_E7E9DDF64CA75E6EEB793C9D3103215F()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_EB329C974D9F8C9D925721AF349BFD92()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Flamethrower_AnimGraphNode_ModifyBone_EE40E4CE47053F0F512D86B13AE8807B()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Flamethrower(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Flamethrower_C">();
	}
	static class UABP_Flamethrower_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Flamethrower_C>();
	}
};
static_assert(alignof(UABP_Flamethrower_C) == 0x000010, "Wrong alignment on UABP_Flamethrower_C");
static_assert(sizeof(UABP_Flamethrower_C) == 0x000BA0, "Wrong size on UABP_Flamethrower_C");
static_assert(offsetof(UABP_Flamethrower_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_Flamethrower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UABP_Flamethrower_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UABP_Flamethrower_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_LocalToComponentSpace) == 0x0003B8, "Member 'UABP_Flamethrower_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ComponentToLocalSpace) == 0x0003D8, "Member 'UABP_Flamethrower_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone_5) == 0x0003F8, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone_4) == 0x000520, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone_3) == 0x000648, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone_2) == 0x000770, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone_1) == 0x000898, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_Slot) == 0x0009C0, "Member 'UABP_Flamethrower_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_ModifyBone) == 0x000A08, "Member 'UABP_Flamethrower_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_Root) == 0x000B30, "Member 'UABP_Flamethrower_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Flamethrower_C, AnimGraphNode_SequencePlayer) == 0x000B50, "Member 'UABP_Flamethrower_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

