#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Template_Orient_00_90_180

#include "Basic.hpp"

#include "ABP_Template_Orient_00_90_180_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "S_OrientAnimSet_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Template_Orient_00_90_180.ABP_Template_Orient_00_90_180_C
// 0x0540 (0x0890 - 0x0350)
class UABP_Template_Orient_00_90_180_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0358(0x0038)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0398(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x0440(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0448(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0450(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0470(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0x04B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x04D8(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0x0520(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0540(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0x0588(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_1;                   // 0x05A8(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0610(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0x0658(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0678(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0x06C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x06E0(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0x0728(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0x0748(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x07B0(0x0048)()
	double                                        K2Node_PropertyAccess_3;                           // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_PropertyAccess_2;                           // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_PropertyAccess_1;                           // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_PropertyAccess;                             // 0x0810(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_NpcCharacter_Default_C*             CharacterReference;                                // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FS_OrientAnimSet                       OrientAnimSet;                                     // 0x0820(0x0030)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_OrientAnimSet                       ActiveAnimSet;                                     // 0x0850(0x0030)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MeshYawOffset;                                     // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void CacheOrientAnimSetToActive(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Template_Orient_00_90_180(int32 EntryPoint)	 // 0xae1e64;
	double GetYawAngleForOrient()	 // 0xae1e64;
	bool IsAnglePositive()	 // 0xae1e64;
	void ResetOrientAnim(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node)	 // 0xae1e64;
	void UpdateOrientAnimPlayrate(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Template_Orient_00_90_180_C">();
	}
	static class UABP_Template_Orient_00_90_180_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Template_Orient_00_90_180_C>();
	}
};
static_assert(alignof(UABP_Template_Orient_00_90_180_C) == 0x000010, "Wrong alignment on UABP_Template_Orient_00_90_180_C");
static_assert(sizeof(UABP_Template_Orient_00_90_180_C) == 0x000890, "Wrong size on UABP_Template_Orient_00_90_180_C");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, UberGraphFrame) == 0x000350, "Member 'UABP_Template_Orient_00_90_180_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_Template_Orient_00_90_180_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'UABP_Template_Orient_00_90_180_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimBlueprintExtension_NodeRelevancy) == 0x000398, "Member 'UABP_Template_Orient_00_90_180_C::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimBlueprintExtension_BlendSpaceGraph) == 0x000440, "Member 'UABP_Template_Orient_00_90_180_C::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimBlueprintExtension_Base) == 0x000448, "Member 'UABP_Template_Orient_00_90_180_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_Root) == 0x000450, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer_5) == 0x000470, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult_5) == 0x0004B8, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer_4) == 0x0004D8, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult_4) == 0x000520, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer_3) == 0x000540, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult_3) == 0x000588, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceGraph_1) == 0x0005A8, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceGraph_1' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer_2) == 0x000610, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult_2) == 0x000658, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer_1) == 0x000678, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult_1) == 0x0006C0, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_SequencePlayer) == 0x0006E0, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceSampleResult) == 0x000728, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceSampleResult' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendSpaceGraph) == 0x000748, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, AnimGraphNode_BlendListByBool) == 0x0007B0, "Member 'UABP_Template_Orient_00_90_180_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, K2Node_PropertyAccess_3) == 0x0007F8, "Member 'UABP_Template_Orient_00_90_180_C::K2Node_PropertyAccess_3' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, K2Node_PropertyAccess_2) == 0x000800, "Member 'UABP_Template_Orient_00_90_180_C::K2Node_PropertyAccess_2' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, K2Node_PropertyAccess_1) == 0x000808, "Member 'UABP_Template_Orient_00_90_180_C::K2Node_PropertyAccess_1' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, K2Node_PropertyAccess) == 0x000810, "Member 'UABP_Template_Orient_00_90_180_C::K2Node_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, CharacterReference) == 0x000818, "Member 'UABP_Template_Orient_00_90_180_C::CharacterReference' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, OrientAnimSet) == 0x000820, "Member 'UABP_Template_Orient_00_90_180_C::OrientAnimSet' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, ActiveAnimSet) == 0x000850, "Member 'UABP_Template_Orient_00_90_180_C::ActiveAnimSet' has a wrong offset!");
static_assert(offsetof(UABP_Template_Orient_00_90_180_C, MeshYawOffset) == 0x000880, "Member 'UABP_Template_Orient_00_90_180_C::MeshYawOffset' has a wrong offset!");

}

