#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BOSS_Spectre_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AICommon_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPC_BOSS_Spectre_PostProcess.ABP_NPC_BOSS_Spectre_PostProcess_C
// 0x0BC0 (0x1120 - 0x0560)
class UABP_NPC_BOSS_Spectre_PostProcess_C final : public UP2NpcAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0568(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0570(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0578(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0580(0x0020)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_3;                        // 0x05A0(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_2;                        // 0x0730(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_1;                        // 0x08C0(0x0190)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver;                          // 0x0A50(0x0190)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0BE0(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0CA8(0x0470)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_NPC_BOSS_Spectre_PostProcess(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_NPC_BOSS_Spectre_PostProcess_C">();
	}
	static class UABP_NPC_BOSS_Spectre_PostProcess_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_NPC_BOSS_Spectre_PostProcess_C>();
	}
};
static_assert(alignof(UABP_NPC_BOSS_Spectre_PostProcess_C) == 0x000010, "Wrong alignment on UABP_NPC_BOSS_Spectre_PostProcess_C");
static_assert(sizeof(UABP_NPC_BOSS_Spectre_PostProcess_C) == 0x001120, "Wrong size on UABP_NPC_BOSS_Spectre_PostProcess_C");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, UberGraphFrame) == 0x000560, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimBlueprintExtension_Tag) == 0x000568, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimBlueprintExtension_PropertyAccess) == 0x000570, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimBlueprintExtension_Base) == 0x000578, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_Root) == 0x000580, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_PoseDriver_3) == 0x0005A0, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_PoseDriver_3' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_PoseDriver_2) == 0x000730, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_PoseDriver_2' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_PoseDriver_1) == 0x0008C0, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_PoseDriver_1' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_PoseDriver) == 0x000A50, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_PoseDriver' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_LinkedInputPose) == 0x000BE0, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_NPC_BOSS_Spectre_PostProcess_C, AnimGraphNode_ControlRig) == 0x000CA8, "Member 'UABP_NPC_BOSS_Spectre_PostProcess_C::AnimGraphNode_ControlRig' has a wrong offset!");

}

