#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_VertGarden_Base_01_A

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Facility_VertGarden_Base_01_A.ABP_Facility_VertGarden_Base_01_A_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_82;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_83;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_84;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_85;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_86;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_87;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_88;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_89;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_90;                               // 0x0034(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_91;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_92;                                 // 0x0064(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_93;                                 // 0x0065(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_94;                                 // 0x0066(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_95;                                 // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_96;                                 // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_97;                                  // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_98;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000004, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_83) == 0x00000C, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_83' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_84) == 0x000014, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_84' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x000018, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_86) == 0x000020, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x000024, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_88) == 0x00002C, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __FloatProperty_89) == 0x000030, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__FloatProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __StructProperty_90) == 0x000034, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__StructProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __FloatProperty_91) == 0x000060, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__FloatProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __BoolProperty_92) == 0x000064, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__BoolProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __EnumProperty_93) == 0x000065, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__EnumProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __ByteProperty_94) == 0x000066, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__ByteProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_95) == 0x000068, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_96) == 0x000070, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_97) == 0x000078, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, __StructProperty_98) == 0x000080, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::__StructProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Facility_VertGarden_Base_01_A.ABP_Facility_VertGarden_Base_01_A_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

