#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Template_OrientAnimManager

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Template_OrientAnimManager_C_AnimGraph final
{
public:
	struct FPoseLink                              Idle_SM;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_AnimGraph");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_AnimGraph) == 0x000020, "Wrong size on ABP_Template_OrientAnimManager_C_AnimGraph");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_AnimGraph, Idle_SM) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_AnimGraph::Idle_SM' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Template_OrientAnimManager_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.ExecuteUbergraph_ABP_Template_OrientAnimManager
// 0x0008 (0x0008 - 0x0000)
struct ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager) == 0x000004, "Wrong alignment on ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager) == 0x000008, "Wrong size on ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager, EntryPoint) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Template_OrientAnimManager_C_ExecuteUbergraph_ABP_Template_OrientAnimManager::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.IsAnglePositive
// 0x0010 (0x0010 - 0x0000)
struct ABP_Template_OrientAnimManager_C_IsAnglePositive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_IsAnglePositive) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_IsAnglePositive");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_IsAnglePositive) == 0x000010, "Wrong size on ABP_Template_OrientAnimManager_C_IsAnglePositive");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_IsAnglePositive, ReturnValue) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_IsAnglePositive::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_IsAnglePositive, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000001, "Member 'ABP_Template_OrientAnimManager_C_IsAnglePositive::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_IsAnglePositive, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'ABP_Template_OrientAnimManager_C_IsAnglePositive::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.ResetCooldown
// 0x0020 (0x0020 - 0x0000)
struct ABP_Template_OrientAnimManager_C_ResetCooldown final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_ResetCooldown) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_ResetCooldown");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_ResetCooldown) == 0x000020, "Wrong size on ABP_Template_OrientAnimManager_C_ResetCooldown");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ResetCooldown, Context) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_ResetCooldown::Context' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ResetCooldown, Node) == 0x000010, "Member 'ABP_Template_OrientAnimManager_C_ResetCooldown::Node' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.SetOrientData
// 0x0028 (0x0028 - 0x0000)
struct ABP_Template_OrientAnimManager_C_SetOrientData final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         K2Node_VariableSet_YawOrientGoal_ImplicitCast;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_SetOrientData) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_SetOrientData");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_SetOrientData) == 0x000028, "Wrong size on ABP_Template_OrientAnimManager_C_SetOrientData");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_SetOrientData, Context) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_SetOrientData::Context' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_SetOrientData, Node) == 0x000010, "Member 'ABP_Template_OrientAnimManager_C_SetOrientData::Node' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_SetOrientData, K2Node_VariableSet_YawOrientGoal_ImplicitCast) == 0x000020, "Member 'ABP_Template_OrientAnimManager_C_SetOrientData::K2Node_VariableSet_YawOrientGoal_ImplicitCast' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.ShouldPlayOrient
// 0x0018 (0x0018 - 0x0000)
struct ABP_Template_OrientAnimManager_C_ShouldPlayOrient final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InRange_FloatFloat_Max_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Min_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_ShouldPlayOrient");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient) == 0x000018, "Wrong size on ABP_Template_OrientAnimManager_C_ShouldPlayOrient");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, ReturnValue) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000001, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000002, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_BooleanOR_ReturnValue_1) == 0x000006, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_InRange_FloatFloat_Max_ImplicitCast) == 0x000008, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_InRange_FloatFloat_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_ShouldPlayOrient, CallFunc_InRange_FloatFloat_Min_ImplicitCast) == 0x000010, "Member 'ABP_Template_OrientAnimManager_C_ShouldPlayOrient::CallFunc_InRange_FloatFloat_Min_ImplicitCast' has a wrong offset!");

// Function ABP_Template_OrientAnimManager.ABP_Template_OrientAnimManager_C.UpdateCooldown
// 0x0070 (0x0070 - 0x0000)
struct ABP_Template_OrientAnimManager_C_UpdateCooldown final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDeltaTime_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_OrientAnimManager_C_UpdateCooldown) == 0x000008, "Wrong alignment on ABP_Template_OrientAnimManager_C_UpdateCooldown");
static_assert(sizeof(ABP_Template_OrientAnimManager_C_UpdateCooldown) == 0x000070, "Wrong size on ABP_Template_OrientAnimManager_C_UpdateCooldown");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, Context) == 0x000000, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::Context' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, Node) == 0x000010, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::Node' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Abs_ReturnValue) == 0x000020, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000030, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_GetDeltaTime_ReturnValue) == 0x000040, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_GetDeltaTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Template_OrientAnimManager_C_UpdateCooldown, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'ABP_Template_OrientAnimManager_C_UpdateCooldown::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

