#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SMG_MPX

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_SMG_MPX.ABP_SMG_MPX_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_SMG_MPX_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_SMG_MPX_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_SMG_MPX_C_AnimGraph");
static_assert(sizeof(ABP_SMG_MPX_C_AnimGraph) == 0x000010, "Wrong size on ABP_SMG_MPX_C_AnimGraph");
static_assert(offsetof(ABP_SMG_MPX_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_SMG_MPX_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_SMG_MPX.ABP_SMG_MPX_C.ExecuteUbergraph_ABP_SMG_MPX
// 0x0008 (0x0008 - 0x0000)
struct ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTagAlpha_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX) == 0x000004, "Wrong alignment on ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX");
static_assert(sizeof(ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX) == 0x000008, "Wrong size on ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX");
static_assert(offsetof(ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX, EntryPoint) == 0x000000, "Member 'ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX, CallFunc_GetTagAlpha_ReturnValue) == 0x000004, "Member 'ABP_SMG_MPX_C_ExecuteUbergraph_ABP_SMG_MPX::CallFunc_GetTagAlpha_ReturnValue' has a wrong offset!");

}

