#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function ABP_AUV.ABP_AUV_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AUV_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AUV_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AUV_C_AnimGraph");
static_assert(sizeof(ABP_AUV_C_AnimGraph) == 0x000010, "Wrong size on ABP_AUV_C_AnimGraph");
static_assert(offsetof(ABP_AUV_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_AUV_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_AUV.ABP_AUV_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AUV_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AUV_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AUV_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AUV_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AUV_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AUV_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AUV.ABP_AUV_C.ExecuteUbergraph_ABP_AUV
// 0x0080 (0x0080 - 0x0000)
struct ABP_AUV_C_ExecuteUbergraph_ABP_AUV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExfilAUV_Managed_C*                 K2Node_DynamicCast_AsBP_Exfil_AUV_Managed;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExfilAUV_Managed_C*                 K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue_2;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_ExfilAUV_Managed_C*                 K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_2;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateHatchState_InHatch_ImplicitCast;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateHatchState_InHatch_ImplicitCast_1;  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateHatchState_InHatch_ImplicitCast_2;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV) == 0x000008, "Wrong alignment on ABP_AUV_C_ExecuteUbergraph_ABP_AUV");
static_assert(sizeof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV) == 0x000080, "Wrong size on ABP_AUV_C_ExecuteUbergraph_ABP_AUV");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, EntryPoint) == 0x000000, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable) == 0x000004, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_1) == 0x000005, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_2) == 0x000006, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_3) == 0x000007, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_4) == 0x000008, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_byte_Variable) == 0x000009, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_5) == 0x00000A, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_6) == 0x00001C, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_GetOwningActor_ReturnValue) == 0x000020, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_AsBP_Exfil_AUV_Managed) == 0x000028, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_AsBP_Exfil_AUV_Managed' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_GetOwningActor_ReturnValue_1) == 0x000038, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_GetOwningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1) == 0x000040, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_Event_DeltaTimeX) == 0x00004C, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_GetOwningActor_ReturnValue_2) == 0x000050, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_GetOwningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_2) == 0x000058, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, Temp_bool_Variable_7) == 0x000061, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, K2Node_Select_Default) == 0x000062, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_UpdateHatchState_InHatch_ImplicitCast) == 0x000068, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_UpdateHatchState_InHatch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_UpdateHatchState_InHatch_ImplicitCast_1) == 0x000070, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_UpdateHatchState_InHatch_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_ExecuteUbergraph_ABP_AUV, CallFunc_UpdateHatchState_InHatch_ImplicitCast_2) == 0x000078, "Member 'ABP_AUV_C_ExecuteUbergraph_ABP_AUV::CallFunc_UpdateHatchState_InHatch_ImplicitCast_2' has a wrong offset!");

// Function ABP_AUV.ABP_AUV_C.UpdateHatchState
// 0x0048 (0x0048 - 0x0000)
struct ABP_AUV_C_UpdateHatchState final
{
public:
	class AP2ExfiltrationAUV*                     InVehicle;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 InSeat;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        InHatch;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDeltaSeconds_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInteractingPawn_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_C_UpdateHatchState) == 0x000008, "Wrong alignment on ABP_AUV_C_UpdateHatchState");
static_assert(sizeof(ABP_AUV_C_UpdateHatchState) == 0x000048, "Wrong size on ABP_AUV_C_UpdateHatchState");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, InVehicle) == 0x000000, "Member 'ABP_AUV_C_UpdateHatchState::InVehicle' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, InSeat) == 0x000008, "Member 'ABP_AUV_C_UpdateHatchState::InSeat' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, InHatch) == 0x000010, "Member 'ABP_AUV_C_UpdateHatchState::InHatch' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_GetDeltaSeconds_ReturnValue) == 0x000018, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_GetDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_GetInteractingPawn_ReturnValue) == 0x000020, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_GetInteractingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000038, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_AUV_C_UpdateHatchState, CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast) == 0x000040, "Member 'ABP_AUV_C_UpdateHatchState::CallFunc_FInterpTo_Constant_DeltaTime_ImplicitCast' has a wrong offset!");

}

