#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Wave

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Wave.ABP_Wave_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Wave_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Wave_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Wave_C_AnimGraph");
static_assert(sizeof(ABP_Wave_C_AnimGraph) == 0x000010, "Wrong size on ABP_Wave_C_AnimGraph");
static_assert(offsetof(ABP_Wave_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Wave_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Wave.ABP_Wave_C.ExecuteUbergraph_ABP_Wave
// 0x0038 (0x0038 - 0x0000)
struct ABP_Wave_C_ExecuteUbergraph_ABP_Wave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTagAlpha_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave) == 0x000008, "Wrong alignment on ABP_Wave_C_ExecuteUbergraph_ABP_Wave");
static_assert(sizeof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave) == 0x000038, "Wrong size on ABP_Wave_C_ExecuteUbergraph_ABP_Wave");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, EntryPoint) == 0x000000, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, CallFunc_GetTagAlpha_ReturnValue) == 0x000004, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::CallFunc_GetTagAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, Temp_object_Variable) == 0x000008, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, Temp_object_Variable_1) == 0x000018, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, Temp_bool_Variable) == 0x000020, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, K2Node_Select_Default) == 0x000028, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Wave_C_ExecuteUbergraph_ABP_Wave, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'ABP_Wave_C_ExecuteUbergraph_ABP_Wave::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

