#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SG_M870

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SG_M870.ABP_SG_M870_C
// 0x0210 (0x05C0 - 0x03B0)
class UABP_SG_M870_C final : public UP2WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03E8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0430(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0440(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0488(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A8(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x04C8(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x05A8(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_SG_M870(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_SG_M870_C">();
	}
	static class UABP_SG_M870_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_SG_M870_C>();
	}
};
static_assert(alignof(UABP_SG_M870_C) == 0x000010, "Wrong alignment on UABP_SG_M870_C");
static_assert(sizeof(UABP_SG_M870_C) == 0x0005C0, "Wrong size on UABP_SG_M870_C");
static_assert(offsetof(UABP_SG_M870_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_SG_M870_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_SG_M870_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_SG_M870_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_Root) == 0x0003C8, "Member 'UABP_SG_M870_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_Slot_1) == 0x0003E8, "Member 'UABP_SG_M870_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_LocalRefPose_1) == 0x000430, "Member 'UABP_SG_M870_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_Slot) == 0x000440, "Member 'UABP_SG_M870_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_LocalToComponentSpace) == 0x000488, "Member 'UABP_SG_M870_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A8, "Member 'UABP_SG_M870_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_LayeredBoneBlend) == 0x0004C8, "Member 'UABP_SG_M870_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_SG_M870_C, AnimGraphNode_LocalRefPose) == 0x0005A8, "Member 'UABP_SG_M870_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

