#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Layer_Gun_FPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Layer_Gun_FPP.ABP_Layer_Gun_FPP_C.AnimBlueprintGeneratedConstantData
// 0x04C7 (0x04C8 - 0x0001)
struct ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2004;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2005;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2006;                               // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2007;                               // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2008;                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2009;                               // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2010;                               // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2011;                               // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2012;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2013;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2014;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2015;                               // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2016;                               // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2017;                             // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2018;                               // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2019;                                // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2020;                               // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2021;                               // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2022;                               // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2023;                             // 0x00B8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_2024;                             // 0x00D8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_2025;                             // 0x00F8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2026;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2027;                              // 0x0120(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_2028;                             // 0x0130(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_2029;                             // 0x0150(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_2030;                             // 0x0170(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2031;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2032;                               // 0x0198(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2033;                               // 0x01A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2034;                               // 0x01A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2035;                               // 0x01B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2036;                               // 0x01B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2037;                               // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2038;                               // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2039;                               // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2040;                               // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2041;                               // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2042;                              // 0x01E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2043;                               // 0x01EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2044;                                // 0x01F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_2045;                             // 0x01F8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2046;                               // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2047;                                // 0x0220(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2048;                             // 0x0228(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2049;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2050;                                // 0x0250(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2051;                               // 0x0254(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2052;                                // 0x025C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2053;                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2054;                                // 0x0268(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2055;                               // 0x026C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2056;                                // 0x0274(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2057;                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2058;                                // 0x0280(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2059;                               // 0x0284(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2060;                                // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2061;                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2062;                                // 0x0298(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2063;                              // 0x029C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2064;                              // 0x02A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_2065;                               // 0x02A4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2066;                             // 0x02A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_2067;                             // 0x02C8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_2068;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2069;                               // 0x02F0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2070;                              // 0x02F8(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2071;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2072;                              // 0x0310(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_2073;                               // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_2074;                              // 0x0328(0x0010)(BlueprintVisible, EditFixedSize)
	ERefPoseType                                  __ByteProperty_2075;                               // 0x0338(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2076;                               // 0x033C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2077;                                // 0x0344(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2078;                               // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2079;                                // 0x0350(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2080;                               // 0x0354(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_2081;                                // 0x035C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_2082;                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_2083;                                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_2084;                               // 0x0370(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_2085;                               // 0x0371(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_2086;                              // 0x0378(0x0010)(BlueprintVisible, EditFixedSize)
	bool                                          __BoolProperty_2087;                               // 0x0388(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2088;                              // 0x038C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_2089;                             // 0x0390(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_2090;                              // 0x03BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2091;                               // 0x03C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_2092;                               // 0x03C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x2];                                      // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_2093;                               // 0x03C4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2094;                               // 0x03CC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2095;                               // 0x03D4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_2096;                               // 0x03DC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_2097;                             // 0x03E8(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_2098;                               // 0x0408(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0410(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0490(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0498(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x04B0(0x0018)()
};
static_assert(alignof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData) == 0x0004C8, "Wrong size on ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2004) == 0x000004, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2004' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2005) == 0x00000C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2005' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2006) == 0x000014, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2006' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2007) == 0x00001C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2007' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2008) == 0x000024, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2008' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2009) == 0x00002C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2009' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2010) == 0x000034, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2010' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2011) == 0x00003C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2011' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2012) == 0x000044, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2012' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2013) == 0x00004C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2013' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2014) == 0x000054, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2014' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2015) == 0x00005C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2015' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2016) == 0x000064, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2016' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2017) == 0x000070, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2017' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2018) == 0x000090, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2018' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2019) == 0x000098, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2019' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2020) == 0x00009C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2020' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2021) == 0x0000A4, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2021' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2022) == 0x0000AC, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2022' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2023) == 0x0000B8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2023' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2024) == 0x0000D8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2024' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2025) == 0x0000F8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2025' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2026) == 0x000118, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2026' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2027) == 0x000120, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2027' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2028) == 0x000130, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2028' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2029) == 0x000150, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2029' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2030) == 0x000170, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2030' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2031) == 0x000190, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2031' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2032) == 0x000198, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2032' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2033) == 0x0001A0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2033' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2034) == 0x0001A8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2034' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2035) == 0x0001B0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2035' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2036) == 0x0001B8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2036' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2037) == 0x0001C0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2037' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2038) == 0x0001C8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2038' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2039) == 0x0001D0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2039' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2040) == 0x0001D8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2040' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2041) == 0x0001E0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2041' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2042) == 0x0001E8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2042' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2043) == 0x0001EC, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2043' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2044) == 0x0001F4, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2044' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2045) == 0x0001F8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2045' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2046) == 0x000218, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2046' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2047) == 0x000220, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2047' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2048) == 0x000228, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2048' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2049) == 0x000248, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2049' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2050) == 0x000250, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2050' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2051) == 0x000254, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2051' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2052) == 0x00025C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2052' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2053) == 0x000260, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2053' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2054) == 0x000268, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2054' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2055) == 0x00026C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2055' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2056) == 0x000274, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2056' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2057) == 0x000278, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2057' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2058) == 0x000280, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2058' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2059) == 0x000284, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2059' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2060) == 0x00028C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2060' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2061) == 0x000290, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2061' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2062) == 0x000298, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2062' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2063) == 0x00029C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2063' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2064) == 0x0002A0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2064' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_2065) == 0x0002A4, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_2065' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2066) == 0x0002A8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2066' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2067) == 0x0002C8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2067' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2068) == 0x0002E8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2068' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2069) == 0x0002F0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2069' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2070) == 0x0002F8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2070' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2071) == 0x000308, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2071' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2072) == 0x000310, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2072' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2073) == 0x000320, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2073' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2074) == 0x000328, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2074' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_2075) == 0x000338, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_2075' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2076) == 0x00033C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2076' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2077) == 0x000344, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2077' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2078) == 0x000348, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2078' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2079) == 0x000350, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2079' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2080) == 0x000354, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2080' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_2081) == 0x00035C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_2081' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __BlendProfile_2082) == 0x000360, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__BlendProfile_2082' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __CurveFloat_2083) == 0x000368, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__CurveFloat_2083' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2084) == 0x000370, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2084' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2085) == 0x000371, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2085' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_2086) == 0x000378, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_2086' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_2087) == 0x000388, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_2087' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2088) == 0x00038C, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2088' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2089) == 0x000390, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2089' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_2090) == 0x0003BC, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_2090' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_2091) == 0x0003C0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_2091' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_2092) == 0x0003C1, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_2092' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2093) == 0x0003C4, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2093' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2094) == 0x0003CC, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2094' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2095) == 0x0003D4, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2095' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_2096) == 0x0003DC, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_2096' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_2097) == 0x0003E8, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_2097' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_2098) == 0x000408, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_2098' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000410, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000490, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000498, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0004B0, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Layer_Gun_FPP.ABP_Layer_Gun_FPP_C.AnimBlueprintGeneratedMutableData
// 0x0187 (0x0188 - 0x0001)
struct ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_8;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_9;                              // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_11;                             // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_12;                             // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_13;                             // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_14;                             // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_15;                             // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_16;                             // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_17;                             // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_18;                                // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_19;                             // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_20;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_21;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_22;                             // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_23;                             // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_24;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_25;                             // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_27;                             // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_28;                                 // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_29;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_30;                             // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_31;                             // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_32;                             // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_33;                             // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_34;                                // 0x00E0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_35;                             // 0x00E8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_36;                                // 0x00F0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_37;                             // 0x00F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_38;                             // 0x0100(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_39;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_40;                             // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_41;                             // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_42;                             // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_43;                             // 0x0128(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_44;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_45;                             // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_46;                             // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_47;                                // 0x0148(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_48;                             // 0x0150(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_49;                             // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_50;                             // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_51;                             // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_52;                                // 0x0170(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_53;                                 // 0x0174(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_54;                                 // 0x0175(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_55;                                 // 0x0176(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_56;                                 // 0x0177(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_57;                                 // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_58;                                // 0x017C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_59;                                 // 0x0180(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData) == 0x000188, "Wrong size on ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_Layer_Gun_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
