#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AmmoPlant_Belt_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_AmmoPlant_Belt_01_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AmmoPlant_Belt_01.ABP_AmmoPlant_Belt_01_C
// 0x08E0 (0x0C30 - 0x0350)
class UABP_AmmoPlant_Belt_01_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_AmmoPlant_Belt_01::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0390(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x03D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0400(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0428(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0450(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0478(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x04A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x04E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0508(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0550(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0570(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x05B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x05D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0640(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0688(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x06A8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0770(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x08F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0918(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0940(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0988(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x09A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x09F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A58(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0AC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0AE0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0B28(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0B48(0x00C8)()
	int32                                         LastState;                                         // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C14[0x4];                                      // 0x0C14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBeginStandby;                                    // 0x0C18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void AnimNotify_OnBeginStantBy()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_SequencePlayer_5DEEFC1644A1D09044F9E6A2BC9FFCF4()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_01E84FD04F67956A69E85BBD864D6BE3()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_145CD4284AECBEE344483CB1EAAD77BD()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_39CEB6F14831E533B95EEA8445932022()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_56985E3549668E33E54E56AC97A6A5E8()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_7BFB3336414348959DEC61BD56C3F907()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_9E7770094CD0B079D8D667BEAF298B28()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_9F3874FF4A909EC5876293B6552BBE48()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_D09CA5634FD0432F439458816F837E5F()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_D64AB49543B57435BD929E875A5E9421()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_F6CAE8934E2BA016FACAFB96FD66D4E9()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AmmoPlant_Belt_01_AnimGraphNode_TransitionResult_FFF3B92A4D241633EF7A80922F0087FC()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_AmmoPlant_Belt_01(int32 EntryPoint)	 // 0xae1e64;
	void SetState(int32 NewState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_AmmoPlant_Belt_01_C">();
	}
	static class UABP_AmmoPlant_Belt_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_AmmoPlant_Belt_01_C>();
	}
};
static_assert(alignof(UABP_AmmoPlant_Belt_01_C) == 0x000010, "Wrong alignment on UABP_AmmoPlant_Belt_01_C");
static_assert(sizeof(UABP_AmmoPlant_Belt_01_C) == 0x000C30, "Wrong size on UABP_AmmoPlant_Belt_01_C");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, UberGraphFrame) == 0x000350, "Member 'UABP_AmmoPlant_Belt_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_AmmoPlant_Belt_01_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimBlueprintExtension_PropertyAccess) == 0x000360, "Member 'UABP_AmmoPlant_Belt_01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimBlueprintExtension_Base) == 0x000368, "Member 'UABP_AmmoPlant_Belt_01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_Root) == 0x000370, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_10) == 0x000390, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_10) == 0x0003D8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_9) == 0x000400, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_8) == 0x000428, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_7) == 0x000450, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_6) == 0x000478, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_9) == 0x0004A0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_9) == 0x0004E8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_8) == 0x000508, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_8) == 0x000550, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_7) == 0x000570, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_7) == 0x0005B8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_6) == 0x0005D8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_6) == 0x000620, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_5) == 0x000640, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_5) == 0x000688, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateMachine_1) == 0x0006A8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_LayeredBoneBlend) == 0x000770, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_5) == 0x000850, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_4) == 0x000878, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_3) == 0x0008A0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_2) == 0x0008C8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult_1) == 0x0008F0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_TransitionResult) == 0x000918, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_4) == 0x000940, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_4) == 0x000988, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_3) == 0x0009A8, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_3) == 0x0009F0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_2) == 0x000A10, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_2) == 0x000A58, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer_1) == 0x000A78, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult_1) == 0x000AC0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_SequencePlayer) == 0x000AE0, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateResult) == 0x000B28, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, AnimGraphNode_StateMachine) == 0x000B48, "Member 'UABP_AmmoPlant_Belt_01_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, LastState) == 0x000C10, "Member 'UABP_AmmoPlant_Belt_01_C::LastState' has a wrong offset!");
static_assert(offsetof(UABP_AmmoPlant_Belt_01_C, OnBeginStandby) == 0x000C18, "Member 'UABP_AmmoPlant_Belt_01_C::OnBeginStandby' has a wrong offset!");

}

