#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BOSS_Spectre

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_NPC_BOSS_Spectre.ABP_NPC_BOSS_Spectre_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_49;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_50;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_51;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_52;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_53;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_54;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_55;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_56;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_57;                                 // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_58;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_59;                                   // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_60;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_61;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_62;                                 // 0x006A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_63;                                // 0x0070(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_64;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __NameProperty_49) == 0x000004, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__NameProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __BoolProperty_50) == 0x00000C, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__BoolProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __FloatProperty_51) == 0x000010, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__FloatProperty_51' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __StructProperty_52) == 0x000014, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__StructProperty_52' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __FloatProperty_53) == 0x000040, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__FloatProperty_53' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __FloatProperty_54) == 0x000044, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__FloatProperty_54' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __EnumProperty_55) == 0x000048, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__EnumProperty_55' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __ByteProperty_56) == 0x000049, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__ByteProperty_56' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __NameProperty_57) == 0x00004C, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__NameProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __BlendProfile_58) == 0x000058, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__BlendProfile_58' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __CurveFloat_59) == 0x000060, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__CurveFloat_59' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __BoolProperty_60) == 0x000068, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__BoolProperty_60' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __EnumProperty_61) == 0x000069, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__EnumProperty_61' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __EnumProperty_62) == 0x00006A, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__EnumProperty_62' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __ArrayProperty_63) == 0x000070, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__ArrayProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, __StructProperty_64) == 0x000080, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::__StructProperty_64' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_NPC_BOSS_Spectre.ABP_NPC_BOSS_Spectre_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_NPC_BOSS_Spectre::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

