#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_DNASequencer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Facility_DNASequencer.ABP_Facility_DNASequencer_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct ABP_Facility_DNASequencer_C_SetActive final
{
public:
	bool                                          bActive_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Facility_DNASequencer_C_SetActive) == 0x000001, "Wrong alignment on ABP_Facility_DNASequencer_C_SetActive");
static_assert(sizeof(ABP_Facility_DNASequencer_C_SetActive) == 0x000001, "Wrong size on ABP_Facility_DNASequencer_C_SetActive");
static_assert(offsetof(ABP_Facility_DNASequencer_C_SetActive, bActive_0) == 0x000000, "Member 'ABP_Facility_DNASequencer_C_SetActive::bActive_0' has a wrong offset!");

// Function ABP_Facility_DNASequencer.ABP_Facility_DNASequencer_C.ExecuteUbergraph_ABP_Facility_DNASequencer
// 0x0004 (0x0004 - 0x0000)
struct ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer) == 0x000004, "Wrong alignment on ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer");
static_assert(sizeof(ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer) == 0x000004, "Wrong size on ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer");
static_assert(offsetof(ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer, EntryPoint) == 0x000000, "Member 'ABP_Facility_DNASequencer_C_ExecuteUbergraph_ABP_Facility_DNASequencer::EntryPoint' has a wrong offset!");

// Function ABP_Facility_DNASequencer.ABP_Facility_DNASequencer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Facility_DNASequencer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Facility_DNASequencer_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Facility_DNASequencer_C_AnimGraph");
static_assert(sizeof(ABP_Facility_DNASequencer_C_AnimGraph) == 0x000010, "Wrong size on ABP_Facility_DNASequencer_C_AnimGraph");
static_assert(offsetof(ABP_Facility_DNASequencer_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Facility_DNASequencer_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

