#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_StunGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_StunGrenade.ABP_StunGrenade_C
// 0x00D0 (0x0470 - 0x03A0)
class UABP_StunGrenade_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0420(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_StunGrenade(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_StunGrenade_C">();
	}
	static class UABP_StunGrenade_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_StunGrenade_C>();
	}
};
static_assert(alignof(UABP_StunGrenade_C) == 0x000010, "Wrong alignment on UABP_StunGrenade_C");
static_assert(sizeof(UABP_StunGrenade_C) == 0x000470, "Wrong size on UABP_StunGrenade_C");
static_assert(offsetof(UABP_StunGrenade_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_StunGrenade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_StunGrenade_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UABP_StunGrenade_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_StunGrenade_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UABP_StunGrenade_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_StunGrenade_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UABP_StunGrenade_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_StunGrenade_C, AnimGraphNode_Slot) == 0x0003D8, "Member 'UABP_StunGrenade_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_StunGrenade_C, AnimGraphNode_SequencePlayer) == 0x000420, "Member 'UABP_StunGrenade_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

