#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_EMP_Advanced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_EMP_Advanced.ABP_EMP_Advanced_C.AnimBlueprintGeneratedConstantData
// 0x00DF (0x00E0 - 0x0001)
struct ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_11;                               // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_12;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_13;                                 // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_14;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_16;                                 // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_17;                                 // 0x003A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_18;                                 // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
};
static_assert(alignof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData) == 0x0000E0, "Wrong size on ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __StructProperty_11) == 0x000010, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__StructProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __ByteProperty_12) == 0x000030, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__ByteProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __BoolProperty_13) == 0x000031, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__BoolProperty_13' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __FloatProperty_14) == 0x000034, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__FloatProperty_14' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __BoolProperty_15) == 0x000038, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__BoolProperty_15' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __EnumProperty_16) == 0x000039, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__EnumProperty_16' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __ByteProperty_17) == 0x00003A, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__ByteProperty_17' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, __NameProperty_18) == 0x00003C, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::__NameProperty_18' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_EMP_Advanced.ABP_EMP_Advanced_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase) == 0x000008, "Member 'ABP_EMP_Advanced::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase' has a wrong offset!");

}

