#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_FX2000_UpperRail_Picatinny_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_FX2000_UpperRail_Picatinny_AnimBlueprint.ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_FX2000_UpperRail_Picatinny_AnimBlueprint.ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_FX2000_UpperRail_Picatinny_AnimBlueprint.ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C.ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint
// 0x0048 (0x0048 - 0x0000)
struct ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBoneAnimated_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint) == 0x000008, "Wrong alignment on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint");
static_assert(sizeof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint) == 0x000048, "Wrong size on ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, EntryPoint) == 0x000000, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000020, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_IsBoneAnimated_ReturnValue) == 0x000025, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_IsBoneAnimated_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000030, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, K2Node_StructMemberSet_Alpha_ImplicitCast) == 0x000038, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::K2Node_StructMemberSet_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000040, "Member 'ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

}

