#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_AmmoPlant_Base_01_A

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Facility_AmmoPlant_Base_01_A.ABP_Facility_AmmoPlant_Base_01_A_C.AnimBlueprintGeneratedConstantData
// 0x011F (0x0120 - 0x0001)
struct ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_37;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_38;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_39;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_40;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_41;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_42;                               // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_43;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_44;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_45;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_46;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_47;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_48;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_49;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_50;                               // 0x0068(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0088(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0108(0x0018)()
};
static_assert(alignof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData) == 0x000120, "Wrong size on ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_37) == 0x000004, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __BoolProperty_38) == 0x00000C, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__BoolProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x000010, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_40) == 0x000018, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_40' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __FloatProperty_41) == 0x00001C, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__FloatProperty_41' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __StructProperty_42) == 0x000020, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__StructProperty_42' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __FloatProperty_43) == 0x00004C, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__FloatProperty_43' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __BoolProperty_44) == 0x000050, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__BoolProperty_44' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __EnumProperty_45) == 0x000051, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__EnumProperty_45' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __ByteProperty_46) == 0x000052, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__ByteProperty_46' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_47) == 0x000054, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_47' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __NameProperty_48) == 0x00005C, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__NameProperty_48' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __IntProperty_49) == 0x000064, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__IntProperty_49' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, __StructProperty_50) == 0x000068, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::__StructProperty_50' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000088, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000108, "Member 'ABP_Facility_AmmoPlant_Base_01_A::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

