#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_VertGarden_Base_01_A

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_Facility_VertGarden_Base_01_A_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Facility_VertGarden_Base_01_A.ABP_Facility_VertGarden_Base_01_A_C
// 0x03B0 (0x0700 - 0x0350)
class UABP_Facility_VertGarden_Base_01_A_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Facility_VertGarden_Base_01_A::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0358(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0368(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0370(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0378(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0398(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x03C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x03E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0460(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0488(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x04D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x04F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0538(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0558(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x05A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0608(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0628(0x00C8)()
	int32                                         State;                                             // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_SequencePlayer_B8F3E4C64FF30751172FE69B02C35C30()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_SequencePlayer_EE1E3A684B04E899898C86A7C33265CB()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_442594AC4F4487AB0DEFA080ED7782C6()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_63E07437471C966F190418803AA5F857()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_64588C124916529571E2FF981C01E49C()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_92620425470918458EA858ACD6CB13B1()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_AEFD800149C228D1388902B175FFE885()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A_AnimGraphNode_TransitionResult_B2D12E71418BC7389F1804B6D7F29E7A()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Facility_VertGarden_Base_01_A(int32 EntryPoint)	 // 0xae1e64;
	void SetState(int32 NewState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Facility_VertGarden_Base_01_A_C">();
	}
	static class UABP_Facility_VertGarden_Base_01_A_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Facility_VertGarden_Base_01_A_C>();
	}
};
static_assert(alignof(UABP_Facility_VertGarden_Base_01_A_C) == 0x000010, "Wrong alignment on UABP_Facility_VertGarden_Base_01_A_C");
static_assert(sizeof(UABP_Facility_VertGarden_Base_01_A_C) == 0x000700, "Wrong size on UABP_Facility_VertGarden_Base_01_A_C");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, UberGraphFrame) == 0x000350, "Member 'UABP_Facility_VertGarden_Base_01_A_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_Facility_VertGarden_Base_01_A_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimBlueprintExtension_PropertyAccess) == 0x000368, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimBlueprintExtension_Base) == 0x000370, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_Root) == 0x000378, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult_5) == 0x000398, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult_4) == 0x0003C0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult_3) == 0x0003E8, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult_2) == 0x000410, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult_1) == 0x000438, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_TransitionResult) == 0x000460, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_SequencePlayer_3) == 0x000488, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_StateResult_3) == 0x0004D0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_SequencePlayer_2) == 0x0004F0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_StateResult_2) == 0x000538, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_SequencePlayer_1) == 0x000558, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_StateResult_1) == 0x0005A0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_SequencePlayer) == 0x0005C0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_StateResult) == 0x000608, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, AnimGraphNode_StateMachine) == 0x000628, "Member 'UABP_Facility_VertGarden_Base_01_A_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Facility_VertGarden_Base_01_A_C, State) == 0x0006F0, "Member 'UABP_Facility_VertGarden_Base_01_A_C::State' has a wrong offset!");

}

