#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_TPP_ItemBaseLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Hero_TPP_ItemBaseLayer.ABP_Hero_TPP_ItemBaseLayer_C.AnimBlueprintGeneratedConstantData
// 0x070F (0x0710 - 0x0001)
struct ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1514;                               // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1515;                               // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1516;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1517;                               // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1518;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1519;                               // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1520;                               // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1521;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1522;                               // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1523;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1524;                               // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1525;                               // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1526;                               // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1527;                               // 0x005C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 __ArrayProperty_1528;                              // 0x0060(0x0010)(BlueprintVisible)
	class FName                                   __NameProperty_1529;                               // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1530;                               // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1531;                               // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1532;                             // 0x0088(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1533;                             // 0x00A8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1534;                               // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1535;                               // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1536;                               // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1537;                               // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1538;                             // 0x00E8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1539;                               // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1540;                               // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1541;                               // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1542;                               // 0x0120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1543;                             // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1544;                             // 0x0148(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1545;                               // 0x0168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1546;                               // 0x0170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1547;                               // 0x0178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1548;                               // 0x0180(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1549;                               // 0x0188(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1550;                               // 0x0190(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1551;                             // 0x0198(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1552;                             // 0x01B8(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1553;                               // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1554;                               // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_1555;                              // 0x01E8(0x0010)(BlueprintVisible, EditFixedSize)
	TArray<float>                                 __ArrayProperty_1556;                              // 0x01F8(0x0010)(BlueprintVisible, EditFixedSize)
	EAlphaBlendOption                             __EnumProperty_1557;                               // 0x0208(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1558;                              // 0x0210(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_1559;                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_1560;                                 // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_1561;                               // 0x0230(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_1562;                               // 0x0231(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_1563;                              // 0x0238(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_1564;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1565;                             // 0x0250(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1566;                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1567;                             // 0x0278(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1568;                             // 0x0298(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1569;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1570;                             // 0x02C0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1571;                             // 0x02E0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1572;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1573;                             // 0x0308(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1574;                               // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1575;                             // 0x0330(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1576;                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1577;                             // 0x0358(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1578;                               // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1579;                             // 0x0380(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1580;                             // 0x03A0(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1581;                             // 0x03C0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1582;                               // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1583;                             // 0x03E8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1584;                             // 0x0408(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1585;                               // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1586;                             // 0x0430(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1587;                               // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1588;                               // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1589;                               // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1590;                             // 0x0468(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1591;                               // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1592;                             // 0x0490(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1593;                               // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1594;                               // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1595;                             // 0x04C0(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1596;                               // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1597;                                // 0x04E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1598;                               // 0x04EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1599;                                // 0x04F4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1600;                               // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1601;                                // 0x0500(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1602;                               // 0x0504(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_1603;                                // 0x050C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1604;                             // 0x0510(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1605;                               // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1606;                               // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_1607;                             // 0x0540(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_1608;                             // 0x0560(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_1609;                              // 0x058C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1610;                               // 0x0590(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1611;                               // 0x0594(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1612;                               // 0x059C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1613;                             // 0x05A8(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_1614;                             // 0x05C8(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_1615;                               // 0x05E8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1616;                               // 0x05E9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA[0x2];                                      // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_1617;                               // 0x05EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1618;                             // 0x05F8(0x0020)(BlueprintVisible, NoDestructor)
	ESequenceEvalReinit                           __ByteProperty_1619;                               // 0x0618(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_1620;                              // 0x061C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1621;                               // 0x0620(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_1622;                               // 0x0621(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_1623;                               // 0x0622(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_623[0x5];                                      // 0x0623(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_1624;                             // 0x0628(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_1625;                               // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_1626;                               // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0658(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x06D8(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x06E0(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x06F8(0x0018)()
};
static_assert(alignof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData) == 0x000710, "Wrong size on ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1514) == 0x000004, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1514' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1515) == 0x00000C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1515' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1516) == 0x000014, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1516' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1517) == 0x000018, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1517' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1518) == 0x000020, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1518' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1519) == 0x000024, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1519' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1520) == 0x00002C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1520' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1521) == 0x000034, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1521' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1522) == 0x000038, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1522' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1523) == 0x000040, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1523' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1524) == 0x000044, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1524' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1525) == 0x00004C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1525' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1526) == 0x000054, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1526' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1527) == 0x00005C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1527' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1528) == 0x000060, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1528' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1529) == 0x000070, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1529' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1530) == 0x000078, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1530' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1531) == 0x000080, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1531' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1532) == 0x000088, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1532' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1533) == 0x0000A8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1533' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1534) == 0x0000C8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1534' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1535) == 0x0000D0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1535' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1536) == 0x0000D8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1536' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1537) == 0x0000E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1537' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1538) == 0x0000E8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1538' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1539) == 0x000108, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1539' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1540) == 0x000110, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1540' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1541) == 0x000118, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1541' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1542) == 0x000120, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1542' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1543) == 0x000128, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1543' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1544) == 0x000148, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1544' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1545) == 0x000168, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1545' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1546) == 0x000170, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1546' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1547) == 0x000178, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1547' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1548) == 0x000180, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1548' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1549) == 0x000188, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1549' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1550) == 0x000190, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1550' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1551) == 0x000198, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1551' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1552) == 0x0001B8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1552' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1553) == 0x0001D8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1553' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1554) == 0x0001E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1554' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1555) == 0x0001E8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1555' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1556) == 0x0001F8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1556' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1557) == 0x000208, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1557' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1558) == 0x000210, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1558' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __BlendProfile_1559) == 0x000220, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__BlendProfile_1559' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __CurveFloat_1560) == 0x000228, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__CurveFloat_1560' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1561) == 0x000230, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1561' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1562) == 0x000231, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1562' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ArrayProperty_1563) == 0x000238, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ArrayProperty_1563' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1564) == 0x000248, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1564' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1565) == 0x000250, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1565' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1566) == 0x000270, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1566' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1567) == 0x000278, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1567' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1568) == 0x000298, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1568' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1569) == 0x0002B8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1569' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1570) == 0x0002C0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1570' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1571) == 0x0002E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1571' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1572) == 0x000300, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1572' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1573) == 0x000308, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1573' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1574) == 0x000328, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1574' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1575) == 0x000330, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1575' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1576) == 0x000350, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1576' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1577) == 0x000358, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1577' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1578) == 0x000378, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1578' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1579) == 0x000380, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1579' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1580) == 0x0003A0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1580' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1581) == 0x0003C0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1581' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1582) == 0x0003E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1582' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1583) == 0x0003E8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1583' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1584) == 0x000408, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1584' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1585) == 0x000428, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1585' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1586) == 0x000430, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1586' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1587) == 0x000450, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1587' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1588) == 0x000458, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1588' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1589) == 0x000460, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1589' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1590) == 0x000468, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1590' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1591) == 0x000488, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1591' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1592) == 0x000490, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1592' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1593) == 0x0004B0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1593' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1594) == 0x0004B8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1594' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1595) == 0x0004C0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1595' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1596) == 0x0004E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1596' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1597) == 0x0004E8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1597' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1598) == 0x0004EC, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1598' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1599) == 0x0004F4, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1599' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1600) == 0x0004F8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1600' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1601) == 0x000500, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1601' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1602) == 0x000504, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1602' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __IntProperty_1603) == 0x00050C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__IntProperty_1603' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1604) == 0x000510, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1604' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1605) == 0x000530, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1605' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1606) == 0x000538, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1606' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1607) == 0x000540, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1607' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1608) == 0x000560, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1608' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __FloatProperty_1609) == 0x00058C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__FloatProperty_1609' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ByteProperty_1610) == 0x000590, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ByteProperty_1610' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1611) == 0x000594, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1611' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1612) == 0x00059C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1612' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1613) == 0x0005A8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1613' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1614) == 0x0005C8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1614' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __BoolProperty_1615) == 0x0005E8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__BoolProperty_1615' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1616) == 0x0005E9, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1616' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1617) == 0x0005EC, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1617' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1618) == 0x0005F8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1618' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ByteProperty_1619) == 0x000618, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ByteProperty_1619' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __FloatProperty_1620) == 0x00061C, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__FloatProperty_1620' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __BoolProperty_1621) == 0x000620, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__BoolProperty_1621' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __EnumProperty_1622) == 0x000621, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__EnumProperty_1622' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __ByteProperty_1623) == 0x000622, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__ByteProperty_1623' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __StructProperty_1624) == 0x000628, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__StructProperty_1624' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1625) == 0x000648, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1625' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, __NameProperty_1626) == 0x000650, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::__NameProperty_1626' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000658, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x0006D8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x0006E0, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0006F8, "Member 'ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Hero_TPP_ItemBaseLayer.ABP_Hero_TPP_ItemBaseLayer_C.AnimBlueprintGeneratedMutableData
// 0x018F (0x0190 - 0x0001)
struct ABP_Hero_TPP_ItemBaseLayer::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1;                              // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2;                              // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	uint8                                         __ByteProperty_3;                                  // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_4;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_6;                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_7;                                  // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_8;                              // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_12;                             // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_13;                             // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_14;                             // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_15;                             // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_16;                             // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_17;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_18;                                // 0x0084(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_19;                                // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_20;                             // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_21;                             // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_22;                             // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_23;                             // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_24;                             // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_25;                             // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_26;                                // 0x00C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_27;                             // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_28;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
