#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mannequin.ABP_Mannequin_C
// 0x0510 (0x0860 - 0x0350)
class UABP_Mannequin_C final : public UP2MannequinAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0388(0x0470)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07F8(0x0048)()
	class FName                                   SelectedCategory;                                  // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RotationAlpha;                                     // 0x0848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CharacterVisible;                                  // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Mannequin(int32 EntryPoint)	 // 0xae1e64;
	void SetFocusedSlot(class FName NewSlotName)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Mannequin_C">();
	}
	static class UABP_Mannequin_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Mannequin_C>();
	}
};
static_assert(alignof(UABP_Mannequin_C) == 0x000010, "Wrong alignment on UABP_Mannequin_C");
static_assert(sizeof(UABP_Mannequin_C) == 0x000860, "Wrong size on UABP_Mannequin_C");
static_assert(offsetof(UABP_Mannequin_C, UberGraphFrame) == 0x000350, "Member 'UABP_Mannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Mannequin_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Mannequin_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Mannequin_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, AnimGraphNode_ControlRig) == 0x000388, "Member 'UABP_Mannequin_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, AnimGraphNode_SequencePlayer) == 0x0007F8, "Member 'UABP_Mannequin_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, SelectedCategory) == 0x000840, "Member 'UABP_Mannequin_C::SelectedCategory' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, RotationAlpha) == 0x000848, "Member 'UABP_Mannequin_C::RotationAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Mannequin_C, CharacterVisible) == 0x000850, "Member 'UABP_Mannequin_C::CharacterVisible' has a wrong offset!");

}

