#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Muntjac

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_MuntjacStances_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Muntjac.ABP_Muntjac_C.AccelerationData
// 0x0048 (0x0048 - 0x0000)
struct ABP_Muntjac_C_AccelerationData final
{
public:
	double                                        CallFunc_VSizeXYSquared_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_AccelerationData) == 0x000008, "Wrong alignment on ABP_Muntjac_C_AccelerationData");
static_assert(sizeof(ABP_Muntjac_C_AccelerationData) == 0x000048, "Wrong size on ABP_Muntjac_C_AccelerationData");
static_assert(offsetof(ABP_Muntjac_C_AccelerationData, CallFunc_VSizeXYSquared_ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_AccelerationData::CallFunc_VSizeXYSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_AccelerationData, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'ABP_Muntjac_C_AccelerationData::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_AccelerationData, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000010, "Member 'ABP_Muntjac_C_AccelerationData::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_AccelerationData, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'ABP_Muntjac_C_AccelerationData::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_AccelerationData, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000030, "Member 'ABP_Muntjac_C_AccelerationData::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Muntjac_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Muntjac_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Muntjac_C_AnimGraph");
static_assert(sizeof(ABP_Muntjac_C_AnimGraph) == 0x000010, "Wrong size on ABP_Muntjac_C_AnimGraph");
static_assert(offsetof(ABP_Muntjac_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Muntjac_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong size on ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_Muntjac_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Muntjac_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Muntjac_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Muntjac_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Muntjac_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Muntjac_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Muntjac_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.CharacterDirectionDebugger
// 0x01A0 (0x01A0 - 0x0000)
struct ABP_Muntjac_C_CharacterDirectionDebugger final
{
public:
	bool                                          DisplayDebug;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationStart;                                     // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_MuntjacStances, double>                DebugStanceSpeedMap;                               // 0x0020(0x0050)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_CharacterDirectionDebugger) == 0x000010, "Wrong alignment on ABP_Muntjac_C_CharacterDirectionDebugger");
static_assert(sizeof(ABP_Muntjac_C_CharacterDirectionDebugger) == 0x0001A0, "Wrong size on ABP_Muntjac_C_CharacterDirectionDebugger");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, DisplayDebug) == 0x000000, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::DisplayDebug' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, LocationStart) == 0x000008, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::LocationStart' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, DebugStanceSpeedMap) == 0x000020, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::DebugStanceSpeedMap' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000070, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_GetSocketTransform_ReturnValue) == 0x000090, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_BreakTransform_Location) == 0x0000F0, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_BreakTransform_Rotation) == 0x000108, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_BreakTransform_Scale) == 0x000120, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_CalculateDirection_ReturnValue) == 0x000138, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000140, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_RotateAngleAxis_ReturnValue) == 0x000158, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000170, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_CharacterDirectionDebugger, CallFunc_Add_VectorVector_ReturnValue) == 0x000188, "Member 'ABP_Muntjac_C_CharacterDirectionDebugger::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.ExecuteUbergraph_ABP_Muntjac
// 0x0100 (0x0100 - 0x0000)
struct ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Muntjac_C*                          K2Node_DynamicCast_AsBP_Muntjac;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac) == 0x000010, "Wrong alignment on ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac");
static_assert(sizeof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac) == 0x000100, "Wrong size on ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, EntryPoint) == 0x000000, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakTransform_Location) == 0x000070, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, K2Node_Event_DeltaTimeX) == 0x0000D0, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000D8, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, K2Node_DynamicCast_AsBP_Muntjac) == 0x0000E0, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::K2Node_DynamicCast_AsBP_Muntjac' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000E9, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'ABP_Muntjac_C_ExecuteUbergraph_ABP_Muntjac::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.GetLookAroundAlpha
// 0x0078 (0x0078 - 0x0000)
struct ABP_Muntjac_C_GetLookAroundAlpha final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast_1;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_GetLookAroundAlpha) == 0x000008, "Wrong alignment on ABP_Muntjac_C_GetLookAroundAlpha");
static_assert(sizeof(ABP_Muntjac_C_GetLookAroundAlpha) == 0x000078, "Wrong size on ABP_Muntjac_C_GetLookAroundAlpha");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_BreakRotator_Roll) == 0x00000C, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_BreakRotator_Pitch) == 0x000010, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_BreakRotator_Yaw) == 0x000014, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Abs_ReturnValue) == 0x000018, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Abs_ReturnValue_1) == 0x000028, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000048, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_SelectFloat_ReturnValue) == 0x000058, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Abs_A_ImplicitCast) == 0x000060, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_Abs_A_ImplicitCast_1) == 0x000068, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_Abs_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetLookAroundAlpha, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000070, "Member 'ABP_Muntjac_C_GetLookAroundAlpha::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.GetMovementComponent
// 0x0018 (0x0018 - 0x0000)
struct ABP_Muntjac_C_GetMovementComponent final
{
public:
	class UCharacterMovementComponent*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_GetMovementComponent) == 0x000008, "Wrong alignment on ABP_Muntjac_C_GetMovementComponent");
static_assert(sizeof(ABP_Muntjac_C_GetMovementComponent) == 0x000018, "Wrong size on ABP_Muntjac_C_GetMovementComponent");
static_assert(offsetof(ABP_Muntjac_C_GetMovementComponent, ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_GetMovementComponent::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetMovementComponent, K2Node_DynamicCast_AsCharacter_Movement_Component) == 0x000008, "Member 'ABP_Muntjac_C_GetMovementComponent::K2Node_DynamicCast_AsCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_GetMovementComponent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_Muntjac_C_GetMovementComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.InitializeLookAroundAnim
// 0x0068 (0x0068 - 0x0000)
struct ABP_Muntjac_C_InitializeLookAroundAnim final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         CallFunc_RandomTimeDelayFromRange_ReturnValue;     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_ConvertToSequencePlayerPure_SequencePlayer; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequencePlayerPure_Result;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_Array_Random_OutItem;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequencePlayerReference               CallFunc_SetSequence_ReturnValue;                  // 0x0050(0x0010)(NoDestructor)
	double                                        K2Node_VariableSet_TimeUntilNextLookAround_ImplicitCast; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_InitializeLookAroundAnim) == 0x000008, "Wrong alignment on ABP_Muntjac_C_InitializeLookAroundAnim");
static_assert(sizeof(ABP_Muntjac_C_InitializeLookAroundAnim) == 0x000068, "Wrong size on ABP_Muntjac_C_InitializeLookAroundAnim");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, Context) == 0x000000, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::Context' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, Node) == 0x000010, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::Node' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_RandomTimeDelayFromRange_ReturnValue) == 0x000020, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_RandomTimeDelayFromRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_ConvertToSequencePlayerPure_SequencePlayer) == 0x000028, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_ConvertToSequencePlayerPure_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_ConvertToSequencePlayerPure_Result) == 0x000038, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_ConvertToSequencePlayerPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_Array_Random_OutItem) == 0x000040, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_Array_Random_OutIndex) == 0x000048, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, CallFunc_SetSequence_ReturnValue) == 0x000050, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::CallFunc_SetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_InitializeLookAroundAnim, K2Node_VariableSet_TimeUntilNextLookAround_ImplicitCast) == 0x000060, "Member 'ABP_Muntjac_C_InitializeLookAroundAnim::K2Node_VariableSet_TimeUntilNextLookAround_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.LocationData
// 0x0020 (0x0020 - 0x0000)
struct ABP_Muntjac_C_LocationData final
{
public:
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_LocationData) == 0x000008, "Wrong alignment on ABP_Muntjac_C_LocationData");
static_assert(sizeof(ABP_Muntjac_C_LocationData) == 0x000020, "Wrong size on ABP_Muntjac_C_LocationData");
static_assert(offsetof(ABP_Muntjac_C_LocationData, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_LocationData::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_LocationData, CallFunc_VSizeXY_ReturnValue) == 0x000018, "Member 'ABP_Muntjac_C_LocationData::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.RandomTimeDelayFromRange
// 0x0048 (0x0048 - 0x0000)
struct ABP_Muntjac_C_RandomTimeDelayFromRange final
{
public:
	double                                        Min;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0034(0x0008)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_RandomTimeDelayFromRange) == 0x000008, "Wrong alignment on ABP_Muntjac_C_RandomTimeDelayFromRange");
static_assert(sizeof(ABP_Muntjac_C_RandomTimeDelayFromRange) == 0x000048, "Wrong size on ABP_Muntjac_C_RandomTimeDelayFromRange");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, Min) == 0x000000, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::Min' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, Max) == 0x000008, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::Max' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, ReturnValue) == 0x000010, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_BreakVector_X) == 0x000018, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_BreakVector_Y) == 0x000020, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_BreakVector_Z) == 0x000028, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_FTrunc_ReturnValue) == 0x000030, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_MakeRandomStream_ReturnValue) == 0x000034, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_MakeRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x00003C, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x000040, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RandomTimeDelayFromRange, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000044, "Member 'ABP_Muntjac_C_RandomTimeDelayFromRange::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.ResetSequenceEvaluator
// 0x0048 (0x0048 - 0x0000)
struct ABP_Muntjac_C_ResetSequenceEvaluator final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FSequenceEvaluatorReference            CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator; // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequenceEvaluatorPure_Result;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceEvaluatorReference            CallFunc_SetExplicitTime_ReturnValue;              // 0x0038(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Muntjac_C_ResetSequenceEvaluator) == 0x000008, "Wrong alignment on ABP_Muntjac_C_ResetSequenceEvaluator");
static_assert(sizeof(ABP_Muntjac_C_ResetSequenceEvaluator) == 0x000048, "Wrong size on ABP_Muntjac_C_ResetSequenceEvaluator");
static_assert(offsetof(ABP_Muntjac_C_ResetSequenceEvaluator, Context) == 0x000000, "Member 'ABP_Muntjac_C_ResetSequenceEvaluator::Context' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ResetSequenceEvaluator, Node) == 0x000010, "Member 'ABP_Muntjac_C_ResetSequenceEvaluator::Node' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ResetSequenceEvaluator, CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator) == 0x000020, "Member 'ABP_Muntjac_C_ResetSequenceEvaluator::CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ResetSequenceEvaluator, CallFunc_ConvertToSequenceEvaluatorPure_Result) == 0x000030, "Member 'ABP_Muntjac_C_ResetSequenceEvaluator::CallFunc_ConvertToSequenceEvaluatorPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ResetSequenceEvaluator, CallFunc_SetExplicitTime_ReturnValue) == 0x000038, "Member 'ABP_Muntjac_C_ResetSequenceEvaluator::CallFunc_SetExplicitTime_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.RotationData
// 0x0028 (0x0028 - 0x0000)
struct ABP_Muntjac_C_RotationData final
{
public:
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WorldDirectionDelta_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_RotationData) == 0x000008, "Wrong alignment on ABP_Muntjac_C_RotationData");
static_assert(sizeof(ABP_Muntjac_C_RotationData) == 0x000028, "Wrong size on ABP_Muntjac_C_RotationData");
static_assert(offsetof(ABP_Muntjac_C_RotationData, CallFunc_CalculateDirection_ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_RotationData::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RotationData, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_Muntjac_C_RotationData::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RotationData, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000010, "Member 'ABP_Muntjac_C_RotationData::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RotationData, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000018, "Member 'ABP_Muntjac_C_RotationData::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_RotationData, K2Node_VariableSet_WorldDirectionDelta_ImplicitCast) == 0x000020, "Member 'ABP_Muntjac_C_RotationData::K2Node_VariableSet_WorldDirectionDelta_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.Set-RotationMode
// 0x0001 (0x0001 - 0x0000)
struct ABP_Muntjac_C_Set_RotationMode final
{
public:
	EOffsetRootBoneMode                           Rotation_Mode_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_Set_RotationMode) == 0x000001, "Wrong alignment on ABP_Muntjac_C_Set_RotationMode");
static_assert(sizeof(ABP_Muntjac_C_Set_RotationMode) == 0x000001, "Wrong size on ABP_Muntjac_C_Set_RotationMode");
static_assert(offsetof(ABP_Muntjac_C_Set_RotationMode, Rotation_Mode_0) == 0x000000, "Member 'ABP_Muntjac_C_Set_RotationMode::Rotation_Mode_0' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.SetLocomotionStart
// 0x0088 (0x0088 - 0x0000)
struct ABP_Muntjac_C_SetLocomotionStart final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	E_MuntjacStances                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceEvaluatorReference            CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator; // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequenceEvaluatorPure_Result;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_1;                            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSequenceEvaluatorReference            CallFunc_SetSequenceWithInertialBlending_ReturnValue; // 0x0068(0x0010)(NoDestructor)
	struct FSequenceEvaluatorReference            CallFunc_SetExplicitTime_ReturnValue;              // 0x0078(0x0010)(NoDestructor)
};
static_assert(alignof(ABP_Muntjac_C_SetLocomotionStart) == 0x000008, "Wrong alignment on ABP_Muntjac_C_SetLocomotionStart");
static_assert(sizeof(ABP_Muntjac_C_SetLocomotionStart) == 0x000088, "Wrong size on ABP_Muntjac_C_SetLocomotionStart");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Context) == 0x000000, "Member 'ABP_Muntjac_C_SetLocomotionStart::Context' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Node) == 0x000010, "Member 'ABP_Muntjac_C_SetLocomotionStart::Node' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Temp_byte_Variable) == 0x000020, "Member 'ABP_Muntjac_C_SetLocomotionStart::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator) == 0x000028, "Member 'ABP_Muntjac_C_SetLocomotionStart::CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, CallFunc_ConvertToSequenceEvaluatorPure_Result) == 0x000038, "Member 'ABP_Muntjac_C_SetLocomotionStart::CallFunc_ConvertToSequenceEvaluatorPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Temp_object_Variable) == 0x000040, "Member 'ABP_Muntjac_C_SetLocomotionStart::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Temp_object_Variable_1) == 0x000048, "Member 'ABP_Muntjac_C_SetLocomotionStart::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Temp_object_Variable_2) == 0x000050, "Member 'ABP_Muntjac_C_SetLocomotionStart::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, Temp_object_Variable_3) == 0x000058, "Member 'ABP_Muntjac_C_SetLocomotionStart::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, K2Node_Select_Default) == 0x000060, "Member 'ABP_Muntjac_C_SetLocomotionStart::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, CallFunc_SetSequenceWithInertialBlending_ReturnValue) == 0x000068, "Member 'ABP_Muntjac_C_SetLocomotionStart::CallFunc_SetSequenceWithInertialBlending_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SetLocomotionStart, CallFunc_SetExplicitTime_ReturnValue) == 0x000078, "Member 'ABP_Muntjac_C_SetLocomotionStart::CallFunc_SetExplicitTime_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.ShouldPredictStopDistance
// 0x0003 (0x0003 - 0x0000)
struct ABP_Muntjac_C_ShouldPredictStopDistance final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_ShouldPredictStopDistance) == 0x000001, "Wrong alignment on ABP_Muntjac_C_ShouldPredictStopDistance");
static_assert(sizeof(ABP_Muntjac_C_ShouldPredictStopDistance) == 0x000003, "Wrong size on ABP_Muntjac_C_ShouldPredictStopDistance");
static_assert(offsetof(ABP_Muntjac_C_ShouldPredictStopDistance, ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_ShouldPredictStopDistance::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ShouldPredictStopDistance, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'ABP_Muntjac_C_ShouldPredictStopDistance::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_ShouldPredictStopDistance, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'ABP_Muntjac_C_ShouldPredictStopDistance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.SwitchToGallop
// 0x0038 (0x0038 - 0x0000)
struct ABP_Muntjac_C_SwitchToGallop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GallopTimeReset;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_SwitchToGallop) == 0x000008, "Wrong alignment on ABP_Muntjac_C_SwitchToGallop");
static_assert(sizeof(ABP_Muntjac_C_SwitchToGallop) == 0x000038, "Wrong size on ABP_Muntjac_C_SwitchToGallop");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, ReturnValue) == 0x000000, "Member 'ABP_Muntjac_C_SwitchToGallop::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, GallopTimeReset) == 0x000008, "Member 'ABP_Muntjac_C_SwitchToGallop::GallopTimeReset' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000011, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_SelectFloat_ReturnValue) == 0x000020, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_SwitchToGallop, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000030, "Member 'ABP_Muntjac_C_SwitchToGallop::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.UpdateLocomotionStart
// 0x0068 (0x0068 - 0x0000)
struct ABP_Muntjac_C_UpdateLocomotionStart final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	double                                        StrideWarpBlendInDurationScaled;                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StrideWarpAlphaDelay;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExplicitTime;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSequenceEvaluatorReference            CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator; // 0x0038(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToSequenceEvaluatorPure_Result;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAccumulatedTime_ReturnValue;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSequenceEvaluatorReference            CallFunc_AdvanceTimeByDistanceMatching_ReturnValue; // 0x0050(0x0010)(NoDestructor)
	float                                         CallFunc_AdvanceTimeByDistanceMatching_DistanceTraveled_ImplicitCast; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Muntjac_C_UpdateLocomotionStart) == 0x000008, "Wrong alignment on ABP_Muntjac_C_UpdateLocomotionStart");
static_assert(sizeof(ABP_Muntjac_C_UpdateLocomotionStart) == 0x000068, "Wrong size on ABP_Muntjac_C_UpdateLocomotionStart");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, Context) == 0x000000, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::Context' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, Node) == 0x000010, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::Node' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, StrideWarpBlendInDurationScaled) == 0x000020, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::StrideWarpBlendInDurationScaled' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, StrideWarpAlphaDelay) == 0x000028, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::StrideWarpAlphaDelay' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, ExplicitTime) == 0x000030, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::ExplicitTime' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator) == 0x000038, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::CallFunc_ConvertToSequenceEvaluatorPure_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, CallFunc_ConvertToSequenceEvaluatorPure_Result) == 0x000048, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::CallFunc_ConvertToSequenceEvaluatorPure_Result' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, CallFunc_GetAccumulatedTime_ReturnValue) == 0x00004C, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::CallFunc_GetAccumulatedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, CallFunc_AdvanceTimeByDistanceMatching_ReturnValue) == 0x000050, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::CallFunc_AdvanceTimeByDistanceMatching_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C_UpdateLocomotionStart, CallFunc_AdvanceTimeByDistanceMatching_DistanceTraveled_ImplicitCast) == 0x000060, "Member 'ABP_Muntjac_C_UpdateLocomotionStart::CallFunc_AdvanceTimeByDistanceMatching_DistanceTraveled_ImplicitCast' has a wrong offset!");

// Function ABP_Muntjac.ABP_Muntjac_C.UpdateLookAroundAnim
// 0x0120 (0x0120 - 0x0000)
struct ABP_Muntjac_C_UpdateLookAroundAnim final
{
public:
