#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PMC_Layer_Unarmed_FPP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_PMC_Layer_Unarmed_FPP_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PMC_Layer_Unarmed_FPP.ABP_PMC_Layer_Unarmed_FPP_C
// 0x0D00 (0x1180 - 0x0480)
class UABP_PMC_Layer_Unarmed_FPP_C final : public UP2CharacterAnimLayer_FPP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PMC_Layer_Unarmed_FPP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;    // 0x0488(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0498(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x04A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x04C8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0590(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x05B0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0678(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0698(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x06B8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x0700(0x0010)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0710(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0730(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x07F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0818(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x08E0(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0928(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09F0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0AF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B20(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0B48(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0C30(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x0C58(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0C68(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0C88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0CD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0CF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0D38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0D58(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0DA0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0DE8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0E58(0x0048)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0x0EA0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F18(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F38(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1000(0x0100)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1100(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1120(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1140(0x0010)()
	TArray<class UAbilityAsync_WaitGameplayTagAdded*> Async_Action_Array;                            // 0x1150(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	class UAnimMontage*                           LandAdditive;                                      // 0x1160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Dbno_Crawl;                                        // 0x1168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurveName_DisableIK_L;                             // 0x1170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurveName_DisableIK_R;                             // 0x1178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void AnimNotify_OnLanded()	 // 0xae1e64;
	void AUV(struct FPoseLink* AUV_0)	 // 0xae1e64;
	void Dbno(const struct FPoseLink& InPose_1, struct FPoseLink* Dbno_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_BlendListByBool_B27534C64A8171DA1677E7AE2C636945()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_BlendListByBool_E2409D3A4EFB0B1233866F9213B2DD81()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_BlendSpaceEvaluator_9F67109A4B3CDFCCEAA76C9D3293593A()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_BlendSpacePlayer_1DD14A86421FD5504F628AA09FB47835()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_4EC4024642262B8908A207A485BDA3E8()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_5B7F8F0E4AA06DF76916F1AE0BC96DAC()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_8C5811E24E3BE21467BA10B446D982DE()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_D50EC1BD454B7CE6F7AB04B9D8EBF7D4()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_EADBB693475D0C7997F13DA670B83FC2()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TransitionResult_EDEDB799446CA5E21030619432BCD38B()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP_AnimGraphNode_TwoWayBlend_C5CEE96D442881F56ADF5EA576E293AE()	 // 0xae1e64;
	void EvaluateGripAlpha(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_PMC_Layer_Unarmed_FPP(int32 EntryPoint)	 // 0xae1e64;
	void HipfireAim(struct FPoseLink* HipfireAim_0)	 // 0xae1e64;
	void Locomotion(struct FPoseLink* Locomotion_0)	 // 0xae1e64;
	void Offset(const struct FPoseLink& InPose_0, struct FPoseLink* Offset_0)	 // 0xae1e64;
	void Override(struct FPoseLink* Override_0)	 // 0xae1e64;
	void PostProcedural(const struct FPoseLink& InPose, struct FPoseLink* PostProcedural_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_PMC_Layer_Unarmed_FPP_C">();
	}
	static class UABP_PMC_Layer_Unarmed_FPP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_PMC_Layer_Unarmed_FPP_C>();
	}
};
static_assert(alignof(UABP_PMC_Layer_Unarmed_FPP_C) == 0x000010, "Wrong alignment on UABP_PMC_Layer_Unarmed_FPP_C");
static_assert(sizeof(UABP_PMC_Layer_Unarmed_FPP_C) == 0x001180, "Wrong size on UABP_PMC_Layer_Unarmed_FPP_C");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, UberGraphFrame) == 0x000480, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, __AnimBlueprintMutables) == 0x000488, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimBlueprintExtension_PropertyAccess) == 0x000498, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimBlueprintExtension_Base) == 0x0004A0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_8) == 0x0004A8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LinkedInputPose_3) == 0x0004C8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_7) == 0x000590, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LinkedInputPose_2) == 0x0005B0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_6) == 0x000678, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_5) == 0x000698, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Slot_1) == 0x0006B8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LocalRefPose_2) == 0x000700, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LocalRefPose_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_4) == 0x000710, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LinkedInputPose_1) == 0x000730, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_3) == 0x0007F8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LinkedInputPose) == 0x000818, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Slot) == 0x0008E0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TwoWayBlend) == 0x000928, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_SaveCachedPose) == 0x0009F0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_UseCachedPose_1) == 0x000AF8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_UseCachedPose) == 0x000B20, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_2) == 0x000B48, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult_5) == 0x000B68, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult_4) == 0x000B90, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult_3) == 0x000BB8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult_2) == 0x000BE0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult_1) == 0x000C08, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_TransitionResult) == 0x000C30, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LocalRefPose_1) == 0x000C58, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_StateResult_3) == 0x000C68, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_SequencePlayer_2) == 0x000C88, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_StateResult_2) == 0x000CD0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_SequencePlayer_1) == 0x000CF0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_StateResult_1) == 0x000D38, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_SequencePlayer) == 0x000D58, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_BlendListByBool_1) == 0x000DA0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_BlendSpacePlayer) == 0x000DE8, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_BlendListByBool) == 0x000E58, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_BlendSpaceEvaluator) == 0x000EA0, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_BlendSpaceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_StateResult) == 0x000F18, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_StateMachine) == 0x000F38, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Inertialization) == 0x001000, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Inertialization' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root_1) == 0x001100, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_Root) == 0x001120, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, AnimGraphNode_LocalRefPose) == 0x001140, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, Async_Action_Array) == 0x001150, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::Async_Action_Array' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, LandAdditive) == 0x001160, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::LandAdditive' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, Dbno_Crawl) == 0x001168, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::Dbno_Crawl' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, CurveName_DisableIK_L) == 0x001170, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::CurveName_DisableIK_L' has a wrong offset!");
static_assert(offsetof(UABP_PMC_Layer_Unarmed_FPP_C, CurveName_DisableIK_R) == 0x001178, "Member 'UABP_PMC_Layer_Unarmed_FPP_C::CurveName_DisableIK_R' has a wrong offset!");

}

