#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Rifle_M277A

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Rifle_M277A.ABP_Rifle_M277A_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Rifle_M277A_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Rifle_M277A_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Rifle_M277A_C_AnimGraph");
static_assert(sizeof(ABP_Rifle_M277A_C_AnimGraph) == 0x000010, "Wrong size on ABP_Rifle_M277A_C_AnimGraph");
static_assert(offsetof(ABP_Rifle_M277A_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Rifle_M277A_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Rifle_M277A.ABP_Rifle_M277A_C.ExecuteUbergraph_ABP_Rifle_M277A
// 0x0008 (0x0008 - 0x0000)
struct ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTagAlpha_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A) == 0x000004, "Wrong alignment on ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A");
static_assert(sizeof(ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A) == 0x000008, "Wrong size on ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A");
static_assert(offsetof(ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A, EntryPoint) == 0x000000, "Member 'ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A, CallFunc_GetTagAlpha_ReturnValue) == 0x000004, "Member 'ABP_Rifle_M277A_C_ExecuteUbergraph_ABP_Rifle_M277A::CallFunc_GetTagAlpha_ReturnValue' has a wrong offset!");

}

