#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Squad_AUV

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Squad_AUV.ABP_Squad_AUV_C
// 0x01C0 (0x0510 - 0x0350)
class UABP_Squad_AUV_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0388(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x03F8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0418(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0438(0x00C8)()
	bool                                          isLeaving;                                         // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Squad_AUV(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Squad_AUV_C">();
	}
	static class UABP_Squad_AUV_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Squad_AUV_C>();
	}
};
static_assert(alignof(UABP_Squad_AUV_C) == 0x000010, "Wrong alignment on UABP_Squad_AUV_C");
static_assert(sizeof(UABP_Squad_AUV_C) == 0x000510, "Wrong size on UABP_Squad_AUV_C");
static_assert(offsetof(UABP_Squad_AUV_C, UberGraphFrame) == 0x000350, "Member 'UABP_Squad_AUV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Squad_AUV_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Squad_AUV_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Squad_AUV_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_TransitionResult) == 0x000388, "Member 'UABP_Squad_AUV_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_SequencePlayer) == 0x0003B0, "Member 'UABP_Squad_AUV_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_StateResult_1) == 0x0003F8, "Member 'UABP_Squad_AUV_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_StateResult) == 0x000418, "Member 'UABP_Squad_AUV_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, AnimGraphNode_StateMachine) == 0x000438, "Member 'UABP_Squad_AUV_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Squad_AUV_C, isLeaving) == 0x000500, "Member 'UABP_Squad_AUV_C::isLeaving' has a wrong offset!");

}

