#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BOSS_Spectre_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_NPC_BOSS_Spectre_PostProcess.ABP_NPC_BOSS_Spectre_PostProcess_C.AnimBlueprintGeneratedConstantData
// 0x012F (0x0130 - 0x0001)
struct ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_19;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_20;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_21;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_Tag                     AnimBlueprintExtension_Tag;                        // 0x0038(0x0060)()
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0098(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0118(0x0018)()
};
static_assert(alignof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData) == 0x000130, "Wrong size on ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, __NameProperty_19) == 0x000004, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::__NameProperty_19' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, __NameProperty_20) == 0x00000C, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::__NameProperty_20' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, __StructProperty_21) == 0x000018, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::__StructProperty_21' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Tag) == 0x000038, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Tag' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000098, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000118, "Member 'ABP_NPC_BOSS_Spectre_PostProcess::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

