#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_APS_Sentry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_APS_Sentry.ABP_APS_Sentry_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_APS_Sentry_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_APS_Sentry_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_APS_Sentry_C_AnimGraph");
static_assert(sizeof(ABP_APS_Sentry_C_AnimGraph) == 0x000010, "Wrong size on ABP_APS_Sentry_C_AnimGraph");
static_assert(offsetof(ABP_APS_Sentry_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_APS_Sentry_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_APS_Sentry.ABP_APS_Sentry_C.ExecuteUbergraph_ABP_APS_Sentry
// 0x0004 (0x0004 - 0x0000)
struct ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry) == 0x000004, "Wrong alignment on ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry");
static_assert(sizeof(ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry) == 0x000004, "Wrong size on ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry");
static_assert(offsetof(ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry, EntryPoint) == 0x000000, "Member 'ABP_APS_Sentry_C_ExecuteUbergraph_ABP_APS_Sentry::EntryPoint' has a wrong offset!");

}

