#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Rifle_AnimLayer_TPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_Rifle_AnimLayer_TPP.ABP_Rifle_AnimLayer_TPP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Rifle_AnimLayer_TPP.ABP_Rifle_AnimLayer_TPP_C.ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP
// 0x0020 (0x0020 - 0x0000)
struct ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2CharacterAnimInstance_TPP*           CallFunc_GetMainAnimInstance_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Hero_TPP_C*                        K2Node_DynamicCast_AsABP_Hero_TPP;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP) == 0x000008, "Wrong alignment on ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP");
static_assert(sizeof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP) == 0x000020, "Wrong size on ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP, EntryPoint) == 0x000000, "Member 'ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP, CallFunc_GetMainAnimInstance_ReturnValue) == 0x000008, "Member 'ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP::CallFunc_GetMainAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP, K2Node_DynamicCast_AsABP_Hero_TPP) == 0x000010, "Member 'ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP::K2Node_DynamicCast_AsABP_Hero_TPP' has a wrong offset!");
static_assert(offsetof(ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ABP_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_Rifle_AnimLayer_TPP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

