#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Template_Orient_00_90_180

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Template_Orient_00_90_180.ABP_Template_Orient_00_90_180_C.AnimBlueprintGeneratedConstantData
// 0x01AF (0x01B0 - 0x0001)
struct ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_99;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_100;                              // 0x0010(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_101;                              // 0x0030(0x0020)(BlueprintVisible, NoDestructor)
	struct FInputScaleBiasClampConstants          __StructProperty_102;                              // 0x0050(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_103;                               // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_104;                                // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_105;                                // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_106;                                // 0x0084(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_107;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimNodeFunctionRef                   __StructProperty_108;                              // 0x00B0(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_109;                                // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_110;                                  // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_111;                                // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_112;                                // 0x00E1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_113;                                // 0x00E2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x5];                                       // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_114;                               // 0x00E8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00F8(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x0178(0x0008)()
	struct FAnimSubsystem_BlendSpaceGraph         AnimBlueprintExtension_BlendSpaceGraph;            // 0x0180(0x0018)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0198(0x0018)()
};
static_assert(alignof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData) == 0x0001B0, "Wrong size on ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000004, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __StructProperty_100) == 0x000010, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__StructProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __StructProperty_101) == 0x000030, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__StructProperty_101' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __StructProperty_102) == 0x000050, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__StructProperty_102' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __FloatProperty_103) == 0x00007C, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__FloatProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __EnumProperty_104) == 0x000080, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__EnumProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __ByteProperty_105) == 0x000081, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__ByteProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000084, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __StructProperty_107) == 0x000090, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__StructProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __StructProperty_108) == 0x0000B0, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__StructProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __BlendProfile_109) == 0x0000D0, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__BlendProfile_109' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __CurveFloat_110) == 0x0000D8, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__CurveFloat_110' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __BoolProperty_111) == 0x0000E0, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__BoolProperty_111' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __EnumProperty_112) == 0x0000E1, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__EnumProperty_112' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __EnumProperty_113) == 0x0000E2, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__EnumProperty_113' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, __ArrayProperty_114) == 0x0000E8, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::__ArrayProperty_114' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000F8, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x000178, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_BlendSpaceGraph) == 0x000180, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_BlendSpaceGraph' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000198, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Template_Orient_00_90_180.ABP_Template_Orient_00_90_180_C.AnimBlueprintGeneratedMutableData
// 0x0037 (0x0038 - 0x0001)
struct ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_6;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_8;                                 // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_9;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_10;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_11;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData) == 0x000038, "Wrong size on ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x000018, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_5) == 0x00001C, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000020, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000024, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_8) == 0x000028, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_8' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_9) == 0x00002C, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x000030, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData, __BoolProperty_11) == 0x000034, "Member 'ABP_Template_Orient_00_90_180::FAnimBlueprintGeneratedMutableData::__BoolProperty_11' has a wrong offset!");

}

