#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AR_FX2000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AR_FX2000.ABP_AR_FX2000_C
// 0x0120 (0x04D0 - 0x03B0)
class UABP_AR_FX2000_C final : public UP2WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x03E8(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03F8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0440(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0488(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04A8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_AR_FX2000(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_AR_FX2000_C">();
	}
	static class UABP_AR_FX2000_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_AR_FX2000_C>();
	}
};
static_assert(alignof(UABP_AR_FX2000_C) == 0x000010, "Wrong alignment on UABP_AR_FX2000_C");
static_assert(sizeof(UABP_AR_FX2000_C) == 0x0004D0, "Wrong size on UABP_AR_FX2000_C");
static_assert(offsetof(UABP_AR_FX2000_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_AR_FX2000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_AR_FX2000_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_AR_FX2000_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_Root) == 0x0003C8, "Member 'UABP_AR_FX2000_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_LocalRefPose) == 0x0003E8, "Member 'UABP_AR_FX2000_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_Slot_1) == 0x0003F8, "Member 'UABP_AR_FX2000_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_Slot) == 0x000440, "Member 'UABP_AR_FX2000_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_LocalToComponentSpace) == 0x000488, "Member 'UABP_AR_FX2000_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_AR_FX2000_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004A8, "Member 'UABP_AR_FX2000_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

