#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV_Hero

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AUV_Hero.ABP_AUV_Hero_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AUV_Hero_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AUV_Hero_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AUV_Hero_C_AnimGraph");
static_assert(sizeof(ABP_AUV_Hero_C_AnimGraph) == 0x000010, "Wrong size on ABP_AUV_Hero_C_AnimGraph");
static_assert(offsetof(ABP_AUV_Hero_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_AUV_Hero_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_AUV_Hero.ABP_AUV_Hero_C.ExecuteUbergraph_ABP_AUV_Hero
// 0x0048 (0x0048 - 0x0000)
struct ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero) == 0x000008, "Wrong alignment on ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero");
static_assert(sizeof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero) == 0x000048, "Wrong size on ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, EntryPoint) == 0x000000, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_object_Variable) == 0x000008, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_object_Variable_1) == 0x000010, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_bool_Variable) == 0x000018, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_bool_Variable_1) == 0x000019, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_object_Variable_2) == 0x000020, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_object_Variable_3) == 0x000028, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_bool_Variable_2) == 0x000030, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, Temp_bool_Variable_3) == 0x000031, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, K2Node_Select_Default) == 0x000038, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero, K2Node_Select_Default_1) == 0x000040, "Member 'ABP_AUV_Hero_C_ExecuteUbergraph_ABP_AUV_Hero::K2Node_Select_Default_1' has a wrong offset!");

// Function ABP_AUV_Hero.ABP_AUV_Hero_C.SwimOverride
// 0x0020 (0x0020 - 0x0000)
struct ABP_AUV_Hero_C_SwimOverride final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimOverride_0;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AUV_Hero_C_SwimOverride) == 0x000008, "Wrong alignment on ABP_AUV_Hero_C_SwimOverride");
static_assert(sizeof(ABP_AUV_Hero_C_SwimOverride) == 0x000020, "Wrong size on ABP_AUV_Hero_C_SwimOverride");
static_assert(offsetof(ABP_AUV_Hero_C_SwimOverride, InPose) == 0x000000, "Member 'ABP_AUV_Hero_C_SwimOverride::InPose' has a wrong offset!");
static_assert(offsetof(ABP_AUV_Hero_C_SwimOverride, SwimOverride_0) == 0x000010, "Member 'ABP_AUV_Hero_C_SwimOverride::SwimOverride_0' has a wrong offset!");

}

