#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BOSS_Template

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_BOSS_Template_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_AnimGraph");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_AnimGraph) == 0x000010, "Wrong size on ABP_NPC_BOSS_Template_C_AnimGraph");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong alignment on ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation) == 0x000004, "Wrong size on ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation, DeltaTime) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_BlueprintThreadSafeUpdateAnimation::DeltaTime' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.Check Health
// 0x0030 (0x0030 - 0x0000)
struct ABP_NPC_BOSS_Template_C_Check_Health final
{
public:
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_HealthBlendOverlay_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_Check_Health) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_Check_Health");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_Check_Health) == 0x000030, "Wrong size on ABP_NPC_BOSS_Template_C_Check_Health");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Health, K2Node_VariableSet_HealthBlendOverlay_ImplicitCast) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_Check_Health::K2Node_VariableSet_HealthBlendOverlay_ImplicitCast' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.Check_Stage_Value
// 0x0050 (0x0050 - 0x0000)
struct ABP_NPC_BOSS_Template_C_Check_Stage_Value final
{
public:
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_GetOwnedGameplayTags_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetOwnedGameplayTags_TagContainer;        // 0x0028(0x0020)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_Check_Stage_Value) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_Check_Stage_Value");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_Check_Stage_Value) == 0x000050, "Wrong size on ABP_NPC_BOSS_Template_C_Check_Stage_Value");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_GetOwningActor_ReturnValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, K2Node_DynamicCast_AsP2NPCharacter) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_GetOwnedGameplayTags_self_CastInput) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_GetOwnedGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_GetOwnedGameplayTags_TagContainer) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_GetOwnedGameplayTags_TagContainer' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_HasTag_ReturnValue) == 0x000048, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_HasTag_ReturnValue_1) == 0x000049, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Check_Stage_Value, CallFunc_HasTag_ReturnValue_2) == 0x00004A, "Member 'ABP_NPC_BOSS_Template_C_Check_Stage_Value::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.ExecuteUbergraph_ABP_NPC_BOSS_Template
// 0x0060 (0x0060 - 0x0000)
struct ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_4;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_2;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_3;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_4;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template) == 0x000060, "Wrong size on ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, EntryPoint) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000A, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000011, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000012, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_BooleanAND_ReturnValue_1) == 0x000013, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_BooleanAND_ReturnValue_2) == 0x000014, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, K2Node_Event_DeltaTimeX) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x00001C, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_ReturnValue_3) == 0x000020, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000024, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_ReturnValue_4) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000038, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_A_ImplicitCast_2) == 0x000040, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_A_ImplicitCast_3) == 0x000050, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template, CallFunc_Less_DoubleDouble_A_ImplicitCast_4) == 0x000058, "Member 'ABP_NPC_BOSS_Template_C_ExecuteUbergraph_ABP_NPC_BOSS_Template::CallFunc_Less_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.Get Cardinal Direction from Angle
// 0x0068 (0x0068 - 0x0000)
struct ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle final
{
public:
	double                                        Angle;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Buffer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CurrentDirection;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            Direction;                                         // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Loc_Bwd_Buffer;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Loc_Fwd_Buffer;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Loc_Abs_Angle;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle) == 0x000068, "Wrong size on ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Angle) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Angle' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Buffer) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Buffer' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CurrentDirection) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CurrentDirection' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Direction) == 0x000011, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Direction' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Loc_Bwd_Buffer) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Loc_Bwd_Buffer' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Loc_Fwd_Buffer) == 0x000020, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Loc_Fwd_Buffer' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, Loc_Abs_Angle) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::Loc_Abs_Angle' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Abs_ReturnValue) == 0x000030, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000050, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000060, "Member 'ABP_NPC_BOSS_Template_C_Get_Cardinal_Direction_from_Angle::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.GetCheckHealthVariables
// 0x0020 (0x0020 - 0x0000)
struct ABP_NPC_BOSS_Template_C_GetCheckHealthVariables final
{
public:
	EP2DeathState                                 CallFunc_GetDeathState_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2HealthComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_GetCheckHealthVariables");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables) == 0x000020, "Wrong size on ABP_NPC_BOSS_Template_C_GetCheckHealthVariables");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables, CallFunc_GetDeathState_ReturnValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_GetCheckHealthVariables::CallFunc_GetDeathState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_GetCheckHealthVariables::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_GetCheckHealthVariables::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetCheckHealthVariables, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_GetCheckHealthVariables::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.GetLookAtVariables
// 0x00C0 (0x00C0 - 0x0000)
struct ABP_NPC_BOSS_Template_C_GetLookAtVariables final
{
public:
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetFocusedActor_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_GetLookAtVariables) == 0x000010, "Wrong alignment on ABP_NPC_BOSS_Template_C_GetLookAtVariables");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_GetLookAtVariables) == 0x0000C0, "Wrong size on ABP_NPC_BOSS_Template_C_GetLookAtVariables");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_GetOwningComponent_ReturnValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_GetSocketTransform_ReturnValue) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_GetOwningActor_ReturnValue) == 0x000070, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, K2Node_DynamicCast_AsP2NPCharacter) == 0x000080, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_GetFocusedActor_ReturnValue) == 0x000090, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_GetFocusedActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A0, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_GetLookAtVariables, CallFunc_GetSocketLocation_ReturnValue) == 0x0000A8, "Member 'ABP_NPC_BOSS_Template_C_GetLookAtVariables::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.IsPhasingValue
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_BOSS_Template_C_IsPhasingValue final
{
public:
	float                                         CallFunc_GetCurveValueWithDefault_OutValue;        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurveValueWithDefault_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_IsPhasingValue) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_IsPhasingValue");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_IsPhasingValue) == 0x000010, "Wrong size on ABP_NPC_BOSS_Template_C_IsPhasingValue");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_IsPhasingValue, CallFunc_GetCurveValueWithDefault_OutValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_IsPhasingValue::CallFunc_GetCurveValueWithDefault_OutValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_IsPhasingValue, CallFunc_GetCurveValueWithDefault_ReturnValue) == 0x000004, "Member 'ABP_NPC_BOSS_Template_C_IsPhasingValue::CallFunc_GetCurveValueWithDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_IsPhasingValue, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000005, "Member 'ABP_NPC_BOSS_Template_C_IsPhasingValue::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_IsPhasingValue, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'ABP_NPC_BOSS_Template_C_IsPhasingValue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_IsPhasingValue, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_IsPhasingValue::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.LookAt
// 0x00A0 (0x00A0 - 0x0000)
struct ABP_NPC_BOSS_Template_C_LookAt final
{
public:
	float                                         CallFunc_GetCurveValueWithDefault_OutValue;        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurveValueWithDefault_ReturnValue;     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindRelativeLookAtRotation_ReturnValue;   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_Look_at_Alpha_ImplicitCast;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_YawValueToTarget_ImplicitCast;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_InRange_FloatFloat_Value_ImplicitCast;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_LookAt) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_LookAt");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_LookAt) == 0x0000A0, "Wrong size on ABP_NPC_BOSS_Template_C_LookAt");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_GetCurveValueWithDefault_OutValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_GetCurveValueWithDefault_OutValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_GetCurveValueWithDefault_ReturnValue) == 0x000004, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_GetCurveValueWithDefault_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000005, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FindLookAtRotation_ReturnValue) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_Vector_Distance_ReturnValue) == 0x000020, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FindRelativeLookAtRotation_ReturnValue) == 0x000040, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FindRelativeLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Roll_1) == 0x000058, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Pitch_1) == 0x00005C, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BreakRotator_Yaw_1) == 0x000060, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FClamp_ReturnValue_1) == 0x000068, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_InRange_FloatFloat_ReturnValue) == 0x000070, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_InRange_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, K2Node_VariableSet_Look_at_Alpha_ImplicitCast) == 0x000078, "Member 'ABP_NPC_BOSS_Template_C_LookAt::K2Node_VariableSet_Look_at_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FClamp_Value_ImplicitCast) == 0x000080, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000088, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, K2Node_VariableSet_YawValueToTarget_ImplicitCast) == 0x000090, "Member 'ABP_NPC_BOSS_Template_C_LookAt::K2Node_VariableSet_YawValueToTarget_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookAt, CallFunc_InRange_FloatFloat_Value_ImplicitCast) == 0x000098, "Member 'ABP_NPC_BOSS_Template_C_LookAt::CallFunc_InRange_FloatFloat_Value_ImplicitCast' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.LookUpClassDetails
// 0x0030 (0x0030 - 0x0000)
struct ABP_NPC_BOSS_Template_C_LookUpClassDetails final
{
public:
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_LookUpClassDetails) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_LookUpClassDetails");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_LookUpClassDetails) == 0x000030, "Wrong size on ABP_NPC_BOSS_Template_C_LookUpClassDetails");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, CallFunc_GetOwningComponent_ReturnValue) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, CallFunc_GetSkeletalMeshAsset_ReturnValue) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::CallFunc_GetSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, K2Node_DynamicCast_AsP2NPCharacter) == 0x000020, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_LookUpClassDetails, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_NPC_BOSS_Template_C_LookUpClassDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ABP_NPC_BOSS_Template.ABP_NPC_BOSS_Template_C.TurnInPlaceValues
// 0x00A8 (0x00A8 - 0x0000)
struct ABP_NPC_BOSS_Template_C_TurnInPlaceValues final
{
public:
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Target_Yaw_ImplicitCast;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_Yaw_Delta_ImplicitCast;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues) == 0x000008, "Wrong alignment on ABP_NPC_BOSS_Template_C_TurnInPlaceValues");
static_assert(sizeof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues) == 0x0000A8, "Wrong size on ABP_NPC_BOSS_Template_C_TurnInPlaceValues");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, Temp_bool_Has_Been_Initd_Variable) == 0x000000, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, Temp_bool_IsClosed_Variable) == 0x000001, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_GetCurveValue_ReturnValue_1) == 0x000008, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000C, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x00000D, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00000E, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00000F, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_MakeRotator_ReturnValue_1) == 0x000030, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_REase_ReturnValue) == 0x000048, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000060, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000068, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BOSS_Template_C_TurnInPlaceValues, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'ABP_NPC_BOSS_Template_C_TurnInPlaceValues::CallFunc_BreakRotator_Roll' has a wrong offset!");
