#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AKN_32GS_Rifle_AnimLayer_TPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_AKN-32GS_Rifle_AnimLayer_TPP.ABP_AKN-32GS_Rifle_AnimLayer_TPP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_AKN-32GS_Rifle_AnimLayer_TPP.ABP_AKN-32GS_Rifle_AnimLayer_TPP_C.ExecuteUbergraph_ABP_AKN-32GS_Rifle_AnimLayer_TPP
// 0x0008 (0x0008 - 0x0000)
struct ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP) == 0x000004, "Wrong alignment on ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP");
static_assert(sizeof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP) == 0x000008, "Wrong size on ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP");
static_assert(offsetof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP, EntryPoint) == 0x000000, "Member 'ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'ABP_AKN_32GS_Rifle_AnimLayer_TPP_C_ExecuteUbergraph_ABP_AKN_32GS_Rifle_AnimLayer_TPP::K2Node_Event_DeltaTimeX' has a wrong offset!");

}

