#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Melee_Sledgehammer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Melee_Sledgehammer.ABP_Melee_Sledgehammer_C
// 0x0200 (0x05A0 - 0x03A0)
class UABP_Melee_Sledgehammer_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03D8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0420(0x0010)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0430(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0450(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0470(0x0128)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Sledgehammer_AnimGraphNode_ModifyBone_4CD583024C6478A4B0E4E8A444EF747F()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Melee_Sledgehammer(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Melee_Sledgehammer_C">();
	}
	static class UABP_Melee_Sledgehammer_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Melee_Sledgehammer_C>();
	}
};
static_assert(alignof(UABP_Melee_Sledgehammer_C) == 0x000010, "Wrong alignment on UABP_Melee_Sledgehammer_C");
static_assert(sizeof(UABP_Melee_Sledgehammer_C) == 0x0005A0, "Wrong size on UABP_Melee_Sledgehammer_C");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_Melee_Sledgehammer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UABP_Melee_Sledgehammer_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UABP_Melee_Sledgehammer_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_Slot) == 0x0003D8, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_LocalRefPose) == 0x000420, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_LocalToComponentSpace) == 0x000430, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_ComponentToLocalSpace) == 0x000450, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Melee_Sledgehammer_C, AnimGraphNode_ModifyBone) == 0x000470, "Member 'UABP_Melee_Sledgehammer_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

