#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PST_V9A1

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_PST_V9A1.ABP_PST_V9A1_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PST_V9A1_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PST_V9A1_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PST_V9A1_C_AnimGraph");
static_assert(sizeof(ABP_PST_V9A1_C_AnimGraph) == 0x000010, "Wrong size on ABP_PST_V9A1_C_AnimGraph");
static_assert(offsetof(ABP_PST_V9A1_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PST_V9A1_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PST_V9A1.ABP_PST_V9A1_C.ExecuteUbergraph_ABP_PST_V9A1
// 0x000C (0x000C - 0x0000)
struct ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTagAlpha_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTagAlpha_ReturnValue_1;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1) == 0x000004, "Wrong alignment on ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1");
static_assert(sizeof(ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1) == 0x00000C, "Wrong size on ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1");
static_assert(offsetof(ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1, EntryPoint) == 0x000000, "Member 'ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1, CallFunc_GetTagAlpha_ReturnValue) == 0x000004, "Member 'ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1::CallFunc_GetTagAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1, CallFunc_GetTagAlpha_ReturnValue_1) == 0x000008, "Member 'ABP_PST_V9A1_C_ExecuteUbergraph_ABP_PST_V9A1::CallFunc_GetTagAlpha_ReturnValue_1' has a wrong offset!");

}

