#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PST_V9A1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PST_V9A1.ABP_PST_V9A1_C
// 0x0820 (0x0BD0 - 0x03B0)
class UABP_PST_V9A1_C final : public UP2WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03C8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x03E8(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x03F8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0440(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0460(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0480(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0490(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x04D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0600(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0728(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0850(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0978(0x0128)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0AA0(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0B80(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PST_V9A1_AnimGraphNode_ModifyBone_18A83A644B6886CEEFB435AAE43021C0()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PST_V9A1_AnimGraphNode_ModifyBone_59EF9F6644933AC3D52D7E973635DA55()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PST_V9A1_AnimGraphNode_ModifyBone_C861AA2C4AD9AC0689E3949CF2046F8F()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PST_V9A1_AnimGraphNode_ModifyBone_FC3F6D334A9F5E2893404BAD3BBFC8B1()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_PST_V9A1(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_PST_V9A1_C">();
	}
	static class UABP_PST_V9A1_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_PST_V9A1_C>();
	}
};
static_assert(alignof(UABP_PST_V9A1_C) == 0x000010, "Wrong alignment on UABP_PST_V9A1_C");
static_assert(sizeof(UABP_PST_V9A1_C) == 0x000BD0, "Wrong size on UABP_PST_V9A1_C");
static_assert(offsetof(UABP_PST_V9A1_C, UberGraphFrame) == 0x0003B0, "Member 'UABP_PST_V9A1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimBlueprintExtension_PropertyAccess) == 0x0003B8, "Member 'UABP_PST_V9A1_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimBlueprintExtension_Base) == 0x0003C0, "Member 'UABP_PST_V9A1_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_Root) == 0x0003C8, "Member 'UABP_PST_V9A1_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_LocalRefPose_1) == 0x0003E8, "Member 'UABP_PST_V9A1_C::AnimGraphNode_LocalRefPose_1' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_Slot_2) == 0x0003F8, "Member 'UABP_PST_V9A1_C::AnimGraphNode_Slot_2' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ComponentToLocalSpace) == 0x000440, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_LocalToComponentSpace) == 0x000460, "Member 'UABP_PST_V9A1_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_LocalRefPose) == 0x000480, "Member 'UABP_PST_V9A1_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_Slot_1) == 0x000490, "Member 'UABP_PST_V9A1_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ModifyBone_4) == 0x0004D8, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ModifyBone_3) == 0x000600, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ModifyBone_2) == 0x000728, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ModifyBone_1) == 0x000850, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_ModifyBone) == 0x000978, "Member 'UABP_PST_V9A1_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_LayeredBoneBlend) == 0x000AA0, "Member 'UABP_PST_V9A1_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_PST_V9A1_C, AnimGraphNode_Slot) == 0x000B80, "Member 'UABP_PST_V9A1_C::AnimGraphNode_Slot' has a wrong offset!");

}

