#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AUV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_AUV_structs.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AUV.ABP_AUV_C
// 0x0720 (0x0A70 - 0x0350)
class UABP_AUV_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_AUV::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                      // 0x0358(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0380(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x03A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x03C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0418(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0460(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0480(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0530(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0550(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x0618(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x06E8(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x07B8(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0888(0x00D0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x0958(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x0998(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x09D8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0A18(0x0040)()
	bool                                          Departed;                                          // 0x0A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A59[0x3];                                      // 0x0A59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HatchFL;                                           // 0x0A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HatchFR;                                           // 0x0A60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HatchBL;                                           // 0x0A64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HatchBR;                                           // 0x0A68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintInitializeAnimation()	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_AUV(int32 EntryPoint)	 // 0xae1e64;
	void OnStateChanged_Event_0()	 // 0xae1e64;
	void UpdateHatchState(class AP2ExfiltrationAUV* InVehicle, class UP2ExfiltrationAUVSeat* InSeat, double& InHatch)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_AUV_C">();
	}
	static class UABP_AUV_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_AUV_C>();
	}
};
static_assert(alignof(UABP_AUV_C) == 0x000010, "Wrong alignment on UABP_AUV_C");
static_assert(sizeof(UABP_AUV_C) == 0x000A70, "Wrong size on UABP_AUV_C");
static_assert(offsetof(UABP_AUV_C, UberGraphFrame) == 0x000350, "Member 'UABP_AUV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, __AnimBlueprintMutables) == 0x000358, "Member 'UABP_AUV_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimBlueprintExtension_PropertyAccess) == 0x000370, "Member 'UABP_AUV_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimBlueprintExtension_Base) == 0x000378, "Member 'UABP_AUV_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_Root) == 0x000380, "Member 'UABP_AUV_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_TransitionResult_2) == 0x0003A0, "Member 'UABP_AUV_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_TransitionResult_1) == 0x0003C8, "Member 'UABP_AUV_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_TransitionResult) == 0x0003F0, "Member 'UABP_AUV_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequencePlayer_2) == 0x000418, "Member 'UABP_AUV_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_StateResult_2) == 0x000460, "Member 'UABP_AUV_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequencePlayer_1) == 0x000480, "Member 'UABP_AUV_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_StateResult_1) == 0x0004C8, "Member 'UABP_AUV_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequencePlayer) == 0x0004E8, "Member 'UABP_AUV_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_StateResult) == 0x000530, "Member 'UABP_AUV_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_StateMachine) == 0x000550, "Member 'UABP_AUV_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_ApplyMeshSpaceAdditive_3) == 0x000618, "Member 'UABP_AUV_C::AnimGraphNode_ApplyMeshSpaceAdditive_3' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_ApplyMeshSpaceAdditive_2) == 0x0006E8, "Member 'UABP_AUV_C::AnimGraphNode_ApplyMeshSpaceAdditive_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_ApplyMeshSpaceAdditive_1) == 0x0007B8, "Member 'UABP_AUV_C::AnimGraphNode_ApplyMeshSpaceAdditive_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x000888, "Member 'UABP_AUV_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequenceEvaluator_3) == 0x000958, "Member 'UABP_AUV_C::AnimGraphNode_SequenceEvaluator_3' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequenceEvaluator_2) == 0x000998, "Member 'UABP_AUV_C::AnimGraphNode_SequenceEvaluator_2' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequenceEvaluator_1) == 0x0009D8, "Member 'UABP_AUV_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, AnimGraphNode_SequenceEvaluator) == 0x000A18, "Member 'UABP_AUV_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, Departed) == 0x000A58, "Member 'UABP_AUV_C::Departed' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, HatchFL) == 0x000A5C, "Member 'UABP_AUV_C::HatchFL' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, HatchFR) == 0x000A60, "Member 'UABP_AUV_C::HatchFR' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, HatchBL) == 0x000A64, "Member 'UABP_AUV_C::HatchBL' has a wrong offset!");
static_assert(offsetof(UABP_AUV_C, HatchBR) == 0x000A68, "Member 'UABP_AUV_C::HatchBR' has a wrong offset!");

}

