#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_FX2000_UpperRail_Picatinny_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_FX2000_UpperRail_Picatinny_AnimBlueprint.ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C
// 0x01B0 (0x0550 - 0x03A0)
class UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C final : public UP2ItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x03D8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0520(0x0010)()
	double                                        IronSightFoldedAlpha;                              // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   In_Bone_Name;                                      // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InterpSpeed;                                       // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_AnimGraphNode_ModifyBone_DA3629094E0BC15A6E5ECBA90A33CE10()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_FX2000_UpperRail_Picatinny_AnimBlueprint(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C">();
	}
	static class UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C>();
	}
};
static_assert(alignof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C) == 0x000010, "Wrong alignment on UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C");
static_assert(sizeof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C) == 0x000550, "Wrong size on UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, UberGraphFrame) == 0x0003A0, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0003A8, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0003B0, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimGraphNode_Root) == 0x0003B8, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x0003D8, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000500, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, AnimGraphNode_MeshRefPose) == 0x000520, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, IronSightFoldedAlpha) == 0x000530, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::IronSightFoldedAlpha' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, In_Bone_Name) == 0x000538, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::In_Bone_Name' has a wrong offset!");
static_assert(offsetof(UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C, InterpSpeed) == 0x000540, "Member 'UABP_FX2000_UpperRail_Picatinny_AnimBlueprint_C::InterpSpeed' has a wrong offset!");

}

