#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_FPP

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_Hero_FPP_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Hero_FPP.ABP_Hero_FPP_C
// 0x5170 (0x60C0 - 0x0F50)
class UABP_Hero_FPP_C final : public UP2CharacterAnimInstance_FPP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Hero_FPP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                 // 0x0F58(0x0004)(HasGetValueTypeHash)
	uint8                                         Pad_F5C[0x4];                                      // 0x0F5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0F60(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0F68(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0F70(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1098(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x11C0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x11E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x1308(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x1430(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1558(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x1680(0x0470)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x1AF0(0x0470)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x1F60(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x2028(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x2130(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x2158(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x2180(0x0470)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x25F0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x26B8(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x27C0(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x28C8(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x29A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x29F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x2A18(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x2A40(0x0108)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x2B48(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x2B90(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x2BB8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2BE0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x2C08(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x2C50(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x2D40(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x2D68(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2E90(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2EB0(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_5;                     // 0x2ED8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x2F28(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_11;          // 0x2F70(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_10;          // 0x3028(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_5;            // 0x30E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x3100(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_4;                     // 0x3128(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x3178(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_9;           // 0x31C0(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_8;           // 0x3278(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_4;            // 0x3330(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x3350(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x3378(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x33C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x33E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x3428(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x3448(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x3510(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x3530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x3558(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0x3580(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x35D0(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_7;           // 0x3618(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_6;           // 0x36D0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_3;            // 0x3788(0x0020)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0x37A8(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x37F8(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_5;           // 0x3840(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_4;           // 0x38F8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_2;            // 0x39B0(0x0020)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_1;                     // 0x39D0(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x3A20(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_3;           // 0x3A68(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_2;           // 0x3B20(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult_1;            // 0x3BD8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x3BF8(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x3C20(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x3C70(0x0048)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator_1;           // 0x3CB8(0x00B8)()
	struct FAnimNode_TransitionPoseEvaluator      AnimGraphNode_TransitionPoseEvaluator;             // 0x3D70(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_CustomTransitionResult;              // 0x3E28(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x3E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x3E70(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x3E98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x3EE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x3F00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3F48(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x3F68(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x3F78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x3F98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x3FE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4000(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x4048(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x4068(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x4130(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x4150(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x4178(0x00C8)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x4240(0x00D0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x4310(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x43D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x4400(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x4428(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x4530(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x4558(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x4580(0x00E0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x4660(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x4728(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x4770(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x47B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4800(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x4848(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x4870(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4978(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x49C0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x49E8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4AC8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4AF0(0x0108)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x4BF8(0x0010)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4C08(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x4C50(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x4D18(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x4DE0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x4E00(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x4E20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x4E40(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x4F08(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x4F28(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x4FF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x5010(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x5030(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x5050(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x5118(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x5138(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x5200(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x5220(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x5240(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x5260(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x5340(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5368(0x0108)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x5470(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x5538(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x5660(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x5680(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x57A8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x58D0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x59F8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x5A18(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x5A40(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x5A88(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x5B50(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x5B98(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x5CC0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x5D08(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5DE8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x5E10(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x5E58(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x5E80(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5F48(0x0048)()
	struct FVector                                __CustomProperty_PLSDOffset_C8C1E51344CA0FF55B88EDBBA9264472; // 0x5F90(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_IK_R_C8C1E51344CA0FF55B88EDBBA9264472; // 0x5FA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_IK_L_C8C1E51344CA0FF55B88EDBBA9264472; // 0x5FB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Offset_Scale_B3041BE240BF16FC30FB22835FAEF7D2; // 0x5FB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               __CustomProperty_Offset_Rotation_B3041BE240BF16FC30FB22835FAEF7D2; // 0x5FD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                __CustomProperty_Offset_Location_B3041BE240BF16FC30FB22835FAEF7D2; // 0x5FE8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_Offset_B3041BE240BF16FC30FB22835FAEF7D2; // 0x6000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Is_Swimming_98F503944FED84C7A291179CEBB2F6C9; // 0x6060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_Is_Sprinting_98F503944FED84C7A291179CEBB2F6C9; // 0x6061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6062[0x2];                                     // 0x6062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_ControlPitch_98F503944FED84C7A291179CEBB2F6C9; // 0x6064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_DbnoAim_98F503944FED84C7A291179CEBB2F6C9; // 0x6068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_606C[0x4];                                     // 0x606C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_IK_R_98F503944FED84C7A291179CEBB2F6C9; // 0x6070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_IK_L_98F503944FED84C7A291179CEBB2F6C9; // 0x6078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MoveGunToSlingCurveName;                           // 0x6080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           C_Transition;                                      // 0x6088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BurningOn;                                         // 0x6090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          hasHeavyGun;                                       // 0x6091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inventory_Open;                                    // 0x6092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Previous_Inventory_Open;                           // 0x6093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Landing_Additive_Alpha;                            // 0x6094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               L_Arm_PLSD_ViewOffset;                             // 0x6098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   MoveMultitoolToItemRName;                          // 0x60B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void AUV(struct FPoseLink* AUV_0)	 // 0xae1e64;
	void BlueprintUpdateAnimation(float DeltaTimeX)	 // 0xae1e64;
	void Dbno(const struct FPoseLink& InPose_1, struct FPoseLink* Dbno_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_FPP_AnimGraphNode_ApplyMeshSpaceAdditive_88AFDADF49E065DA53DE1FBB2B1CCD54()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_FPP_AnimGraphNode_ControlRig_B3041BE240BF16FC30FB22835FAEF7D2()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_FPP_AnimGraphNode_CopyBone_D36F180D4AA52ECD5AB88AAB44869C07()	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Hero_FPP_AnimGraphNode_LayeredBoneBlend_68BE86424BB2A5F53F2E2B8D6C56492E()	 // 0xae1e64;
