#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_Server_TPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Hero_Server_TPP.ABP_Hero_Server_TPP_C
// 0x0090 (0x04D0 - 0x0440)
class UABP_Hero_Server_TPP_C final : public UP2CharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0448(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0450(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0458(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0478(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0488(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Hero_Server_TPP(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Hero_Server_TPP_C">();
	}
	static class UABP_Hero_Server_TPP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Hero_Server_TPP_C>();
	}
};
static_assert(alignof(UABP_Hero_Server_TPP_C) == 0x000010, "Wrong alignment on UABP_Hero_Server_TPP_C");
static_assert(sizeof(UABP_Hero_Server_TPP_C) == 0x0004D0, "Wrong size on UABP_Hero_Server_TPP_C");
static_assert(offsetof(UABP_Hero_Server_TPP_C, UberGraphFrame) == 0x000440, "Member 'UABP_Hero_Server_TPP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Hero_Server_TPP_C, AnimBlueprintExtension_PropertyAccess) == 0x000448, "Member 'UABP_Hero_Server_TPP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Hero_Server_TPP_C, AnimBlueprintExtension_Base) == 0x000450, "Member 'UABP_Hero_Server_TPP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Hero_Server_TPP_C, AnimGraphNode_Root) == 0x000458, "Member 'UABP_Hero_Server_TPP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Hero_Server_TPP_C, AnimGraphNode_LocalRefPose) == 0x000478, "Member 'UABP_Hero_Server_TPP_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_Hero_Server_TPP_C, AnimGraphNode_Slot) == 0x000488, "Member 'UABP_Hero_Server_TPP_C::AnimGraphNode_Slot' has a wrong offset!");

}

