#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Facility_Printer_Level_01

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Facility_Printer_Level_01.ABP_Facility_Printer_Level_01_C
// 0x0540 (0x0890 - 0x0350)
class UABP_Facility_Printer_Level_01_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0388(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x04B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x05D8(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0700(0x0020)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0720(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0730(0x0128)()
	double                                        loc_X;                                             // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        loc_Y;                                             // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        loc_Z;                                             // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        X;                                                 // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Z;                                                 // 0x0880(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CloseCover;                                        // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0)	 // 0xae1e64;
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Facility_Printer_Level_01_AnimGraphNode_ModifyBone_4F33A33D4920A374F26EE790E3EDDF33()	 // 0xae1e64;
	void ExecuteUbergraph_ABP_Facility_Printer_Level_01(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ABP_Facility_Printer_Level_01_C">();
	}
	static class UABP_Facility_Printer_Level_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UABP_Facility_Printer_Level_01_C>();
	}
};
static_assert(alignof(UABP_Facility_Printer_Level_01_C) == 0x000010, "Wrong alignment on UABP_Facility_Printer_Level_01_C");
static_assert(sizeof(UABP_Facility_Printer_Level_01_C) == 0x000890, "Wrong size on UABP_Facility_Printer_Level_01_C");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, UberGraphFrame) == 0x000350, "Member 'UABP_Facility_Printer_Level_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Facility_Printer_Level_01_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Facility_Printer_Level_01_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_ModifyBone_3) == 0x000388, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_ModifyBone_2) == 0x0004B0, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_ModifyBone_1) == 0x0005D8, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_ComponentToLocalSpace) == 0x000700, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_MeshRefPose) == 0x000720, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_MeshRefPose' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, AnimGraphNode_ModifyBone) == 0x000730, "Member 'UABP_Facility_Printer_Level_01_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, loc_X) == 0x000858, "Member 'UABP_Facility_Printer_Level_01_C::loc_X' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, loc_Y) == 0x000860, "Member 'UABP_Facility_Printer_Level_01_C::loc_Y' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, loc_Z) == 0x000868, "Member 'UABP_Facility_Printer_Level_01_C::loc_Z' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, X) == 0x000870, "Member 'UABP_Facility_Printer_Level_01_C::X' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, Y) == 0x000878, "Member 'UABP_Facility_Printer_Level_01_C::Y' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, Z) == 0x000880, "Member 'UABP_Facility_Printer_Level_01_C::Z' has a wrong offset!");
static_assert(offsetof(UABP_Facility_Printer_Level_01_C, CloseCover) == 0x000888, "Member 'UABP_Facility_Printer_Level_01_C::CloseCover' has a wrong offset!");

}

