#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PMC_Hero_TPP_FakeBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.AnimBlueprintGeneratedConstantData
// 0x01E7 (0x01E8 - 0x0001)
struct ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_254;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_255;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_256;                                  // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_257;                                // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_258;                                // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_259;                               // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_260;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_261;                                 // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_262;                                // 0x0044(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_263;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_264;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_265;                                 // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_266;                              // 0x0060(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_267;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_268;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_269;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_270;                                // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_271;                                 // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_272;                                // 0x00BC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_273;                                 // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_274;                                // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_275;                                 // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_276;                                // 0x00D4(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_277;                               // 0x00D8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_278;                              // 0x00DC(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_279;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_280;                                // 0x010C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_281;                                // 0x010D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_282;                                // 0x010E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_283;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_284;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_285;                                 // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_286;                              // 0x0128(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem                         AnimBlueprintExtension_NodeRelevancy;              // 0x01C8(0x0008)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData) == 0x0001E8, "Wrong size on ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_254) == 0x000004, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_254' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __BlendProfile_255) == 0x000010, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__BlendProfile_255' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __CurveFloat_256) == 0x000018, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__CurveFloat_256' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_257) == 0x000020, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_257' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_258) == 0x000021, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_258' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __ArrayProperty_259) == 0x000028, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__ArrayProperty_259' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_260) == 0x000038, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_260' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_261) == 0x000040, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_261' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_262) == 0x000044, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_262' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_263) == 0x00004C, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_263' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_264) == 0x000050, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_264' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_265) == 0x000058, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_265' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __StructProperty_266) == 0x000060, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__StructProperty_266' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_267) == 0x000080, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_267' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_268) == 0x000088, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_268' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __StructProperty_269) == 0x000090, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__StructProperty_269' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_270) == 0x0000B0, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_270' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_271) == 0x0000B8, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_271' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_272) == 0x0000BC, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_272' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_273) == 0x0000C4, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_273' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_274) == 0x0000C8, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_274' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_275) == 0x0000D0, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_275' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __BoolProperty_276) == 0x0000D4, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__BoolProperty_276' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __FloatProperty_277) == 0x0000D8, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__FloatProperty_277' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __StructProperty_278) == 0x0000DC, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__StructProperty_278' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __FloatProperty_279) == 0x000108, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__FloatProperty_279' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __BoolProperty_280) == 0x00010C, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__BoolProperty_280' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __EnumProperty_281) == 0x00010D, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__EnumProperty_281' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __ByteProperty_282) == 0x00010E, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__ByteProperty_282' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_283) == 0x000110, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_283' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __NameProperty_284) == 0x000118, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__NameProperty_284' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __IntProperty_285) == 0x000120, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__IntProperty_285' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, __StructProperty_286) == 0x000128, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::__StructProperty_286' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_NodeRelevancy) == 0x0001C8, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_NodeRelevancy' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_PMC_Hero_TPP_FakeBody.ABP_PMC_Hero_TPP_FakeBody_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_2;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000004, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'ABP_PMC_Hero_TPP_FakeBody::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

