#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Layer_Melee_FPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_Layer_Melee_FPP.ABP_Layer_Melee_FPP_C.AnimBlueprintGeneratedConstantData
// 0x01E7 (0x01E8 - 0x0001)
struct ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_444;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_445;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_446;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_447;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_448;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_449;                                // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_450;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_451;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_452;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_453;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_454;                                // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_455;                                 // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_456;                                // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_457;                                 // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_458;                              // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_459;                                // 0x00A4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_460;                                 // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_461;                               // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_462;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_463;                                  // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_464;                                // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_465;                                // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_466;                               // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_467;                                // 0x00E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_468;                                 // 0x00E8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_469;                                // 0x00EC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_470;                                // 0x00F4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_471;                                // 0x00FC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_472;                                // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_473;                                // 0x0105(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_474;                               // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_475;                                // 0x010C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_476;                                // 0x010D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_477;                                // 0x010E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_478;                                // 0x0110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_479;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_480;                              // 0x0120(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_481;                                // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_482;                                // 0x0148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0150(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D0(0x0018)()
};
static_assert(alignof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData) == 0x0001E8, "Wrong size on ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_444) == 0x000004, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_444' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_445) == 0x00000C, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_445' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_446) == 0x000014, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_446' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_447) == 0x000020, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_447' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_448) == 0x000030, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_448' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_449) == 0x000038, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_449' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_450) == 0x000040, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_450' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_451) == 0x000048, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_451' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_452) == 0x000050, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_452' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_453) == 0x000058, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_453' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_454) == 0x000060, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_454' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_455) == 0x000068, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_455' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_456) == 0x00006C, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_456' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_457) == 0x000074, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_457' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_458) == 0x000078, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_458' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_459) == 0x0000A4, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_459' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_460) == 0x0000AC, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_460' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_461) == 0x0000B0, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_461' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __BlendProfile_462) == 0x0000B8, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__BlendProfile_462' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __CurveFloat_463) == 0x0000C0, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__CurveFloat_463' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_464) == 0x0000C8, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_464' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_465) == 0x0000C9, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_465' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_466) == 0x0000D0, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_466' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_467) == 0x0000E0, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_467' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __IntProperty_468) == 0x0000E8, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__IntProperty_468' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_469) == 0x0000EC, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_469' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_470) == 0x0000F4, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_470' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_471) == 0x0000FC, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_471' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_472) == 0x000104, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_472' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_473) == 0x000105, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_473' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __FloatProperty_474) == 0x000108, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__FloatProperty_474' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __BoolProperty_475) == 0x00010C, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__BoolProperty_475' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __EnumProperty_476) == 0x00010D, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__EnumProperty_476' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __ByteProperty_477) == 0x00010E, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__ByteProperty_477' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_478) == 0x000110, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_478' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_479) == 0x000118, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_479' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __StructProperty_480) == 0x000120, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__StructProperty_480' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_481) == 0x000140, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_481' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, __NameProperty_482) == 0x000148, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::__NameProperty_482' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000150, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D0, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_Layer_Melee_FPP.ABP_Layer_Melee_FPP_C.AnimBlueprintGeneratedMutableData
// 0x0047 (0x0048 - 0x0001)
struct ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_3;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_4;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_5;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_6;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_7;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_8;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_9;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_10;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_11;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_12;                                 // 0x0034(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_13;                             // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_14;                             // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData) == 0x000048, "Wrong size on ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000008, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_4) == 0x00000C, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_4' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_5) == 0x000010, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_5' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_6) == 0x000014, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_6' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_7) == 0x000018, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_7' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_8) == 0x000020, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_8' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_9) == 0x000028, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_9' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_10) == 0x00002C, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_10' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __FloatProperty_11) == 0x000030, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__FloatProperty_11' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __BoolProperty_12) == 0x000034, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__BoolProperty_12' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_13) == 0x000038, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_13' has a wrong offset!");
static_assert(offsetof(ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase_14) == 0x000040, "Member 'ABP_Layer_Melee_FPP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase_14' has a wrong offset!");

}

