#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICommon

#include "Basic.hpp"

#include "AICommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Mercuna_structs.hpp"
#include "Game_structs.hpp"
#include "AIModule_structs.hpp"
#include "MotionSymphony_structs.hpp"


namespace SDK::Params
{

// Function AICommon.P2AIFunctionLibrary.GetActorsInBox
// 0x0078 (0x0078 - 0x0000)
struct P2AIFunctionLibrary_GetActorsInBox final
{
public:
	TArray<class AActor*>                         OutActors;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                InWorldContextObject;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         IgnoredActors;                                     // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0028(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0040(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector3f                              BoxHalfExtent;                                     // 0x0058(0x000C)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0068(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2AIMobilityType                             MobilityType;                                      // 0x0070(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0071(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IgnoreHiddenActors;                                // 0x0072(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_GetActorsInBox) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_GetActorsInBox");
static_assert(sizeof(P2AIFunctionLibrary_GetActorsInBox) == 0x000078, "Wrong size on P2AIFunctionLibrary_GetActorsInBox");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, OutActors) == 0x000000, "Member 'P2AIFunctionLibrary_GetActorsInBox::OutActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, InWorldContextObject) == 0x000010, "Member 'P2AIFunctionLibrary_GetActorsInBox::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, IgnoredActors) == 0x000018, "Member 'P2AIFunctionLibrary_GetActorsInBox::IgnoredActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, Position) == 0x000028, "Member 'P2AIFunctionLibrary_GetActorsInBox::Position' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, Rotation) == 0x000040, "Member 'P2AIFunctionLibrary_GetActorsInBox::Rotation' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, BoxHalfExtent) == 0x000058, "Member 'P2AIFunctionLibrary_GetActorsInBox::BoxHalfExtent' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, ActorClass) == 0x000068, "Member 'P2AIFunctionLibrary_GetActorsInBox::ActorClass' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, MobilityType) == 0x000070, "Member 'P2AIFunctionLibrary_GetActorsInBox::MobilityType' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, CollisionChannel) == 0x000071, "Member 'P2AIFunctionLibrary_GetActorsInBox::CollisionChannel' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBox, IgnoreHiddenActors) == 0x000072, "Member 'P2AIFunctionLibrary_GetActorsInBox::IgnoreHiddenActors' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.GetActorsInBoxByChannel
// 0x0080 (0x0080 - 0x0000)
struct P2AIFunctionLibrary_GetActorsInBoxByChannel final
{
public:
	TArray<class AActor*>                         OutActors;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                InWorldContextObject;                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         IgnoredActors;                                     // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0028(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0040(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                BoxHalfExtent;                                     // 0x0058(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2AIMobilityType                             MobilityType;                                      // 0x0078(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0079(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_GetActorsInBoxByChannel) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_GetActorsInBoxByChannel");
static_assert(sizeof(P2AIFunctionLibrary_GetActorsInBoxByChannel) == 0x000080, "Wrong size on P2AIFunctionLibrary_GetActorsInBoxByChannel");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, OutActors) == 0x000000, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::OutActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, InWorldContextObject) == 0x000010, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, IgnoredActors) == 0x000018, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::IgnoredActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, Position) == 0x000028, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::Position' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, Rotation) == 0x000040, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::Rotation' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, BoxHalfExtent) == 0x000058, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::BoxHalfExtent' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, ActorClass) == 0x000070, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::ActorClass' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, MobilityType) == 0x000078, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::MobilityType' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInBoxByChannel, CollisionChannel) == 0x000079, "Member 'P2AIFunctionLibrary_GetActorsInBoxByChannel::CollisionChannel' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.GetActorsInSphere
// 0x0080 (0x0080 - 0x0000)
struct P2AIFunctionLibrary_GetActorsInSphere final
{
public:
	TArray<class AActor*>                         OutActors;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         InIgnoredActors;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                InPos;                                             // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  InRot;                                             // 0x0040(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSphereRadius;                                    // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2AIMobilityType                             InMobilityType;                                    // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             InCollisionChannel;                                // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InbIgnoreHiddenActors;                             // 0x0072(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0xD];                                       // 0x0073(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_GetActorsInSphere) == 0x000010, "Wrong alignment on P2AIFunctionLibrary_GetActorsInSphere");
static_assert(sizeof(P2AIFunctionLibrary_GetActorsInSphere) == 0x000080, "Wrong size on P2AIFunctionLibrary_GetActorsInSphere");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, OutActors) == 0x000000, "Member 'P2AIFunctionLibrary_GetActorsInSphere::OutActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, WorldContextObject) == 0x000010, "Member 'P2AIFunctionLibrary_GetActorsInSphere::WorldContextObject' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InIgnoredActors) == 0x000018, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InIgnoredActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InPos) == 0x000028, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InPos' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InRot) == 0x000040, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InRot' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InSphereRadius) == 0x000060, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InSphereRadius' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InActorClass) == 0x000068, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InActorClass' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InMobilityType) == 0x000070, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InMobilityType' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InCollisionChannel) == 0x000071, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InCollisionChannel' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphere, InbIgnoreHiddenActors) == 0x000072, "Member 'P2AIFunctionLibrary_GetActorsInSphere::InbIgnoreHiddenActors' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.GetActorsInSphereByChannel
// 0x0080 (0x0080 - 0x0000)
struct P2AIFunctionLibrary_GetActorsInSphereByChannel final
{
public:
	TArray<class AActor*>                         OutActors;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         InIgnoredActors;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                InPos;                                             // 0x0028(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  InRot;                                             // 0x0040(0x0020)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InSphereRadius;                                    // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     InActorClass;                                      // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2AIMobilityType                             InMobilityType;                                    // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             InCollisionChannel;                                // 0x0071(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0xE];                                       // 0x0072(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_GetActorsInSphereByChannel) == 0x000010, "Wrong alignment on P2AIFunctionLibrary_GetActorsInSphereByChannel");
static_assert(sizeof(P2AIFunctionLibrary_GetActorsInSphereByChannel) == 0x000080, "Wrong size on P2AIFunctionLibrary_GetActorsInSphereByChannel");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, OutActors) == 0x000000, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::OutActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, WorldContextObject) == 0x000010, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::WorldContextObject' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InIgnoredActors) == 0x000018, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InIgnoredActors' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InPos) == 0x000028, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InPos' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InRot) == 0x000040, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InRot' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InSphereRadius) == 0x000060, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InSphereRadius' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InActorClass) == 0x000068, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InActorClass' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InMobilityType) == 0x000070, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InMobilityType' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_GetActorsInSphereByChannel, InCollisionChannel) == 0x000071, "Member 'P2AIFunctionLibrary_GetActorsInSphereByChannel::InCollisionChannel' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.MakeGameplayAbilityDamageTarget
// 0x0038 (0x0038 - 0x0000)
struct P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget final
{
public:
	TArray<class AActor*>                         InActorArray;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       OutDataHandle;                                     // 0x0010(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget");
static_assert(sizeof(P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget) == 0x000038, "Wrong size on P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget, InActorArray) == 0x000000, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget::InActorArray' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget, OutDataHandle) == 0x000010, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityDamageTarget::OutDataHandle' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.MakeGameplayAbilityRadialDamageTarget
// 0x0058 (0x0058 - 0x0000)
struct P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget final
{
public:
	TArray<class AActor*>                         InActorArray;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                InImpactCenter;                                    // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InImpactAoeRadius;                                 // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       OutDataHandle;                                     // 0x0030(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget");
static_assert(sizeof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget) == 0x000058, "Wrong size on P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget, InActorArray) == 0x000000, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget::InActorArray' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget, InImpactCenter) == 0x000010, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget::InImpactCenter' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget, InImpactAoeRadius) == 0x000028, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget::InImpactAoeRadius' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget, OutDataHandle) == 0x000030, "Member 'P2AIFunctionLibrary_MakeGameplayAbilityRadialDamageTarget::OutDataHandle' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.SendImpactAudio
// 0x0030 (0x0030 - 0x0000)
struct P2AIFunctionLibrary_SendImpactAudio final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0000(0x0028)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ImpactTag;                                         // 0x0028(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIFunctionLibrary_SendImpactAudio) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_SendImpactAudio");
static_assert(sizeof(P2AIFunctionLibrary_SendImpactAudio) == 0x000030, "Wrong size on P2AIFunctionLibrary_SendImpactAudio");
static_assert(offsetof(P2AIFunctionLibrary_SendImpactAudio, TargetDataHandle) == 0x000000, "Member 'P2AIFunctionLibrary_SendImpactAudio::TargetDataHandle' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_SendImpactAudio, ImpactTag) == 0x000028, "Member 'P2AIFunctionLibrary_SendImpactAudio::ImpactTag' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.TryDealDamage
// 0x0040 (0x0040 - 0x0000)
struct P2AIFunctionLibrary_TryDealDamage final
{
public:
	const class UAbilitySystemComponent*          InstigatorASC;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0008(0x0028)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2GameplayEffect_Damage>   EffectClass;                                       // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectLevel;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_TryDealDamage) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_TryDealDamage");
static_assert(sizeof(P2AIFunctionLibrary_TryDealDamage) == 0x000040, "Wrong size on P2AIFunctionLibrary_TryDealDamage");
static_assert(offsetof(P2AIFunctionLibrary_TryDealDamage, InstigatorASC) == 0x000000, "Member 'P2AIFunctionLibrary_TryDealDamage::InstigatorASC' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryDealDamage, TargetDataHandle) == 0x000008, "Member 'P2AIFunctionLibrary_TryDealDamage::TargetDataHandle' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryDealDamage, EffectClass) == 0x000030, "Member 'P2AIFunctionLibrary_TryDealDamage::EffectClass' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryDealDamage, EffectLevel) == 0x000038, "Member 'P2AIFunctionLibrary_TryDealDamage::EffectLevel' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.TryStun
// 0x0040 (0x0040 - 0x0000)
struct P2AIFunctionLibrary_TryStun final
{
public:
	const class UAbilitySystemComponent*          InstigatorASC;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       TargetDataHandle;                                  // 0x0008(0x0028)(Parm, NativeAccessSpecifierPublic)
	float                                         ChanceToApply;                                     // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InStunTag;                                         // 0x0034(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIFunctionLibrary_TryStun) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_TryStun");
static_assert(sizeof(P2AIFunctionLibrary_TryStun) == 0x000040, "Wrong size on P2AIFunctionLibrary_TryStun");
static_assert(offsetof(P2AIFunctionLibrary_TryStun, InstigatorASC) == 0x000000, "Member 'P2AIFunctionLibrary_TryStun::InstigatorASC' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStun, TargetDataHandle) == 0x000008, "Member 'P2AIFunctionLibrary_TryStun::TargetDataHandle' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStun, ChanceToApply) == 0x000030, "Member 'P2AIFunctionLibrary_TryStun::ChanceToApply' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStun, InStunTag) == 0x000034, "Member 'P2AIFunctionLibrary_TryStun::InStunTag' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.TryStunRadial
// 0x0030 (0x0030 - 0x0000)
struct P2AIFunctionLibrary_TryStunRadial final
{
public:
	const class UAbilitySystemComponent*          InstigatorASC;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UCurveFloat*                      StunSeverityCurve;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactCenter;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIFunctionLibrary_TryStunRadial) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_TryStunRadial");
static_assert(sizeof(P2AIFunctionLibrary_TryStunRadial) == 0x000030, "Wrong size on P2AIFunctionLibrary_TryStunRadial");
static_assert(offsetof(P2AIFunctionLibrary_TryStunRadial, InstigatorASC) == 0x000000, "Member 'P2AIFunctionLibrary_TryStunRadial::InstigatorASC' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunRadial, StunSeverityCurve) == 0x000008, "Member 'P2AIFunctionLibrary_TryStunRadial::StunSeverityCurve' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunRadial, MaxDistance) == 0x000010, "Member 'P2AIFunctionLibrary_TryStunRadial::MaxDistance' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunRadial, ImpactCenter) == 0x000018, "Member 'P2AIFunctionLibrary_TryStunRadial::ImpactCenter' has a wrong offset!");

// Function AICommon.P2AIFunctionLibrary.TryStunTargetRadial
// 0x0038 (0x0038 - 0x0000)
struct P2AIFunctionLibrary_TryStunTargetRadial final
{
public:
	const class UAbilitySystemComponent*          InstigatorASC;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UCurveFloat*                      StunSeverityCurve;                                 // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpactCenter;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIFunctionLibrary_TryStunTargetRadial) == 0x000008, "Wrong alignment on P2AIFunctionLibrary_TryStunTargetRadial");
static_assert(sizeof(P2AIFunctionLibrary_TryStunTargetRadial) == 0x000038, "Wrong size on P2AIFunctionLibrary_TryStunTargetRadial");
static_assert(offsetof(P2AIFunctionLibrary_TryStunTargetRadial, InstigatorASC) == 0x000000, "Member 'P2AIFunctionLibrary_TryStunTargetRadial::InstigatorASC' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunTargetRadial, StunSeverityCurve) == 0x000008, "Member 'P2AIFunctionLibrary_TryStunTargetRadial::StunSeverityCurve' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunTargetRadial, MaxDistance) == 0x000010, "Member 'P2AIFunctionLibrary_TryStunTargetRadial::MaxDistance' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunTargetRadial, ImpactCenter) == 0x000018, "Member 'P2AIFunctionLibrary_TryStunTargetRadial::ImpactCenter' has a wrong offset!");
static_assert(offsetof(P2AIFunctionLibrary_TryStunTargetRadial, Target) == 0x000030, "Member 'P2AIFunctionLibrary_TryStunTargetRadial::Target' has a wrong offset!");

// Function AICommon.AICheatExtension.ClientDisplayDebugMsgOnScreen
// 0x0010 (0x0010 - 0x0000)
struct AICheatExtension_ClientDisplayDebugMsgOnScreen final
{
public:
	class FString                                 DebugMsg;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ClientDisplayDebugMsgOnScreen) == 0x000008, "Wrong alignment on AICheatExtension_ClientDisplayDebugMsgOnScreen");
static_assert(sizeof(AICheatExtension_ClientDisplayDebugMsgOnScreen) == 0x000010, "Wrong size on AICheatExtension_ClientDisplayDebugMsgOnScreen");
static_assert(offsetof(AICheatExtension_ClientDisplayDebugMsgOnScreen, DebugMsg) == 0x000000, "Member 'AICheatExtension_ClientDisplayDebugMsgOnScreen::DebugMsg' has a wrong offset!");

// Function AICommon.AICheatExtension.ClientReceiveTickDebugData
// 0x0028 (0x0028 - 0x0000)
struct AICheatExtension_ClientReceiveTickDebugData final
{
public:
	struct FAICheatDebugData                      DebugData;                                         // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ClientReceiveTickDebugData) == 0x000008, "Wrong alignment on AICheatExtension_ClientReceiveTickDebugData");
static_assert(sizeof(AICheatExtension_ClientReceiveTickDebugData) == 0x000028, "Wrong size on AICheatExtension_ClientReceiveTickDebugData");
static_assert(offsetof(AICheatExtension_ClientReceiveTickDebugData, DebugData) == 0x000000, "Member 'AICheatExtension_ClientReceiveTickDebugData::DebugData' has a wrong offset!");

// Function AICommon.AICheatExtension.EnableSignificanceDebug
// 0x0001 (0x0001 - 0x0000)
struct AICheatExtension_EnableSignificanceDebug final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_EnableSignificanceDebug) == 0x000001, "Wrong alignment on AICheatExtension_EnableSignificanceDebug");
static_assert(sizeof(AICheatExtension_EnableSignificanceDebug) == 0x000001, "Wrong size on AICheatExtension_EnableSignificanceDebug");
static_assert(offsetof(AICheatExtension_EnableSignificanceDebug, bEnabled) == 0x000000, "Member 'AICheatExtension_EnableSignificanceDebug::bEnabled' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerDestroyAllNpcsOfDataType
// 0x0008 (0x0008 - 0x0000)
struct AICheatExtension_ServerDestroyAllNpcsOfDataType final
{
public:
	const class UP2NpcData*                       NpcData;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerDestroyAllNpcsOfDataType) == 0x000008, "Wrong alignment on AICheatExtension_ServerDestroyAllNpcsOfDataType");
static_assert(sizeof(AICheatExtension_ServerDestroyAllNpcsOfDataType) == 0x000008, "Wrong size on AICheatExtension_ServerDestroyAllNpcsOfDataType");
static_assert(offsetof(AICheatExtension_ServerDestroyAllNpcsOfDataType, NpcData) == 0x000000, "Member 'AICheatExtension_ServerDestroyAllNpcsOfDataType::NpcData' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerKillAllNpcsOfDataType
// 0x0008 (0x0008 - 0x0000)
struct AICheatExtension_ServerKillAllNpcsOfDataType final
{
public:
	const class UP2NpcData*                       NpcData;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerKillAllNpcsOfDataType) == 0x000008, "Wrong alignment on AICheatExtension_ServerKillAllNpcsOfDataType");
static_assert(sizeof(AICheatExtension_ServerKillAllNpcsOfDataType) == 0x000008, "Wrong size on AICheatExtension_ServerKillAllNpcsOfDataType");
static_assert(offsetof(AICheatExtension_ServerKillAllNpcsOfDataType, NpcData) == 0x000000, "Member 'AICheatExtension_ServerKillAllNpcsOfDataType::NpcData' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerSetDynamicScale
// 0x000C (0x000C - 0x0000)
struct AICheatExtension_ServerSetDynamicScale final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerSetDynamicScale) == 0x000004, "Wrong alignment on AICheatExtension_ServerSetDynamicScale");
static_assert(sizeof(AICheatExtension_ServerSetDynamicScale) == 0x00000C, "Wrong size on AICheatExtension_ServerSetDynamicScale");
static_assert(offsetof(AICheatExtension_ServerSetDynamicScale, Tag) == 0x000000, "Member 'AICheatExtension_ServerSetDynamicScale::Tag' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSetDynamicScale, Scale) == 0x000008, "Member 'AICheatExtension_ServerSetDynamicScale::Scale' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerSpawnNpc
// 0x0008 (0x0008 - 0x0000)
struct AICheatExtension_ServerSpawnNpc final
{
public:
	const class UP2NpcData*                       NpcData;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerSpawnNpc) == 0x000008, "Wrong alignment on AICheatExtension_ServerSpawnNpc");
static_assert(sizeof(AICheatExtension_ServerSpawnNpc) == 0x000008, "Wrong size on AICheatExtension_ServerSpawnNpc");
static_assert(offsetof(AICheatExtension_ServerSpawnNpc, NpcData) == 0x000000, "Member 'AICheatExtension_ServerSpawnNpc::NpcData' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerSpawnNpcAtDistance
// 0x0010 (0x0010 - 0x0000)
struct AICheatExtension_ServerSpawnNpcAtDistance final
{
public:
	const class UP2NpcData*                       NpcData;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnDistance;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AICheatExtension_ServerSpawnNpcAtDistance) == 0x000008, "Wrong alignment on AICheatExtension_ServerSpawnNpcAtDistance");
static_assert(sizeof(AICheatExtension_ServerSpawnNpcAtDistance) == 0x000010, "Wrong size on AICheatExtension_ServerSpawnNpcAtDistance");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcAtDistance, NpcData) == 0x000000, "Member 'AICheatExtension_ServerSpawnNpcAtDistance::NpcData' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcAtDistance, SpawnDistance) == 0x000008, "Member 'AICheatExtension_ServerSpawnNpcAtDistance::SpawnDistance' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerSpawnNpcGroupSpawner
// 0x0030 (0x0030 - 0x0000)
struct AICheatExtension_ServerSpawnNpcGroupSpawner final
{
public:
	TSubclassOf<class AP2NpcGroupSpawner>         InGroupSpawnerClass;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2NpcGroupData*                  InNpcGroupData;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InGroupMemberNumX;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InGroupMemberNumY;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InSpawnLocation;                                   // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerSpawnNpcGroupSpawner) == 0x000008, "Wrong alignment on AICheatExtension_ServerSpawnNpcGroupSpawner");
static_assert(sizeof(AICheatExtension_ServerSpawnNpcGroupSpawner) == 0x000030, "Wrong size on AICheatExtension_ServerSpawnNpcGroupSpawner");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcGroupSpawner, InGroupSpawnerClass) == 0x000000, "Member 'AICheatExtension_ServerSpawnNpcGroupSpawner::InGroupSpawnerClass' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcGroupSpawner, InNpcGroupData) == 0x000008, "Member 'AICheatExtension_ServerSpawnNpcGroupSpawner::InNpcGroupData' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcGroupSpawner, InGroupMemberNumX) == 0x000010, "Member 'AICheatExtension_ServerSpawnNpcGroupSpawner::InGroupMemberNumX' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcGroupSpawner, InGroupMemberNumY) == 0x000014, "Member 'AICheatExtension_ServerSpawnNpcGroupSpawner::InGroupMemberNumY' has a wrong offset!");
static_assert(offsetof(AICheatExtension_ServerSpawnNpcGroupSpawner, InSpawnLocation) == 0x000018, "Member 'AICheatExtension_ServerSpawnNpcGroupSpawner::InSpawnLocation' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerStartStateTreeDebug
// 0x0008 (0x0008 - 0x0000)
struct AICheatExtension_ServerStartStateTreeDebug final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerStartStateTreeDebug) == 0x000008, "Wrong alignment on AICheatExtension_ServerStartStateTreeDebug");
static_assert(sizeof(AICheatExtension_ServerStartStateTreeDebug) == 0x000008, "Wrong size on AICheatExtension_ServerStartStateTreeDebug");
static_assert(offsetof(AICheatExtension_ServerStartStateTreeDebug, TargetActor) == 0x000000, "Member 'AICheatExtension_ServerStartStateTreeDebug::TargetActor' has a wrong offset!");

// Function AICommon.AICheatExtension.ServerUpdateStateTreeDebugMsg
// 0x0010 (0x0010 - 0x0000)
struct AICheatExtension_ServerUpdateStateTreeDebugMsg final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_ServerUpdateStateTreeDebugMsg) == 0x000008, "Wrong alignment on AICheatExtension_ServerUpdateStateTreeDebugMsg");
static_assert(sizeof(AICheatExtension_ServerUpdateStateTreeDebugMsg) == 0x000010, "Wrong size on AICheatExtension_ServerUpdateStateTreeDebugMsg");
static_assert(offsetof(AICheatExtension_ServerUpdateStateTreeDebugMsg, Msg) == 0x000000, "Member 'AICheatExtension_ServerUpdateStateTreeDebugMsg::Msg' has a wrong offset!");

// Function AICommon.AICheatExtension.SetDynamicScale
// 0x000C (0x000C - 0x0000)
struct AICheatExtension_SetDynamicScale final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_SetDynamicScale) == 0x000004, "Wrong alignment on AICheatExtension_SetDynamicScale");
static_assert(sizeof(AICheatExtension_SetDynamicScale) == 0x00000C, "Wrong size on AICheatExtension_SetDynamicScale");
static_assert(offsetof(AICheatExtension_SetDynamicScale, Tag) == 0x000000, "Member 'AICheatExtension_SetDynamicScale::Tag' has a wrong offset!");
static_assert(offsetof(AICheatExtension_SetDynamicScale, Scale) == 0x000008, "Member 'AICheatExtension_SetDynamicScale::Scale' has a wrong offset!");

// Function AICommon.AICheatExtension.SetPerceptionForcedAlertedLevel
// 0x0004 (0x0004 - 0x0000)
struct AICheatExtension_SetPerceptionForcedAlertedLevel final
{
public:
	int32                                         InAlertedLevel;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_SetPerceptionForcedAlertedLevel) == 0x000004, "Wrong alignment on AICheatExtension_SetPerceptionForcedAlertedLevel");
static_assert(sizeof(AICheatExtension_SetPerceptionForcedAlertedLevel) == 0x000004, "Wrong size on AICheatExtension_SetPerceptionForcedAlertedLevel");
static_assert(offsetof(AICheatExtension_SetPerceptionForcedAlertedLevel, InAlertedLevel) == 0x000000, "Member 'AICheatExtension_SetPerceptionForcedAlertedLevel::InAlertedLevel' has a wrong offset!");

// Function AICommon.AICheatExtension.SetAllPlayersPerceptionEnabled
// 0x0001 (0x0001 - 0x0000)
struct AICheatExtension_SetAllPlayersPerceptionEnabled final
{
public:
	bool                                          PerceptionEnabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_SetAllPlayersPerceptionEnabled) == 0x000001, "Wrong alignment on AICheatExtension_SetAllPlayersPerceptionEnabled");
static_assert(sizeof(AICheatExtension_SetAllPlayersPerceptionEnabled) == 0x000001, "Wrong size on AICheatExtension_SetAllPlayersPerceptionEnabled");
static_assert(offsetof(AICheatExtension_SetAllPlayersPerceptionEnabled, PerceptionEnabled) == 0x000000, "Member 'AICheatExtension_SetAllPlayersPerceptionEnabled::PerceptionEnabled' has a wrong offset!");

// Function AICommon.AICheatExtension.SetPlayerPerceptionEnabled
// 0x0001 (0x0001 - 0x0000)
struct AICheatExtension_SetPlayerPerceptionEnabled final
{
public:
	bool                                          PerceptionEnabled;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AICheatExtension_SetPlayerPerceptionEnabled) == 0x000001, "Wrong alignment on AICheatExtension_SetPlayerPerceptionEnabled");
static_assert(sizeof(AICheatExtension_SetPlayerPerceptionEnabled) == 0x000001, "Wrong size on AICheatExtension_SetPlayerPerceptionEnabled");
static_assert(offsetof(AICheatExtension_SetPlayerPerceptionEnabled, PerceptionEnabled) == 0x000000, "Member 'AICheatExtension_SetPlayerPerceptionEnabled::PerceptionEnabled' has a wrong offset!");

// Function AICommon.P2AIItemStatAccessor_SentryAbility.FindAbility
// 0x0010 (0x0010 - 0x0000)
struct P2AIItemStatAccessor_SentryAbility_FindAbility final
{
public:
	const class UP2ItemData*                      InItemData;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIItemStatAccessor_SentryAbility_FindAbility) == 0x000008, "Wrong alignment on P2AIItemStatAccessor_SentryAbility_FindAbility");
static_assert(sizeof(P2AIItemStatAccessor_SentryAbility_FindAbility) == 0x000010, "Wrong size on P2AIItemStatAccessor_SentryAbility_FindAbility");
static_assert(offsetof(P2AIItemStatAccessor_SentryAbility_FindAbility, InItemData) == 0x000000, "Member 'P2AIItemStatAccessor_SentryAbility_FindAbility::InItemData' has a wrong offset!");
static_assert(offsetof(P2AIItemStatAccessor_SentryAbility_FindAbility, ReturnValue) == 0x000008, "Member 'P2AIItemStatAccessor_SentryAbility_FindAbility::ReturnValue' has a wrong offset!");

// Function AICommon.P2AIItemStatAccessor_PropertyProjectile.GetProjectile
// 0x0010 (0x0010 - 0x0000)
struct P2AIItemStatAccessor_PropertyProjectile_GetProjectile final
{
public:
	const class UDataAsset*                       InDataAsset;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2SentryProjectile*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIItemStatAccessor_PropertyProjectile_GetProjectile) == 0x000008, "Wrong alignment on P2AIItemStatAccessor_PropertyProjectile_GetProjectile");
static_assert(sizeof(P2AIItemStatAccessor_PropertyProjectile_GetProjectile) == 0x000010, "Wrong size on P2AIItemStatAccessor_PropertyProjectile_GetProjectile");
static_assert(offsetof(P2AIItemStatAccessor_PropertyProjectile_GetProjectile, InDataAsset) == 0x000000, "Member 'P2AIItemStatAccessor_PropertyProjectile_GetProjectile::InDataAsset' has a wrong offset!");
static_assert(offsetof(P2AIItemStatAccessor_PropertyProjectile_GetProjectile, ReturnValue) == 0x000008, "Member 'P2AIItemStatAccessor_PropertyProjectile_GetProjectile::ReturnValue' has a wrong offset!");

// Function AICommon.P2BruteProjectile.GetImpactAudioEvent
// 0x0030 (0x0030 - 0x0000)
struct P2BruteProjectile_GetImpactAudioEvent final
{
public:
	struct FAkEventSlotConfig                     ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BruteProjectile_GetImpactAudioEvent) == 0x000008, "Wrong alignment on P2BruteProjectile_GetImpactAudioEvent");
static_assert(sizeof(P2BruteProjectile_GetImpactAudioEvent) == 0x000030, "Wrong size on P2BruteProjectile_GetImpactAudioEvent");
static_assert(offsetof(P2BruteProjectile_GetImpactAudioEvent, ReturnValue) == 0x000000, "Member 'P2BruteProjectile_GetImpactAudioEvent::ReturnValue' has a wrong offset!");

// Function AICommon.P2BruteProjectile.GetProjectileSpeed
// 0x0004 (0x0004 - 0x0000)
struct P2BruteProjectile_GetProjectileSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BruteProjectile_GetProjectileSpeed) == 0x000004, "Wrong alignment on P2BruteProjectile_GetProjectileSpeed");
static_assert(sizeof(P2BruteProjectile_GetProjectileSpeed) == 0x000004, "Wrong size on P2BruteProjectile_GetProjectileSpeed");
static_assert(offsetof(P2BruteProjectile_GetProjectileSpeed, ReturnValue) == 0x000000, "Member 'P2BruteProjectile_GetProjectileSpeed::ReturnValue' has a wrong offset!");

// Function AICommon.P2BruteProjectile.K2_OnProjectileStop
// 0x00E8 (0x00E8 - 0x0000)
struct P2BruteProjectile_K2_OnProjectileStop final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BruteProjectile_K2_OnProjectileStop) == 0x000008, "Wrong alignment on P2BruteProjectile_K2_OnProjectileStop");
static_assert(sizeof(P2BruteProjectile_K2_OnProjectileStop) == 0x0000E8, "Wrong size on P2BruteProjectile_K2_OnProjectileStop");
static_assert(offsetof(P2BruteProjectile_K2_OnProjectileStop, ImpactResult) == 0x000000, "Member 'P2BruteProjectile_K2_OnProjectileStop::ImpactResult' has a wrong offset!");

// Function AICommon.P2BruteProjectile.OnProjectileStop
// 0x00E8 (0x00E8 - 0x0000)
struct P2BruteProjectile_OnProjectileStop final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BruteProjectile_OnProjectileStop) == 0x000008, "Wrong alignment on P2BruteProjectile_OnProjectileStop");
static_assert(sizeof(P2BruteProjectile_OnProjectileStop) == 0x0000E8, "Wrong size on P2BruteProjectile_OnProjectileStop");
static_assert(offsetof(P2BruteProjectile_OnProjectileStop, ImpactResult) == 0x000000, "Member 'P2BruteProjectile_OnProjectileStop::ImpactResult' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.AssignTarget
// 0x0008 (0x0008 - 0x0000)
struct P2AIPerceptionComponent_AssignTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIPerceptionComponent_AssignTarget) == 0x000008, "Wrong alignment on P2AIPerceptionComponent_AssignTarget");
static_assert(sizeof(P2AIPerceptionComponent_AssignTarget) == 0x000008, "Wrong size on P2AIPerceptionComponent_AssignTarget");
static_assert(offsetof(P2AIPerceptionComponent_AssignTarget, InTarget) == 0x000000, "Member 'P2AIPerceptionComponent_AssignTarget::InTarget' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.ClearAllThreats
// 0x0001 (0x0001 - 0x0000)
struct P2AIPerceptionComponent_ClearAllThreats final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIPerceptionComponent_ClearAllThreats) == 0x000001, "Wrong alignment on P2AIPerceptionComponent_ClearAllThreats");
static_assert(sizeof(P2AIPerceptionComponent_ClearAllThreats) == 0x000001, "Wrong size on P2AIPerceptionComponent_ClearAllThreats");
static_assert(offsetof(P2AIPerceptionComponent_ClearAllThreats, ReturnValue) == 0x000000, "Member 'P2AIPerceptionComponent_ClearAllThreats::ReturnValue' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.ClearInvalidThreats
// 0x0001 (0x0001 - 0x0000)
struct P2AIPerceptionComponent_ClearInvalidThreats final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AIPerceptionComponent_ClearInvalidThreats) == 0x000001, "Wrong alignment on P2AIPerceptionComponent_ClearInvalidThreats");
static_assert(sizeof(P2AIPerceptionComponent_ClearInvalidThreats) == 0x000001, "Wrong size on P2AIPerceptionComponent_ClearInvalidThreats");
static_assert(offsetof(P2AIPerceptionComponent_ClearInvalidThreats, ReturnValue) == 0x000000, "Member 'P2AIPerceptionComponent_ClearInvalidThreats::ReturnValue' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.ClearThreat
// 0x0010 (0x0010 - 0x0000)
struct P2AIPerceptionComponent_ClearThreat final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIPerceptionComponent_ClearThreat) == 0x000008, "Wrong alignment on P2AIPerceptionComponent_ClearThreat");
static_assert(sizeof(P2AIPerceptionComponent_ClearThreat) == 0x000010, "Wrong size on P2AIPerceptionComponent_ClearThreat");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreat, InActor) == 0x000000, "Member 'P2AIPerceptionComponent_ClearThreat::InActor' has a wrong offset!");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreat, ReturnValue) == 0x000008, "Member 'P2AIPerceptionComponent_ClearThreat::ReturnValue' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.ClearThreats
// 0x0010 (0x0010 - 0x0000)
struct P2AIPerceptionComponent_ClearThreats final
{
public:
	bool                                          InClearNonSpotted;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InClearNonVisible;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InMinInterestLevel;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMaxInterestLevel;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2AIPerceptionComponent_ClearThreats) == 0x000004, "Wrong alignment on P2AIPerceptionComponent_ClearThreats");
static_assert(sizeof(P2AIPerceptionComponent_ClearThreats) == 0x000010, "Wrong size on P2AIPerceptionComponent_ClearThreats");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreats, InClearNonSpotted) == 0x000000, "Member 'P2AIPerceptionComponent_ClearThreats::InClearNonSpotted' has a wrong offset!");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreats, InClearNonVisible) == 0x000001, "Member 'P2AIPerceptionComponent_ClearThreats::InClearNonVisible' has a wrong offset!");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreats, InMinInterestLevel) == 0x000004, "Member 'P2AIPerceptionComponent_ClearThreats::InMinInterestLevel' has a wrong offset!");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreats, InMaxInterestLevel) == 0x000008, "Member 'P2AIPerceptionComponent_ClearThreats::InMaxInterestLevel' has a wrong offset!");
static_assert(offsetof(P2AIPerceptionComponent_ClearThreats, ReturnValue) == 0x00000C, "Member 'P2AIPerceptionComponent_ClearThreats::ReturnValue' has a wrong offset!");

// Function AICommon.P2AIPerceptionComponent.IgnoreTarget
// 0x0010 (0x0010 - 0x0000)
struct P2AIPerceptionComponent_IgnoreTarget final
{
public:
