#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICommon

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AICommon_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "NavigationSystem_classes.hpp"
#include "Mercuna_structs.hpp"
#include "Mercuna_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Mercuna3DMovement_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "BehaviorTreeExtension_classes.hpp"
#include "MotionSymphony_structs.hpp"
#include "MotionSymphony_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "MotionWarping_classes.hpp"
#include "GameplayStateTreeModule_classes.hpp"


namespace SDK
{

// Class AICommon.P2BTDecorator_Stance
// 0x0008 (0x0070 - 0x0068)
class UP2BTDecorator_Stance final : public UBTDecorator
{
public:
	struct FGameplayTag                           Stance;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_Stance">();
	}
	static class UP2BTDecorator_Stance* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_Stance>();
	}
};
static_assert(alignof(UP2BTDecorator_Stance) == 0x000008, "Wrong alignment on UP2BTDecorator_Stance");
static_assert(sizeof(UP2BTDecorator_Stance) == 0x000070, "Wrong size on UP2BTDecorator_Stance");
static_assert(offsetof(UP2BTDecorator_Stance, Stance) == 0x000068, "Member 'UP2BTDecorator_Stance::Stance' has a wrong offset!");

// Class AICommon.P2AIFleeConfig
// 0x0000 (0x0028 - 0x0028)
class UP2AIFleeConfig : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIFleeConfig">();
	}
	static class UP2AIFleeConfig* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIFleeConfig>();
	}
};
static_assert(alignof(UP2AIFleeConfig) == 0x000008, "Wrong alignment on UP2AIFleeConfig");
static_assert(sizeof(UP2AIFleeConfig) == 0x000028, "Wrong size on UP2AIFleeConfig");

// Class AICommon.P2AIFleeConfig_Default
// 0x0040 (0x0068 - 0x0028)
class UP2AIFleeConfig_Default : public UP2AIFleeConfig
{
public:
	float                                         InterestFleeThreshold;                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HpFleeThreshold;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinFriendliesToBlockFleeing;                       // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ForceFleeTags;                                     // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	float                                         FriendlySearchRadius;                              // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinFleeingTime;                                    // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterestRelaxThreshold;                            // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIFleeConfig_Default">();
	}
	static class UP2AIFleeConfig_Default* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIFleeConfig_Default>();
	}
};
static_assert(alignof(UP2AIFleeConfig_Default) == 0x000008, "Wrong alignment on UP2AIFleeConfig_Default");
static_assert(sizeof(UP2AIFleeConfig_Default) == 0x000068, "Wrong size on UP2AIFleeConfig_Default");
static_assert(offsetof(UP2AIFleeConfig_Default, InterestFleeThreshold) == 0x000028, "Member 'UP2AIFleeConfig_Default::InterestFleeThreshold' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, HpFleeThreshold) == 0x00002C, "Member 'UP2AIFleeConfig_Default::HpFleeThreshold' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, MinFriendliesToBlockFleeing) == 0x000030, "Member 'UP2AIFleeConfig_Default::MinFriendliesToBlockFleeing' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, ForceFleeTags) == 0x000038, "Member 'UP2AIFleeConfig_Default::ForceFleeTags' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, FriendlySearchRadius) == 0x000058, "Member 'UP2AIFleeConfig_Default::FriendlySearchRadius' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, MinFleeingTime) == 0x00005C, "Member 'UP2AIFleeConfig_Default::MinFleeingTime' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Default, InterestRelaxThreshold) == 0x000060, "Member 'UP2AIFleeConfig_Default::InterestRelaxThreshold' has a wrong offset!");

// Class AICommon.P2AIFleeConfig_Bombug
// 0x0010 (0x0078 - 0x0068)
class UP2AIFleeConfig_Bombug final : public UP2AIFleeConfig_Default
{
public:
	float                                         MinFriendliesToBlockFleeingGrounded;               // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FriendliesSearchRadiusWhenGrounded;                // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GroundedTag;                                       // 0x0070(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIFleeConfig_Bombug">();
	}
	static class UP2AIFleeConfig_Bombug* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIFleeConfig_Bombug>();
	}
};
static_assert(alignof(UP2AIFleeConfig_Bombug) == 0x000008, "Wrong alignment on UP2AIFleeConfig_Bombug");
static_assert(sizeof(UP2AIFleeConfig_Bombug) == 0x000078, "Wrong size on UP2AIFleeConfig_Bombug");
static_assert(offsetof(UP2AIFleeConfig_Bombug, MinFriendliesToBlockFleeingGrounded) == 0x000068, "Member 'UP2AIFleeConfig_Bombug::MinFriendliesToBlockFleeingGrounded' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Bombug, FriendliesSearchRadiusWhenGrounded) == 0x00006C, "Member 'UP2AIFleeConfig_Bombug::FriendliesSearchRadiusWhenGrounded' has a wrong offset!");
static_assert(offsetof(UP2AIFleeConfig_Bombug, GroundedTag) == 0x000070, "Member 'UP2AIFleeConfig_Bombug::GroundedTag' has a wrong offset!");

// Class AICommon.P2DisplayActorNameProvider_Npc
// 0x0000 (0x0050 - 0x0050)
class UP2DisplayActorNameProvider_Npc final : public UP2DisplayActorNameProvider_FromClass
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2DisplayActorNameProvider_Npc">();
	}
	static class UP2DisplayActorNameProvider_Npc* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2DisplayActorNameProvider_Npc>();
	}
};
static_assert(alignof(UP2DisplayActorNameProvider_Npc) == 0x000008, "Wrong alignment on UP2DisplayActorNameProvider_Npc");
static_assert(sizeof(UP2DisplayActorNameProvider_Npc) == 0x000050, "Wrong size on UP2DisplayActorNameProvider_Npc");

// Class AICommon.P2AIFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UP2AIFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetActorsInBox(TArray<class AActor*>* OutActors, class UObject* InWorldContextObject, const TArray<class AActor*>& IgnoredActors, const struct FVector& Position, const struct FRotator& Rotation, const struct FVector3f& BoxHalfExtent, const TSubclassOf<class AActor> ActorClass, const EP2AIMobilityType MobilityType, const ECollisionChannel CollisionChannel, const bool IgnoreHiddenActors)	 // 0x4732bc8;
	static void GetActorsInBoxByChannel(TArray<class AActor*>* OutActors, class UObject* InWorldContextObject, const TArray<class AActor*>& IgnoredActors, const struct FVector& Position, const struct FRotator& Rotation, const struct FVector& BoxHalfExtent, const TSubclassOf<class AActor> ActorClass, const EP2AIMobilityType MobilityType, const ECollisionChannel CollisionChannel)	 // 0x473319c;
	static void GetActorsInSphere(TArray<class AActor*>* OutActors, class UObject* WorldContextObject, const TArray<class AActor*>& InIgnoredActors, const struct FVector& InPos, const struct FQuat& InRot, float InSphereRadius, TSubclassOf<class AActor> InActorClass, EP2AIMobilityType InMobilityType, ECollisionChannel InCollisionChannel, bool InbIgnoreHiddenActors)	 // 0x4733630;
	static void GetActorsInSphereByChannel(TArray<class AActor*>* OutActors, class UObject* WorldContextObject, const TArray<class AActor*>& InIgnoredActors, const struct FVector& InPos, const struct FQuat& InRot, float InSphereRadius, TSubclassOf<class AActor> InActorClass, EP2AIMobilityType InMobilityType, ECollisionChannel InCollisionChannel)	 // 0x4733c40;
	static void MakeGameplayAbilityDamageTarget(const TArray<class AActor*>& InActorArray, struct FGameplayAbilityTargetDataHandle* OutDataHandle)	 // 0x4734e80;
	static void MakeGameplayAbilityRadialDamageTarget(const TArray<class AActor*>& InActorArray, const struct FVector& InImpactCenter, const float InImpactAoeRadius, struct FGameplayAbilityTargetDataHandle* OutDataHandle)	 // 0x4734fa4;
	static void SendImpactAudio(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ImpactTag)	 // 0x473553c;
	static void TryDealDamage(const class UAbilitySystemComponent* InstigatorASC, const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const TSubclassOf<class UP2GameplayEffect_Damage>& EffectClass, float EffectLevel)	 // 0x47357a8;
	static void TryStun(const class UAbilitySystemComponent* InstigatorASC, const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, float ChanceToApply, const struct FGameplayTag& InStunTag)	 // 0x4735a60;
	static void TryStunRadial(const class UAbilitySystemComponent* InstigatorASC, const class UCurveFloat* StunSeverityCurve, float MaxDistance, const struct FVector& ImpactCenter)	 // 0x4735ce8;
	static void TryStunTargetRadial(const class UAbilitySystemComponent* InstigatorASC, const class UCurveFloat* StunSeverityCurve, float MaxDistance, const struct FVector& ImpactCenter, class AActor* Target)	 // 0x473601c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIFunctionLibrary">();
	}
	static class UP2AIFunctionLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIFunctionLibrary>();
	}
};
static_assert(alignof(UP2AIFunctionLibrary) == 0x000008, "Wrong alignment on UP2AIFunctionLibrary");
static_assert(sizeof(UP2AIFunctionLibrary) == 0x000028, "Wrong size on UP2AIFunctionLibrary");

// Class AICommon.P2EnvQueryContext_Target
// 0x0000 (0x0028 - 0x0028)
class UP2EnvQueryContext_Target final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2EnvQueryContext_Target">();
	}
	static class UP2EnvQueryContext_Target* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2EnvQueryContext_Target>();
	}
};
static_assert(alignof(UP2EnvQueryContext_Target) == 0x000008, "Wrong alignment on UP2EnvQueryContext_Target");
static_assert(sizeof(UP2EnvQueryContext_Target) == 0x000028, "Wrong size on UP2EnvQueryContext_Target");

// Class AICommon.P2DisplayActorNameProvider_NpcSpawningCosmeticActor
// 0x0000 (0x0050 - 0x0050)
class UP2DisplayActorNameProvider_NpcSpawningCosmeticActor final : public UP2DisplayActorNameProvider_FromClass
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2DisplayActorNameProvider_NpcSpawningCosmeticActor">();
	}
	static class UP2DisplayActorNameProvider_NpcSpawningCosmeticActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2DisplayActorNameProvider_NpcSpawningCosmeticActor>();
	}
};
static_assert(alignof(UP2DisplayActorNameProvider_NpcSpawningCosmeticActor) == 0x000008, "Wrong alignment on UP2DisplayActorNameProvider_NpcSpawningCosmeticActor");
static_assert(sizeof(UP2DisplayActorNameProvider_NpcSpawningCosmeticActor) == 0x000050, "Wrong size on UP2DisplayActorNameProvider_NpcSpawningCosmeticActor");

// Class AICommon.AICheatExtension
// 0x00F0 (0x0168 - 0x0078)
class UAICheatExtension final : public UP2CheatManagerExtension
{
public:
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CurrentWorld;                                      // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AP2NPCharacter*                         CurrentNPC;                                        // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AP2HeroCharacter*                       CurrentPlayer;                                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class AP2NpcGroupSpawner>> GroupSpawnerClasses;                               // 0x00D8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2NpcGroupData*>                GroupDataList;                                     // 0x00F8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x60];                                     // 0x0108(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearPerceptionForcedAlertedLevel()	 // 0x472ab34;
	void ClientDisplayDebugMsgOnScreen(const class FString& DebugMsg)	 // 0x472ab90;
	void ClientReceiveTickDebugData(const struct FAICheatDebugData& DebugData)	 // 0x472ac64;
	void EnableSignificanceDebug(bool bEnabled)	 // 0x472ad7c;
	void RequestTickDebugData()	 // 0x1769068;
	void ServerDestroyAllNpcsOfDataType(const class UP2NpcData* NpcData)	 // 0x472b054;
	void ServerEndStateTreeDebug()	 // 0x17db788;
	void ServerKillAllNpcsOfDataType(const class UP2NpcData* NpcData)	 // 0x472b118;
	void ServerSetDynamicScale(const struct FGameplayTag& Tag, float Scale)	 // 0x472b1dc;
	void ServerSpawnNpc(const class UP2NpcData* NpcData)	 // 0x472b320;
	void ServerSpawnNpcAtDistance(const class UP2NpcData* NpcData, float SpawnDistance)	 // 0x472b3e4;
	void ServerSpawnNpcGroupSpawner(TSubclassOf<class AP2NpcGroupSpawner> InGroupSpawnerClass, const class UP2NpcGroupData* InNpcGroupData, int32 InGroupMemberNumX, int32 InGroupMemberNumY, const struct FVector& InSpawnLocation)	 // 0x472b528;
	void ServerStartStateTreeDebug(class AActor* TargetActor)	 // 0x472b7e0;
	void ServerUpdateStateTreeDebugMsg(const class FString& Msg)	 // 0x472b8a4;
	void SetDynamicScale(class FName Tag, float Scale)	 // 0x472ba38;
	void SetPerceptionForcedAlertedLevel(int32 InAlertedLevel)	 // 0x472bb78;

	void SetAllPlayersPerceptionEnabled(bool PerceptionEnabled) const	 // 0x472b974;
	void SetPlayerPerceptionEnabled(bool PerceptionEnabled) const	 // 0x472bc9c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AICheatExtension">();
	}
	static class UAICheatExtension* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAICheatExtension>();
	}
};
static_assert(alignof(UAICheatExtension) == 0x000008, "Wrong alignment on UAICheatExtension");
static_assert(sizeof(UAICheatExtension) == 0x000168, "Wrong size on UAICheatExtension");
static_assert(offsetof(UAICheatExtension, CurrentWorld) == 0x0000C0, "Member 'UAICheatExtension::CurrentWorld' has a wrong offset!");
static_assert(offsetof(UAICheatExtension, CurrentNPC) == 0x0000C8, "Member 'UAICheatExtension::CurrentNPC' has a wrong offset!");
static_assert(offsetof(UAICheatExtension, CurrentPlayer) == 0x0000D0, "Member 'UAICheatExtension::CurrentPlayer' has a wrong offset!");
static_assert(offsetof(UAICheatExtension, GroupSpawnerClasses) == 0x0000D8, "Member 'UAICheatExtension::GroupSpawnerClasses' has a wrong offset!");
static_assert(offsetof(UAICheatExtension, GroupDataList) == 0x0000F8, "Member 'UAICheatExtension::GroupDataList' has a wrong offset!");

// Class AICommon.P2AIItemStatAccessor_SentryAbility
// 0x0008 (0x0188 - 0x0180)
class UP2AIItemStatAccessor_SentryAbility : public UP2ItemStatAccessor
{
public:
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x0180(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UGameplayAbility* FindAbility(const class UP2ItemData* InItemData) const	 // 0x4732af8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIItemStatAccessor_SentryAbility">();
	}
	static class UP2AIItemStatAccessor_SentryAbility* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIItemStatAccessor_SentryAbility>();
	}
};
static_assert(alignof(UP2AIItemStatAccessor_SentryAbility) == 0x000008, "Wrong alignment on UP2AIItemStatAccessor_SentryAbility");
static_assert(sizeof(UP2AIItemStatAccessor_SentryAbility) == 0x000188, "Wrong size on UP2AIItemStatAccessor_SentryAbility");
static_assert(offsetof(UP2AIItemStatAccessor_SentryAbility, AbilityClass) == 0x000180, "Member 'UP2AIItemStatAccessor_SentryAbility::AbilityClass' has a wrong offset!");

// Class AICommon.AttackStageCondition
// 0x0000 (0x0028 - 0x0028)
class UAttackStageCondition : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AttackStageCondition">();
	}
	static class UAttackStageCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAttackStageCondition>();
	}
};
static_assert(alignof(UAttackStageCondition) == 0x000008, "Wrong alignment on UAttackStageCondition");
static_assert(sizeof(UAttackStageCondition) == 0x000028, "Wrong size on UAttackStageCondition");

// Class AICommon.P2BTTask_ActivateAbilityBase
// 0x0028 (0x0098 - 0x0070)
class UP2BTTask_ActivateAbilityBase : public UBTTaskNode
{
public:
	bool                                          bIsBlocking;                                       // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTreatCancelAsSuccess;                             // 0x0071(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEventToActivate;                               // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTreeComponent*                 OwnerCache;                                        // 0x0078(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2NpcAbilitySystemComponent*           AbilitySystemCache;                                // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTTask_ActivateAbilityBase">();
	}
	static class UP2BTTask_ActivateAbilityBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTTask_ActivateAbilityBase>();
	}
};
static_assert(alignof(UP2BTTask_ActivateAbilityBase) == 0x000008, "Wrong alignment on UP2BTTask_ActivateAbilityBase");
static_assert(sizeof(UP2BTTask_ActivateAbilityBase) == 0x000098, "Wrong size on UP2BTTask_ActivateAbilityBase");
static_assert(offsetof(UP2BTTask_ActivateAbilityBase, bIsBlocking) == 0x000070, "Member 'UP2BTTask_ActivateAbilityBase::bIsBlocking' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ActivateAbilityBase, bTreatCancelAsSuccess) == 0x000071, "Member 'UP2BTTask_ActivateAbilityBase::bTreatCancelAsSuccess' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ActivateAbilityBase, bUseEventToActivate) == 0x000072, "Member 'UP2BTTask_ActivateAbilityBase::bUseEventToActivate' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ActivateAbilityBase, OwnerCache) == 0x000078, "Member 'UP2BTTask_ActivateAbilityBase::OwnerCache' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ActivateAbilityBase, AbilitySystemCache) == 0x000080, "Member 'UP2BTTask_ActivateAbilityBase::AbilitySystemCache' has a wrong offset!");

// Class AICommon.P2AIItemStatAccessor_SentryAbilityCost
// 0x0000 (0x0188 - 0x0188)
class UP2AIItemStatAccessor_SentryAbilityCost final : public UP2AIItemStatAccessor_SentryAbility
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIItemStatAccessor_SentryAbilityCost">();
	}
	static class UP2AIItemStatAccessor_SentryAbilityCost* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIItemStatAccessor_SentryAbilityCost>();
	}
};
static_assert(alignof(UP2AIItemStatAccessor_SentryAbilityCost) == 0x000008, "Wrong alignment on UP2AIItemStatAccessor_SentryAbilityCost");
static_assert(sizeof(UP2AIItemStatAccessor_SentryAbilityCost) == 0x000188, "Wrong size on UP2AIItemStatAccessor_SentryAbilityCost");

// Class AICommon.P2BTDecorator_TopDamageDealerWithinDistance
// 0x0010 (0x00A0 - 0x0090)
class UP2BTDecorator_TopDamageDealerWithinDistance final : public UBTDecorator_BlackboardBase
{
public:
	float                                         Radius;                                            // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyPlayerControlled;                              // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistance;                                       // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeWindow;                                        // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_TopDamageDealerWithinDistance">();
	}
	static class UP2BTDecorator_TopDamageDealerWithinDistance* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_TopDamageDealerWithinDistance>();
	}
};
static_assert(alignof(UP2BTDecorator_TopDamageDealerWithinDistance) == 0x000008, "Wrong alignment on UP2BTDecorator_TopDamageDealerWithinDistance");
static_assert(sizeof(UP2BTDecorator_TopDamageDealerWithinDistance) == 0x0000A0, "Wrong size on UP2BTDecorator_TopDamageDealerWithinDistance");
static_assert(offsetof(UP2BTDecorator_TopDamageDealerWithinDistance, Radius) == 0x000090, "Member 'UP2BTDecorator_TopDamageDealerWithinDistance::Radius' has a wrong offset!");
static_assert(offsetof(UP2BTDecorator_TopDamageDealerWithinDistance, OnlyPlayerControlled) == 0x000094, "Member 'UP2BTDecorator_TopDamageDealerWithinDistance::OnlyPlayerControlled' has a wrong offset!");
static_assert(offsetof(UP2BTDecorator_TopDamageDealerWithinDistance, MaxDistance) == 0x000098, "Member 'UP2BTDecorator_TopDamageDealerWithinDistance::MaxDistance' has a wrong offset!");
static_assert(offsetof(UP2BTDecorator_TopDamageDealerWithinDistance, TimeWindow) == 0x00009C, "Member 'UP2BTDecorator_TopDamageDealerWithinDistance::TimeWindow' has a wrong offset!");

// Class AICommon.PredictionBasedCondition
// 0x0008 (0x0030 - 0x0028)
class UPredictionBasedCondition : public UAttackStageCondition
{
public:
	bool                                          bWithPrediction;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PredictionTime;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PredictionBasedCondition">();
	}
	static class UPredictionBasedCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPredictionBasedCondition>();
	}
};
static_assert(alignof(UPredictionBasedCondition) == 0x000008, "Wrong alignment on UPredictionBasedCondition");
static_assert(sizeof(UPredictionBasedCondition) == 0x000030, "Wrong size on UPredictionBasedCondition");
static_assert(offsetof(UPredictionBasedCondition, bWithPrediction) == 0x000028, "Member 'UPredictionBasedCondition::bWithPrediction' has a wrong offset!");
static_assert(offsetof(UPredictionBasedCondition, PredictionTime) == 0x00002C, "Member 'UPredictionBasedCondition::PredictionTime' has a wrong offset!");

// Class AICommon.DistanceToTargetCondition
// 0x0008 (0x0038 - 0x0030)
class UDistanceToTargetCondition final : public UPredictionBasedCondition
{
public:
	float                                         MinDistance;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"DistanceToTargetCondition">();
	}
	static class UDistanceToTargetCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UDistanceToTargetCondition>();
	}
};
static_assert(alignof(UDistanceToTargetCondition) == 0x000008, "Wrong alignment on UDistanceToTargetCondition");
static_assert(sizeof(UDistanceToTargetCondition) == 0x000038, "Wrong size on UDistanceToTargetCondition");
static_assert(offsetof(UDistanceToTargetCondition, MinDistance) == 0x000030, "Member 'UDistanceToTargetCondition::MinDistance' has a wrong offset!");
static_assert(offsetof(UDistanceToTargetCondition, MaxDistance) == 0x000034, "Member 'UDistanceToTargetCondition::MaxDistance' has a wrong offset!");

// Class AICommon.BTService_CheckIsLookedAt
// 0x0058 (0x00C8 - 0x0070)
class UBTService_CheckIsLookedAt final : public UBTService
{
public:
	class UP2LookedAtSenseData*                   Settings;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 Target;                                            // 0x0078(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 Result;                                            // 0x00A0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTService_CheckIsLookedAt">();
	}
	static class UBTService_CheckIsLookedAt* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTService_CheckIsLookedAt>();
	}
};
static_assert(alignof(UBTService_CheckIsLookedAt) == 0x000008, "Wrong alignment on UBTService_CheckIsLookedAt");
static_assert(sizeof(UBTService_CheckIsLookedAt) == 0x0000C8, "Wrong size on UBTService_CheckIsLookedAt");
static_assert(offsetof(UBTService_CheckIsLookedAt, Settings) == 0x000070, "Member 'UBTService_CheckIsLookedAt::Settings' has a wrong offset!");
static_assert(offsetof(UBTService_CheckIsLookedAt, Target) == 0x000078, "Member 'UBTService_CheckIsLookedAt::Target' has a wrong offset!");
static_assert(offsetof(UBTService_CheckIsLookedAt, Result) == 0x0000A0, "Member 'UBTService_CheckIsLookedAt::Result' has a wrong offset!");

// Class AICommon.P2AIItemStatAccessor_PropertyProjectile
// 0x0000 (0x0198 - 0x0198)
class UP2AIItemStatAccessor_PropertyProjectile : public UP2ItemStatAccessor_Property
{
public:
	class AP2SentryProjectile* GetProjectile(const class UDataAsset* InDataAsset) const	 // 0x4734210;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIItemStatAccessor_PropertyProjectile">();
	}
	static class UP2AIItemStatAccessor_PropertyProjectile* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIItemStatAccessor_PropertyProjectile>();
	}
};
static_assert(alignof(UP2AIItemStatAccessor_PropertyProjectile) == 0x000008, "Wrong alignment on UP2AIItemStatAccessor_PropertyProjectile");
static_assert(sizeof(UP2AIItemStatAccessor_PropertyProjectile) == 0x000198, "Wrong size on UP2AIItemStatAccessor_PropertyProjectile");

// Class AICommon.P2BruteProjectile
// 0x0130 (0x03E0 - 0x02B0)
class AP2BruteProjectile final : public AActor
{
public:
	uint8                                         Pad_2B0[0x18];                                     // 0x02B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2SmartObjectDefinition_BruteThrowable* Definition;                                       // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FP2BrutProjectileData                  ReplicatedData;                                    // 0x02D0(0x00C0)(Net, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FVector                                Velocity;                                          // 0x0390(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                TargetLocation;                                    // 0x03A8(0x0018)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x20];                                     // 0x03C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FAkEventSlotConfig GetImpactAudioEvent()	 // 0x473dd68;
	float GetProjectileSpeed()	 // 0x473dd9c;
	void K2_OnProjectileStop(const struct FHitResult& ImpactResult)	 // 0xae1e64;
	void OnProjectileStop(const struct FHitResult& ImpactResult)	 // 0x473ddec;
	void OnRep_ReplicatedData()	 // 0x473de84;
	void OnRep_SetVelocity()	 // 0x473de98;
	void OnVelocityChangedBP()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BruteProjectile">();
	}
	static class AP2BruteProjectile* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2BruteProjectile>();
	}
};
static_assert(alignof(AP2BruteProjectile) == 0x000010, "Wrong alignment on AP2BruteProjectile");
static_assert(sizeof(AP2BruteProjectile) == 0x0003E0, "Wrong size on AP2BruteProjectile");
static_assert(offsetof(AP2BruteProjectile, Definition) == 0x0002C8, "Member 'AP2BruteProjectile::Definition' has a wrong offset!");
static_assert(offsetof(AP2BruteProjectile, ReplicatedData) == 0x0002D0, "Member 'AP2BruteProjectile::ReplicatedData' has a wrong offset!");
static_assert(offsetof(AP2BruteProjectile, Velocity) == 0x000390, "Member 'AP2BruteProjectile::Velocity' has a wrong offset!");
static_assert(offsetof(AP2BruteProjectile, TargetLocation) == 0x0003A8, "Member 'AP2BruteProjectile::TargetLocation' has a wrong offset!");

// Class AICommon.InstigatorSpeedCondition
// 0x0008 (0x0030 - 0x0028)
class UInstigatorSpeedCondition final : public UAttackStageCondition
{
public:
	float                                         MinSpeed;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"InstigatorSpeedCondition">();
	}
	static class UInstigatorSpeedCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UInstigatorSpeedCondition>();
	}
};
static_assert(alignof(UInstigatorSpeedCondition) == 0x000008, "Wrong alignment on UInstigatorSpeedCondition");
static_assert(sizeof(UInstigatorSpeedCondition) == 0x000030, "Wrong size on UInstigatorSpeedCondition");
static_assert(offsetof(UInstigatorSpeedCondition, MinSpeed) == 0x000028, "Member 'UInstigatorSpeedCondition::MinSpeed' has a wrong offset!");
static_assert(offsetof(UInstigatorSpeedCondition, MaxSpeed) == 0x00002C, "Member 'UInstigatorSpeedCondition::MaxSpeed' has a wrong offset!");

// Class AICommon.P2AIItemStatAccessor_PropertyFireData
// 0x0000 (0x0198 - 0x0198)
class UP2AIItemStatAccessor_PropertyFireData final : public UP2AIItemStatAccessor_PropertyProjectile
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIItemStatAccessor_PropertyFireData">();
	}
	static class UP2AIItemStatAccessor_PropertyFireData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIItemStatAccessor_PropertyFireData>();
	}
};
static_assert(alignof(UP2AIItemStatAccessor_PropertyFireData) == 0x000008, "Wrong alignment on UP2AIItemStatAccessor_PropertyFireData");
static_assert(sizeof(UP2AIItemStatAccessor_PropertyFireData) == 0x000198, "Wrong size on UP2AIItemStatAccessor_PropertyFireData");

// Class AICommon.P2TestKeySelector
// 0x0000 (0x0030 - 0x0030)
class UP2TestKeySelector : public UP2Object
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestKeySelector">();
	}
	static class UP2TestKeySelector* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TestKeySelector>();
	}
};
static_assert(alignof(UP2TestKeySelector) == 0x000008, "Wrong alignment on UP2TestKeySelector");
static_assert(sizeof(UP2TestKeySelector) == 0x000030, "Wrong size on UP2TestKeySelector");

// Class AICommon.TargetSpeedCondition
// 0x0008 (0x0030 - 0x0028)
class UTargetSpeedCondition final : public UAttackStageCondition
{
public:
	float                                         MinSpeed;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSpeed;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"TargetSpeedCondition">();
	}
	static class UTargetSpeedCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UTargetSpeedCondition>();
	}
};
static_assert(alignof(UTargetSpeedCondition) == 0x000008, "Wrong alignment on UTargetSpeedCondition");
static_assert(sizeof(UTargetSpeedCondition) == 0x000030, "Wrong size on UTargetSpeedCondition");
static_assert(offsetof(UTargetSpeedCondition, MinSpeed) == 0x000028, "Member 'UTargetSpeedCondition::MinSpeed' has a wrong offset!");
static_assert(offsetof(UTargetSpeedCondition, MaxSpeed) == 0x00002C, "Member 'UTargetSpeedCondition::MaxSpeed' has a wrong offset!");

// Class AICommon.AngleToTargetCondition
// 0x0010 (0x0040 - 0x0030)
class UAngleToTargetCondition final : public UPredictionBasedCondition
{
public:
	float                                         MinAngle;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle;                                          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAngleCalculationType                         CalculationType;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AngleToTargetCondition">();
	}
	static class UAngleToTargetCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAngleToTargetCondition>();
	}
};
static_assert(alignof(UAngleToTargetCondition) == 0x000008, "Wrong alignment on UAngleToTargetCondition");
static_assert(sizeof(UAngleToTargetCondition) == 0x000040, "Wrong size on UAngleToTargetCondition");
static_assert(offsetof(UAngleToTargetCondition, MinAngle) == 0x000030, "Member 'UAngleToTargetCondition::MinAngle' has a wrong offset!");
static_assert(offsetof(UAngleToTargetCondition, MaxAngle) == 0x000034, "Member 'UAngleToTargetCondition::MaxAngle' has a wrong offset!");
static_assert(offsetof(UAngleToTargetCondition, CalculationType) == 0x000038, "Member 'UAngleToTargetCondition::CalculationType' has a wrong offset!");

// Class AICommon.P2AIPerceptionComponent
// 0x0318 (0x04C8 - 0x01B0)
class UP2AIPerceptionComponent final : public UAIPerceptionComponent
{
public:
	uint8                                         Pad_1B0[0x20];                                     // 0x01B0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class AActor* Actor, EP2PerceptionAlertedLevelType InNewAlertedLevel, EP2PerceptionAlertedLevelType InOldAlertedLevel)> OnAlertedLevelChangedDelegate; // 0x01D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0x18];                                     // 0x01E0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class AActor* Actor, class AActor* InNewTarget, class AActor* InOldTarget)> OnTargetChangedDelegate; // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_208[0x18];                                     // 0x0208(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2PerceptionAlertedLevelChangePair> AlertedLevelIncreasePairs;                    // 0x0220(0x0010)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FP2PerceptionAlertedLevelChangePair> AlertedLevelDecreasePairs;                    // 0x0230(0x0010)(Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EP2PerceptionAlertedLevelType, float>    AlertedLevelIncreaseRate;                          // 0x0240(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EP2PerceptionAlertedLevelType, float>    AlertedLevelDecreaseRate;                          // 0x0290(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             InterestLevelPerTagData;                           // 0x02E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UAISense>, float>      InterestLevelIncreasePerSense;                     // 0x02E8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         MinSpottedTime;                                    // 0x0338(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinVisibleTime;                                    // 0x033C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSet<TSubclassOf<class UAISense>>             SpotSenses;                                        // 0x0340(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<TSubclassOf<class UAISense>>             SensitiveSenses;                                   // 0x0390(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AActor>, float>     IgnoredTargets;                                    // 0x03E0(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  IgnoredStimuli;                                    // 0x0430(0x0020)(Edit, BlueprintVisible, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x78];                                     // 0x0450(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AssignTarget(class AActor* InTarget)	 // 0x47326b8;
	bool ClearAllThreats()	 // 0x4732778;
	bool ClearInvalidThreats()	 // 0x473279c;
	void ClearTarget()	 // 0x47327c0;
	bool ClearThreat(const class AActor* InActor)	 // 0x47327d4;
	bool ClearThreats(bool InClearNonSpotted, bool InClearNonVisible, float InMinInterestLevel, float InMaxInterestLevel)	 // 0x47328a4;
	void IgnoreTarget(const class AActor* InActor, float Time)	 // 0x4734ab8;
	void OnPostPerceptionUpdate(const TArray<class AActor*>& InUpdatedActors)	 // 0x4735168;
	void OnPostTargetPerceptionUpdated(class AActor* InActor, const struct FAIStimulus& InStimulus)	 // 0x4735204;
	void OverrideThreatInterestLevel(const class AActor* InActor, float InInterestLevel, float InInterestLevelTarget)	 // 0x4735380;
	void SetIgnoredStimuli(const struct FGameplayTagContainer& StimuliTags)	 // 0x47356c8;

	const EP2PerceptionAlertedLevelType GetAlertedLevel() const	 // 0x47341b8;
	const struct FGameplayTagContainer GetIgnoredStimuli() const	 // 0x47341d0;
	class AActor* GetPrimaryTarget() const	 // 0x47341ec;
	float GetThreatInterestLevel(const class AActor* InActor) const	 // 0x47342d0;
	float GetThreatInterestLevelTarget(const class AActor* InActor) const	 // 0x47343a0;
	struct FVector GetThreatLocation(const class AActor* InActor) const	 // 0x4734470;
	bool HasRecentStimuliByTags(const struct FGameplayTagContainer& GameplayTags, bool bCheckTargetOnly, bool bUseCustomAgeFilter, float CustomMaxAge, float MaxDistance, bool bHostileOnly) const	 // 0x4734744;
	bool IsInterestLevelDecreasingEnabled() const	 // 0x4734bf8;
	bool IsSuppressed(float InMaxTimeSince) const	 // 0x4734c10;
	bool IsThreatSpotted(const class AActor* InActor) const	 // 0x4734ce0;
	bool IsThreatVisible(const class AActor* InActor) const	 // 0x4734db0;
	bool TookDamageRecently() const	 // 0x4735784;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AIPerceptionComponent">();
	}
	static class UP2AIPerceptionComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AIPerceptionComponent>();
	}
};
static_assert(alignof(UP2AIPerceptionComponent) == 0x000008, "Wrong alignment on UP2AIPerceptionComponent");
static_assert(sizeof(UP2AIPerceptionComponent) == 0x0004C8, "Wrong size on UP2AIPerceptionComponent");
static_assert(offsetof(UP2AIPerceptionComponent, OnAlertedLevelChangedDelegate) == 0x0001D0, "Member 'UP2AIPerceptionComponent::OnAlertedLevelChangedDelegate' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, OnTargetChangedDelegate) == 0x0001F8, "Member 'UP2AIPerceptionComponent::OnTargetChangedDelegate' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, AlertedLevelIncreasePairs) == 0x000220, "Member 'UP2AIPerceptionComponent::AlertedLevelIncreasePairs' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, AlertedLevelDecreasePairs) == 0x000230, "Member 'UP2AIPerceptionComponent::AlertedLevelDecreasePairs' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, AlertedLevelIncreaseRate) == 0x000240, "Member 'UP2AIPerceptionComponent::AlertedLevelIncreaseRate' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, AlertedLevelDecreaseRate) == 0x000290, "Member 'UP2AIPerceptionComponent::AlertedLevelDecreaseRate' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, InterestLevelPerTagData) == 0x0002E0, "Member 'UP2AIPerceptionComponent::InterestLevelPerTagData' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, InterestLevelIncreasePerSense) == 0x0002E8, "Member 'UP2AIPerceptionComponent::InterestLevelIncreasePerSense' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, MinSpottedTime) == 0x000338, "Member 'UP2AIPerceptionComponent::MinSpottedTime' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, MinVisibleTime) == 0x00033C, "Member 'UP2AIPerceptionComponent::MinVisibleTime' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, SpotSenses) == 0x000340, "Member 'UP2AIPerceptionComponent::SpotSenses' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, SensitiveSenses) == 0x000390, "Member 'UP2AIPerceptionComponent::SensitiveSenses' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, IgnoredTargets) == 0x0003E0, "Member 'UP2AIPerceptionComponent::IgnoredTargets' has a wrong offset!");
static_assert(offsetof(UP2AIPerceptionComponent, IgnoredStimuli) == 0x000430, "Member 'UP2AIPerceptionComponent::IgnoredStimuli' has a wrong offset!");

// Class AICommon.StageCondition
// 0x0008 (0x0030 - 0x0028)
class UStageCondition final : public UAttackStageCondition
{
public:
	int8                                          PreviousStages;                                    // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StageCondition">();
	}
	static class UStageCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStageCondition>();
	}
};
static_assert(alignof(UStageCondition) == 0x000008, "Wrong alignment on UStageCondition");
static_assert(sizeof(UStageCondition) == 0x000030, "Wrong size on UStageCondition");
static_assert(offsetof(UStageCondition, PreviousStages) == 0x000028, "Member 'UStageCondition::PreviousStages' has a wrong offset!");

// Class AICommon.MatchPreviousPoseCondition
// 0x0018 (0x0040 - 0x0028)
class UMatchPreviousPoseCondition final : public UAttackStageCondition
{
public:
	float                                         PoseMatchingTolerance;                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoreBones;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MatchPreviousPoseCondition">();
	}
	static class UMatchPreviousPoseCondition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMatchPreviousPoseCondition>();
	}
};
static_assert(alignof(UMatchPreviousPoseCondition) == 0x000008, "Wrong alignment on UMatchPreviousPoseCondition");
static_assert(sizeof(UMatchPreviousPoseCondition) == 0x000040, "Wrong size on UMatchPreviousPoseCondition");
static_assert(offsetof(UMatchPreviousPoseCondition, PoseMatchingTolerance) == 0x000028, "Member 'UMatchPreviousPoseCondition::PoseMatchingTolerance' has a wrong offset!");
static_assert(offsetof(UMatchPreviousPoseCondition, IgnoreBones) == 0x000030, "Member 'UMatchPreviousPoseCondition::IgnoreBones' has a wrong offset!");

// Class AICommon.EnvQueryGenerator_SentryReachable
// 0x0038 (0x0088 - 0x0050)
class UEnvQueryGenerator_SentryReachable final : public UEnvQueryGenerator
{
public:
	struct FAIDataProviderFloatValue              AngleStep;                                         // 0x0050(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryGenerator_SentryReachable">();
	}
	static class UEnvQueryGenerator_SentryReachable* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_SentryReachable>();
	}
};
static_assert(alignof(UEnvQueryGenerator_SentryReachable) == 0x000008, "Wrong alignment on UEnvQueryGenerator_SentryReachable");
static_assert(sizeof(UEnvQueryGenerator_SentryReachable) == 0x000088, "Wrong size on UEnvQueryGenerator_SentryReachable");
static_assert(offsetof(UEnvQueryGenerator_SentryReachable, AngleStep) == 0x000050, "Member 'UEnvQueryGenerator_SentryReachable::AngleStep' has a wrong offset!");

// Class AICommon.P2AbilityNavLinkComponent
// 0x0008 (0x01F8 - 0x01F0)
class UP2AbilityNavLinkComponent final : public UNavLinkCustomComponent
{
public:
	TSubclassOf<class UP2NpcAbility_UseNavLink>   AbilityToUse;                                      // 0x01F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityNavLinkComponent">();
	}
	static class UP2AbilityNavLinkComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityNavLinkComponent>();
	}
};
static_assert(alignof(UP2AbilityNavLinkComponent) == 0x000008, "Wrong alignment on UP2AbilityNavLinkComponent");
static_assert(sizeof(UP2AbilityNavLinkComponent) == 0x0001F8, "Wrong size on UP2AbilityNavLinkComponent");
static_assert(offsetof(UP2AbilityNavLinkComponent, AbilityToUse) == 0x0001F0, "Member 'UP2AbilityNavLinkComponent::AbilityToUse' has a wrong offset!");

// Class AICommon.P2AbilityNavLinkProxy
// 0x0000 (0x0300 - 0x0300)
class AP2AbilityNavLinkProxy final : public ANavLinkProxy
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityNavLinkProxy">();
	}
	static class AP2AbilityNavLinkProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2AbilityNavLinkProxy>();
	}
};
static_assert(alignof(AP2AbilityNavLinkProxy) == 0x000008, "Wrong alignment on AP2AbilityNavLinkProxy");
static_assert(sizeof(AP2AbilityNavLinkProxy) == 0x000300, "Wrong size on AP2AbilityNavLinkProxy");

// Class AICommon.P2AbilityTask_AimCharge
// 0x0010 (0x0090 - 0x0080)
class UP2AbilityTask_AimCharge final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_AimCharge">();
	}
	static class UP2AbilityTask_AimCharge* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_AimCharge>();
	}
};
static_assert(alignof(UP2AbilityTask_AimCharge) == 0x000008, "Wrong alignment on UP2AbilityTask_AimCharge");
static_assert(sizeof(UP2AbilityTask_AimCharge) == 0x000090, "Wrong size on UP2AbilityTask_AimCharge");

// Class AICommon.P2AbilityTask_AnimLayer
// 0x0008 (0x0088 - 0x0080)
class UP2AbilityTask_AnimLayer : public UAbilityTask
{
public:
	TSubclassOf<class UAnimInstance>              AnimLayer;                                         // 0x0080(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_AnimLayer">();
	}
	static class UP2AbilityTask_AnimLayer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_AnimLayer>();
	}
};
static_assert(alignof(UP2AbilityTask_AnimLayer) == 0x000008, "Wrong alignment on UP2AbilityTask_AnimLayer");
static_assert(sizeof(UP2AbilityTask_AnimLayer) == 0x000088, "Wrong size on UP2AbilityTask_AnimLayer");
static_assert(offsetof(UP2AbilityTask_AnimLayer, AnimLayer) == 0x000080, "Member 'UP2AbilityTask_AnimLayer::AnimLayer' has a wrong offset!");

// Class AICommon.P2StasisAnimationsData
// 0x0030 (0x0060 - 0x0030)
class UP2StasisAnimationsData final : public UPrimaryDataAsset
{
public:
	class UAnimSequenceBase*                      SleepingSequence;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      AwakeningSequence;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      LookingAroundSequence;                             // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      FallingAsleepSequence;                             // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ExitingSequence;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                   HeadAimOffset;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2StasisAnimationsData">();
	}
	static class UP2StasisAnimationsData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2StasisAnimationsData>();
	}
};
static_assert(alignof(UP2StasisAnimationsData) == 0x000008, "Wrong alignment on UP2StasisAnimationsData");
static_assert(sizeof(UP2StasisAnimationsData) == 0x000060, "Wrong size on UP2StasisAnimationsData");
static_assert(offsetof(UP2StasisAnimationsData, SleepingSequence) == 0x000030, "Member 'UP2StasisAnimationsData::SleepingSequence' has a wrong offset!");
static_assert(offsetof(UP2StasisAnimationsData, AwakeningSequence) == 0x000038, "Member 'UP2StasisAnimationsData::AwakeningSequence' has a wrong offset!");
static_assert(offsetof(UP2StasisAnimationsData, LookingAroundSequence) == 0x000040, "Member 'UP2StasisAnimationsData::LookingAroundSequence' has a wrong offset!");
static_assert(offsetof(UP2StasisAnimationsData, FallingAsleepSequence) == 0x000048, "Member 'UP2StasisAnimationsData::FallingAsleepSequence' has a wrong offset!");
static_assert(offsetof(UP2StasisAnimationsData, ExitingSequence) == 0x000050, "Member 'UP2StasisAnimationsData::ExitingSequence' has a wrong offset!");
static_assert(offsetof(UP2StasisAnimationsData, HeadAimOffset) == 0x000058, "Member 'UP2StasisAnimationsData::HeadAimOffset' has a wrong offset!");

// Class AICommon.P2BTDecorator_Cooldown
// 0x0008 (0x0078 - 0x0070)
class UP2BTDecorator_Cooldown final : public UBTDecorator_Cooldown
{
public:
	float                                         RandomDeviation;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_Cooldown">();
	}
	static class UP2BTDecorator_Cooldown* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_Cooldown>();
	}
};
static_assert(alignof(UP2BTDecorator_Cooldown) == 0x000008, "Wrong alignment on UP2BTDecorator_Cooldown");
static_assert(sizeof(UP2BTDecorator_Cooldown) == 0x000078, "Wrong size on UP2BTDecorator_Cooldown");
static_assert(offsetof(UP2BTDecorator_Cooldown, RandomDeviation) == 0x000070, "Member 'UP2BTDecorator_Cooldown::RandomDeviation' has a wrong offset!");

// Class AICommon.P2AbilityTask_AnimLayer_Rassler
// 0x0040 (0x00C8 - 0x0088)
class UP2AbilityTask_AnimLayer_Rassler final : public UP2AbilityTask_AnimLayer
{
public:
	float                                         DetectionGaugeValue;                               // 0x0088(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAroundMontageTime;                             // 0x008C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExitMontageTime;                                   // 0x0090(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
