#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AICommon

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "Game_structs.hpp"
#include "Mercuna_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// Enum AICommon.EDoorLinkState
// NumValues: 0x0003
enum class EDoorLinkState : uint8
{
	Closed                                   = 0,
	Opened                                   = 1,
	EDoorLinkState_MAX                       = 2,
};

// Enum AICommon.EP2_Stalker_State
// NumValues: 0x0004
enum class EP2_Stalker_State : uint8
{
	Stalking                                 = 0,
	Attacking                                = 1,
	Fleeing                                  = 2,
	EP2_Stalker_MAX                          = 3,
};

// Enum AICommon.EP2GroupRoe
// NumValues: 0x0003
enum class EP2GroupRoe : uint8
{
	HoldFire                                 = 0,
	OpenFire                                 = 1,
	Max                                      = 2,
};

// Enum AICommon.EP2GroupFormation
// NumValues: 0x0005
enum class EP2GroupFormation : uint8
{
	Column                                   = 0,
	Wedge                                    = 1,
	Line                                     = 2,
	Crowd                                    = 3,
	Max                                      = 4,
};

// Enum AICommon.EP2NpcSpawningExclusionType
// NumValues: 0x0005
enum class EP2NpcSpawningExclusionType : uint8
{
	Both                                     = 0,
	InnerRadius                              = 1,
	OuterRadius                              = 2,
	None                                     = 3,
	EP2NpcSpawningExclusionType_MAX          = 4,
};

// Enum AICommon.EP2PerceptionAlertedLevelType
// NumValues: 0x0005
enum class EP2PerceptionAlertedLevelType : uint8
{
	Relaxed                                  = 0,
	Investigating                            = 1,
	Seeking                                  = 2,
	Engaging                                 = 3,
	MAX                                      = 4,
};

// Enum AICommon.ETickDebugMode
// NumValues: 0x0004
enum class ETickDebugMode : uint8
{
	Off                                      = 0,
	Server                                   = 1,
	Client                                   = 2,
	ETickDebugMode_MAX                       = 3,
};

// Enum AICommon.EAngleCalculationType
// NumValues: 0x0004
enum class EAngleCalculationType : uint8
{
	Horizontal                               = 0,
	Vertical                                 = 1,
	Any                                      = 2,
	EAngleCalculationType_MAX                = 3,
};

// Enum AICommon.EP2RasslerStasisState
// NumValues: 0x0006
enum class EP2RasslerStasisState : uint8
{
	Sleeping                                 = 0,
	Awakening                                = 1,
	LookingAround                            = 2,
	FallingAsleep                            = 3,
	Exiting                                  = 4,
	EP2RasslerStasisState_MAX                = 5,
};

// Enum AICommon.EP2AICoverState
// NumValues: 0x0004
enum class EP2AICoverState : uint8
{
	None                                     = 0,
	Assigned                                 = 1,
	Occupied                                 = 2,
	EP2AICoverState_MAX                      = 3,
};

// Enum AICommon.EP2AICoverGenerationType
// NumValues: 0x0004
enum class EP2AICoverGenerationType : uint8
{
	Cover                                    = 0,
	Concealment                              = 1,
	All                                      = 2,
	EP2AICoverGenerationType_MAX             = 3,
};

// Enum AICommon.EP2EnvTestDamageQuery
// NumValues: 0x0003
enum class EP2EnvTestDamageQuery : uint8
{
	DamageReceived                           = 0,
	DamageCaused                             = 1,
	EP2EnvTestDamageQuery_MAX                = 2,
};

// Enum AICommon.EP2AIMobilityType
// NumValues: 0x0004
enum class EP2AIMobilityType : uint8
{
	Any                                      = 0,
	Static                                   = 1,
	Dynamic                                  = 2,
	EP2AIMobilityType_MAX                    = 3,
};

// Enum AICommon.EP2NPCPriority
// NumValues: 0x0006
enum class EP2NPCPriority : uint8
{
	EP2NPCPriority_Critical                  = 0,
	EP2NPCPriority_High                      = 1,
	EP2NPCPriority_Normal                    = 2,
	EP2NPCPriority_Low                       = 3,
	EP2NPCPriority_NUM                       = 4,
	EP2NPCPriority_MAX                       = 5,
};

// Enum AICommon.EP2AttackTicketRequestResult
// NumValues: 0x0004
enum class EP2AttackTicketRequestResult : uint8
{
	Granted                                  = 0,
	NotGranted                               = 1,
	Error                                    = 2,
	EP2AttackTicketRequestResult_MAX         = 3,
};

// Enum AICommon.EP2BruteLungState
// NumValues: 0x0004
enum class EP2BruteLungState : uint8
{
	Open                                     = 0,
	Closed                                   = 1,
	PusBurst                                 = 2,
	EP2BruteLungState_MAX                    = 3,
};

// Enum AICommon.EP2DistanceCheckType
// NumValues: 0x0004
enum class EP2DistanceCheckType : uint8
{
	Distance3D                               = 0,
	Distance2D                               = 1,
	DistanceZ                                = 2,
	EP2DistanceCheckType_MAX                 = 3,
};

// Enum AICommon.EGroupRole
// NumValues: 0x0004
enum class EGroupRole : uint8
{
	None                                     = 0,
	Follower                                 = 1,
	Leader                                   = 2,
	EGroupRole_MAX                           = 3,
};

// Enum AICommon.EP2PathQueryType
// NumValues: 0x0003
enum class EP2PathQueryType : uint8
{
	NavmeshRaycast2D                         = 0,
	RegularPathFinding                       = 1,
	EP2PathQueryType_MAX                     = 2,
};

// Enum AICommon.ELookupArea
// NumValues: 0x0004
enum class ELookupArea : uint32
{
	InnerRadius                              = 0,
	OuterRadiusExcludingInner                = 1,
	OutsideInnerRadius                       = 2,
	ELookupArea_MAX                          = 3,
};

// Enum AICommon.EP2AICoverStatus
// NumValues: 0x0006
enum class EP2AICoverStatus : uint8
{
	None                                     = 0,
	Hidden                                   = 1,
	Forward                                  = 2,
	Right                                    = 3,
	Left                                     = 4,
	EP2AICoverStatus_MAX                     = 5,
};

// Enum AICommon.EPBlackboardClearTargetBehavior
// NumValues: 0x0004
enum class EPBlackboardClearTargetBehavior : uint32
{
	DoNothing                                = 0,
	ClearAll                                 = 1,
	ClearTargetActorOnly                     = 2,
	EPBlackboardClearTargetBehavior_MAX      = 3,
};

// Enum AICommon.EAbilityStatus
// NumValues: 0x0007
enum class EAbilityStatus : uint8
{
	None                                     = 0,
	Failed                                   = 1,
	Succeeded                                = 2,
	InProgress                               = 3,
	Canceling                                = 4,
	Canceled                                 = 5,
	EAbilityStatus_MAX                       = 6,
};

// Enum AICommon.EComparisonType
// NumValues: 0x0006
enum class EComparisonType : uint32
{
	GreaterThan                              = 0,
	Equal                                    = 1,
	LessThan                                 = 2,
	GreaterOrEqualThan                       = 3,
	LessOrEqualThan                          = 4,
	EComparisonType_MAX                      = 5,
};

// Enum AICommon.EP2DistanceConditionType
// NumValues: 0x0004
enum class EP2DistanceConditionType : uint8
{
	Distance3D                               = 0,
	Distance2D                               = 1,
	DistanceZ                                = 2,
	EP2DistanceConditionType_MAX             = 3,
};

// Enum AICommon.EP2CrocSnapAttackAlignementAnchor
// NumValues: 0x0004
enum class EP2CrocSnapAttackAlignementAnchor : uint8
{
	A                                        = 0,
	B                                        = 1,
	MidPoint                                 = 2,
	EP2CrocSnapAttackAlignementAnchor_MAX    = 3,
};

// Enum AICommon.EP2EnvQueryTest_NavRaycast_Direction
// NumValues: 0x0003
enum class EP2EnvQueryTest_NavRaycast_Direction : uint8
{
	ContextToItem                            = 0,
	ItemToContext                            = 1,
	EP2EnvQueryTest_NavRaycast_MAX           = 2,
};

// Enum AICommon.EP2AccuracyPenaltyType
// NumValues: 0x0003
enum class EP2AccuracyPenaltyType : uint8
{
	TargetHit                                = 0,
	ShotFired                                = 1,
	EP2AccuracyPenaltyType_MAX               = 2,
};

// Enum AICommon.EP2CapsuleSection
// NumValues: 0x0005
enum class EP2CapsuleSection : uint8
{
	Top                                      = 0,
	Middle                                   = 1,
	Bottom                                   = 2,
	CQC                                      = 3,
	EP2CapsuleSection_MAX                    = 4,
};

// Enum AICommon.EP2JumpLinkGeneratorType
// NumValues: 0x0003
enum class EP2JumpLinkGeneratorType : uint8
{
	StaticMesh                               = 0,
	Actor                                    = 1,
	EP2JumpLinkGeneratorType_MAX             = 2,
};

// Enum AICommon.EP2CondCompositionType
// NumValues: 0x0003
enum class EP2CondCompositionType : uint8
{
	AND                                      = 0,
	OR                                       = 1,
	EP2CondCompositionType_MAX               = 2,
};

// Enum AICommon.EP2MercunaNavLinkTraversalType
// NumValues: 0x0006
enum class EP2MercunaNavLinkTraversalType : uint8
{
	None                                     = 0,
	Ground                                   = 1,
	Vault                                    = 2,
	HighVault                                = 3,
	Unreachable                              = 4,
	EP2MercunaNavLinkTraversalType_MAX       = 5,
};

// Enum AICommon.EP2MercunaNavLinkEntryLocation
// NumValues: 0x0003
enum class EP2MercunaNavLinkEntryLocation : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	EP2MercunaNavLinkEntryLocation_MAX       = 2,
};

// Enum AICommon.EP2BombugMeleeDiveState
// NumValues: 0x0008
enum class EP2BombugMeleeDiveState : uint8
{
	Preparation                              = 0,
	Dive                                     = 1,
	Climb                                    = 2,
	ExitMiss                                 = 3,
	HitDelay                                 = 4,
	ExitHit                                  = 5,
	Finish                                   = 6,
	EP2BombugMeleeDiveState_MAX              = 7,
};

// Enum AICommon.EP2CrocSnapAttackState
// NumValues: 0x0006
enum class EP2CrocSnapAttackState : uint8
{
	Reaching                                 = 0,
	Snapping                                 = 1,
	Snapped                                  = 2,
	Releasing                                = 3,
	Missing                                  = 4,
	EP2CrocSnapAttackState_MAX               = 5,
};

// Enum AICommon.EDoorsAttackSelectionType
// NumValues: 0x0003
enum class EDoorsAttackSelectionType : uint8
{
	Random                                   = 0,
	Sequential                               = 1,
	EDoorsAttackSelectionType_MAX            = 2,
};

// Enum AICommon.EP2AttackStage
// NumValues: 0x0006
enum class EP2AttackStage : uint8
{
	None                                     = 0,
	Activation                               = 2,
	Telegraph                                = 4,
	Attack                                   = 8,
	Recovery                                 = 16,
	EP2AttackStage_MAX                       = 17,
};

// Enum AICommon.EP2TargetingType
// NumValues: 0x0004
enum class EP2TargetingType : uint8
{
	CalcTargetAtSpawn                        = 0,
	LineInTargetMovementDir                  = 1,
	CustomLocation                           = 2,
	EP2TargetingType_MAX                     = 3,
};

// Enum AICommon.EP2WildCatTreeState
// NumValues: 0x000A
enum class EP2WildCatTreeState : uint8
{
	ClimbingUp                               = 0,
	Idle                                     = 1,
	ClimbingDown                             = 2,
	ClimbingDownLanded                       = 3,
	Attacking                                = 4,
	AttackLanded                             = 5,
	JumpingDown                              = 6,
	JumpingDownLanded                        = 7,
	Default                                  = 8,
	EP2WildCatTreeState_MAX                  = 9,
};

// Enum AICommon.ENpcDebugMovementType
// NumValues: 0x0005
enum class ENpcDebugMovementType : uint8
{
	Cyclic                                   = 0,
	StopAtEnd                                = 1,
	TeleportToStart                          = 2,
	OneLocation                              = 3,
	MAX                                      = 4,
};

// Enum AICommon.EP2NpcSpawningNavTrace
// NumValues: 0x0003
enum class EP2NpcSpawningNavTrace : uint8
{
	Circle                                   = 0,
	Volume                                   = 1,
	EP2NpcSpawningNavTrace_MAX               = 2,
};

// Enum AICommon.EPassageState
// NumValues: 0x0003
enum class EPassageState : uint8
{
	Closed                                   = 0,
	Open                                     = 1,
	EPassageState_MAX                        = 2,
};

// Enum AICommon.EP2MovementTrackerState
// NumValues: 0x0004
enum class EP2MovementTrackerState : uint8
{
	None                                     = 0,
	Jumping                                  = 1,
	Vaulting                                 = 2,
	EP2MovementTrackerState_MAX              = 3,
};

// Enum AICommon.EP2RootMotionTargetOffsetType
// NumValues: 0x0003
enum class EP2RootMotionTargetOffsetType : uint8
{
	Default                                  = 0,
	Tangent                                  = 1,
	EP2RootMotionTargetOffsetType_MAX        = 2,
};

// Enum AICommon.EP2RootMotionWarpingType
// NumValues: 0x0007
enum class EP2RootMotionWarpingType : uint8
{
	Default                                  = 0,
	RotateTarget                             = 1,
	ProjectTarget                            = 2,
	NoProjection                             = 3,
	NoRotation                               = 4,
	OnlyRotationWarping                      = 5,
	EP2RootMotionWarpingType_MAX             = 6,
};

// Enum AICommon.EP2RootMotionTargetType
// NumValues: 0x0004
enum class EP2RootMotionTargetType : uint8
{
	Actor                                    = 0,
	Location                                 = 1,
	NotSet                                   = 2,
	EP2RootMotionTargetType_MAX              = 3,
};

// Enum AICommon.EP2LureGrenadeState
// NumValues: 0x0004
enum class EP2LureGrenadeState : uint8
{
	None                                     = 0,
	Attract                                  = 1,
	Repel                                    = 2,
	EP2LureGrenadeState_MAX                  = 3,
};

// ScriptStruct AICommon.MovementModeOverride
// 0x0038 (0x0038 - 0x0000)
struct FMovementModeOverride final
{
public:
	float                                         Priority;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Source;                                            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMovementModeOverride) == 0x000008, "Wrong alignment on FMovementModeOverride");
static_assert(sizeof(FMovementModeOverride) == 0x000038, "Wrong size on FMovementModeOverride");
static_assert(offsetof(FMovementModeOverride, Priority) == 0x000000, "Member 'FMovementModeOverride::Priority' has a wrong offset!");
static_assert(offsetof(FMovementModeOverride, Source) == 0x000008, "Member 'FMovementModeOverride::Source' has a wrong offset!");

// ScriptStruct AICommon.P2MovementModeStack
// 0x00A8 (0x00A8 - 0x0000)
struct FP2MovementModeStack final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovementModeOverride                  ActiveOverride;                                    // 0x0018(0x0038)(NativeAccessSpecifierPrivate)
	TMap<int32, struct FMovementModeOverride>     Overrides;                                         // 0x0050(0x0050)(NativeAccessSpecifierPrivate)
	int32                                         NextHandle;                                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2MovementModeStack) == 0x000008, "Wrong alignment on FP2MovementModeStack");
static_assert(sizeof(FP2MovementModeStack) == 0x0000A8, "Wrong size on FP2MovementModeStack");
static_assert(offsetof(FP2MovementModeStack, ActiveOverride) == 0x000018, "Member 'FP2MovementModeStack::ActiveOverride' has a wrong offset!");
static_assert(offsetof(FP2MovementModeStack, Overrides) == 0x000050, "Member 'FP2MovementModeStack::Overrides' has a wrong offset!");
static_assert(offsetof(FP2MovementModeStack, NextHandle) == 0x0000A0, "Member 'FP2MovementModeStack::NextHandle' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningSpawnedCreature
// 0x0050 (0x0050 - 0x0000)
struct FP2NpcSpawningSpawnedCreature final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Location;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0018(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2NpcSpawningSpawnedCreature) == 0x000008, "Wrong alignment on FP2NpcSpawningSpawnedCreature");
static_assert(sizeof(FP2NpcSpawningSpawnedCreature) == 0x000050, "Wrong size on FP2NpcSpawningSpawnedCreature");
static_assert(offsetof(FP2NpcSpawningSpawnedCreature, Tag) == 0x000000, "Member 'FP2NpcSpawningSpawnedCreature::Tag' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningSpawnedCreature, Location) == 0x000008, "Member 'FP2NpcSpawningSpawnedCreature::Location' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningSpawnedCreature, Icon) == 0x000018, "Member 'FP2NpcSpawningSpawnedCreature::Icon' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningSpawnedCreature, Size) == 0x000048, "Member 'FP2NpcSpawningSpawnedCreature::Size' has a wrong offset!");

// ScriptStruct AICommon.P2NpcGroupSpawningRespawn
// 0x0050 (0x0050 - 0x0000)
struct FP2NpcGroupSpawningRespawn final
{
public:
	TSubclassOf<class AP2NpcGroupSpawner>         RespawnerClass;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckAlivePlayers;                                // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         GroupsPerPlayerCountSF;                            // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FIntPoint                              Range;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeCurrentGroups;                             // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutsideAnomaly;                                   // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2NpcGroupData*                        NpcGroupData;                                      // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcGroupSpawningRespawn) == 0x000008, "Wrong alignment on FP2NpcGroupSpawningRespawn");
static_assert(sizeof(FP2NpcGroupSpawningRespawn) == 0x000050, "Wrong size on FP2NpcGroupSpawningRespawn");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, RespawnerClass) == 0x000000, "Member 'FP2NpcGroupSpawningRespawn::RespawnerClass' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, bCheckAlivePlayers) == 0x000008, "Member 'FP2NpcGroupSpawningRespawn::bCheckAlivePlayers' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, GroupsPerPlayerCountSF) == 0x000010, "Member 'FP2NpcGroupSpawningRespawn::GroupsPerPlayerCountSF' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, Range) == 0x000038, "Member 'FP2NpcGroupSpawningRespawn::Range' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, bIncludeCurrentGroups) == 0x000040, "Member 'FP2NpcGroupSpawningRespawn::bIncludeCurrentGroups' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, bOutsideAnomaly) == 0x000041, "Member 'FP2NpcGroupSpawningRespawn::bOutsideAnomaly' has a wrong offset!");
static_assert(offsetof(FP2NpcGroupSpawningRespawn, NpcGroupData) == 0x000048, "Member 'FP2NpcGroupSpawningRespawn::NpcGroupData' has a wrong offset!");

// ScriptStruct AICommon.P2CollectStateInfoTask
// 0x0000 (0x0020 - 0x0020)
struct FP2CollectStateInfoTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FP2CollectStateInfoTask) == 0x000008, "Wrong alignment on FP2CollectStateInfoTask");
static_assert(sizeof(FP2CollectStateInfoTask) == 0x000020, "Wrong size on FP2CollectStateInfoTask");

// ScriptStruct AICommon.P2NpcSpawningGeneratedPoint
// 0x0010 (0x0010 - 0x0000)
struct FP2NpcSpawningGeneratedPoint final
{
public:
	struct FIntPoint                              Position;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcSpawningGeneratedPoint) == 0x000004, "Wrong alignment on FP2NpcSpawningGeneratedPoint");
static_assert(sizeof(FP2NpcSpawningGeneratedPoint) == 0x000010, "Wrong size on FP2NpcSpawningGeneratedPoint");
static_assert(offsetof(FP2NpcSpawningGeneratedPoint, Position) == 0x000000, "Member 'FP2NpcSpawningGeneratedPoint::Position' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGeneratedPoint, Color) == 0x000008, "Member 'FP2NpcSpawningGeneratedPoint::Color' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGeneratedPoint, Radius) == 0x00000C, "Member 'FP2NpcSpawningGeneratedPoint::Radius' has a wrong offset!");

// ScriptStruct AICommon.P2ActivateAbilityTask
// 0x0000 (0x0020 - 0x0020)
struct FP2ActivateAbilityTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FP2ActivateAbilityTask) == 0x000008, "Wrong alignment on FP2ActivateAbilityTask");
static_assert(sizeof(FP2ActivateAbilityTask) == 0x000020, "Wrong size on FP2ActivateAbilityTask");

// ScriptStruct AICommon.P2ReplicatedProperty_SentryTarget
// 0x0024 (0x0028 - 0x0004)
struct alignas(0x08) FP2ReplicatedProperty_SentryTarget final : public FP2ReplicatedProperty
{
public:
	uint8                                         Pad_4[0x24];                                       // 0x0004(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2ReplicatedProperty_SentryTarget) == 0x000008, "Wrong alignment on FP2ReplicatedProperty_SentryTarget");
static_assert(sizeof(FP2ReplicatedProperty_SentryTarget) == 0x000028, "Wrong size on FP2ReplicatedProperty_SentryTarget");

// ScriptStruct AICommon.P2BaseConditionInstanceData
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FP2BaseConditionInstanceData
{
};
#pragma pack(pop)
static_assert(alignof(FP2BaseConditionInstanceData) == 0x000001, "Wrong alignment on FP2BaseConditionInstanceData");
static_assert(sizeof(FP2BaseConditionInstanceData) == 0x000001, "Wrong size on FP2BaseConditionInstanceData");

// ScriptStruct AICommon.P2CompareEnumConditionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FP2CompareEnumConditionInstanceData final : public FP2BaseConditionInstanceData
{
public:
	struct FStateTreeAnyEnum                      Left;                                              // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FStateTreeAnyEnum                      Right;                                             // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2CompareEnumConditionInstanceData) == 0x000008, "Wrong alignment on FP2CompareEnumConditionInstanceData");
static_assert(sizeof(FP2CompareEnumConditionInstanceData) == 0x000020, "Wrong size on FP2CompareEnumConditionInstanceData");
static_assert(offsetof(FP2CompareEnumConditionInstanceData, Left) == 0x000000, "Member 'FP2CompareEnumConditionInstanceData::Left' has a wrong offset!");
static_assert(offsetof(FP2CompareEnumConditionInstanceData, Right) == 0x000010, "Member 'FP2CompareEnumConditionInstanceData::Right' has a wrong offset!");

// ScriptStruct AICommon.P2RunEqsQueryTask
// 0x0000 (0x0020 - 0x0020)
struct FP2RunEqsQueryTask : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FP2RunEqsQueryTask) == 0x000008, "Wrong alignment on FP2RunEqsQueryTask");
static_assert(sizeof(FP2RunEqsQueryTask) == 0x000020, "Wrong size on FP2RunEqsQueryTask");

// ScriptStruct AICommon.BaseEvaluatorInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FBaseEvaluatorInstanceData
{
public:
	float                                         TickRemainingTime;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBaseEvaluatorInstanceData) == 0x000004, "Wrong alignment on FBaseEvaluatorInstanceData");
static_assert(sizeof(FBaseEvaluatorInstanceData) == 0x000004, "Wrong size on FBaseEvaluatorInstanceData");
static_assert(offsetof(FBaseEvaluatorInstanceData, TickRemainingTime) == 0x000000, "Member 'FBaseEvaluatorInstanceData::TickRemainingTime' has a wrong offset!");

// ScriptStruct AICommon.CachedNoisyEvent
// 0x0008 (0x0008 - 0x0000)
struct FCachedNoisyEvent final
{
public:
	double                                        Timestamp;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCachedNoisyEvent) == 0x000008, "Wrong alignment on FCachedNoisyEvent");
static_assert(sizeof(FCachedNoisyEvent) == 0x000008, "Wrong size on FCachedNoisyEvent");
static_assert(offsetof(FCachedNoisyEvent, Timestamp) == 0x000000, "Member 'FCachedNoisyEvent::Timestamp' has a wrong offset!");

// ScriptStruct AICommon.NoiseEvaluatorInstanceData
// 0x001C (0x0020 - 0x0004)
struct FNoiseEvaluatorInstanceData final : public FBaseEvaluatorInstanceData
{
public:
	int32                                         NoisyEvents;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCachedNoisyEvent>              Events;                                            // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNoiseEvaluatorInstanceData) == 0x000008, "Wrong alignment on FNoiseEvaluatorInstanceData");
static_assert(sizeof(FNoiseEvaluatorInstanceData) == 0x000020, "Wrong size on FNoiseEvaluatorInstanceData");
static_assert(offsetof(FNoiseEvaluatorInstanceData, NoisyEvents) == 0x000004, "Member 'FNoiseEvaluatorInstanceData::NoisyEvents' has a wrong offset!");
static_assert(offsetof(FNoiseEvaluatorInstanceData, Events) == 0x000008, "Member 'FNoiseEvaluatorInstanceData::Events' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningCreature
// 0x0060 (0x0060 - 0x0000)
struct FP2NpcSpawningCreature final
{
public:
	struct FGameplayTagContainer                  Tags;                                              // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FIntPoint                              Range;                                             // 0x0020(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0030(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcSpawningCreature) == 0x000008, "Wrong alignment on FP2NpcSpawningCreature");
static_assert(sizeof(FP2NpcSpawningCreature) == 0x000060, "Wrong size on FP2NpcSpawningCreature");
static_assert(offsetof(FP2NpcSpawningCreature, Tags) == 0x000000, "Member 'FP2NpcSpawningCreature::Tags' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCreature, Range) == 0x000020, "Member 'FP2NpcSpawningCreature::Range' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCreature, Probability) == 0x000028, "Member 'FP2NpcSpawningCreature::Probability' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCreature, Icon) == 0x000030, "Member 'FP2NpcSpawningCreature::Icon' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningCosmetic
// 0x0020 (0x0020 - 0x0000)
struct FP2NpcSpawningCosmetic final
{
public:
	TSubclassOf<class AP2NpcSpawningCosmeticActor> CosmeticClass;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              Range;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMercunaGroundAgentType                AgentType;                                         // 0x0010(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2NpcSpawningCosmetic) == 0x000008, "Wrong alignment on FP2NpcSpawningCosmetic");
static_assert(sizeof(FP2NpcSpawningCosmetic) == 0x000020, "Wrong size on FP2NpcSpawningCosmetic");
static_assert(offsetof(FP2NpcSpawningCosmetic, CosmeticClass) == 0x000000, "Member 'FP2NpcSpawningCosmetic::CosmeticClass' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCosmetic, Range) == 0x000008, "Member 'FP2NpcSpawningCosmetic::Range' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCosmetic, AgentType) == 0x000010, "Member 'FP2NpcSpawningCosmetic::AgentType' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningGroup
// 0x0050 (0x0058 - 0x0008)
struct FP2NpcSpawningGroup final : public FTableRowBase
{
public:
	struct FGameplayTag                           Zone;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Distributions;                                     // 0x0010(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2NpcSpawningExclusionType                   ExclusionType;                                     // 0x0034(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2NpcSpawningCreature>         Creatures;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FP2NpcSpawningCosmetic>         Cosmetics;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcSpawningGroup) == 0x000008, "Wrong alignment on FP2NpcSpawningGroup");
static_assert(sizeof(FP2NpcSpawningGroup) == 0x000058, "Wrong size on FP2NpcSpawningGroup");
static_assert(offsetof(FP2NpcSpawningGroup, Zone) == 0x000008, "Member 'FP2NpcSpawningGroup::Zone' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGroup, Distributions) == 0x000010, "Member 'FP2NpcSpawningGroup::Distributions' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGroup, Weight) == 0x000030, "Member 'FP2NpcSpawningGroup::Weight' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGroup, ExclusionType) == 0x000034, "Member 'FP2NpcSpawningGroup::ExclusionType' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGroup, Creatures) == 0x000038, "Member 'FP2NpcSpawningGroup::Creatures' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningGroup, Cosmetics) == 0x000048, "Member 'FP2NpcSpawningGroup::Cosmetics' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningRespawn
// 0x0020 (0x0020 - 0x0000)
struct FP2NpcSpawningRespawn final
{
public:
	struct FIntPoint                              Range;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeCurrentGroups;                             // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2NpcSpawningGroup>            Groups;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcSpawningRespawn) == 0x000008, "Wrong alignment on FP2NpcSpawningRespawn");
static_assert(sizeof(FP2NpcSpawningRespawn) == 0x000020, "Wrong size on FP2NpcSpawningRespawn");
static_assert(offsetof(FP2NpcSpawningRespawn, Range) == 0x000000, "Member 'FP2NpcSpawningRespawn::Range' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningRespawn, bIncludeCurrentGroups) == 0x000008, "Member 'FP2NpcSpawningRespawn::bIncludeCurrentGroups' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningRespawn, Groups) == 0x000010, "Member 'FP2NpcSpawningRespawn::Groups' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningCell
// 0x0118 (0x0118 - 0x0000)
struct FP2NpcSpawningCell final
{
public:
	uint8                                         ZoneIndex;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 DistributionIndexes;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Density;                                           // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Zone;                                              // 0x001C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FColor>      Distribution;                                      // 0x0028(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FIntPoint                              Coordinate;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ZoneMinDistanceRange;                              // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SelectedDistribution;                              // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AliveNpcNum;                                       // 0x0098(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NpcGroupSize;                                      // 0x009C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bExcludeAll;                                       // 0x00A0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, int32>              BlacklistedTags;                                   // 0x00A8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  SpawnedTags;                                       // 0x00F8(0x0020)(Transient, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FP2NpcSpawningCell) == 0x000008, "Wrong alignment on FP2NpcSpawningCell");
static_assert(sizeof(FP2NpcSpawningCell) == 0x000118, "Wrong size on FP2NpcSpawningCell");
static_assert(offsetof(FP2NpcSpawningCell, ZoneIndex) == 0x000000, "Member 'FP2NpcSpawningCell::ZoneIndex' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, DistributionIndexes) == 0x000008, "Member 'FP2NpcSpawningCell::DistributionIndexes' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, Density) == 0x000018, "Member 'FP2NpcSpawningCell::Density' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, Zone) == 0x00001C, "Member 'FP2NpcSpawningCell::Zone' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, Distribution) == 0x000028, "Member 'FP2NpcSpawningCell::Distribution' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, Coordinate) == 0x000078, "Member 'FP2NpcSpawningCell::Coordinate' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, ZoneMinDistanceRange) == 0x000080, "Member 'FP2NpcSpawningCell::ZoneMinDistanceRange' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, SelectedDistribution) == 0x000090, "Member 'FP2NpcSpawningCell::SelectedDistribution' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, AliveNpcNum) == 0x000098, "Member 'FP2NpcSpawningCell::AliveNpcNum' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, NpcGroupSize) == 0x00009C, "Member 'FP2NpcSpawningCell::NpcGroupSize' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, bExcludeAll) == 0x0000A0, "Member 'FP2NpcSpawningCell::bExcludeAll' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, BlacklistedTags) == 0x0000A8, "Member 'FP2NpcSpawningCell::BlacklistedTags' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningCell, SpawnedTags) == 0x0000F8, "Member 'FP2NpcSpawningCell::SpawnedTags' has a wrong offset!");

// ScriptStruct AICommon.CollectStateInfoTaskInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FCollectStateInfoTaskInstanceData final
{
public:
	float                                         StateTime;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCollectStateInfoTaskInstanceData) == 0x000004, "Wrong alignment on FCollectStateInfoTaskInstanceData");
static_assert(sizeof(FCollectStateInfoTaskInstanceData) == 0x000004, "Wrong size on FCollectStateInfoTaskInstanceData");
static_assert(offsetof(FCollectStateInfoTaskInstanceData, StateTime) == 0x000000, "Member 'FCollectStateInfoTaskInstanceData::StateTime' has a wrong offset!");

// ScriptStruct AICommon.P2SentryBoneConfig
// 0x0030 (0x0030 - 0x0000)
struct FP2SentryBoneConfig final
{
public:
	class FName                                   RootBoneName;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_YawHalfSwingLimit : 1;                   // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        YawHalfSwingLimit;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOverride_PitchHalfSwingLimit : 1;                 // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PitchHalfSwingLimit;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TurnRateLimit;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2SentryBoneConfig) == 0x000008, "Wrong alignment on FP2SentryBoneConfig");
static_assert(sizeof(FP2SentryBoneConfig) == 0x000030, "Wrong size on FP2SentryBoneConfig");
static_assert(offsetof(FP2SentryBoneConfig, RootBoneName) == 0x000000, "Member 'FP2SentryBoneConfig::RootBoneName' has a wrong offset!");
static_assert(offsetof(FP2SentryBoneConfig, YawHalfSwingLimit) == 0x000010, "Member 'FP2SentryBoneConfig::YawHalfSwingLimit' has a wrong offset!");
static_assert(offsetof(FP2SentryBoneConfig, PitchHalfSwingLimit) == 0x000020, "Member 'FP2SentryBoneConfig::PitchHalfSwingLimit' has a wrong offset!");
static_assert(offsetof(FP2SentryBoneConfig, TurnRateLimit) == 0x000028, "Member 'FP2SentryBoneConfig::TurnRateLimit' has a wrong offset!");

// ScriptStruct AICommon.P2MinDistanceTaskConfig
// 0x0008 (0x0008 - 0x0000)
struct FP2MinDistanceTaskConfig final
{
public:
	bool                                          bUseDistanceOverride;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceOverride;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2MinDistanceTaskConfig) == 0x000004, "Wrong alignment on FP2MinDistanceTaskConfig");
static_assert(sizeof(FP2MinDistanceTaskConfig) == 0x000008, "Wrong size on FP2MinDistanceTaskConfig");
static_assert(offsetof(FP2MinDistanceTaskConfig, bUseDistanceOverride) == 0x000000, "Member 'FP2MinDistanceTaskConfig::bUseDistanceOverride' has a wrong offset!");
static_assert(offsetof(FP2MinDistanceTaskConfig, DistanceOverride) == 0x000004, "Member 'FP2MinDistanceTaskConfig::DistanceOverride' has a wrong offset!");

// ScriptStruct AICommon.P2RunEqsQueryTaskInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FP2RunEqsQueryTaskInstanceData
{
public:
	class UEnvQuery*                              QueryTemplate;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnvQueryRunMode                              QueryRunMode;                                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunQueryOnTick;                                   // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunQueryOnStateEnter;                             // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bQueryOnTickFails;                                 // 0x000B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QueryTickInterval;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QueryTickIntervalRandom;                           // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2RunEqsQueryTaskInstanceData) == 0x000008, "Wrong alignment on FP2RunEqsQueryTaskInstanceData");
static_assert(sizeof(FP2RunEqsQueryTaskInstanceData) == 0x000018, "Wrong size on FP2RunEqsQueryTaskInstanceData");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, QueryTemplate) == 0x000000, "Member 'FP2RunEqsQueryTaskInstanceData::QueryTemplate' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, QueryRunMode) == 0x000008, "Member 'FP2RunEqsQueryTaskInstanceData::QueryRunMode' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, bRunQueryOnTick) == 0x000009, "Member 'FP2RunEqsQueryTaskInstanceData::bRunQueryOnTick' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, bRunQueryOnStateEnter) == 0x00000A, "Member 'FP2RunEqsQueryTaskInstanceData::bRunQueryOnStateEnter' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, bQueryOnTickFails) == 0x00000B, "Member 'FP2RunEqsQueryTaskInstanceData::bQueryOnTickFails' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, QueryTickInterval) == 0x00000C, "Member 'FP2RunEqsQueryTaskInstanceData::QueryTickInterval' has a wrong offset!");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData, QueryTickIntervalRandom) == 0x000010, "Member 'FP2RunEqsQueryTaskInstanceData::QueryTickIntervalRandom' has a wrong offset!");

// ScriptStruct AICommon.P2RunEqsQueryTaskInstanceData_Point
// 0x0018 (0x0030 - 0x0018)
struct FP2RunEqsQueryTaskInstanceData_Point final : public FP2RunEqsQueryTaskInstanceData
{
public:
	struct FVector                                Point;                                             // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2RunEqsQueryTaskInstanceData_Point) == 0x000008, "Wrong alignment on FP2RunEqsQueryTaskInstanceData_Point");
static_assert(sizeof(FP2RunEqsQueryTaskInstanceData_Point) == 0x000030, "Wrong size on FP2RunEqsQueryTaskInstanceData_Point");
static_assert(offsetof(FP2RunEqsQueryTaskInstanceData_Point, Point) == 0x000018, "Member 'FP2RunEqsQueryTaskInstanceData_Point::Point' has a wrong offset!");

// ScriptStruct AICommon.P2BruteRoarStatusEffectConfig
// 0x0090 (0x0090 - 0x0000)
struct FP2BruteRoarStatusEffectConfig final
{
public:
	struct FGameplayTag                           StatusEffectTag;                                   // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     StacksPerDistanceCurve;                            // 0x0008(0x0088)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2BruteRoarStatusEffectConfig) == 0x000008, "Wrong alignment on FP2BruteRoarStatusEffectConfig");
static_assert(sizeof(FP2BruteRoarStatusEffectConfig) == 0x000090, "Wrong size on FP2BruteRoarStatusEffectConfig");
static_assert(offsetof(FP2BruteRoarStatusEffectConfig, StatusEffectTag) == 0x000000, "Member 'FP2BruteRoarStatusEffectConfig::StatusEffectTag' has a wrong offset!");
static_assert(offsetof(FP2BruteRoarStatusEffectConfig, StacksPerDistanceCurve) == 0x000008, "Member 'FP2BruteRoarStatusEffectConfig::StacksPerDistanceCurve' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningMutation
// 0x0058 (0x0058 - 0x0000)
struct FP2NpcSpawningMutation final
{
public:
	struct FGameplayTag                           Zone;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FGameplayTag> FromTo;                                           // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2NpcSpawningMutation) == 0x000008, "Wrong alignment on FP2NpcSpawningMutation");
static_assert(sizeof(FP2NpcSpawningMutation) == 0x000058, "Wrong size on FP2NpcSpawningMutation");
static_assert(offsetof(FP2NpcSpawningMutation, Zone) == 0x000000, "Member 'FP2NpcSpawningMutation::Zone' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningMutation, FromTo) == 0x000008, "Member 'FP2NpcSpawningMutation::FromTo' has a wrong offset!");

// ScriptStruct AICommon.P2NpcSpawningWave
// 0x0050 (0x0058 - 0x0008)
struct FP2NpcSpawningWave final : public FTableRowBase
{
public:
	float                                         Delay;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2NpcSpawningMutation>         Mutations;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FP2NpcSpawningRespawn                  Respawns;                                          // 0x0020(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FP2NpcGroupSpawningRespawn>     NpcGroupRespawns;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2NpcSpawningWave) == 0x000008, "Wrong alignment on FP2NpcSpawningWave");
static_assert(sizeof(FP2NpcSpawningWave) == 0x000058, "Wrong size on FP2NpcSpawningWave");
static_assert(offsetof(FP2NpcSpawningWave, Delay) == 0x000008, "Member 'FP2NpcSpawningWave::Delay' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningWave, Mutations) == 0x000010, "Member 'FP2NpcSpawningWave::Mutations' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningWave, Respawns) == 0x000020, "Member 'FP2NpcSpawningWave::Respawns' has a wrong offset!");
static_assert(offsetof(FP2NpcSpawningWave, NpcGroupRespawns) == 0x000040, "Member 'FP2NpcSpawningWave::NpcGroupRespawns' has a wrong offset!");

// ScriptStruct AICommon.P2RunEqsQueryTask_Actor
// 0x0000 (0x0020 - 0x0020)
struct FP2RunEqsQueryTask_Actor final : public FP2RunEqsQueryTask
{
};
static_assert(alignof(FP2RunEqsQueryTask_Actor) == 0x000008, "Wrong alignment on FP2RunEqsQueryTask_Actor");
static_assert(sizeof(FP2RunEqsQueryTask_Actor) == 0x000020, "Wrong size on FP2RunEqsQueryTask_Actor");

// ScriptStruct AICommon.P2BaseCondition
// 0x0008 (0x0028 - 0x0020)
struct FP2BaseCondition : public FStateTreeConditionCommonBase
{
public:
	bool                                          bInvert;                                           // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2BaseCondition) == 0x000008, "Wrong alignment on FP2BaseCondition");
static_assert(sizeof(FP2BaseCondition) == 0x000028, "Wrong size on FP2BaseCondition");
static_assert(offsetof(FP2BaseCondition, bInvert) == 0x000020, "Member 'FP2BaseCondition::bInvert' has a wrong offset!");

// ScriptStruct AICommon.P2EmoteTaskRootMotionData
// 0x0030 (0x0030 - 0x0000)
struct FP2EmoteTaskRootMotionData final
{
public:
	class FName                                   RootMotionTargetName;                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 BlackboardKey;                                     // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2EmoteTaskRootMotionData) == 0x000008, "Wrong alignment on FP2EmoteTaskRootMotionData");
static_assert(sizeof(FP2EmoteTaskRootMotionData) == 0x000030, "Wrong size on FP2EmoteTaskRootMotionData");
static_assert(offsetof(FP2EmoteTaskRootMotionData, RootMotionTargetName) == 0x000000, "Member 'FP2EmoteTaskRootMotionData::RootMotionTargetName' has a wrong offset!");
static_assert(offsetof(FP2EmoteTaskRootMotionData, BlackboardKey) == 0x000008, "Member 'FP2EmoteTaskRootMotionData::BlackboardKey' has a wrong offset!");

// ScriptStruct AICommon.SavePreviousStateTaskInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FSavePreviousStateTaskInstanceData final
{
public:
	struct FStateTreeStateHandle                  PreviousState;                                     // 0x0000(0x0002)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
