#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AITestRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function AITestRuntime.P2BotMoveDeltaCommand.TaskBotMoveDelta
// 0x0038 (0x0038 - 0x0000)
struct P2BotMoveDeltaCommand_TaskBotMoveDelta final
{
public:
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DeltaVector;                                       // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptanceDistance;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2BotMoveDeltaCommand*                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotMoveDeltaCommand_TaskBotMoveDelta) == 0x000008, "Wrong alignment on P2BotMoveDeltaCommand_TaskBotMoveDelta");
static_assert(sizeof(P2BotMoveDeltaCommand_TaskBotMoveDelta) == 0x000038, "Wrong size on P2BotMoveDeltaCommand_TaskBotMoveDelta");
static_assert(offsetof(P2BotMoveDeltaCommand_TaskBotMoveDelta, TaskOwner) == 0x000000, "Member 'P2BotMoveDeltaCommand_TaskBotMoveDelta::TaskOwner' has a wrong offset!");
static_assert(offsetof(P2BotMoveDeltaCommand_TaskBotMoveDelta, DeltaVector) == 0x000010, "Member 'P2BotMoveDeltaCommand_TaskBotMoveDelta::DeltaVector' has a wrong offset!");
static_assert(offsetof(P2BotMoveDeltaCommand_TaskBotMoveDelta, AcceptanceDistance) == 0x000028, "Member 'P2BotMoveDeltaCommand_TaskBotMoveDelta::AcceptanceDistance' has a wrong offset!");
static_assert(offsetof(P2BotMoveDeltaCommand_TaskBotMoveDelta, ReturnValue) == 0x000030, "Member 'P2BotMoveDeltaCommand_TaskBotMoveDelta::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2AudioFireBotSpawner.RespawnBot
// 0x0008 (0x0008 - 0x0000)
struct P2AudioFireBotSpawner_RespawnBot final
{
public:
	class UP2HealthComponent*                     HealthComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2AudioFireBotSpawner_RespawnBot) == 0x000008, "Wrong alignment on P2AudioFireBotSpawner_RespawnBot");
static_assert(sizeof(P2AudioFireBotSpawner_RespawnBot) == 0x000008, "Wrong size on P2AudioFireBotSpawner_RespawnBot");
static_assert(offsetof(P2AudioFireBotSpawner_RespawnBot, HealthComponent) == 0x000000, "Member 'P2AudioFireBotSpawner_RespawnBot::HealthComponent' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerConsumeOwnedItem
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerConsumeOwnedItem final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2Consumable*                    Consumable;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerConsumeOwnedItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerConsumeOwnedItem");
static_assert(sizeof(P2BotCheatExtension_ServerConsumeOwnedItem) == 0x000010, "Wrong size on P2BotCheatExtension_ServerConsumeOwnedItem");
static_assert(offsetof(P2BotCheatExtension_ServerConsumeOwnedItem, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerConsumeOwnedItem::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerConsumeOwnedItem, Consumable) == 0x000008, "Member 'P2BotCheatExtension_ServerConsumeOwnedItem::Consumable' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerDestroyItem
// 0x0008 (0x0008 - 0x0000)
struct P2BotCheatExtension_ServerDestroyItem final
{
public:
	class UP2Item*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerDestroyItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerDestroyItem");
static_assert(sizeof(P2BotCheatExtension_ServerDestroyItem) == 0x000008, "Wrong size on P2BotCheatExtension_ServerDestroyItem");
static_assert(offsetof(P2BotCheatExtension_ServerDestroyItem, Item) == 0x000000, "Member 'P2BotCheatExtension_ServerDestroyItem::Item' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerDropItem
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerDropItem final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                Item;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerDropItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerDropItem");
static_assert(sizeof(P2BotCheatExtension_ServerDropItem) == 0x000010, "Wrong size on P2BotCheatExtension_ServerDropItem");
static_assert(offsetof(P2BotCheatExtension_ServerDropItem, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerDropItem::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerDropItem, Item) == 0x000008, "Member 'P2BotCheatExtension_ServerDropItem::Item' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerEquipAmmo
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerEquipAmmo final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2AmmoData*                      AmmoData;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerEquipAmmo) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerEquipAmmo");
static_assert(sizeof(P2BotCheatExtension_ServerEquipAmmo) == 0x000010, "Wrong size on P2BotCheatExtension_ServerEquipAmmo");
static_assert(offsetof(P2BotCheatExtension_ServerEquipAmmo, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerEquipAmmo::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerEquipAmmo, AmmoData) == 0x000008, "Member 'P2BotCheatExtension_ServerEquipAmmo::AmmoData' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerEquipAttachment
// 0x0018 (0x0018 - 0x0000)
struct P2BotCheatExtension_ServerEquipAttachment final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Slot*                                Slot;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2AttachableData*                AttachmentData;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerEquipAttachment) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerEquipAttachment");
static_assert(sizeof(P2BotCheatExtension_ServerEquipAttachment) == 0x000018, "Wrong size on P2BotCheatExtension_ServerEquipAttachment");
static_assert(offsetof(P2BotCheatExtension_ServerEquipAttachment, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerEquipAttachment::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerEquipAttachment, Slot) == 0x000008, "Member 'P2BotCheatExtension_ServerEquipAttachment::Slot' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerEquipAttachment, AttachmentData) == 0x000010, "Member 'P2BotCheatExtension_ServerEquipAttachment::AttachmentData' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerEquipItem
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerEquipItem final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2ItemData*                      ItemData;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerEquipItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerEquipItem");
static_assert(sizeof(P2BotCheatExtension_ServerEquipItem) == 0x000010, "Wrong size on P2BotCheatExtension_ServerEquipItem");
static_assert(offsetof(P2BotCheatExtension_ServerEquipItem, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerEquipItem::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerEquipItem, ItemData) == 0x000008, "Member 'P2BotCheatExtension_ServerEquipItem::ItemData' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerEquipOwnedItem
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerEquipOwnedItem final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2Item*                          Item;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerEquipOwnedItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerEquipOwnedItem");
static_assert(sizeof(P2BotCheatExtension_ServerEquipOwnedItem) == 0x000010, "Wrong size on P2BotCheatExtension_ServerEquipOwnedItem");
static_assert(offsetof(P2BotCheatExtension_ServerEquipOwnedItem, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerEquipOwnedItem::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerEquipOwnedItem, Item) == 0x000008, "Member 'P2BotCheatExtension_ServerEquipOwnedItem::Item' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerNextFireMode
// 0x0008 (0x0008 - 0x0000)
struct P2BotCheatExtension_ServerNextFireMode final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerNextFireMode) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerNextFireMode");
static_assert(sizeof(P2BotCheatExtension_ServerNextFireMode) == 0x000008, "Wrong size on P2BotCheatExtension_ServerNextFireMode");
static_assert(offsetof(P2BotCheatExtension_ServerNextFireMode, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerNextFireMode::Character' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerPrevFireMode
// 0x0008 (0x0008 - 0x0000)
struct P2BotCheatExtension_ServerPrevFireMode final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerPrevFireMode) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerPrevFireMode");
static_assert(sizeof(P2BotCheatExtension_ServerPrevFireMode) == 0x000008, "Wrong size on P2BotCheatExtension_ServerPrevFireMode");
static_assert(offsetof(P2BotCheatExtension_ServerPrevFireMode, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerPrevFireMode::Character' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerSelectSlottedItem
// 0x0010 (0x0010 - 0x0000)
struct P2BotCheatExtension_ServerSelectSlottedItem final
{
public:
	const class AP2HeroCharacter*                 Character;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2UsableSlot*                          UsableSlot;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotCheatExtension_ServerSelectSlottedItem) == 0x000008, "Wrong alignment on P2BotCheatExtension_ServerSelectSlottedItem");
static_assert(sizeof(P2BotCheatExtension_ServerSelectSlottedItem) == 0x000010, "Wrong size on P2BotCheatExtension_ServerSelectSlottedItem");
static_assert(offsetof(P2BotCheatExtension_ServerSelectSlottedItem, Character) == 0x000000, "Member 'P2BotCheatExtension_ServerSelectSlottedItem::Character' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSelectSlottedItem, UsableSlot) == 0x000008, "Member 'P2BotCheatExtension_ServerSelectSlottedItem::UsableSlot' has a wrong offset!");

// Function AITestRuntime.P2BotCheatExtension.ServerSpawnBots
// 0x00A0 (0x00A0 - 0x0000)
struct P2BotCheatExtension_ServerSpawnBots final
{
public:
	int32                                         BotNumX;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BotNumY;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Spacing;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryAssetId                        NpcDataAssetId;                                    // 0x0070(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2BotCommandScript>        CommandScriptClass;                                // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UserName;                                          // 0x0088(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RespawnTime;                                       // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BotCheatExtension_ServerSpawnBots) == 0x000010, "Wrong alignment on P2BotCheatExtension_ServerSpawnBots");
static_assert(sizeof(P2BotCheatExtension_ServerSpawnBots) == 0x0000A0, "Wrong size on P2BotCheatExtension_ServerSpawnBots");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, BotNumX) == 0x000000, "Member 'P2BotCheatExtension_ServerSpawnBots::BotNumX' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, BotNumY) == 0x000004, "Member 'P2BotCheatExtension_ServerSpawnBots::BotNumY' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, Spacing) == 0x000008, "Member 'P2BotCheatExtension_ServerSpawnBots::Spacing' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, Transform) == 0x000010, "Member 'P2BotCheatExtension_ServerSpawnBots::Transform' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, NpcDataAssetId) == 0x000070, "Member 'P2BotCheatExtension_ServerSpawnBots::NpcDataAssetId' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, CommandScriptClass) == 0x000080, "Member 'P2BotCheatExtension_ServerSpawnBots::CommandScriptClass' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, UserName) == 0x000088, "Member 'P2BotCheatExtension_ServerSpawnBots::UserName' has a wrong offset!");
static_assert(offsetof(P2BotCheatExtension_ServerSpawnBots, RespawnTime) == 0x000090, "Member 'P2BotCheatExtension_ServerSpawnBots::RespawnTime' has a wrong offset!");

// Function AITestRuntime.P2BotMoveToCommand.TaskBotMoveTo
// 0x0038 (0x0038 - 0x0000)
struct P2BotMoveToCommand_TaskBotMoveTo final
{
public:
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptanceDistance;                                // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2BotMoveToCommand*                    ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotMoveToCommand_TaskBotMoveTo) == 0x000008, "Wrong alignment on P2BotMoveToCommand_TaskBotMoveTo");
static_assert(sizeof(P2BotMoveToCommand_TaskBotMoveTo) == 0x000038, "Wrong size on P2BotMoveToCommand_TaskBotMoveTo");
static_assert(offsetof(P2BotMoveToCommand_TaskBotMoveTo, TaskOwner) == 0x000000, "Member 'P2BotMoveToCommand_TaskBotMoveTo::TaskOwner' has a wrong offset!");
static_assert(offsetof(P2BotMoveToCommand_TaskBotMoveTo, Location) == 0x000010, "Member 'P2BotMoveToCommand_TaskBotMoveTo::Location' has a wrong offset!");
static_assert(offsetof(P2BotMoveToCommand_TaskBotMoveTo, AcceptanceDistance) == 0x000028, "Member 'P2BotMoveToCommand_TaskBotMoveTo::AcceptanceDistance' has a wrong offset!");
static_assert(offsetof(P2BotMoveToCommand_TaskBotMoveTo, ReturnValue) == 0x000030, "Member 'P2BotMoveToCommand_TaskBotMoveTo::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2BotShootAtPoint.TaskBotShootAtPoint
// 0x0038 (0x0038 - 0x0000)
struct P2BotShootAtPoint_TaskBotShootAtPoint final
{
public:
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPoint;                                        // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootingDuration;                                  // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2BotShootAtPoint*                     ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotShootAtPoint_TaskBotShootAtPoint) == 0x000008, "Wrong alignment on P2BotShootAtPoint_TaskBotShootAtPoint");
static_assert(sizeof(P2BotShootAtPoint_TaskBotShootAtPoint) == 0x000038, "Wrong size on P2BotShootAtPoint_TaskBotShootAtPoint");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootAtPoint, TaskOwner) == 0x000000, "Member 'P2BotShootAtPoint_TaskBotShootAtPoint::TaskOwner' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootAtPoint, WorldPoint) == 0x000010, "Member 'P2BotShootAtPoint_TaskBotShootAtPoint::WorldPoint' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootAtPoint, ShootingDuration) == 0x000028, "Member 'P2BotShootAtPoint_TaskBotShootAtPoint::ShootingDuration' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootAtPoint, ReturnValue) == 0x000030, "Member 'P2BotShootAtPoint_TaskBotShootAtPoint::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2BotShootAtPoint.TaskBotShootInDirection
// 0x0038 (0x0038 - 0x0000)
struct P2BotShootAtPoint_TaskBotShootInDirection final
{
public:
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Direction;                                         // 0x0010(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsRelative;                                       // 0x0028(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShootingDuration;                                  // 0x002C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2BotShootAtPoint*                     ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotShootAtPoint_TaskBotShootInDirection) == 0x000008, "Wrong alignment on P2BotShootAtPoint_TaskBotShootInDirection");
static_assert(sizeof(P2BotShootAtPoint_TaskBotShootInDirection) == 0x000038, "Wrong size on P2BotShootAtPoint_TaskBotShootInDirection");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootInDirection, TaskOwner) == 0x000000, "Member 'P2BotShootAtPoint_TaskBotShootInDirection::TaskOwner' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootInDirection, Direction) == 0x000010, "Member 'P2BotShootAtPoint_TaskBotShootInDirection::Direction' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootInDirection, bIsRelative) == 0x000028, "Member 'P2BotShootAtPoint_TaskBotShootInDirection::bIsRelative' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootInDirection, ShootingDuration) == 0x00002C, "Member 'P2BotShootAtPoint_TaskBotShootInDirection::ShootingDuration' has a wrong offset!");
static_assert(offsetof(P2BotShootAtPoint_TaskBotShootInDirection, ReturnValue) == 0x000030, "Member 'P2BotShootAtPoint_TaskBotShootInDirection::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2BotShootAtTarget.TaskBotShootAtPrimaryTarget
// 0x0040 (0x0040 - 0x0000)
struct P2BotShootAtTarget_TaskBotShootAtPrimaryTarget final
{
public:
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TrackTarget;                                       // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShootingDuration;                                  // 0x0030(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2BotShootAtTarget*                    ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget) == 0x000008, "Wrong alignment on P2BotShootAtTarget_TaskBotShootAtPrimaryTarget");
static_assert(sizeof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget) == 0x000040, "Wrong size on P2BotShootAtTarget_TaskBotShootAtPrimaryTarget");
static_assert(offsetof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget, TaskOwner) == 0x000000, "Member 'P2BotShootAtTarget_TaskBotShootAtPrimaryTarget::TaskOwner' has a wrong offset!");
static_assert(offsetof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget, TrackTarget) == 0x000010, "Member 'P2BotShootAtTarget_TaskBotShootAtPrimaryTarget::TrackTarget' has a wrong offset!");
static_assert(offsetof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget, Offset) == 0x000018, "Member 'P2BotShootAtTarget_TaskBotShootAtPrimaryTarget::Offset' has a wrong offset!");
static_assert(offsetof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget, ShootingDuration) == 0x000030, "Member 'P2BotShootAtTarget_TaskBotShootAtPrimaryTarget::ShootingDuration' has a wrong offset!");
static_assert(offsetof(P2BotShootAtTarget_TaskBotShootAtPrimaryTarget, ReturnValue) == 0x000038, "Member 'P2BotShootAtTarget_TaskBotShootAtPrimaryTarget::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2BotSpawner.BP_SpawnBot
// 0x00E0 (0x00E0 - 0x0000)
struct P2BotSpawner_BP_SpawnBot final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InTransform;                                       // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2BotData*                       InNpcData;                                         // 0x0070(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2BotCommandScript>        InCommandScriptClass;                              // 0x0078(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UP2WearableData*>                InAdditionalWearables;                             // 0x0080(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UP2WeaponData*                          InWeaponDataOverride;                              // 0x0090(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UP2AttachableData*>              InWeaponAttachables;                               // 0x0098(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UP2AmmoData*                            InAmmoOverride;                                    // 0x00A8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                  InAnimOverrides;                                   // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InName;                                            // 0x00C0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InRespawnTime;                                     // 0x00C8(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       ReturnValue;                                       // 0x00D0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BotSpawner_BP_SpawnBot) == 0x000010, "Wrong alignment on P2BotSpawner_BP_SpawnBot");
static_assert(sizeof(P2BotSpawner_BP_SpawnBot) == 0x0000E0, "Wrong size on P2BotSpawner_BP_SpawnBot");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, WorldContext) == 0x000000, "Member 'P2BotSpawner_BP_SpawnBot::WorldContext' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InTransform) == 0x000010, "Member 'P2BotSpawner_BP_SpawnBot::InTransform' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InNpcData) == 0x000070, "Member 'P2BotSpawner_BP_SpawnBot::InNpcData' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InCommandScriptClass) == 0x000078, "Member 'P2BotSpawner_BP_SpawnBot::InCommandScriptClass' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InAdditionalWearables) == 0x000080, "Member 'P2BotSpawner_BP_SpawnBot::InAdditionalWearables' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InWeaponDataOverride) == 0x000090, "Member 'P2BotSpawner_BP_SpawnBot::InWeaponDataOverride' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InWeaponAttachables) == 0x000098, "Member 'P2BotSpawner_BP_SpawnBot::InWeaponAttachables' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InAmmoOverride) == 0x0000A8, "Member 'P2BotSpawner_BP_SpawnBot::InAmmoOverride' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InAnimOverrides) == 0x0000B0, "Member 'P2BotSpawner_BP_SpawnBot::InAnimOverrides' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InName) == 0x0000C0, "Member 'P2BotSpawner_BP_SpawnBot::InName' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, InRespawnTime) == 0x0000C8, "Member 'P2BotSpawner_BP_SpawnBot::InRespawnTime' has a wrong offset!");
static_assert(offsetof(P2BotSpawner_BP_SpawnBot, ReturnValue) == 0x0000D0, "Member 'P2BotSpawner_BP_SpawnBot::ReturnValue' has a wrong offset!");

// Function AITestRuntime.P2HeroAIController.OnDeathStarted
// 0x0030 (0x0030 - 0x0000)
struct P2HeroAIController_OnDeathStarted final
{
public:
	class UP2HealthComponent*                     InHealthComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FP2FinalBlowImpulseData                InImpulse;                                         // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2HeroAIController_OnDeathStarted) == 0x000008, "Wrong alignment on P2HeroAIController_OnDeathStarted");
static_assert(sizeof(P2HeroAIController_OnDeathStarted) == 0x000030, "Wrong size on P2HeroAIController_OnDeathStarted");
static_assert(offsetof(P2HeroAIController_OnDeathStarted, InHealthComponent) == 0x000000, "Member 'P2HeroAIController_OnDeathStarted::InHealthComponent' has a wrong offset!");
static_assert(offsetof(P2HeroAIController_OnDeathStarted, InImpulse) == 0x000008, "Member 'P2HeroAIController_OnDeathStarted::InImpulse' has a wrong offset!");

}

