#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AITestRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTasks_classes.hpp"
#include "AITestRuntime_structs.hpp"
#include "Game_classes.hpp"
#include "AIModule_structs.hpp"
#include "AICommon_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class AITestRuntime.P2AbstractBotCommand
// 0x0020 (0x0088 - 0x0068)
class UP2AbstractBotCommand : public UGameplayTask
{
public:
	TMulticastInlineDelegate<void()>              OnFinish;                                          // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AP2HeroCharacter*                       HeroCharacter;                                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2BotCommandScript*                    CommandScript;                                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbstractBotCommand">();
	}
	static class UP2AbstractBotCommand* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbstractBotCommand>();
	}
};
static_assert(alignof(UP2AbstractBotCommand) == 0x000008, "Wrong alignment on UP2AbstractBotCommand");
static_assert(sizeof(UP2AbstractBotCommand) == 0x000088, "Wrong size on UP2AbstractBotCommand");
static_assert(offsetof(UP2AbstractBotCommand, OnFinish) == 0x000068, "Member 'UP2AbstractBotCommand::OnFinish' has a wrong offset!");
static_assert(offsetof(UP2AbstractBotCommand, HeroCharacter) == 0x000078, "Member 'UP2AbstractBotCommand::HeroCharacter' has a wrong offset!");
static_assert(offsetof(UP2AbstractBotCommand, CommandScript) == 0x000080, "Member 'UP2AbstractBotCommand::CommandScript' has a wrong offset!");

// Class AITestRuntime.P2BotMoveDeltaCommand
// 0x0038 (0x00C0 - 0x0088)
class UP2BotMoveDeltaCommand final : public UP2AbstractBotCommand
{
public:
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Delta;                                             // 0x00A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Acceptance;                                        // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2BotMoveDeltaCommand* TaskBotMoveDelta(TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, const struct FVector& DeltaVector, float AcceptanceDistance)	 // 0x4d934e4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotMoveDeltaCommand">();
	}
	static class UP2BotMoveDeltaCommand* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotMoveDeltaCommand>();
	}
};
static_assert(alignof(UP2BotMoveDeltaCommand) == 0x000008, "Wrong alignment on UP2BotMoveDeltaCommand");
static_assert(sizeof(UP2BotMoveDeltaCommand) == 0x0000C0, "Wrong size on UP2BotMoveDeltaCommand");
static_assert(offsetof(UP2BotMoveDeltaCommand, Delta) == 0x0000A0, "Member 'UP2BotMoveDeltaCommand::Delta' has a wrong offset!");
static_assert(offsetof(UP2BotMoveDeltaCommand, Acceptance) == 0x0000B8, "Member 'UP2BotMoveDeltaCommand::Acceptance' has a wrong offset!");

// Class AITestRuntime.P2AudioFireBotSpawner
// 0x0018 (0x02C8 - 0x02B0)
class AP2AudioFireBotSpawner final : public AActor
{
public:
	class UP2BotData*                             AudioNPCData;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2BotCommandScript>        CommandScriptClass;                                // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2HeroCharacter*                       CurrentBot;                                        // 0x02C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RespawnBot(class UP2HealthComponent* HealthComponent)	 // 0x4d92458;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AudioFireBotSpawner">();
	}
	static class AP2AudioFireBotSpawner* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2AudioFireBotSpawner>();
	}
};
static_assert(alignof(AP2AudioFireBotSpawner) == 0x000008, "Wrong alignment on AP2AudioFireBotSpawner");
static_assert(sizeof(AP2AudioFireBotSpawner) == 0x0002C8, "Wrong size on AP2AudioFireBotSpawner");
static_assert(offsetof(AP2AudioFireBotSpawner, AudioNPCData) == 0x0002B0, "Member 'AP2AudioFireBotSpawner::AudioNPCData' has a wrong offset!");
static_assert(offsetof(AP2AudioFireBotSpawner, CommandScriptClass) == 0x0002B8, "Member 'AP2AudioFireBotSpawner::CommandScriptClass' has a wrong offset!");
static_assert(offsetof(AP2AudioFireBotSpawner, CurrentBot) == 0x0002C0, "Member 'AP2AudioFireBotSpawner::CurrentBot' has a wrong offset!");

// Class AITestRuntime.P2AudioTestBotComponent
// 0x0000 (0x00C8 - 0x00C8)
class UP2AudioTestBotComponent final : public UP2PawnComponent
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AudioTestBotComponent">();
	}
	static class UP2AudioTestBotComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AudioTestBotComponent>();
	}
};
static_assert(alignof(UP2AudioTestBotComponent) == 0x000008, "Wrong alignment on UP2AudioTestBotComponent");
static_assert(sizeof(UP2AudioTestBotComponent) == 0x0000C8, "Wrong size on UP2AudioTestBotComponent");

// Class AITestRuntime.P2BotCheatExtension
// 0x00B8 (0x0130 - 0x0078)
class UP2BotCheatExtension final : public UP2CheatManagerExtension
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       SelectedCharacter;                                 // 0x0080(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2Item*                                SelectedItem;                                      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UClass*>                         CommandScriptClasses;                              // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2BotData*>                     NpcDataList;                                       // 0x00A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2WeaponData*>                  WeaponDataList;                                    // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2UtilityData*>                 UtilityDataList;                                   // 0x00C0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2WearableData*>                WearableDataList;                                  // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2ConsumableData*>              ConsumableDataList;                                // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2ItemData*>                    MiscellaneousDataList;                             // 0x00F0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2AttachableData*>              AttachableDataList;                                // 0x0100(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UP2AmmoData*>                    AmmoDataList;                                      // 0x0110(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 ServerWorld;                                       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ServerConsumeOwnedItem(const class AP2HeroCharacter* Character, const class UP2Consumable* Consumable)	 // 0x4d92514;
	void ServerDestroyItem(class UP2Item* Item)	 // 0x472b054;
	void ServerDropItem(const class AP2HeroCharacter* Character, class UP2Item* Item)	 // 0x4d92658;
	void ServerEquipAmmo(const class AP2HeroCharacter* Character, const class UP2AmmoData* AmmoData)	 // 0x4d9279c;
	void ServerEquipAttachment(const class AP2HeroCharacter* Character, class UP2Slot* Slot, const class UP2AttachableData* AttachmentData)	 // 0x4d928e0;
	void ServerEquipItem(const class AP2HeroCharacter* Character, const class UP2ItemData* ItemData)	 // 0x4d92aa0;
	void ServerEquipOwnedItem(const class AP2HeroCharacter* Character, const class UP2Item* Item)	 // 0x4d92be4;
	void ServerNextFireMode(const class AP2HeroCharacter* Character)	 // 0x4d92d28;
	void ServerPrevFireMode(const class AP2HeroCharacter* Character)	 // 0x4d92dec;
	void ServerSelectSlottedItem(const class AP2HeroCharacter* Character, class UP2UsableSlot* UsableSlot)	 // 0x4d92eb0;
	void ServerSpawnBots(int32 BotNumX, int32 BotNumY, int32 Spacing, const struct FTransform& Transform, const struct FPrimaryAssetId& NpcDataAssetId, TSubclassOf<class UP2BotCommandScript> CommandScriptClass, class FName UserName, int32 RespawnTime)	 // 0x4d92ff4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotCheatExtension">();
	}
	static class UP2BotCheatExtension* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotCheatExtension>();
	}
};
static_assert(alignof(UP2BotCheatExtension) == 0x000008, "Wrong alignment on UP2BotCheatExtension");
static_assert(sizeof(UP2BotCheatExtension) == 0x000130, "Wrong size on UP2BotCheatExtension");
static_assert(offsetof(UP2BotCheatExtension, SelectedCharacter) == 0x000080, "Member 'UP2BotCheatExtension::SelectedCharacter' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, SelectedItem) == 0x000088, "Member 'UP2BotCheatExtension::SelectedItem' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, CommandScriptClasses) == 0x000090, "Member 'UP2BotCheatExtension::CommandScriptClasses' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, NpcDataList) == 0x0000A0, "Member 'UP2BotCheatExtension::NpcDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, WeaponDataList) == 0x0000B0, "Member 'UP2BotCheatExtension::WeaponDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, UtilityDataList) == 0x0000C0, "Member 'UP2BotCheatExtension::UtilityDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, WearableDataList) == 0x0000D0, "Member 'UP2BotCheatExtension::WearableDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, ConsumableDataList) == 0x0000E0, "Member 'UP2BotCheatExtension::ConsumableDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, MiscellaneousDataList) == 0x0000F0, "Member 'UP2BotCheatExtension::MiscellaneousDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, AttachableDataList) == 0x000100, "Member 'UP2BotCheatExtension::AttachableDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, AmmoDataList) == 0x000110, "Member 'UP2BotCheatExtension::AmmoDataList' has a wrong offset!");
static_assert(offsetof(UP2BotCheatExtension, ServerWorld) == 0x000128, "Member 'UP2BotCheatExtension::ServerWorld' has a wrong offset!");

// Class AITestRuntime.P2BotCommandScript
// 0x0098 (0x00C8 - 0x0030)
class UP2BotCommandScript final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UP2BotData*                             NpcData;                                           // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 MoveToTargetKey;                                   // 0x0050(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 ShootingTargetKey;                                 // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 PrimaryTargetKey;                                  // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	void Activate()	 // 0x151192c;
	void Deactivate()	 // 0xf79a00;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotCommandScript">();
	}
	static class UP2BotCommandScript* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotCommandScript>();
	}
};
static_assert(alignof(UP2BotCommandScript) == 0x000008, "Wrong alignment on UP2BotCommandScript");
static_assert(sizeof(UP2BotCommandScript) == 0x0000C8, "Wrong size on UP2BotCommandScript");
static_assert(offsetof(UP2BotCommandScript, Owner) == 0x000040, "Member 'UP2BotCommandScript::Owner' has a wrong offset!");
static_assert(offsetof(UP2BotCommandScript, NpcData) == 0x000048, "Member 'UP2BotCommandScript::NpcData' has a wrong offset!");
static_assert(offsetof(UP2BotCommandScript, MoveToTargetKey) == 0x000050, "Member 'UP2BotCommandScript::MoveToTargetKey' has a wrong offset!");
static_assert(offsetof(UP2BotCommandScript, ShootingTargetKey) == 0x000078, "Member 'UP2BotCommandScript::ShootingTargetKey' has a wrong offset!");
static_assert(offsetof(UP2BotCommandScript, PrimaryTargetKey) == 0x0000A0, "Member 'UP2BotCommandScript::PrimaryTargetKey' has a wrong offset!");

// Class AITestRuntime.P2BotComponent
// 0x0028 (0x00F0 - 0x00C8)
class UP2BotComponent final : public UP2PawnComponent
{
public:
	class UP2BotData*                             NpcData;                                           // 0x00C8(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                  AnimOverrides;                                     // 0x00D0(0x0010)(Net, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2BotCommandScript>        CommandScript;                                     // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2BotCommandScript*                    CommandScriptInstance;                             // 0x00E8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotComponent">();
	}
	static class UP2BotComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotComponent>();
	}
};
static_assert(alignof(UP2BotComponent) == 0x000008, "Wrong alignment on UP2BotComponent");
static_assert(sizeof(UP2BotComponent) == 0x0000F0, "Wrong size on UP2BotComponent");
static_assert(offsetof(UP2BotComponent, NpcData) == 0x0000C8, "Member 'UP2BotComponent::NpcData' has a wrong offset!");
static_assert(offsetof(UP2BotComponent, AnimOverrides) == 0x0000D0, "Member 'UP2BotComponent::AnimOverrides' has a wrong offset!");
static_assert(offsetof(UP2BotComponent, CommandScript) == 0x0000E0, "Member 'UP2BotComponent::CommandScript' has a wrong offset!");
static_assert(offsetof(UP2BotComponent, CommandScriptInstance) == 0x0000E8, "Member 'UP2BotComponent::CommandScriptInstance' has a wrong offset!");

// Class AITestRuntime.P2BotData
// 0x0090 (0x00C0 - 0x0030)
class UP2BotData final : public UPrimaryDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PawnData*                            PawnData;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UP2PawnComponent>>   AdditionalRuntimeComponentList;                    // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class UP2WeaponData*                          WeaponToEquip;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UP2WearableData*>                WearablesToEquip;                                  // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         WeaponFireModeIndex;                               // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequence*>                  AnimationOverrides;                                // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FP2BlackboardKeyFloat>          FloatBBOverrides;                                  // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UP2AbilitySet*                          NpcGeneralAbilitySet;                              // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  BlockAbilitiesWithTags;                            // 0x00A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotData">();
	}
	static class UP2BotData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotData>();
	}
};
static_assert(alignof(UP2BotData) == 0x000008, "Wrong alignment on UP2BotData");
static_assert(sizeof(UP2BotData) == 0x0000C0, "Wrong size on UP2BotData");
static_assert(offsetof(UP2BotData, PawnData) == 0x000038, "Member 'UP2BotData::PawnData' has a wrong offset!");
static_assert(offsetof(UP2BotData, AdditionalRuntimeComponentList) == 0x000040, "Member 'UP2BotData::AdditionalRuntimeComponentList' has a wrong offset!");
static_assert(offsetof(UP2BotData, WeaponToEquip) == 0x000050, "Member 'UP2BotData::WeaponToEquip' has a wrong offset!");
static_assert(offsetof(UP2BotData, WearablesToEquip) == 0x000058, "Member 'UP2BotData::WearablesToEquip' has a wrong offset!");
static_assert(offsetof(UP2BotData, WeaponFireModeIndex) == 0x000068, "Member 'UP2BotData::WeaponFireModeIndex' has a wrong offset!");
static_assert(offsetof(UP2BotData, AnimationOverrides) == 0x000070, "Member 'UP2BotData::AnimationOverrides' has a wrong offset!");
static_assert(offsetof(UP2BotData, BehaviorTree) == 0x000080, "Member 'UP2BotData::BehaviorTree' has a wrong offset!");
static_assert(offsetof(UP2BotData, FloatBBOverrides) == 0x000088, "Member 'UP2BotData::FloatBBOverrides' has a wrong offset!");
static_assert(offsetof(UP2BotData, NpcGeneralAbilitySet) == 0x000098, "Member 'UP2BotData::NpcGeneralAbilitySet' has a wrong offset!");
static_assert(offsetof(UP2BotData, BlockAbilitiesWithTags) == 0x0000A0, "Member 'UP2BotData::BlockAbilitiesWithTags' has a wrong offset!");

// Class AITestRuntime.P2BotMoveToCommand
// 0x0020 (0x00A8 - 0x0088)
class UP2BotMoveToCommand final : public UP2AbstractBotCommand
{
public:
	struct FVector                                TargetLoc;                                         // 0x0088(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceptance;                                        // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2BotMoveToCommand* TaskBotMoveTo(TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, const struct FVector& Location, float AcceptanceDistance)	 // 0x4d936d0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotMoveToCommand">();
	}
	static class UP2BotMoveToCommand* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotMoveToCommand>();
	}
};
static_assert(alignof(UP2BotMoveToCommand) == 0x000008, "Wrong alignment on UP2BotMoveToCommand");
static_assert(sizeof(UP2BotMoveToCommand) == 0x0000A8, "Wrong size on UP2BotMoveToCommand");
static_assert(offsetof(UP2BotMoveToCommand, TargetLoc) == 0x000088, "Member 'UP2BotMoveToCommand::TargetLoc' has a wrong offset!");
static_assert(offsetof(UP2BotMoveToCommand, Acceptance) == 0x0000A0, "Member 'UP2BotMoveToCommand::Acceptance' has a wrong offset!");

// Class AITestRuntime.P2BotShootAtPoint
// 0x0028 (0x00B0 - 0x0088)
class UP2BotShootAtPoint final : public UP2AbstractBotCommand
{
public:
	struct FVector                                TargetPoint;                                       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Duration;                                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2BotShootAtPoint* TaskBotShootAtPoint(TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, const struct FVector& WorldPoint, const float ShootingDuration)	 // 0x4d938bc;
	static class UP2BotShootAtPoint* TaskBotShootInDirection(TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, const struct FRotator& Direction, const bool bIsRelative, const float ShootingDuration)	 // 0x4d93d10;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotShootAtPoint">();
	}
	static class UP2BotShootAtPoint* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotShootAtPoint>();
	}
};
static_assert(alignof(UP2BotShootAtPoint) == 0x000008, "Wrong alignment on UP2BotShootAtPoint");
static_assert(sizeof(UP2BotShootAtPoint) == 0x0000B0, "Wrong size on UP2BotShootAtPoint");
static_assert(offsetof(UP2BotShootAtPoint, TargetPoint) == 0x000088, "Member 'UP2BotShootAtPoint::TargetPoint' has a wrong offset!");
static_assert(offsetof(UP2BotShootAtPoint, Duration) == 0x0000A0, "Member 'UP2BotShootAtPoint::Duration' has a wrong offset!");

// Class AITestRuntime.P2BotShootAtTarget
// 0x0040 (0x00C8 - 0x0088)
class UP2BotShootAtTarget final : public UP2AbstractBotCommand
{
public:
	struct FVector                                TargetPoint;                                       // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Duration;                                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPointOffset;                                 // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2BotShootAtTarget* TaskBotShootAtPrimaryTarget(TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner, const bool TrackTarget, const struct FVector& Offset, const float ShootingDuration)	 // 0x4d93aa8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotShootAtTarget">();
	}
	static class UP2BotShootAtTarget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BotShootAtTarget>();
	}
};
static_assert(alignof(UP2BotShootAtTarget) == 0x000008, "Wrong alignment on UP2BotShootAtTarget");
static_assert(sizeof(UP2BotShootAtTarget) == 0x0000C8, "Wrong size on UP2BotShootAtTarget");
static_assert(offsetof(UP2BotShootAtTarget, TargetPoint) == 0x000088, "Member 'UP2BotShootAtTarget::TargetPoint' has a wrong offset!");
static_assert(offsetof(UP2BotShootAtTarget, Duration) == 0x0000A0, "Member 'UP2BotShootAtTarget::Duration' has a wrong offset!");
static_assert(offsetof(UP2BotShootAtTarget, TargetPointOffset) == 0x0000A8, "Member 'UP2BotShootAtTarget::TargetPointOffset' has a wrong offset!");

// Class AITestRuntime.P2BotSpawner
// 0x0070 (0x0348 - 0x02D8)
class AP2BotSpawner final : public ANavigationObjectBase
{
public:
	class FName                                   UserName;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RespawnTime;                                       // 0x02E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2BotData*                             NpcData;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2BotCommandScript>        CommandScriptOverride;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UP2WearableData*>                AdditionalWearablesToEquip;                        // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UP2WeaponData*                          WeaponOverride;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UP2AttachableData*>              WeaponAttachables;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UP2AmmoData*                            AmmoOverride;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                  AnimationOverrides;                                // 0x0328(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AP2HeroCharacter*                       CurrentNPC;                                        // 0x0338(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AP2HeroCharacter* BP_SpawnBot(class UObject* WorldContext, const struct FTransform& InTransform, const class UP2BotData* InNpcData, const TSubclassOf<class UP2BotCommandScript>& InCommandScriptClass, const TArray<class UP2WearableData*>& InAdditionalWearables, class UP2WeaponData* InWeaponDataOverride, const TArray<class UP2AttachableData*>& InWeaponAttachables, class UP2AmmoData* InAmmoOverride, const TArray<class UAnimSequence*>& InAnimOverrides, const class FName& InName, const int32& InRespawnTime)	 // 0x4d91bf0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BotSpawner">();
	}
	static class AP2BotSpawner* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2BotSpawner>();
	}
};
static_assert(alignof(AP2BotSpawner) == 0x000008, "Wrong alignment on AP2BotSpawner");
static_assert(sizeof(AP2BotSpawner) == 0x000348, "Wrong size on AP2BotSpawner");
static_assert(offsetof(AP2BotSpawner, UserName) == 0x0002D8, "Member 'AP2BotSpawner::UserName' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, RespawnTime) == 0x0002E0, "Member 'AP2BotSpawner::RespawnTime' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, NpcData) == 0x0002E8, "Member 'AP2BotSpawner::NpcData' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, CommandScriptOverride) == 0x0002F0, "Member 'AP2BotSpawner::CommandScriptOverride' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, AdditionalWearablesToEquip) == 0x0002F8, "Member 'AP2BotSpawner::AdditionalWearablesToEquip' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, WeaponOverride) == 0x000308, "Member 'AP2BotSpawner::WeaponOverride' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, WeaponAttachables) == 0x000310, "Member 'AP2BotSpawner::WeaponAttachables' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, AmmoOverride) == 0x000320, "Member 'AP2BotSpawner::AmmoOverride' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, AnimationOverrides) == 0x000328, "Member 'AP2BotSpawner::AnimationOverrides' has a wrong offset!");
static_assert(offsetof(AP2BotSpawner, CurrentNPC) == 0x000338, "Member 'AP2BotSpawner::CurrentNPC' has a wrong offset!");

// Class AITestRuntime.P2HeroAIController
// 0x0030 (0x0458 - 0x0428)
class AP2HeroAIController final : public AP2AIController
{
public:
	class UP2BotData*                             NpcData;                                           // 0x0428(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_430[0x28];                                     // 0x0430(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDeathStarted(class UP2HealthComponent* InHealthComponent, const struct FP2FinalBlowImpulseData& InImpulse)	 // 0x4d92314;
	void OnItemsChanged()	 // 0x4d92444;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2HeroAIController">();
	}
	static class AP2HeroAIController* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2HeroAIController>();
	}
};
static_assert(alignof(AP2HeroAIController) == 0x000008, "Wrong alignment on AP2HeroAIController");
static_assert(sizeof(AP2HeroAIController) == 0x000458, "Wrong size on AP2HeroAIController");
static_assert(offsetof(AP2HeroAIController, NpcData) == 0x000428, "Member 'AP2HeroAIController::NpcData' has a wrong offset!");

}

