#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WwiseResourceLoader_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class AkAudio.AkPS5InitializationSettings
// 0x00D8 (0x0100 - 0x0028)
class UAkPS5InitializationSettings : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettings        CommonSettings;                                    // 0x0030(0x0068)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x0098(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkPS5AdvancedInitializationSettings   AdvancedSettings;                                  // 0x00B8(0x0044)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkPS5InitializationSettings">();
	}
	static class UAkPS5InitializationSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkPS5InitializationSettings>();
	}
};
static_assert(alignof(UAkPS5InitializationSettings) == 0x000008, "Wrong alignment on UAkPS5InitializationSettings");
static_assert(sizeof(UAkPS5InitializationSettings) == 0x000100, "Wrong size on UAkPS5InitializationSettings");
static_assert(offsetof(UAkPS5InitializationSettings, CommonSettings) == 0x000030, "Member 'UAkPS5InitializationSettings::CommonSettings' has a wrong offset!");
static_assert(offsetof(UAkPS5InitializationSettings, CommunicationSettings) == 0x000098, "Member 'UAkPS5InitializationSettings::CommunicationSettings' has a wrong offset!");
static_assert(offsetof(UAkPS5InitializationSettings, AdvancedSettings) == 0x0000B8, "Member 'UAkPS5InitializationSettings::AdvancedSettings' has a wrong offset!");

// Class AkAudio.AkGameObject
// 0x0020 (0x0300 - 0x02E0)
class UAkGameObject : public USceneComponent
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const class FString& InEventName)	 // 0x1538c3c;
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingID, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo)	 // 0x436abcc;
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback)	 // 0x153821c;
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo, int32* PlayingID)	 // 0x436b614;
	void Stop()	 // 0x4370188;

	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& RTPC, int32 PlayingID) const	 // 0x4369e18;
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& RTPC) const	 // 0x1602054;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkGameObject">();
	}
	static class UAkGameObject* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
static_assert(alignof(UAkGameObject) == 0x000010, "Wrong alignment on UAkGameObject");
static_assert(sizeof(UAkGameObject) == 0x000300, "Wrong size on UAkGameObject");
static_assert(offsetof(UAkGameObject, AkAudioEvent) == 0x0002E0, "Member 'UAkGameObject::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(UAkGameObject, EventName) == 0x0002E8, "Member 'UAkGameObject::EventName' has a wrong offset!");

// Class AkAudio.AkDPXInitializationSettings
// 0x0000 (0x0100 - 0x0100)
class UAkDPXInitializationSettings final : public UAkPS5InitializationSettings
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkDPXInitializationSettings">();
	}
	static class UAkDPXInitializationSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkDPXInitializationSettings>();
	}
};
static_assert(alignof(UAkDPXInitializationSettings) == 0x000008, "Wrong alignment on UAkDPXInitializationSettings");
static_assert(sizeof(UAkDPXInitializationSettings) == 0x000100, "Wrong size on UAkDPXInitializationSettings");

// Class AkAudio.AkComponent
// 0x02A0 (0x05A0 - 0x0300)
class UAkComponent : public UAkGameObject
{
public:
	bool                                          bUseSpatialAudio;                                  // 0x0300(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	EAkCollisionChannel                           OcclusionCollisionChannel;                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSpotReflectors;                              // 0x0309(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OuterRadius;                                       // 0x030C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x0318(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x0320(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EarlyReflectionOrder;                              // 0x0330(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionBusSendGain;                        // 0x0334(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionMaxPathLength;                      // 0x0338(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         roomReverbAuxBusGain;                              // 0x033C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxEdges;                               // 0x0340(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxPaths;                               // 0x0344(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         diffractionMaxPathLength;                          // 0x0348(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DrawFirstOrderReflections;                         // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawSecondOrderReflections;                        // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawHigherOrderReflections;                        // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDiffraction;                                   // 0x034F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerDestroyed;                            // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttenuationScalingFactor;                          // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionRefreshInterval;                          // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverbVolumes;                                 // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35D[0x243];                                    // 0x035D(0x0243)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ECollisionChannel GetOcclusionCollisionChannel()	 // 0x4363cd8;
	int32 PostAkEventAndWaitForEnd(class UAkAudioEvent* AkEvent, const class FString& in_EventName, const struct FLatentActionInfo& LatentInfo)	 // 0x4363e7c;
	void PostAkEventAndWaitForEndAsync(class UAkAudioEvent* AkEvent, int32* PlayingID, const struct FLatentActionInfo& LatentInfo)	 // 0x436407c;
	int32 PostAkEventByName(const class FString& in_EventName)	 // 0x4364234;
	int32 PostAssociatedAkEventAndWaitForEnd(const struct FLatentActionInfo& LatentInfo)	 // 0x4364314;
	void PostAssociatedAkEventAndWaitForEndAsync(int32* PlayingID, const struct FLatentActionInfo& LatentInfo)	 // 0x436441c;
	void PostTrigger(class UAkTrigger* TriggerValue, const class FString& Trigger)	 // 0x43659a8;
	void SetAttenuationScalingFactor(float Value)	 // 0x4365cc4;
	void SetAutoDestroy(bool in_AutoDestroy)	 // 0x4365d88;
	void SetEarlyReflectionsAuxBus(const class FString& AuxBusName)	 // 0x4365f08;
	void SetEarlyReflectionsVolume(float SendVolume)	 // 0x436616c;
	void SetEnableSpotReflectors(bool in_enable)	 // 0x436623c;
	void SetGameObjectRadius(float in_outerRadius, float in_innerRadius)	 // 0x436630c;
	void SetIsSubComponent(bool in_IsSubComponent)	 // 0x4366510;
	void SetListeners(const TArray<class UAkComponent*>& Listeners)	 // 0x43665d0;
	void SetOutputBusVolume(float BusVolume)	 // 0x436666c;
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed)	 // 0x1805140;
	void SetSwitch(class UAkSwitchValue* SwitchValue, const class FString& SwitchGroup, const class FString& SwitchState)	 // 0x4366730;
	void UseEarlyReflections(class UAkAuxBus* AuxBus, int32 Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, const class FString& AuxBusName)	 // 0x4366a2c;
	void UseReverbVolumes(bool inUseReverbVolumes)	 // 0x4366d44;

	float GetAttenuationRadius() const	 // 0x4363bdc;
	class UAkRoomComponent* GetCurrentRoom() const	 // 0x4363c4c;
	float GetIndoorRoomSize() const	 // 0x4363cb0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkComponent">();
	}
	static class UAkComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkComponent>();
	}
};
static_assert(alignof(UAkComponent) == 0x000010, "Wrong alignment on UAkComponent");
static_assert(sizeof(UAkComponent) == 0x0005A0, "Wrong size on UAkComponent");
static_assert(offsetof(UAkComponent, bUseSpatialAudio) == 0x000300, "Member 'UAkComponent::bUseSpatialAudio' has a wrong offset!");
static_assert(offsetof(UAkComponent, OcclusionCollisionChannel) == 0x000308, "Member 'UAkComponent::OcclusionCollisionChannel' has a wrong offset!");
static_assert(offsetof(UAkComponent, EnableSpotReflectors) == 0x000309, "Member 'UAkComponent::EnableSpotReflectors' has a wrong offset!");
static_assert(offsetof(UAkComponent, OuterRadius) == 0x00030C, "Member 'UAkComponent::OuterRadius' has a wrong offset!");
static_assert(offsetof(UAkComponent, InnerRadius) == 0x000310, "Member 'UAkComponent::InnerRadius' has a wrong offset!");
static_assert(offsetof(UAkComponent, EarlyReflectionAuxBus) == 0x000318, "Member 'UAkComponent::EarlyReflectionAuxBus' has a wrong offset!");
static_assert(offsetof(UAkComponent, EarlyReflectionAuxBusName) == 0x000320, "Member 'UAkComponent::EarlyReflectionAuxBusName' has a wrong offset!");
static_assert(offsetof(UAkComponent, EarlyReflectionOrder) == 0x000330, "Member 'UAkComponent::EarlyReflectionOrder' has a wrong offset!");
static_assert(offsetof(UAkComponent, EarlyReflectionBusSendGain) == 0x000334, "Member 'UAkComponent::EarlyReflectionBusSendGain' has a wrong offset!");
static_assert(offsetof(UAkComponent, EarlyReflectionMaxPathLength) == 0x000338, "Member 'UAkComponent::EarlyReflectionMaxPathLength' has a wrong offset!");
static_assert(offsetof(UAkComponent, roomReverbAuxBusGain) == 0x00033C, "Member 'UAkComponent::roomReverbAuxBusGain' has a wrong offset!");
static_assert(offsetof(UAkComponent, diffractionMaxEdges) == 0x000340, "Member 'UAkComponent::diffractionMaxEdges' has a wrong offset!");
static_assert(offsetof(UAkComponent, diffractionMaxPaths) == 0x000344, "Member 'UAkComponent::diffractionMaxPaths' has a wrong offset!");
static_assert(offsetof(UAkComponent, diffractionMaxPathLength) == 0x000348, "Member 'UAkComponent::diffractionMaxPathLength' has a wrong offset!");
static_assert(offsetof(UAkComponent, DrawFirstOrderReflections) == 0x00034C, "Member 'UAkComponent::DrawFirstOrderReflections' has a wrong offset!");
static_assert(offsetof(UAkComponent, DrawSecondOrderReflections) == 0x00034D, "Member 'UAkComponent::DrawSecondOrderReflections' has a wrong offset!");
static_assert(offsetof(UAkComponent, DrawHigherOrderReflections) == 0x00034E, "Member 'UAkComponent::DrawHigherOrderReflections' has a wrong offset!");
static_assert(offsetof(UAkComponent, DrawDiffraction) == 0x00034F, "Member 'UAkComponent::DrawDiffraction' has a wrong offset!");
static_assert(offsetof(UAkComponent, StopWhenOwnerDestroyed) == 0x000350, "Member 'UAkComponent::StopWhenOwnerDestroyed' has a wrong offset!");
static_assert(offsetof(UAkComponent, AttenuationScalingFactor) == 0x000354, "Member 'UAkComponent::AttenuationScalingFactor' has a wrong offset!");
static_assert(offsetof(UAkComponent, OcclusionRefreshInterval) == 0x000358, "Member 'UAkComponent::OcclusionRefreshInterval' has a wrong offset!");
static_assert(offsetof(UAkComponent, bUseReverbVolumes) == 0x00035C, "Member 'UAkComponent::bUseReverbVolumes' has a wrong offset!");

// Class AkAudio.AkSettingsPerUser
// 0x0050 (0x0078 - 0x0028)
class UAkSettingsPerUser final : public UObject
{
public:
	struct FDirectoryPath                         WwiseWindowsInstallationPath;                      // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilePath                              WwiseMacInstallationPath;                          // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         GeneratedSoundBanksFolderUserOverride;             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WaapiIPAddress;                                    // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        WaapiPort;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoConnectToWAAPI;                               // 0x006C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoSyncSelection;                                 // 0x006D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        WaapiTranslatorTimeout;                            // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SuppressGeneratedSoundBanksPathWarnings;           // 0x0074(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SoundDataGenerationSkipLanguage;                   // 0x0075(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AskForWwiseAssetReload;                            // 0x0076(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAkComponentSpriteInEditor;                    // 0x0077(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkSettingsPerUser">();
	}
	static class UAkSettingsPerUser* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkSettingsPerUser>();
	}
};
static_assert(alignof(UAkSettingsPerUser) == 0x000008, "Wrong alignment on UAkSettingsPerUser");
static_assert(sizeof(UAkSettingsPerUser) == 0x000078, "Wrong size on UAkSettingsPerUser");
static_assert(offsetof(UAkSettingsPerUser, WwiseWindowsInstallationPath) == 0x000028, "Member 'UAkSettingsPerUser::WwiseWindowsInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WwiseMacInstallationPath) == 0x000038, "Member 'UAkSettingsPerUser::WwiseMacInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, GeneratedSoundBanksFolderUserOverride) == 0x000048, "Member 'UAkSettingsPerUser::GeneratedSoundBanksFolderUserOverride' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiIPAddress) == 0x000058, "Member 'UAkSettingsPerUser::WaapiIPAddress' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiPort) == 0x000068, "Member 'UAkSettingsPerUser::WaapiPort' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, bAutoConnectToWAAPI) == 0x00006C, "Member 'UAkSettingsPerUser::bAutoConnectToWAAPI' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, AutoSyncSelection) == 0x00006D, "Member 'UAkSettingsPerUser::AutoSyncSelection' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiTranslatorTimeout) == 0x000070, "Member 'UAkSettingsPerUser::WaapiTranslatorTimeout' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, SuppressGeneratedSoundBanksPathWarnings) == 0x000074, "Member 'UAkSettingsPerUser::SuppressGeneratedSoundBanksPathWarnings' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, SoundDataGenerationSkipLanguage) == 0x000075, "Member 'UAkSettingsPerUser::SoundDataGenerationSkipLanguage' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, AskForWwiseAssetReload) == 0x000076, "Member 'UAkSettingsPerUser::AskForWwiseAssetReload' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, bShowAkComponentSpriteInEditor) == 0x000077, "Member 'UAkSettingsPerUser::bShowAkComponentSpriteInEditor' has a wrong offset!");

// Class AkAudio.AkPortalComponent
// 0x00E0 (0x03C0 - 0x02E0)
class UAkPortalComponent final : public USceneComponent
{
public:
	bool                                          bDynamic;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysActiveInSpatialAudio;                       // 0x02E2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E3[0x1];                                      // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionRefreshInterval;                        // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0xD7];                                     // 0x02E9(0x00D7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal()	 // 0x155d5d0;
	void OpenPortal()	 // 0x155d710;

	EAkAcousticPortalState GetCurrentState() const	 // 0x4363c98;
	class UPrimitiveComponent* GetPrimitiveParent() const	 // 0x178dafc;
	bool PortalPlacementValid() const	 // 0x4363e58;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkPortalComponent">();
	}
	static class UAkPortalComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
static_assert(alignof(UAkPortalComponent) == 0x000010, "Wrong alignment on UAkPortalComponent");
static_assert(sizeof(UAkPortalComponent) == 0x0003C0, "Wrong size on UAkPortalComponent");
static_assert(offsetof(UAkPortalComponent, bDynamic) == 0x0002E0, "Member 'UAkPortalComponent::bDynamic' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, InitialState) == 0x0002E1, "Member 'UAkPortalComponent::InitialState' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, bAlwaysActiveInSpatialAudio) == 0x0002E2, "Member 'UAkPortalComponent::bAlwaysActiveInSpatialAudio' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, ObstructionRefreshInterval) == 0x0002E4, "Member 'UAkPortalComponent::ObstructionRefreshInterval' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, ObstructionCollisionChannel) == 0x0002E8, "Member 'UAkPortalComponent::ObstructionCollisionChannel' has a wrong offset!");

// Class AkAudio.AkSpotReflector
// 0x0038 (0x02E8 - 0x02B0)
class AAkSpotReflector final : public AActor
{
public:
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAcousticTexture*                     AcousticTexture;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceScalingFactor;                             // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SameRoomOnly;                                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRoomOverride;                                // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 RoomOverride;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkSpotReflector">();
	}
	static class AAkSpotReflector* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AAkSpotReflector>();
	}
};
static_assert(alignof(AAkSpotReflector) == 0x000008, "Wrong alignment on AAkSpotReflector");
static_assert(sizeof(AAkSpotReflector) == 0x0002E8, "Wrong size on AAkSpotReflector");
static_assert(offsetof(AAkSpotReflector, EarlyReflectionAuxBus) == 0x0002B0, "Member 'AAkSpotReflector::EarlyReflectionAuxBus' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, EarlyReflectionAuxBusName) == 0x0002B8, "Member 'AAkSpotReflector::EarlyReflectionAuxBusName' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, AcousticTexture) == 0x0002C8, "Member 'AAkSpotReflector::AcousticTexture' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, DistanceScalingFactor) == 0x0002D0, "Member 'AAkSpotReflector::DistanceScalingFactor' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, Level) == 0x0002D4, "Member 'AAkSpotReflector::Level' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, SameRoomOnly) == 0x0002D8, "Member 'AAkSpotReflector::SameRoomOnly' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, EnableRoomOverride) == 0x0002D9, "Member 'AAkSpotReflector::EnableRoomOverride' has a wrong offset!");
static_assert(offsetof(AAkSpotReflector, RoomOverride) == 0x0002E0, "Member 'AAkSpotReflector::RoomOverride' has a wrong offset!");

// Class AkAudio.AkAcousticPortal
// 0x0010 (0x02F8 - 0x02E8)
class AAkAcousticPortal final : public AVolume
{
public:
	class UAkPortalComponent*                     Portal;                                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRequiresStateMigration;                           // 0x02F1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal()	 // 0x4363864;
	void OpenPortal()	 // 0x4363e30;

	EAkAcousticPortalState GetCurrentState() const	 // 0x4363c70;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAcousticPortal">();
	}
	static class AAkAcousticPortal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
static_assert(alignof(AAkAcousticPortal) == 0x000008, "Wrong alignment on AAkAcousticPortal");
static_assert(sizeof(AAkAcousticPortal) == 0x0002F8, "Wrong size on AAkAcousticPortal");
static_assert(offsetof(AAkAcousticPortal, Portal) == 0x0002E8, "Member 'AAkAcousticPortal::Portal' has a wrong offset!");
static_assert(offsetof(AAkAcousticPortal, InitialState) == 0x0002F0, "Member 'AAkAcousticPortal::InitialState' has a wrong offset!");
static_assert(offsetof(AAkAcousticPortal, bRequiresStateMigration) == 0x0002F1, "Member 'AAkAcousticPortal::bRequiresStateMigration' has a wrong offset!");

// Class AkAudio.AkAudioType
// 0x0028 (0x0050 - 0x0028)
class UAkAudioType : public UObject
{
public:
	bool                                          bAutoLoad;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        UserData;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData()	 // 0xf79a00;
	void UnloadData(bool bAsync)	 // 0x4366964;

	int32 GetWwiseShortID() const	 // 0x4363cfc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAudioType">();
	}
	static class UAkAudioType* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
static_assert(alignof(UAkAudioType) == 0x000008, "Wrong alignment on UAkAudioType");
static_assert(sizeof(UAkAudioType) == 0x000050, "Wrong size on UAkAudioType");
static_assert(offsetof(UAkAudioType, bAutoLoad) == 0x000028, "Member 'UAkAudioType::bAutoLoad' has a wrong offset!");
static_assert(offsetof(UAkAudioType, UserData) == 0x000030, "Member 'UAkAudioType::UserData' has a wrong offset!");

// Class AkAudio.AkGroupValue
// 0x0020 (0x0070 - 0x0050)
class UAkGroupValue : public UAkAudioType
{
public:
	struct FWwiseGroupValueCookedData             GroupValueCookedData;                              // 0x0050(0x0014)(Edit, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        GroupShortId;                                      // 0x0064(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkGroupValue">();
	}
	static class UAkGroupValue* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkGroupValue>();
	}
};
static_assert(alignof(UAkGroupValue) == 0x000008, "Wrong alignment on UAkGroupValue");
static_assert(sizeof(UAkGroupValue) == 0x000070, "Wrong size on UAkGroupValue");
static_assert(offsetof(UAkGroupValue, GroupValueCookedData) == 0x000050, "Member 'UAkGroupValue::GroupValueCookedData' has a wrong offset!");
static_assert(offsetof(UAkGroupValue, GroupShortId) == 0x000064, "Member 'UAkGroupValue::GroupShortId' has a wrong offset!");

// Class AkAudio.AkStateValue
// 0x0000 (0x0070 - 0x0070)
class UAkStateValue final : public UAkGroupValue
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkStateValue">();
	}
	static class UAkStateValue* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkStateValue>();
	}
};
static_assert(alignof(UAkStateValue) == 0x000008, "Wrong alignment on UAkStateValue");
static_assert(sizeof(UAkStateValue) == 0x000070, "Wrong size on UAkStateValue");

// Class AkAudio.AkAudioInputComponent
// 0x0030 (0x05D0 - 0x05A0)
class UAkAudioInputComponent : public UAkComponent
{
public:
	uint8                                         Pad_5A0[0x30];                                     // 0x05A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAssociatedAudioInputEvent()	 // 0x4364558;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAudioInputComponent">();
	}
	static class UAkAudioInputComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAudioInputComponent>();
	}
};
static_assert(alignof(UAkAudioInputComponent) == 0x000010, "Wrong alignment on UAkAudioInputComponent");
static_assert(sizeof(UAkAudioInputComponent) == 0x0005D0, "Wrong size on UAkAudioInputComponent");

// Class AkAudio.AkSubmixInputComponent
// 0x0060 (0x0630 - 0x05D0)
class UAkSubmixInputComponent final : public UAkAudioInputComponent
{
public:
	uint8                                         Pad_5D0[0x8];                                      // 0x05D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundSubmix*                           SubmixToRecord;                                    // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E0[0x50];                                     // 0x05E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkSubmixInputComponent">();
	}
	static class UAkSubmixInputComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkSubmixInputComponent>();
	}
};
static_assert(alignof(UAkSubmixInputComponent) == 0x000010, "Wrong alignment on UAkSubmixInputComponent");
static_assert(sizeof(UAkSubmixInputComponent) == 0x000630, "Wrong size on UAkSubmixInputComponent");
static_assert(offsetof(UAkSubmixInputComponent, SubmixToRecord) == 0x0005D8, "Member 'UAkSubmixInputComponent::SubmixToRecord' has a wrong offset!");

// Class AkAudio.AkAcousticTexture
// 0x0010 (0x0060 - 0x0050)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	struct FWwiseAcousticTextureCookedData        AcousticTextureCookedData;                         // 0x0050(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAcousticTexture">();
	}
	static class UAkAcousticTexture* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
static_assert(alignof(UAkAcousticTexture) == 0x000008, "Wrong alignment on UAkAcousticTexture");
static_assert(sizeof(UAkAcousticTexture) == 0x000060, "Wrong size on UAkAcousticTexture");
static_assert(offsetof(UAkAcousticTexture, AcousticTextureCookedData) == 0x000050, "Member 'UAkAcousticTexture::AcousticTextureCookedData' has a wrong offset!");

// Class AkAudio.AkAcousticTextureSetComponent
// 0x0020 (0x0300 - 0x02E0)
#pragma pack(push, 0x1)
class alignas(0x10) UAkAcousticTextureSetComponent : public USceneComponent
{
public:
	uint8                                         Pad_2E0[0x18];                                     // 0x02E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAcousticTextureSetComponent">();
	}
	static class UAkAcousticTextureSetComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAcousticTextureSetComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAkAcousticTextureSetComponent) == 0x000010, "Wrong alignment on UAkAcousticTextureSetComponent");
static_assert(sizeof(UAkAcousticTextureSetComponent) == 0x000300, "Wrong size on UAkAcousticTextureSetComponent");

// Class AkAudio.AkAmbientSound
// 0x0040 (0x02F0 - 0x02B0)
class AAkAmbientSound final : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x02B0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                           AkComponent;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x2E];                                     // 0x02C2(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound()	 // 0x436693c;
	void StopAmbientSound()	 // 0x4366950;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAmbientSound">();
	}
	static class AAkAmbientSound* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
static_assert(alignof(AAkAmbientSound) == 0x000008, "Wrong alignment on AAkAmbientSound");
static_assert(sizeof(AAkAmbientSound) == 0x0002F0, "Wrong size on AAkAmbientSound");
static_assert(offsetof(AAkAmbientSound, AkAudioEvent) == 0x0002B0, "Member 'AAkAmbientSound::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, AkComponent) == 0x0002B8, "Member 'AAkAmbientSound::AkComponent' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, StopWhenOwnerIsDestroyed) == 0x0002C0, "Member 'AAkAmbientSound::StopWhenOwnerIsDestroyed' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, AutoPost) == 0x0002C1, "Member 'AAkAmbientSound::AutoPost' has a wrong offset!");

// Class AkAudio.AkAndroidInitializationSettings
// 0x00D8 (0x0100 - 0x0028)
class UAkAndroidInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0030(0x0070)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00A0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x00C0(0x0040)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	void MigrateMultiCoreRendering(bool NewValue)	 // 0x4363d70;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAndroidInitializationSettings">();
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
static_assert(alignof(UAkAndroidInitializationSettings) == 0x000008, "Wrong alignment on UAkAndroidInitializationSettings");
static_assert(sizeof(UAkAndroidInitializationSettings) == 0x000100, "Wrong size on UAkAndroidInitializationSettings");
static_assert(offsetof(UAkAndroidInitializationSettings, CommonSettings) == 0x000030, "Member 'UAkAndroidInitializationSettings::CommonSettings' has a wrong offset!");
static_assert(offsetof(UAkAndroidInitializationSettings, CommunicationSettings) == 0x0000A0, "Member 'UAkAndroidInitializationSettings::CommunicationSettings' has a wrong offset!");
static_assert(offsetof(UAkAndroidInitializationSettings, AdvancedSettings) == 0x0000C0, "Member 'UAkAndroidInitializationSettings::AdvancedSettings' has a wrong offset!");

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0070 - 0x0028)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkPlatformInfo">();
	}
	static class UAkPlatformInfo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
static_assert(alignof(UAkPlatformInfo) == 0x000008, "Wrong alignment on UAkPlatformInfo");
static_assert(sizeof(UAkPlatformInfo) == 0x000070, "Wrong size on UAkPlatformInfo");

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0070 - 0x0070)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAndroidPlatformInfo">();
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
static_assert(alignof(UAkAndroidPlatformInfo) == 0x000008, "Wrong alignment on UAkAndroidPlatformInfo");
static_assert(sizeof(UAkAndroidPlatformInfo) == 0x000070, "Wrong size on UAkAndroidPlatformInfo");

// Class AkAudio.AkAudioBank
// 0x0008 (0x0058 - 0x0050)
class UAkAudioBank final : public UAkAudioType
{
public:
	bool                                          AutoLoad;                                          // 0x0050(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAudioBank">();
	}
	static class UAkAudioBank* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
static_assert(alignof(UAkAudioBank) == 0x000008, "Wrong alignment on UAkAudioBank");
static_assert(sizeof(UAkAudioBank) == 0x000058, "Wrong size on UAkAudioBank");
static_assert(offsetof(UAkAudioBank, AutoLoad) == 0x000050, "Member 'UAkAudioBank::AutoLoad' has a wrong offset!");

// Class AkAudio.AkAudioEvent
// 0x0080 (0x00D0 - 0x0050)
class UAkAudioEvent final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseLocalizedEventCookedData         EventCookedData;                                   // 0x0060(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00C0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 ExecuteAction(const EAkActionOnEventType ActionType, const class AActor* Actor, const int32 PlayingID, const int32 TransitionDuration, const EAkCurveInterpolation FadeCurve)	 // 0x436388c;
	int32 PostAtLocation(const struct FVector& Location, const struct FRotator& Orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject)	 // 0x4364580;
	int32 PostOnActor(const class AActor* Actor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed)	 // 0x4364920;
	int32 PostOnActorAndWait(const class AActor* Actor, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo)	 // 0x4364c04;
	int32 PostOnComponent(class UAkComponent* Component, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed)	 // 0x4364ea8;
	int32 PostOnComponentAndWait(class UAkComponent* Component, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo)	 // 0x43651e0;
	int32 PostOnGameObject(class UAkGameObject* GameObject, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask)	 // 0x4365514;
	int32 PostOnGameObjectAndWait(class UAkGameObject* GameObject, const struct FLatentActionInfo& LatentActionInfo)	 // 0x436571c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAudioEvent">();
	}
	static class UAkAudioEvent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
static_assert(alignof(UAkAudioEvent) == 0x000008, "Wrong alignment on UAkAudioEvent");
static_assert(sizeof(UAkAudioEvent) == 0x0000D0, "Wrong size on UAkAudioEvent");
static_assert(offsetof(UAkAudioEvent, MaxAttenuationRadius) == 0x000050, "Member 'UAkAudioEvent::MaxAttenuationRadius' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, IsInfinite) == 0x000054, "Member 'UAkAudioEvent::IsInfinite' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, MinimumDuration) == 0x000058, "Member 'UAkAudioEvent::MinimumDuration' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, MaximumDuration) == 0x00005C, "Member 'UAkAudioEvent::MaximumDuration' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, EventCookedData) == 0x000060, "Member 'UAkAudioEvent::EventCookedData' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, RequiredBank) == 0x0000C0, "Member 'UAkAudioEvent::RequiredBank' has a wrong offset!");

// Class AkAudio.AkAuxBus
// 0x0070 (0x00C0 - 0x0050)
class UAkAuxBus final : public UAkAudioType
{
public:
	struct FWwiseLocalizedAuxBusCookedData        AuxBusCookedData;                                  // 0x0050(0x0060)(Edit, Transient, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00B0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAuxBus">();
	}
	static class UAkAuxBus* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAuxBus>();
	}
};
static_assert(alignof(UAkAuxBus) == 0x000008, "Wrong alignment on UAkAuxBus");
static_assert(sizeof(UAkAuxBus) == 0x0000C0, "Wrong size on UAkAuxBus");
static_assert(offsetof(UAkAuxBus, AuxBusCookedData) == 0x000050, "Member 'UAkAuxBus::AuxBusCookedData' has a wrong offset!");
static_assert(offsetof(UAkAuxBus, RequiredBank) == 0x0000B0, "Member 'UAkAuxBus::RequiredBank' has a wrong offset!");

// Class AkAudio.AkCheckBox
// 0x0E48 (0x0FB0 - 0x0168)
class UAkCheckBox final : public UContentWidget
{
public:
	uint8                                         Pad_168[0x280];                                    // 0x0168(0x0280)(Fixing Size After Last Property [ Dumper-7 ])
	ECheckBoxState                                CheckedState;                                      // 0x03E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             CheckedStateDelegate;                              // 0x03EC(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         WidgetStyle;                                       // 0x0400(0x0AD0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0ED0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x0ED1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED2[0x6];                                      // 0x0ED2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkBoolPropertyToControl               ThePropertyToControl;                              // 0x0ED8(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FAkWwiseItemToControl                  ItemToControl;                                     // 0x0EE8(0x0040)(Edit, Config, EditConst, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsChecked)> AkOnCheckStateChanged;                           // 0x0F28(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGuid& ItemDroppedID)> OnItemDropped;                 // 0x0F38(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PropertyDropped)> OnPropertyDropped;          // 0x0F48(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_F58[0x58];                                     // 0x0F58(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAkBoolProperty(const class FString& ItemProperty)	 // 0x4365b64;
	void SetAkItemId(const struct FGuid& ItemId)	 // 0x4365c34;
	void SetCheckedState(ECheckBoxState InCheckedState)	 // 0x4365e48;
	void SetIsChecked(bool InIsChecked)	 // 0x436644c;

	const struct FGuid GetAkItemId() const	 // 0x4363b40;
	const class FString GetAkProperty() const	 // 0x4363b8c;
	ECheckBoxState GetCheckedState() const	 // 0x4363c10;
	bool IsChecked() const	 // 0x4363d24;
	bool IsPressed() const	 // 0x4363d48;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkCheckBox">();
	}
	static class UAkCheckBox* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkCheckBox>();
	}
};
static_assert(alignof(UAkCheckBox) == 0x000010, "Wrong alignment on UAkCheckBox");
static_assert(sizeof(UAkCheckBox) == 0x000FB0, "Wrong size on UAkCheckBox");
static_assert(offsetof(UAkCheckBox, CheckedState) == 0x0003E8, "Member 'UAkCheckBox::CheckedState' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, CheckedStateDelegate) == 0x0003EC, "Member 'UAkCheckBox::CheckedStateDelegate' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, WidgetStyle) == 0x000400, "Member 'UAkCheckBox::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, HorizontalAlignment) == 0x000ED0, "Member 'UAkCheckBox::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, IsFocusable) == 0x000ED1, "Member 'UAkCheckBox::IsFocusable' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, ThePropertyToControl) == 0x000ED8, "Member 'UAkCheckBox::ThePropertyToControl' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, ItemToControl) == 0x000EE8, "Member 'UAkCheckBox::ItemToControl' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, AkOnCheckStateChanged) == 0x000F28, "Member 'UAkCheckBox::AkOnCheckStateChanged' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, OnItemDropped) == 0x000F38, "Member 'UAkCheckBox::OnItemDropped' has a wrong offset!");
static_assert(offsetof(UAkCheckBox, OnPropertyDropped) == 0x000F48, "Member 'UAkCheckBox::OnPropertyDropped' has a wrong offset!");

// Class AkAudio.AkComponentTicker
// 0x0020 (0x0060 - 0x0040)
class UAkComponentTicker final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkComponentTicker">();
	}
	static class UAkComponentTicker* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkComponentTicker>();
	}
};
static_assert(alignof(UAkComponentTicker) == 0x000008, "Wrong alignment on UAkComponentTicker");
static_assert(sizeof(UAkComponentTicker) == 0x000060, "Wrong size on UAkComponentTicker");

// Class AkAudio.AkAssetData
// 0x0028 (0x0050 - 0x0028)
class UAkAssetData final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAssetData">();
	}
	static class UAkAssetData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAssetData>();
	}
};
static_assert(alignof(UAkAssetData) == 0x000008, "Wrong alignment on UAkAssetData");
static_assert(sizeof(UAkAssetData) == 0x000050, "Wrong size on UAkAssetData");

// Class AkAudio.AkAssetPlatformData
// 0x0008 (0x0030 - 0x0028)
class UAkAssetPlatformData final : public UObject
{
public:
	class UAkAssetData*                           CurrentAssetData;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkAssetPlatformData">();
	}
	static class UAkAssetPlatformData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkAssetPlatformData>();
	}
};
static_assert(alignof(UAkAssetPlatformData) == 0x000008, "Wrong alignment on UAkAssetPlatformData");
static_assert(sizeof(UAkAssetPlatformData) == 0x000030, "Wrong size on UAkAssetPlatformData");
static_assert(offsetof(UAkAssetPlatformData, CurrentAssetData) == 0x000028, "Member 'UAkAssetPlatformData::CurrentAssetData' has a wrong offset!");

// Class AkAudio.AkMediaAssetData
// 0x0010 (0x0038 - 0x0028)
class UAkMediaAssetData final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkMediaAssetData">();
	}
	static class UAkMediaAssetData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkMediaAssetData>();
	}
};
static_assert(alignof(UAkMediaAssetData) == 0x000008, "Wrong alignment on UAkMediaAssetData");
static_assert(sizeof(UAkMediaAssetData) == 0x000038, "Wrong size on UAkMediaAssetData");

// Class AkAudio.AkMediaAsset
// 0x0050 (0x0078 - 0x0028)
class UAkMediaAsset : public UObject
{
public:
	TMap<class FString, class UAkMediaAssetData*> MediaAssetDataPerPlatform;                         // 0x0028(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AkMediaAsset">();
	}
	static class UAkMediaAsset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAkMediaAsset>();
	}
};
static_assert(alignof(UAkMediaAsset) == 0x000008, "Wrong alignment on UAkMediaAsset");
static_assert(sizeof(UAkMediaAsset) == 0x000078, "Wrong size on UAkMediaAsset");
