#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_Hero_Usable_TPP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.AUV
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_AUV final
{
public:
	struct FPoseLink                              AUV_0;                                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_AUV) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_AUV");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_AUV) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_AUV");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_AUV, AUV_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_AUV::AUV_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_AdditiveLean
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean final
{
public:
	struct FPoseLink                              FullBody_AdditiveLean_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean, FullBody_AdditiveLean_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_AdditiveLean::FullBody_AdditiveLean_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Additives
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Additives final
{
public:
	struct FPoseLink                              FullBody_Additives_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Additives) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Additives");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Additives) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Additives");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Additives, FullBody_Additives_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Additives::FullBody_Additives_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Aiming_State
// 0x0030 (0x0030 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Aiming_State final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        InYaw;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InPitch;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              FullBody_Aiming_State_0;                           // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Aiming_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State) == 0x000030, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Aiming_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State, InPose) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Aiming_State::InPose' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State, InYaw) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Aiming_State::InYaw' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State, InPitch) == 0x000018, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Aiming_State::InPitch' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Aiming_State, FullBody_Aiming_State_0) == 0x000020, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Aiming_State::FullBody_Aiming_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Cycle_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Cycle_State final
{
public:
	struct FPoseLink                              FullBody_Cycle_State_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Cycle_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Cycle_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Cycle_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Cycle_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Cycle_State, FullBody_Cycle_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Cycle_State::FullBody_Cycle_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Dbno_Override
// 0x0020 (0x0020 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override final
{
public:
	struct FPoseLink                              InPose_2;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody_Dbno_Override_0;                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override) == 0x000020, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override, InPose_2) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override::InPose_2' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override, FullBody_Dbno_Override_0) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Dbno_Override::FullBody_Dbno_Override_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_FallLand_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_FallLand_State final
{
public:
	struct FPoseLink                              FullBody_FallLand_State_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_FallLand_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_FallLand_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_FallLand_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_FallLand_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_FallLand_State, FullBody_FallLand_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_FallLand_State::FullBody_FallLand_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_FallLoop_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State final
{
public:
	struct FPoseLink                              FullBody_FallLoop_State_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State, FullBody_FallLoop_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_FallLoop_State::FullBody_FallLoop_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Idle_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Idle_State final
{
public:
	struct FPoseLink                              FullBody_Idle_State_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Idle_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Idle_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Idle_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Idle_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Idle_State, FullBody_Idle_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Idle_State::FullBody_Idle_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_JumpApex_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State final
{
public:
	struct FPoseLink                              FullBody_JumpApex_State_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State, FullBody_JumpApex_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_JumpApex_State::FullBody_JumpApex_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_JumpLoop_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State final
{
public:
	struct FPoseLink                              FullBody_JumpLoop_State_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State, FullBody_JumpLoop_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_JumpLoop_State::FullBody_JumpLoop_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_JumpStart_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State final
{
public:
	struct FPoseLink                              FullBody_JumpStart_State_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State, FullBody_JumpStart_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_JumpStart_State::FullBody_JumpStart_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Melee
// 0x0020 (0x0020 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Melee final
{
public:
	struct FPoseLink                              InPose_3;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody_Melee_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Melee) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Melee");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Melee) == 0x000020, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Melee");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Melee, InPose_3) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Melee::InPose_3' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Melee, FullBody_Melee_0) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Melee::FullBody_Melee_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Pivot_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Pivot_State final
{
public:
	struct FPoseLink                              FullBody_Pivot_State_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Pivot_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Pivot_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Pivot_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Pivot_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Pivot_State, FullBody_Pivot_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Pivot_State::FullBody_Pivot_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_SkeletalControls
// 0x0020 (0x0020 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls final
{
public:
	struct FPoseLink                              InPose_SkelControls;                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody_SkeletalControls_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls) == 0x000020, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls, InPose_SkelControls) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls::InPose_SkelControls' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls, FullBody_SkeletalControls_0) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_FullBody_SkeletalControls::FullBody_SkeletalControls_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Slide
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Slide final
{
public:
	struct FPoseLink                              FullBody_Slide_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Slide) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Slide");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Slide) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Slide");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Slide, FullBody_Slide_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Slide::FullBody_Slide_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Start_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Start_State final
{
public:
	struct FPoseLink                              FullBody_Start_State_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Start_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Start_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Start_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Start_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Start_State, FullBody_Start_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Start_State::FullBody_Start_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Stop_State
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Stop_State final
{
public:
	struct FPoseLink                              FullBody_Stop_State_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Stop_State) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Stop_State");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Stop_State) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Stop_State");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Stop_State, FullBody_Stop_State_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Stop_State::FullBody_Stop_State_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Swimming
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Swimming final
{
public:
	struct FPoseLink                              FullBody_Swimming_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Swimming) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Swimming");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Swimming) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Swimming");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Swimming, FullBody_Swimming_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Swimming::FullBody_Swimming_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.FullBody_Vault
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_FullBody_Vault final
{
public:
	struct FPoseLink                              FullBody_Vault_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_FullBody_Vault) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_FullBody_Vault");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_FullBody_Vault) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_FullBody_Vault");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_FullBody_Vault, FullBody_Vault_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_FullBody_Vault::FullBody_Vault_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.Grip_Override
// 0x0020 (0x0020 - 0x0000)
struct ALI_Hero_Usable_TPP_C_Grip_Override final
{
public:
	struct FPoseLink                              InPose_Grip;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Grip_Override_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_Grip_Override) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_Grip_Override");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_Grip_Override) == 0x000020, "Wrong size on ALI_Hero_Usable_TPP_C_Grip_Override");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_Grip_Override, InPose_Grip) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_Grip_Override::InPose_Grip' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_Grip_Override, Grip_Override_0) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_Grip_Override::Grip_Override_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.LocalLayer
// 0x0020 (0x0020 - 0x0000)
struct ALI_Hero_Usable_TPP_C_LocalLayer final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LocalLayer_0;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_LocalLayer) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_LocalLayer");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_LocalLayer) == 0x000020, "Wrong size on ALI_Hero_Usable_TPP_C_LocalLayer");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_LocalLayer, InPose_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_LocalLayer::InPose_0' has a wrong offset!");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_LocalLayer, LocalLayer_0) == 0x000010, "Member 'ALI_Hero_Usable_TPP_C_LocalLayer::LocalLayer_0' has a wrong offset!");

// Function ALI_Hero_Usable_TPP.ALI_Hero_Usable_TPP_C.LocomotionOverride
// 0x0010 (0x0010 - 0x0000)
struct ALI_Hero_Usable_TPP_C_LocomotionOverride final
{
public:
	struct FPoseLink                              LocomotionOverride_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ALI_Hero_Usable_TPP_C_LocomotionOverride) == 0x000008, "Wrong alignment on ALI_Hero_Usable_TPP_C_LocomotionOverride");
static_assert(sizeof(ALI_Hero_Usable_TPP_C_LocomotionOverride) == 0x000010, "Wrong size on ALI_Hero_Usable_TPP_C_LocomotionOverride");
static_assert(offsetof(ALI_Hero_Usable_TPP_C_LocomotionOverride, LocomotionOverride_0) == 0x000000, "Member 'ALI_Hero_Usable_TPP_C_LocomotionOverride::LocomotionOverride_0' has a wrong offset!");

}

