#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AugmentedReality_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AugmentedReality.ARActor
// 0x0000 (0x02B0 - 0x02B0)
class AARActor final : public AActor
{
public:
	class UARComponent* AddARComponent(TSubclassOf<class UARComponent> InComponentClass, const struct FGuid& NativeID)	 // 0x62c934c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARActor">();
	}
	static class AARActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AARActor>();
	}
};
static_assert(alignof(AARActor) == 0x000008, "Wrong alignment on AARActor");
static_assert(sizeof(AARActor) == 0x0002B0, "Wrong size on AARActor");

// Class AugmentedReality.ARBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UARBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AddManualEnvironmentCaptureProbe(const struct FVector& Location, const struct FVector& Extent)	 // 0x62c9ae0;
	static class UARCandidateImage* AddRuntimeCandidateImage(class UARSessionConfig* SessionConfig, class UTexture2D* CandidateTexture, const class FString& FriendlyName, float PhysicalWidth)	 // 0x62c9c54;
	static bool AddTrackedPointWithName(const struct FTransform& WorldTransform, const class FString& PointName, bool bDeletePointsWithSameName)	 // 0x62c9eb8;
	static void CalculateAlignmentTransform(const struct FTransform& TransformInFirstCoordinateSystem, const struct FTransform& TransformInSecondCoordinateSystem, struct FTransform* AlignmentTransform)	 // 0x62ca0d0;
	static void CalculateClosestIntersection(const TArray<struct FVector>& StartPoints, const TArray<struct FVector>& EndPoints, struct FVector* ClosestIntersection)	 // 0x62ca2f4;
	static void DebugDrawPin(class UARPin* ARPin, class UObject* WorldContextObject, const struct FLinearColor& Color, float Scale, float PersistForSeconds)	 // 0x62caf84;
	static void DebugDrawTrackedGeometry(class UARTrackedGeometry* TrackedGeometry, class UObject* WorldContextObject, const struct FLinearColor& Color, float OutlineThickness, float PersistForSeconds)	 // 0x62cb278;
	static TArray<class UARTrackedPoint*> FindTrackedPointsByName(const class FString& PointName)	 // 0x62cb56c;
	static struct FTransform GetAlignmentTransform()	 // 0x62cb7b0;
	static TArray<class UARTrackedGeometry*> GetAllGeometries()	 // 0x62cb80c;
	static TArray<class UARTrackedGeometry*> GetAllGeometriesByClass(TSubclassOf<class UARTrackedGeometry> GeometryClass)	 // 0x62cb848;
	static TArray<class UARPin*> GetAllPins()	 // 0x62cba0c;
	static TArray<struct FARPose2D> GetAllTracked2DPoses()	 // 0x62cba48;
	static TArray<class UAREnvironmentCaptureProbe*> GetAllTrackedEnvironmentCaptureProbes()	 // 0x62cbae4;
	static TArray<class UARTrackedImage*> GetAllTrackedImages()	 // 0x62cbb50;
	static TArray<class UARPlaneGeometry*> GetAllTrackedPlanes()	 // 0x62cbbbc;
	static TArray<class UARTrackedPoint*> GetAllTrackedPoints()	 // 0x62cbc28;
	static TArray<class UARTrackedPose*> GetAllTrackedPoses()	 // 0x62cbc64;
	static struct FARSessionStatus GetARSessionStatus()	 // 0x62cb678;
	static class UARTexture* GetARTexture(EARTextureType TextureType)	 // 0x62cb6c8;
	static float GetARWorldScale()	 // 0x62cb788;
	static class UARTextureCameraDepth* GetCameraDepth()	 // 0x62cbef0;
	static class UARTextureCameraImage* GetCameraImage()	 // 0x62cbf40;
	static bool GetCameraIntrinsics(struct FARCameraIntrinsics* OutCameraIntrinsics)	 // 0x62cbf90;
	static class UARLightEstimate* GetCurrentLightEstimate()	 // 0x62cc160;
	static int32 GetNumberOfTrackedFacesSupported()	 // 0x62ccaf8;
	static bool GetObjectClassificationAtLocation(const struct FVector& InWorldLocation, EARObjectClassification* OutClassification, struct FVector* OutClassificationLocation, float MaxLocationDiff)	 // 0x62ccb34;
	static class UARTexture* GetPersonSegmentationDepthImage()	 // 0x62cd048;
	static class UARTexture* GetPersonSegmentationImage()	 // 0x62cd070;
	static TArray<struct FVector> GetPointCloud()	 // 0x62cd0bc;
	static class UARSessionConfig* GetSessionConfig()	 // 0x62cd114;
	static TArray<struct FARVideoFormat> GetSupportedVideoFormats(EARSessionType SessionType)	 // 0x62cd164;
	static EARTrackingQuality GetTrackingQuality()	 // 0x62cd404;
	static EARTrackingQualityReason GetTrackingQualityReason()	 // 0x62cd428;
	static EARWorldMappingState GetWorldMappingStatus()	 // 0x62cd4ac;
	static bool IsARPinLocalStoreReady()	 // 0x62cd86c;
	static bool IsARPinLocalStoreSupported()	 // 0x62cd890;
	static bool IsARSupported()	 // 0x62cd8b4;
	static bool IsSceneReconstructionSupported(EARSessionType SessionType, EARSceneReconstruction SceneReconstructionMethod)	 // 0x62cd8d8;
	static bool IsSessionTrackingFeatureSupported(EARSessionType SessionType, EARSessionTrackingFeature SessionTrackingFeature)	 // 0x62cda18;
	static bool IsSessionTypeSupported(EARSessionType SessionType)	 // 0x62cdb58;
	static TArray<struct FARTraceResult> LineTraceTrackedObjects(const struct FVector2D& ScreenCoord, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon)	 // 0x62cdfb4;
	static TArray<struct FARTraceResult> LineTraceTrackedObjects3D(const struct FVector& Start, const struct FVector& End, bool bTestFeaturePoints, bool bTestGroundPlane, bool bTestPlaneExtents, bool bTestPlaneBoundaryPolygon)	 // 0x62cdc34;
	static TMap<class FName, class UARPin*> LoadARPinsFromLocalStore()	 // 0x62ce29c;
	static void PauseARSession()	 // 0x62ce358;
	static class UARPin* PinComponent(class USceneComponent* ComponentToPin, const struct FTransform& PinToWorldTransform, class UARTrackedGeometry* TrackedGeometry, const class FName DebugName)	 // 0x62ce36c;
	static bool PinComponentToARPin(class USceneComponent* ComponentToPin, class UARPin* Pin)	 // 0x62ce5e0;
	static class UARPin* PinComponentToTraceResult(class USceneComponent* ComponentToPin, const struct FARTraceResult& TraceResult, const class FName DebugName)	 // 0x62ce720;
	static void RemoveAllARPinsFromLocalStore()	 // 0x62ce9e8;
	static void RemoveARPinFromLocalStore(class FName InSaveName)	 // 0x62ce938;
	static void RemovePin(class UARPin* PinToRemove)	 // 0x62ce9fc;
	static struct FIntPoint ResizeXRCamera(const struct FIntPoint& InSize)	 // 0x62cecd4;
	static bool SaveARPinToLocalStore(class FName InSaveName, class UARPin* InPin)	 // 0x62ced64;
	static void SetAlignmentTransform(const struct FTransform& InAlignmentTransform)	 // 0x62d0010;
	static void SetARWorldOriginLocationAndRotation(const struct FVector& OriginLocation, const struct FRotator& OriginRotation, bool bIsTransformInWorldSpace, bool bMaintainUpDirection)	 // 0x62cfce0;
	static void SetARWorldScale(float InWorldScale)	 // 0x62cff3c;
	static void SetEnabledXRCamera(bool bOnOff)	 // 0x62d04b0;
	static void StartARSession(class UARSessionConfig* SessionConfig)	 // 0x62d148c;
	static void StopARSession()	 // 0x62d179c;
	static bool ToggleARCapture(const bool bOnOff, const EARCaptureType CaptureType)	 // 0x62d17b0;
	static void UnpinComponent(class USceneComponent* ComponentToUnpin)	 // 0x62d1900;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARBlueprintLibrary">();
	}
	static class UARBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARBlueprintLibrary>();
	}
};
static_assert(alignof(UARBlueprintLibrary) == 0x000008, "Wrong alignment on UARBlueprintLibrary");
static_assert(sizeof(UARBlueprintLibrary) == 0x000028, "Wrong size on UARBlueprintLibrary");

// Class AugmentedReality.ARTraceResultLibrary
// 0x0000 (0x0028 - 0x0028)
class UARTraceResultLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetDistanceFromCamera(const struct FARTraceResult& TraceResult)	 // 0x62cc1f4;
	static struct FTransform GetLocalToTrackingTransform(const struct FARTraceResult& TraceResult)	 // 0x62cc6fc;
	static struct FTransform GetLocalToWorldTransform(const struct FARTraceResult& TraceResult)	 // 0x62cc868;
	static struct FTransform GetLocalTransform(const struct FARTraceResult& TraceResult)	 // 0x62cc9d4;
	static EARLineTraceChannels GetTraceChannel(const struct FARTraceResult& TraceResult)	 // 0x62cd25c;
	static class UARTrackedGeometry* GetTrackedGeometry(const struct FARTraceResult& TraceResult)	 // 0x62cd320;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARTraceResultLibrary">();
	}
	static class UARTraceResultLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARTraceResultLibrary>();
	}
};
static_assert(alignof(UARTraceResultLibrary) == 0x000008, "Wrong alignment on UARTraceResultLibrary");
static_assert(sizeof(UARTraceResultLibrary) == 0x000028, "Wrong size on UARTraceResultLibrary");

// Class AugmentedReality.ARBaseAsyncTaskBlueprintProxy
// 0x0020 (0x0050 - 0x0030)
class UARBaseAsyncTaskBlueprintProxy : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARBaseAsyncTaskBlueprintProxy">();
	}
	static class UARBaseAsyncTaskBlueprintProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARBaseAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARBaseAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARBaseAsyncTaskBlueprintProxy");
static_assert(sizeof(UARBaseAsyncTaskBlueprintProxy) == 0x000050, "Wrong size on UARBaseAsyncTaskBlueprintProxy");

// Class AugmentedReality.ARSaveWorldAsyncTaskBlueprintProxy
// 0x0030 (0x0080 - 0x0050)
class UARSaveWorldAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	TMulticastInlineDelegate<void(const TArray<uint8>& SavedWorld)> OnSuccess;                       // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<uint8>& SavedWorld)> OnFailed;                        // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARSaveWorldAsyncTaskBlueprintProxy* ARSaveWorld(class UObject* WorldContextObject)	 // 0x62c9270;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARSaveWorldAsyncTaskBlueprintProxy">();
	}
	static class UARSaveWorldAsyncTaskBlueprintProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARSaveWorldAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARSaveWorldAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARSaveWorldAsyncTaskBlueprintProxy");
static_assert(sizeof(UARSaveWorldAsyncTaskBlueprintProxy) == 0x000080, "Wrong size on UARSaveWorldAsyncTaskBlueprintProxy");
static_assert(offsetof(UARSaveWorldAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UARSaveWorldAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UARSaveWorldAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UARSaveWorldAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARGetCandidateObjectAsyncTaskBlueprintProxy
// 0x0060 (0x00B0 - 0x0050)
class UARGetCandidateObjectAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	TMulticastInlineDelegate<void(class UARCandidateObject* SavedObject)> OnSuccess;                 // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UARCandidateObject* SavedObject)> OnFailed;                  // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x40];                                      // 0x0070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* ARGetCandidateObject(class UObject* WorldContextObject, const struct FVector& Location, const struct FVector& Extent)	 // 0x62c9050;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARGetCandidateObjectAsyncTaskBlueprintProxy">();
	}
	static class UARGetCandidateObjectAsyncTaskBlueprintProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARGetCandidateObjectAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UARGetCandidateObjectAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UARGetCandidateObjectAsyncTaskBlueprintProxy");
static_assert(sizeof(UARGetCandidateObjectAsyncTaskBlueprintProxy) == 0x0000B0, "Wrong size on UARGetCandidateObjectAsyncTaskBlueprintProxy");
static_assert(offsetof(UARGetCandidateObjectAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UARGetCandidateObjectAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UARGetCandidateObjectAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UARGetCandidateObjectAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARComponent
// 0x0080 (0x0360 - 0x02E0)
class UARComponent : public USceneComponent
{
public:
	struct FGuid                                  NativeID;                                          // 0x02E0(0x0010)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x30];                                     // 0x02F0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseDefaultReplication;                            // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DefaultMeshMaterial;                               // 0x0328(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultWireframeMeshMaterial;                      // 0x0330(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMRMeshComponent*                       MRMeshComponent;                                   // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UARTrackedGeometry*                     MyTrackedGeometry;                                 // 0x0340(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x18];                                     // 0x0348(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMRMeshComponent* GetMRMesh()	 // 0x16099bc;
	void OnRep_Payload()	 // 0x62ce340;
	void ReceiveRemove()	 // 0xae1e64;
	void SetNativeID(const struct FGuid& NativeID_0)	 // 0x62d0afc;
	void UpdateVisualization()	 // 0x62d19b0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARComponent">();
	}
	static class UARComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARComponent>();
	}
};
static_assert(alignof(UARComponent) == 0x000010, "Wrong alignment on UARComponent");
static_assert(sizeof(UARComponent) == 0x000360, "Wrong size on UARComponent");
static_assert(offsetof(UARComponent, NativeID) == 0x0002E0, "Member 'UARComponent::NativeID' has a wrong offset!");
static_assert(offsetof(UARComponent, bUseDefaultReplication) == 0x000320, "Member 'UARComponent::bUseDefaultReplication' has a wrong offset!");
static_assert(offsetof(UARComponent, DefaultMeshMaterial) == 0x000328, "Member 'UARComponent::DefaultMeshMaterial' has a wrong offset!");
static_assert(offsetof(UARComponent, DefaultWireframeMeshMaterial) == 0x000330, "Member 'UARComponent::DefaultWireframeMeshMaterial' has a wrong offset!");
static_assert(offsetof(UARComponent, MRMeshComponent) == 0x000338, "Member 'UARComponent::MRMeshComponent' has a wrong offset!");
static_assert(offsetof(UARComponent, MyTrackedGeometry) == 0x000340, "Member 'UARComponent::MyTrackedGeometry' has a wrong offset!");

// Class AugmentedReality.ARPlaneComponent
// 0x00D0 (0x0430 - 0x0360)
class UARPlaneComponent final : public UARComponent
{
public:
	struct FARPlaneUpdatePayload                  ReplicatedPayload;                                 // 0x0360(0x00D0)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static const TMap<EARObjectClassification, struct FLinearColor> GetObjectClassificationDebugColors()	 // 0x62cd014;
	static void SetObjectClassificationDebugColors(const TMap<EARObjectClassification, struct FLinearColor>& InColors)	 // 0x62d0bc0;
	static void SetPlaneComponentDebugMode(EPlaneComponentDebugMode NewDebugMode)	 // 0x62d0c98;

	void ReceiveAdd(const struct FARPlaneUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARPlaneUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARPlaneUpdatePayload& NewPayload)	 // 0x62cf734;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARPlaneComponent">();
	}
	static class UARPlaneComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARPlaneComponent>();
	}
};
static_assert(alignof(UARPlaneComponent) == 0x000010, "Wrong alignment on UARPlaneComponent");
static_assert(sizeof(UARPlaneComponent) == 0x000430, "Wrong size on UARPlaneComponent");
static_assert(offsetof(UARPlaneComponent, ReplicatedPayload) == 0x000360, "Member 'UARPlaneComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARPointComponent
// 0x0010 (0x0370 - 0x0360)
class UARPointComponent final : public UARComponent
{
public:
	struct FARPointUpdatePayload                  ReplicatedPayload;                                 // 0x0360(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_361[0xF];                                      // 0x0361(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveAdd(const struct FARPointUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARPointUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARPointUpdatePayload& NewPayload)	 // 0x62cf850;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARPointComponent">();
	}
	static class UARPointComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARPointComponent>();
	}
};
static_assert(alignof(UARPointComponent) == 0x000010, "Wrong alignment on UARPointComponent");
static_assert(sizeof(UARPointComponent) == 0x000370, "Wrong size on UARPointComponent");
static_assert(offsetof(UARPointComponent, ReplicatedPayload) == 0x000360, "Member 'UARPointComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARFaceComponent
// 0x0090 (0x03F0 - 0x0360)
class UARFaceComponent final : public UARComponent
{
public:
	EARFaceTransformMixing                        TransformSetting;                                  // 0x0360(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateVertexNormal;                               // 0x0361(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFaceOutOfScreen;                                  // 0x0362(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_363[0x5];                                      // 0x0363(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FARFaceUpdatePayload                   ReplicatedPayload;                                 // 0x0368(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C8[0x28];                                     // 0x03C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetFaceComponentDebugMode(EFaceComponentDebugMode NewDebugMode)	 // 0x62d0668;

	void ReceiveAdd(const struct FARFaceUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARFaceUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARFaceUpdatePayload& NewPayload)	 // 0x62cf2bc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARFaceComponent">();
	}
	static class UARFaceComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARFaceComponent>();
	}
};
static_assert(alignof(UARFaceComponent) == 0x000010, "Wrong alignment on UARFaceComponent");
static_assert(sizeof(UARFaceComponent) == 0x0003F0, "Wrong size on UARFaceComponent");
static_assert(offsetof(UARFaceComponent, TransformSetting) == 0x000360, "Member 'UARFaceComponent::TransformSetting' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, bUpdateVertexNormal) == 0x000361, "Member 'UARFaceComponent::bUpdateVertexNormal' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, bFaceOutOfScreen) == 0x000362, "Member 'UARFaceComponent::bFaceOutOfScreen' has a wrong offset!");
static_assert(offsetof(UARFaceComponent, ReplicatedPayload) == 0x000368, "Member 'UARFaceComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARImageComponent
// 0x00A0 (0x0400 - 0x0360)
class UARImageComponent final : public UARComponent
{
public:
	struct FARImageUpdatePayload                  ReplicatedPayload;                                 // 0x0360(0x00A0)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static void SetImageComponentDebugMode(EImageComponentDebugMode NewDebugMode)	 // 0x62d0a3c;

	void ReceiveAdd(const struct FARImageUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARImageUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARImageUpdatePayload& NewPayload)	 // 0x62cf4c8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARImageComponent">();
	}
	static class UARImageComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARImageComponent>();
	}
};
static_assert(alignof(UARImageComponent) == 0x000010, "Wrong alignment on UARImageComponent");
static_assert(sizeof(UARImageComponent) == 0x000400, "Wrong size on UARImageComponent");
static_assert(offsetof(UARImageComponent, ReplicatedPayload) == 0x000360, "Member 'UARImageComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARQRCodeComponent
// 0x00B0 (0x0410 - 0x0360)
class UARQRCodeComponent final : public UARComponent
{
public:
	struct FARQRCodeUpdatePayload                 ReplicatedPayload;                                 // 0x0360(0x00B0)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetQRCodeComponentDebugMode(EQRCodeComponentDebugMode NewDebugMode)	 // 0x62d0f48;

	void ReceiveAdd(const struct FARQRCodeUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARQRCodeUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARQRCodeUpdatePayload& NewPayload)	 // 0x62cfa94;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARQRCodeComponent">();
	}
	static class UARQRCodeComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARQRCodeComponent>();
	}
};
static_assert(alignof(UARQRCodeComponent) == 0x000010, "Wrong alignment on UARQRCodeComponent");
static_assert(sizeof(UARQRCodeComponent) == 0x000410, "Wrong size on UARQRCodeComponent");
static_assert(offsetof(UARQRCodeComponent, ReplicatedPayload) == 0x000360, "Member 'UARQRCodeComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARPoseComponent
// 0x0070 (0x03D0 - 0x0360)
class UARPoseComponent final : public UARComponent
{
public:
	struct FARPoseUpdatePayload                   ReplicatedPayload;                                 // 0x0360(0x0070)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetPoseComponentDebugMode(EPoseComponentDebugMode NewDebugMode)	 // 0x62d0d58;

	void ReceiveAdd(const struct FARPoseUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARPoseUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARPoseUpdatePayload& NewPayload)	 // 0x62cf92c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARPoseComponent">();
	}
	static class UARPoseComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARPoseComponent>();
	}
};
static_assert(alignof(UARPoseComponent) == 0x000010, "Wrong alignment on UARPoseComponent");
static_assert(sizeof(UARPoseComponent) == 0x0003D0, "Wrong size on UARPoseComponent");
static_assert(offsetof(UARPoseComponent, ReplicatedPayload) == 0x000360, "Member 'UARPoseComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.AREnvironmentProbeComponent
// 0x0060 (0x03C0 - 0x0360)
class UAREnvironmentProbeComponent final : public UARComponent
{
public:
	struct FAREnvironmentProbeUpdatePayload       ReplicatedPayload;                                 // 0x0360(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FAREnvironmentProbeUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FAREnvironmentProbeUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FAREnvironmentProbeUpdatePayload& NewPayload)	 // 0x62cf16c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AREnvironmentProbeComponent">();
	}
	static class UAREnvironmentProbeComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAREnvironmentProbeComponent>();
	}
};
static_assert(alignof(UAREnvironmentProbeComponent) == 0x000010, "Wrong alignment on UAREnvironmentProbeComponent");
static_assert(sizeof(UAREnvironmentProbeComponent) == 0x0003C0, "Wrong size on UAREnvironmentProbeComponent");
static_assert(offsetof(UAREnvironmentProbeComponent, ReplicatedPayload) == 0x000360, "Member 'UAREnvironmentProbeComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARObjectComponent
// 0x0060 (0x03C0 - 0x0360)
class UARObjectComponent final : public UARComponent
{
public:
	struct FARObjectUpdatePayload                 ReplicatedPayload;                                 // 0x0360(0x0060)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FARObjectUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARObjectUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARObjectUpdatePayload& NewPayload)	 // 0x62cf16c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARObjectComponent">();
	}
	static class UARObjectComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARObjectComponent>();
	}
};
static_assert(alignof(UARObjectComponent) == 0x000010, "Wrong alignment on UARObjectComponent");
static_assert(sizeof(UARObjectComponent) == 0x0003C0, "Wrong size on UARObjectComponent");
static_assert(offsetof(UARObjectComponent, ReplicatedPayload) == 0x000360, "Member 'UARObjectComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARMeshComponent
// 0x0090 (0x03F0 - 0x0360)
class UARMeshComponent final : public UARComponent
{
public:
	struct FARMeshUpdatePayload                   ReplicatedPayload;                                 // 0x0360(0x0090)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void ReceiveAdd(const struct FARMeshUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARMeshUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARMeshUpdatePayload& NewPayload)	 // 0x62cf5d8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARMeshComponent">();
	}
	static class UARMeshComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARMeshComponent>();
	}
};
static_assert(alignof(UARMeshComponent) == 0x000010, "Wrong alignment on UARMeshComponent");
static_assert(sizeof(UARMeshComponent) == 0x0003F0, "Wrong size on UARMeshComponent");
static_assert(offsetof(UARMeshComponent, ReplicatedPayload) == 0x000360, "Member 'UARMeshComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARGeoAnchorComponent
// 0x00A0 (0x0400 - 0x0360)
class UARGeoAnchorComponent final : public UARComponent
{
public:
	struct FARGeoAnchorUpdatePayload              ReplicatedPayload;                                 // 0x0360(0x00A0)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)

public:
	static void SetGeoAnchorComponentDebugMode(EGeoAnchorComponentDebugMode NewDebugMode)	 // 0x62d097c;

	void ReceiveAdd(const struct FARGeoAnchorUpdatePayload& Payload)	 // 0xae1e64;
	void ReceiveUpdate(const struct FARGeoAnchorUpdatePayload& Payload)	 // 0xae1e64;
	void ServerUpdatePayload(const struct FARGeoAnchorUpdatePayload& NewPayload)	 // 0x62cf3ac;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARGeoAnchorComponent">();
	}
	static class UARGeoAnchorComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARGeoAnchorComponent>();
	}
};
static_assert(alignof(UARGeoAnchorComponent) == 0x000010, "Wrong alignment on UARGeoAnchorComponent");
static_assert(sizeof(UARGeoAnchorComponent) == 0x000400, "Wrong size on UARGeoAnchorComponent");
static_assert(offsetof(UARGeoAnchorComponent, ReplicatedPayload) == 0x000360, "Member 'UARGeoAnchorComponent::ReplicatedPayload' has a wrong offset!");

// Class AugmentedReality.ARDependencyHandler
// 0x0000 (0x0028 - 0x0028)
class UARDependencyHandler final : public UObject
{
public:
	static class UARDependencyHandler* GetARDependencyHandler()	 // 0x62cb654;

	void CheckARServiceAvailability(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, EARServiceAvailability* OutAvailability)	 // 0x62ca4ac;
	void InstallARService(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, EARServiceInstallRequestResult* OutInstallResult)	 // 0x62cd6bc;
	void RequestARSessionPermission(class UObject* WorldContextObject, class UARSessionConfig* SessionConfig, const struct FLatentActionInfo& LatentInfo, EARServicePermissionRequestResult* OutPermissionResult)	 // 0x62ceaac;
	void StartARSessionLatent(class UObject* WorldContextObject, class UARSessionConfig* SessionConfig, const struct FLatentActionInfo& LatentInfo)	 // 0x62d15bc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARDependencyHandler">();
	}
	static class UARDependencyHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARDependencyHandler>();
	}
};
static_assert(alignof(UARDependencyHandler) == 0x000008, "Wrong alignment on UARDependencyHandler");
static_assert(sizeof(UARDependencyHandler) == 0x000028, "Wrong size on UARDependencyHandler");

// Class AugmentedReality.ARGeoTrackingSupport
// 0x0000 (0x0028 - 0x0028)
class UARGeoTrackingSupport final : public UObject
{
public:
	static class UARGeoTrackingSupport* GetGeoTrackingSupport()	 // 0x62cc514;

	bool AddGeoAnchorAtLocation(float Longitude, float Latitude, const class FString& OptionalAnchorName)	 // 0x62c9688;
	bool AddGeoAnchorAtLocationWithAltitude(float Longitude, float Latitude, float AltitudeMeters, const class FString& OptionalAnchorName)	 // 0x62c987c;

	EARGeoTrackingAccuracy GetGeoTrackingAccuracy() const	 // 0x4f1e470;
	EARGeoTrackingState GetGeoTrackingState() const	 // 0x4f1e4c0;
	EARGeoTrackingStateReason GetGeoTrackingStateReason() const	 // 0x4153a04;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARGeoTrackingSupport">();
	}
	static class UARGeoTrackingSupport* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARGeoTrackingSupport>();
	}
};
static_assert(alignof(UARGeoTrackingSupport) == 0x000008, "Wrong alignment on UARGeoTrackingSupport");
static_assert(sizeof(UARGeoTrackingSupport) == 0x000028, "Wrong size on UARGeoTrackingSupport");

// Class AugmentedReality.CheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy
// 0x0050 (0x00A0 - 0x0050)
class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	TMulticastInlineDelegate<void(bool bIsAvailable, const class FString& Error)> OnSuccess;         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsAvailable, const class FString& Error)> OnFailed;          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x30];                                      // 0x0070(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailability(class UObject* WorldContextObject)	 // 0x62ca65c;
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* CheckGeoTrackingAvailabilityAtLocation(class UObject* WorldContextObject, float Longitude, float Latitude)	 // 0x62ca738;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy">();
	}
	static class UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy");
static_assert(sizeof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy) == 0x0000A0, "Wrong size on UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy");
static_assert(offsetof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.GetGeoLocationAsyncTaskBlueprintProxy
// 0x0058 (0x00A8 - 0x0050)
class UGetGeoLocationAsyncTaskBlueprintProxy final : public UARBaseAsyncTaskBlueprintProxy
{
public:
	TMulticastInlineDelegate<void(float Longitude, float Latitude, float Altitude, const class FString& Error)> OnSuccess; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Longitude, float Latitude, float Altitude, const class FString& Error)> OnFailed; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x38];                                      // 0x0070(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGetGeoLocationAsyncTaskBlueprintProxy* GetGeoLocationAtWorldPosition(class UObject* WorldContextObject, const struct FVector& WorldPosition)	 // 0x62cc3d0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GetGeoLocationAsyncTaskBlueprintProxy">();
	}
	static class UGetGeoLocationAsyncTaskBlueprintProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGetGeoLocationAsyncTaskBlueprintProxy>();
	}
};
static_assert(alignof(UGetGeoLocationAsyncTaskBlueprintProxy) == 0x000008, "Wrong alignment on UGetGeoLocationAsyncTaskBlueprintProxy");
static_assert(sizeof(UGetGeoLocationAsyncTaskBlueprintProxy) == 0x0000A8, "Wrong size on UGetGeoLocationAsyncTaskBlueprintProxy");
static_assert(offsetof(UGetGeoLocationAsyncTaskBlueprintProxy, OnSuccess) == 0x000050, "Member 'UGetGeoLocationAsyncTaskBlueprintProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UGetGeoLocationAsyncTaskBlueprintProxy, OnFailed) == 0x000060, "Member 'UGetGeoLocationAsyncTaskBlueprintProxy::OnFailed' has a wrong offset!");

// Class AugmentedReality.ARLifeCycleComponent
// 0x0030 (0x0310 - 0x02E0)
class UARLifeCycleComponent final : public USceneComponent
{
public:
	TMulticastInlineDelegate<void(class UClass* ComponentClass, const struct FGuid& NativeID, class AARActor* SpawnedActor)> OnARActorSpawnedDelegate; // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AARActor* Actor)> OnARActorToBeDestroyedDelegate;            // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ServerDestroyARActor(class AARActor* Actor)	 // 0x62ceea4;
	void ServerSpawnARActor(class UClass* ComponentClass, const struct FGuid& NativeID)	 // 0x62cefd4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARLifeCycleComponent">();
	}
	static class UARLifeCycleComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARLifeCycleComponent>();
	}
};
static_assert(alignof(UARLifeCycleComponent) == 0x000010, "Wrong alignment on UARLifeCycleComponent");
static_assert(sizeof(UARLifeCycleComponent) == 0x000310, "Wrong size on UARLifeCycleComponent");
static_assert(offsetof(UARLifeCycleComponent, OnARActorSpawnedDelegate) == 0x0002E0, "Member 'UARLifeCycleComponent::OnARActorSpawnedDelegate' has a wrong offset!");
static_assert(offsetof(UARLifeCycleComponent, OnARActorToBeDestroyedDelegate) == 0x0002F0, "Member 'UARLifeCycleComponent::OnARActorToBeDestroyedDelegate' has a wrong offset!");

// Class AugmentedReality.ARLightEstimate
// 0x0000 (0x0028 - 0x0028)
class UARLightEstimate : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARLightEstimate">();
	}
	static class UARLightEstimate* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARLightEstimate>();
	}
};
static_assert(alignof(UARLightEstimate) == 0x000008, "Wrong alignment on UARLightEstimate");
static_assert(sizeof(UARLightEstimate) == 0x000028, "Wrong size on UARLightEstimate");

// Class AugmentedReality.ARBasicLightEstimate
// 0x0018 (0x0040 - 0x0028)
class UARBasicLightEstimate final : public UARLightEstimate
{
public:
	float                                         AmbientIntensityLumens;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AmbientColorTemperatureKelvin;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           AmbientColor;                                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetAmbientColor() const	 // 0x62cbce8;
	float GetAmbientColorTemperatureKelvin() const	 // 0x46a6b18;
	float GetAmbientIntensityLumens() const	 // 0x4fabf8c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARBasicLightEstimate">();
	}
	static class UARBasicLightEstimate* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARBasicLightEstimate>();
	}
};
static_assert(alignof(UARBasicLightEstimate) == 0x000008, "Wrong alignment on UARBasicLightEstimate");
static_assert(sizeof(UARBasicLightEstimate) == 0x000040, "Wrong size on UARBasicLightEstimate");
static_assert(offsetof(UARBasicLightEstimate, AmbientIntensityLumens) == 0x000028, "Member 'UARBasicLightEstimate::AmbientIntensityLumens' has a wrong offset!");
static_assert(offsetof(UARBasicLightEstimate, AmbientColorTemperatureKelvin) == 0x00002C, "Member 'UARBasicLightEstimate::AmbientColorTemperatureKelvin' has a wrong offset!");
static_assert(offsetof(UARBasicLightEstimate, AmbientColor) == 0x000030, "Member 'UARBasicLightEstimate::AmbientColor' has a wrong offset!");

// Class AugmentedReality.AROriginActor
// 0x0000 (0x02B0 - 0x02B0)
class AAROriginActor final : public AActor
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AROriginActor">();
	}
	static class AAROriginActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AAROriginActor>();
	}
};
static_assert(alignof(AAROriginActor) == 0x000008, "Wrong alignment on AAROriginActor");
static_assert(sizeof(AAROriginActor) == 0x0002B0, "Wrong size on AAROriginActor");

// Class AugmentedReality.ARPin
// 0x0128 (0x0150 - 0x0028)
class UARPin final : public UObject
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PinnedComponent;                                   // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalToTrackingTransform;                          // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTransform                             LocalToAlignedTrackingTransform;                   // 0x00A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EARTrackingState                              TrackingState;                                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x1F];                                     // 0x0101(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EARTrackingState NewTrackingState)> OnARTrackingStateChanged;      // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const struct FTransform& OldToNewTransform)> OnARTransformUpdated; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DebugDraw(class UWorld* World, const struct FLinearColor& Color, float Scale, float PersistForSeconds) const	 // 0x62cad80;
	class FName GetDebugName() const	 // 0x62cc184;
	struct FTransform GetLocalToTrackingTransform() const	 // 0x62cc6a4;
	struct FTransform GetLocalToWorldTransform() const	 // 0x62cc7ec;
	class USceneComponent* GetPinnedComponent() const	 // 0x17cf1b8;
	class UARTrackedGeometry* GetTrackedGeometry() const	 // 0x454629c;
	EARTrackingState GetTrackingState() const	 // 0x62cd44c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ARPin">();
	}
	static class UARPin* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UARPin>();
	}
};
static_assert(alignof(UARPin) == 0x000010, "Wrong alignment on UARPin");
static_assert(sizeof(UARPin) == 0x000150, "Wrong size on UARPin");
static_assert(offsetof(UARPin, TrackedGeometry) == 0x000028, "Member 'UARPin::TrackedGeometry' has a wrong offset!");
static_assert(offsetof(UARPin, PinnedComponent) == 0x000030, "Member 'UARPin::PinnedComponent' has a wrong offset!");
static_assert(offsetof(UARPin, LocalToTrackingTransform) == 0x000040, "Member 'UARPin::LocalToTrackingTransform' has a wrong offset!");
static_assert(offsetof(UARPin, LocalToAlignedTrackingTransform) == 0x0000A0, "Member 'UARPin::LocalToAlignedTrackingTransform' has a wrong offset!");
static_assert(offsetof(UARPin, TrackingState) == 0x000100, "Member 'UARPin::TrackingState' has a wrong offset!");
static_assert(offsetof(UARPin, OnARTrackingStateChanged) == 0x000120, "Member 'UARPin::OnARTrackingStateChanged' has a wrong offset!");
static_assert(offsetof(UARPin, OnARTransformUpdated) == 0x000130, "Member 'UARPin::OnARTransformUpdated' has a wrong offset!");

// Class AugmentedReality.ARSessionConfig
// 0x00E0 (0x0110 - 0x0030)
class UARSessionConfig final : public UDataAsset
{
public:
	bool                                          bGenerateMeshDataFromTrackedGeometry;              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateCollisionForMeshData;                     // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateNavMeshForMeshData;                       // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMeshDataForOcclusion;                          // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderMeshDataInWireframe;                        // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackSceneObjects;                                // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePersonSegmentationForOcclusion;                // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSceneDepthForOcclusion;                        // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAutomaticImageScaleEstimation;                 // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseStandardOnboardingUX;                          // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARWorldAlignment                             WorldAlignment;                                    // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARSessionType                                SessionType;                                       // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARPlaneDetectionMode                         PlaneDetectionMode;                                // 0x003C(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHorizontalPlaneDetection;                         // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVerticalPlaneDetection;                           // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutoFocus;                                  // 0x003F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARLightEstimationMode                        LightEstimationMode;                               // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFrameSyncMode                              FrameSyncMode;                                     // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraOverlay;                     // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAutomaticCameraTracking;                    // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetCameraTracking;                              // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetTrackedObjects;                              // 0x0045(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UARCandidateImage*>              CandidateImages;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         MaxNumSimultaneousImagesTracked;                   // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAREnvironmentCaptureProbeType                EnvironmentCaptureProbeType;                       // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 WorldMapData;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class UARCandidateObject*>             CandidateObjects;                                  // 0x0070(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FARVideoFormat                         DesiredVideoFormat;                                // 0x0080(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUseOptimalVideoFormat;                            // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFaceTrackingDirection                      FaceTrackingDirection;                             // 0x008D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARFaceTrackingUpdate                         FaceTrackingUpdate;                                // 0x008E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxNumberOfTrackedFaces;                           // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 SerializedARCandidateImageDatabase;                // 0x0098(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EARSessionTrackingFeature                     EnabledSessionTrackingFeature;                     // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EARSceneReconstruction                        SceneReconstructionMethod;                         // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UARPlaneComponent>          PlaneComponentClass;                               // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARPointComponent>          PointComponentClass;                               // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARFaceComponent>           FaceComponentClass;                                // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARImageComponent>          ImageComponentClass;                               // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARQRCodeComponent>         QRCodeComponentClass;                              // 0x00D0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARPoseComponent>           PoseComponentClass;                                // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAREnvironmentProbeComponent> EnvironmentProbeComponentClass;                  // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARObjectComponent>         ObjectComponentClass;                              // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARMeshComponent>           MeshComponentClass;                                // 0x00F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UARGeoAnchorComponent>      GeoAnchorComponentClass;                           // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultMeshMaterial;                               // 0x0100(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultWireframeMeshMaterial;                      // 0x0108(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddCandidateImage(class UARCandidateImage* NewCandidateImage)	 // 0x62c94e4;
	void AddCandidateObject(class UARCandidateObject* CandidateObject)	 // 0x62c95a4;
	void SetCandidateObjectList(const TArray<class UARCandidateObject*>& InCandidateObjects)	 // 0x62d0248;
	void SetDesiredVideoFormat(const struct FARVideoFormat& NewFormat)	 // 0x62d0324;
	void SetEnableAutoFocus(bool bNewValue)	 // 0x62d03f4;
	void SetFaceTrackingDirection(EARFaceTrackingDirection InDirection)	 // 0x62d0728;
	void SetFaceTrackingUpdate(EARFaceTrackingUpdate InUpdate)	 // 0x62d07e8;
	void SetResetCameraTracking(bool bNewValue)	 // 0x62d1008;
	void SetResetTrackedObjects(bool bNewValue)	 // 0x62d10c4;
	void SetSceneReconstructionMethod(EARSceneReconstruction InSceneReconstructionMethod)	 // 0x62d1180;
	void SetSessionTrackingFeatureToEnable(EARSessionTrackingFeature InSessionTrackingFeature)	 // 0x62d1240;
	void SetWorldMapData(const TArray<uint8>& WorldMapData_0)	 // 0x62d1300;

	const TArray<class UARCandidateImage*> GetCandidateImageList() const	 // 0x62cc034;
	const TArray<class UARCandidateObject*> GetCandidateObjectList() const	 // 0x62cc0c4;
	struct FARVideoFormat GetDesiredVideoFormat() const	 // 0x62cc1b4;
	EARSessionTrackingFeature GetEnabledSessionTrackingFeature() const	 // 0x62cc2b8;
	EAREnvironmentCaptureProbeType GetEnvironmentCaptureProbeType() const	 // 0x4f99334;
	EARFaceTrackingDirection GetFaceTrackingDirection() const	 // 0x62cc354;
	EARFaceTrackingUpdate GetFaceTrackingUpdate() const	 // 0x62cc36c;
	EARFrameSyncMode GetFrameSyncMode() const	 // 0x62cc384;
	EARLightEstimationMode GetLightEstimationMode() const	 // 0x62cc588;
	int32 GetMaxNumSimultaneousImagesTracked() const	 // 0x4bb4078;
	EARPlaneDetectionMode GetPlaneDetectionMode() const	 // 0x62cd098;
	EARSceneReconstruction GetSceneReconstructionMethod() const	 // 0x62cd0fc;
	EARSessionType GetSessionType() const	 // 0x62cd138;
	EARWorldAlignment GetWorldAlignment() const	 // 0x62cd47c;
	const TArray<uint8> GetWorldMapData() const	 // 0x62cd490;
	bool ShouldEnableAutoFocus() const	 // 0x62d1428;
	bool ShouldEnableCameraTracking() const	 // 0x62d143c;
	bool ShouldRenderCameraOverlay() const	 // 0x62d1450;
