#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AVCodecsCoreRHI

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AVCodecsCoreRHI_structs.hpp"


namespace SDK
{

// Class AVCodecsCoreRHI.SimpleAVHelper
// 0x0000 (0x0028 - 0x0028)
class USimpleAVHelper : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleAVHelper">();
	}
	static class USimpleAVHelper* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleAVHelper>();
	}
};
static_assert(alignof(USimpleAVHelper) == 0x000008, "Wrong alignment on USimpleAVHelper");
static_assert(sizeof(USimpleAVHelper) == 0x000028, "Wrong size on USimpleAVHelper");

// Class AVCodecsCoreRHI.SimpleAudioHelper
// 0x0000 (0x0028 - 0x0028)
class USimpleAudioHelper final : public USimpleAVHelper
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleAudioHelper">();
	}
	static class USimpleAudioHelper* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleAudioHelper>();
	}
};
static_assert(alignof(USimpleAudioHelper) == 0x000008, "Wrong alignment on USimpleAudioHelper");
static_assert(sizeof(USimpleAudioHelper) == 0x000028, "Wrong size on USimpleAudioHelper");

// Class AVCodecsCoreRHI.SimpleAudioEncoder
// 0x0048 (0x0070 - 0x0028)
class USimpleAudioEncoder final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close()	 // 0x50c5d40;
	bool Open(ESimpleAudioCodec Codec, const struct FSimpleAudioEncoderConfig& Config, bool bAsynchronous)	 // 0x50c5f90;
	bool ReceivePacket(struct FSimpleAudioPacket* OutPacket)	 // 0x50c6578;
	void ReceivePackets(TArray<struct FSimpleAudioPacket>* OutPackets)	 // 0x50c6660;
	bool SendFrameFloat(const TArray<float>& Resource, double Timestamp, int32 NumSamples, float SampleDuration)	 // 0x50c6790;
	void SetConfig(const struct FSimpleAudioEncoderConfig& NewConfig)	 // 0x50c6f64;

	ESimpleAudioCodec GetCodec() const	 // 0x50c5d7c;
	struct FSimpleAudioEncoderConfig GetConfig() const	 // 0x50c5e64;
	bool IsAsync() const	 // 0x50c5f50;
	bool IsOpen() const	 // 0x50c5f6c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleAudioEncoder">();
	}
	static class USimpleAudioEncoder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleAudioEncoder>();
	}
};
static_assert(alignof(USimpleAudioEncoder) == 0x000008, "Wrong alignment on USimpleAudioEncoder");
static_assert(sizeof(USimpleAudioEncoder) == 0x000070, "Wrong size on USimpleAudioEncoder");

// Class AVCodecsCoreRHI.SimpleVideoHelper
// 0x0000 (0x0028 - 0x0028)
class USimpleVideoHelper final : public USimpleAVHelper
{
public:
	static void ShareRenderTarget2D(class UTextureRenderTarget2D* RenderTarget)	 // 0x50c7154;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleVideoHelper">();
	}
	static class USimpleVideoHelper* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleVideoHelper>();
	}
};
static_assert(alignof(USimpleVideoHelper) == 0x000008, "Wrong alignment on USimpleVideoHelper");
static_assert(sizeof(USimpleVideoHelper) == 0x000028, "Wrong size on USimpleVideoHelper");

// Class AVCodecsCoreRHI.SimpleVideoDecoder
// 0x0038 (0x0060 - 0x0028)
class USimpleVideoDecoder final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close()	 // 0x50c5d54;
	bool Open(ESimpleVideoCodec Codec, bool bAsynchronous)	 // 0x50c6174;
	bool ReceiveFrame(class UTextureRenderTarget2D* Resource)	 // 0x50c64a8;
	bool SendPacket(const struct FSimpleVideoPacket& Packet)	 // 0x50c6e7c;

	ESimpleVideoCodec GetCodec() const	 // 0x50c5de8;
	bool IsAsync() const	 // 0x50c5f50;
	bool IsOpen() const	 // 0x50c5f6c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleVideoDecoder">();
	}
	static class USimpleVideoDecoder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleVideoDecoder>();
	}
};
static_assert(alignof(USimpleVideoDecoder) == 0x000008, "Wrong alignment on USimpleVideoDecoder");
static_assert(sizeof(USimpleVideoDecoder) == 0x000060, "Wrong size on USimpleVideoDecoder");

// Class AVCodecsCoreRHI.SimpleVideoEncoder
// 0x0048 (0x0070 - 0x0028)
class USimpleVideoEncoder final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close()	 // 0x50c5d68;
	bool Open(ESimpleVideoCodec Codec, const struct FSimpleVideoEncoderConfig& Config, bool bAsynchronous)	 // 0x50c62c4;
	bool ReceivePacket(struct FSimpleVideoPacket* OutPacket)	 // 0x50c6578;
	void ReceivePackets(TArray<struct FSimpleVideoPacket>* OutPackets)	 // 0x50c66f8;
	bool SendFrameRenderTarget(class UTextureRenderTarget2D* Resource, double Timestamp, bool bForceKeyframe)	 // 0x50c6af4;
	bool SendFrameTexture(class UTexture2D* Resource, double Timestamp, bool bForceKeyframe)	 // 0x50c6cb8;
	void SetConfig(const struct FSimpleVideoEncoderConfig& NewConfig)	 // 0x50c7058;

	ESimpleVideoCodec GetCodec() const	 // 0x50c5de8;
	struct FSimpleVideoEncoderConfig GetConfig() const	 // 0x50c5ed4;
	bool IsAsync() const	 // 0x50c5f50;
	bool IsOpen() const	 // 0x50c5f6c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleVideoEncoder">();
	}
	static class USimpleVideoEncoder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USimpleVideoEncoder>();
	}
};
static_assert(alignof(USimpleVideoEncoder) == 0x000008, "Wrong alignment on USimpleVideoEncoder");
static_assert(sizeof(USimpleVideoEncoder) == 0x000070, "Wrong size on USimpleVideoEncoder");

}

