#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackendApi

#include "Basic.hpp"

#include "BackendApi_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BackendApi.P2BackendApiFunctionLibrary.CanCancelMatchmakingsessionState
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState");
static_assert(sizeof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState");
static_assert(offsetof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.CanCancelMatchmakingsessionState_HideoutInstance
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance");
static_assert(sizeof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance");
static_assert(offsetof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_CanCancelMatchmakingsessionState_HideoutInstance::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetBestConnectionEndpoint
// 0x0020 (0x0020 - 0x0000)
struct P2BackendApiFunctionLibrary_GetBestConnectionEndpoint final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetBestConnectionEndpoint) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetBestConnectionEndpoint");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetBestConnectionEndpoint) == 0x000020, "Wrong size on P2BackendApiFunctionLibrary_GetBestConnectionEndpoint");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetBestConnectionEndpoint, URL) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetBestConnectionEndpoint::URL' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetBestConnectionEndpoint, ReturnValue) == 0x000010, "Member 'P2BackendApiFunctionLibrary_GetBestConnectionEndpoint::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetMatchmakingDestination
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_GetMatchmakingDestination final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2TravelDestination                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetMatchmakingDestination) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetMatchmakingDestination");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetMatchmakingDestination) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_GetMatchmakingDestination");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingDestination, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingDestination::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingDestination, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingDestination::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetMatchmakingSessionState
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_GetMatchmakingSessionState final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MatchmakingSessionState                    ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetMatchmakingSessionState) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetMatchmakingSessionState");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetMatchmakingSessionState) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_GetMatchmakingSessionState");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingSessionState, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingSessionState::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingSessionState, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingSessionState::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetMatchmakingUserState
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_GetMatchmakingUserState final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MatchmakingUserState                       ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetMatchmakingUserState) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetMatchmakingUserState");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetMatchmakingUserState) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_GetMatchmakingUserState");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingUserState, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingUserState::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetMatchmakingUserState, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_GetMatchmakingUserState::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetTravelURL
// 0x0028 (0x0028 - 0x0000)
struct P2BackendApiFunctionLibrary_GetTravelURL final
{
public:
	const class APlayerController*                PC;                                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Endpoint;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetTravelURL) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetTravelURL");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetTravelURL) == 0x000028, "Wrong size on P2BackendApiFunctionLibrary_GetTravelURL");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetTravelURL, PC) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetTravelURL::PC' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetTravelURL, Endpoint) == 0x000008, "Member 'P2BackendApiFunctionLibrary_GetTravelURL::Endpoint' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetTravelURL, ReturnValue) == 0x000018, "Member 'P2BackendApiFunctionLibrary_GetTravelURL::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendApiFunctionLibrary.GetUserServerMoveState
// 0x0010 (0x0010 - 0x0000)
struct P2BackendApiFunctionLibrary_GetUserServerMoveState final
{
public:
	const class AActor*                           PawnOrControllerOrPlayerState;                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2UserServerMoveState                        ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendApiFunctionLibrary_GetUserServerMoveState) == 0x000008, "Wrong alignment on P2BackendApiFunctionLibrary_GetUserServerMoveState");
static_assert(sizeof(P2BackendApiFunctionLibrary_GetUserServerMoveState) == 0x000010, "Wrong size on P2BackendApiFunctionLibrary_GetUserServerMoveState");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetUserServerMoveState, PawnOrControllerOrPlayerState) == 0x000000, "Member 'P2BackendApiFunctionLibrary_GetUserServerMoveState::PawnOrControllerOrPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendApiFunctionLibrary_GetUserServerMoveState, ReturnValue) == 0x000008, "Member 'P2BackendApiFunctionLibrary_GetUserServerMoveState::ReturnValue' has a wrong offset!");

// Function BackendApi.P2BackendPlayerStateComponent.OnRep_SquadInvites
// 0x0010 (0x0010 - 0x0000)
struct P2BackendPlayerStateComponent_OnRep_SquadInvites final
{
public:
	TArray<struct FP2SquadInvite>                 PrevPendingSquadInvites;                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2BackendPlayerStateComponent_OnRep_SquadInvites) == 0x000008, "Wrong alignment on P2BackendPlayerStateComponent_OnRep_SquadInvites");
static_assert(sizeof(P2BackendPlayerStateComponent_OnRep_SquadInvites) == 0x000010, "Wrong size on P2BackendPlayerStateComponent_OnRep_SquadInvites");
static_assert(offsetof(P2BackendPlayerStateComponent_OnRep_SquadInvites, PrevPendingSquadInvites) == 0x000000, "Member 'P2BackendPlayerStateComponent_OnRep_SquadInvites::PrevPendingSquadInvites' has a wrong offset!");

// Function BackendApi.P2BackendPlayerStateComponent.OnTeamIdChanged
// 0x0010 (0x0010 - 0x0000)
struct P2BackendPlayerStateComponent_OnTeamIdChanged final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewId;                                             // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2BackendPlayerStateComponent_OnTeamIdChanged) == 0x000008, "Wrong alignment on P2BackendPlayerStateComponent_OnTeamIdChanged");
static_assert(sizeof(P2BackendPlayerStateComponent_OnTeamIdChanged) == 0x000010, "Wrong size on P2BackendPlayerStateComponent_OnTeamIdChanged");
static_assert(offsetof(P2BackendPlayerStateComponent_OnTeamIdChanged, InPlayerState) == 0x000000, "Member 'P2BackendPlayerStateComponent_OnTeamIdChanged::InPlayerState' has a wrong offset!");
static_assert(offsetof(P2BackendPlayerStateComponent_OnTeamIdChanged, NewId) == 0x000008, "Member 'P2BackendPlayerStateComponent_OnTeamIdChanged::NewId' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.ConnectByPlayerId
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_ConnectByPlayerId final
{
public:
	class FString                                 InPlayerId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_ConnectByPlayerId) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_ConnectByPlayerId");
static_assert(sizeof(P2ClientLoginSubsystem_ConnectByPlayerId) == 0x000010, "Wrong size on P2ClientLoginSubsystem_ConnectByPlayerId");
static_assert(offsetof(P2ClientLoginSubsystem_ConnectByPlayerId, InPlayerId) == 0x000000, "Member 'P2ClientLoginSubsystem_ConnectByPlayerId::InPlayerId' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.ConnectToServer
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_ConnectToServer final
{
public:
	class FString                                 InCharacterId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_ConnectToServer) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_ConnectToServer");
static_assert(sizeof(P2ClientLoginSubsystem_ConnectToServer) == 0x000010, "Wrong size on P2ClientLoginSubsystem_ConnectToServer");
static_assert(offsetof(P2ClientLoginSubsystem_ConnectToServer, InCharacterId) == 0x000000, "Member 'P2ClientLoginSubsystem_ConnectToServer::InCharacterId' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.OnClickedConnectErrorPopupButton
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton final
{
public:
	EPopupButtonID                                InButtonID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton");
static_assert(sizeof(P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton) == 0x000001, "Wrong size on P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton");
static_assert(offsetof(P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton, InButtonID) == 0x000000, "Member 'P2ClientLoginSubsystem_OnClickedConnectErrorPopupButton::InButtonID' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.RequestArchiveAccount
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_RequestArchiveAccount final
{
public:
	class FString                                 InCharacterId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_RequestArchiveAccount) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_RequestArchiveAccount");
static_assert(sizeof(P2ClientLoginSubsystem_RequestArchiveAccount) == 0x000010, "Wrong size on P2ClientLoginSubsystem_RequestArchiveAccount");
static_assert(offsetof(P2ClientLoginSubsystem_RequestArchiveAccount, InCharacterId) == 0x000000, "Member 'P2ClientLoginSubsystem_RequestArchiveAccount::InCharacterId' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.RequestNicknameValidation
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_RequestNicknameValidation final
{
public:
	class FString                                 InNickname;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_RequestNicknameValidation) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_RequestNicknameValidation");
static_assert(sizeof(P2ClientLoginSubsystem_RequestNicknameValidation) == 0x000010, "Wrong size on P2ClientLoginSubsystem_RequestNicknameValidation");
static_assert(offsetof(P2ClientLoginSubsystem_RequestNicknameValidation, InNickname) == 0x000000, "Member 'P2ClientLoginSubsystem_RequestNicknameValidation::InNickname' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.SetConnectToTutorial
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_SetConnectToTutorial final
{
public:
	bool                                          bInWantsTutorial;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_SetConnectToTutorial) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_SetConnectToTutorial");
static_assert(sizeof(P2ClientLoginSubsystem_SetConnectToTutorial) == 0x000001, "Wrong size on P2ClientLoginSubsystem_SetConnectToTutorial");
static_assert(offsetof(P2ClientLoginSubsystem_SetConnectToTutorial, bInWantsTutorial) == 0x000000, "Member 'P2ClientLoginSubsystem_SetConnectToTutorial::bInWantsTutorial' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.SetInitializedUserData
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_SetInitializedUserData final
{
public:
	bool                                          bInIsInitialized;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_SetInitializedUserData) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_SetInitializedUserData");
static_assert(sizeof(P2ClientLoginSubsystem_SetInitializedUserData) == 0x000001, "Wrong size on P2ClientLoginSubsystem_SetInitializedUserData");
static_assert(offsetof(P2ClientLoginSubsystem_SetInitializedUserData, bInIsInitialized) == 0x000000, "Member 'P2ClientLoginSubsystem_SetInitializedUserData::bInIsInitialized' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.GenerateOptionsString
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_GenerateOptionsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_GenerateOptionsString) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_GenerateOptionsString");
static_assert(sizeof(P2ClientLoginSubsystem_GenerateOptionsString) == 0x000010, "Wrong size on P2ClientLoginSubsystem_GenerateOptionsString");
static_assert(offsetof(P2ClientLoginSubsystem_GenerateOptionsString, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_GenerateOptionsString::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.GetCachedPlayerId
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_GetCachedPlayerId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_GetCachedPlayerId) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_GetCachedPlayerId");
static_assert(sizeof(P2ClientLoginSubsystem_GetCachedPlayerId) == 0x000010, "Wrong size on P2ClientLoginSubsystem_GetCachedPlayerId");
static_assert(offsetof(P2ClientLoginSubsystem_GetCachedPlayerId, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_GetCachedPlayerId::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.GetCachedPlayerNickname
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_GetCachedPlayerNickname final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_GetCachedPlayerNickname) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_GetCachedPlayerNickname");
static_assert(sizeof(P2ClientLoginSubsystem_GetCachedPlayerNickname) == 0x000010, "Wrong size on P2ClientLoginSubsystem_GetCachedPlayerNickname");
static_assert(offsetof(P2ClientLoginSubsystem_GetCachedPlayerNickname, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_GetCachedPlayerNickname::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.GetCachedRegion
// 0x0010 (0x0010 - 0x0000)
struct P2ClientLoginSubsystem_GetCachedRegion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_GetCachedRegion) == 0x000008, "Wrong alignment on P2ClientLoginSubsystem_GetCachedRegion");
static_assert(sizeof(P2ClientLoginSubsystem_GetCachedRegion) == 0x000010, "Wrong size on P2ClientLoginSubsystem_GetCachedRegion");
static_assert(offsetof(P2ClientLoginSubsystem_GetCachedRegion, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_GetCachedRegion::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.IsDevelopmentLoginAvailable
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_IsDevelopmentLoginAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_IsDevelopmentLoginAvailable) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_IsDevelopmentLoginAvailable");
static_assert(sizeof(P2ClientLoginSubsystem_IsDevelopmentLoginAvailable) == 0x000001, "Wrong size on P2ClientLoginSubsystem_IsDevelopmentLoginAvailable");
static_assert(offsetof(P2ClientLoginSubsystem_IsDevelopmentLoginAvailable, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_IsDevelopmentLoginAvailable::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.IsOSSEnabled
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_IsOSSEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_IsOSSEnabled) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_IsOSSEnabled");
static_assert(sizeof(P2ClientLoginSubsystem_IsOSSEnabled) == 0x000001, "Wrong size on P2ClientLoginSubsystem_IsOSSEnabled");
static_assert(offsetof(P2ClientLoginSubsystem_IsOSSEnabled, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_IsOSSEnabled::ReturnValue' has a wrong offset!");

// Function BackendApi.P2ClientLoginSubsystem.NeedToConnectTutorial
// 0x0001 (0x0001 - 0x0000)
struct P2ClientLoginSubsystem_NeedToConnectTutorial final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ClientLoginSubsystem_NeedToConnectTutorial) == 0x000001, "Wrong alignment on P2ClientLoginSubsystem_NeedToConnectTutorial");
static_assert(sizeof(P2ClientLoginSubsystem_NeedToConnectTutorial) == 0x000001, "Wrong size on P2ClientLoginSubsystem_NeedToConnectTutorial");
static_assert(offsetof(P2ClientLoginSubsystem_NeedToConnectTutorial, ReturnValue) == 0x000000, "Member 'P2ClientLoginSubsystem_NeedToConnectTutorial::ReturnValue' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ClientClaimAttachedItems
// 0x0010 (0x0010 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems final
{
public:
	TArray<class FString>                         InMailIds;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems) == 0x000008, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems) == 0x000010, "Wrong size on P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems, InMailIds) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ClientClaimAttachedItems::InMailIds' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ClientDeleteMails
// 0x0010 (0x0010 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ClientDeleteMails final
{
public:
	TArray<class FString>                         InMailIds;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ClientDeleteMails) == 0x000008, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ClientDeleteMails");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ClientDeleteMails) == 0x000010, "Wrong size on P2HideoutBackendPlayerStateComponent_ClientDeleteMails");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientDeleteMails, InMailIds) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ClientDeleteMails::InMailIds' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ClientOnSyncMails
// 0x0018 (0x0018 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ClientOnSyncMails final
{
public:
	TArray<struct FP2MailDetails>                 InMails;                                           // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsFinish;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ClientOnSyncMails) == 0x000008, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ClientOnSyncMails");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ClientOnSyncMails) == 0x000018, "Wrong size on P2HideoutBackendPlayerStateComponent_ClientOnSyncMails");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientOnSyncMails, InMails) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ClientOnSyncMails::InMails' has a wrong offset!");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientOnSyncMails, bIsFinish) == 0x000010, "Member 'P2HideoutBackendPlayerStateComponent_ClientOnSyncMails::bIsFinish' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ClientReadMails
// 0x0010 (0x0010 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ClientReadMails final
{
public:
	TArray<class FString>                         InMailIds;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ClientReadMails) == 0x000008, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ClientReadMails");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ClientReadMails) == 0x000010, "Wrong size on P2HideoutBackendPlayerStateComponent_ClientReadMails");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientReadMails, InMailIds) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ClientReadMails::InMailIds' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ClientReceiveMailDetails
// 0x0018 (0x0018 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails final
{
public:
	TArray<struct FP2MailDetails>                 InReceivedMails;                                   // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsInitialize;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails) == 0x000008, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails) == 0x000018, "Wrong size on P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails, InReceivedMails) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails::InReceivedMails' has a wrong offset!");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails, bIsInitialize) == 0x000010, "Member 'P2HideoutBackendPlayerStateComponent_ClientReceiveMailDetails::bIsInitialize' has a wrong offset!");

// Function BackendApi.P2HideoutBackendPlayerStateComponent.ServerRequestMailDetails
// 0x0008 (0x0008 - 0x0000)
struct P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails final
{
public:
	int32                                         InStartIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEndIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails) == 0x000004, "Wrong alignment on P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails");
static_assert(sizeof(P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails) == 0x000008, "Wrong size on P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails, InStartIndex) == 0x000000, "Member 'P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails::InStartIndex' has a wrong offset!");
static_assert(offsetof(P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails, InEndIndex) == 0x000004, "Member 'P2HideoutBackendPlayerStateComponent_ServerRequestMailDetails::InEndIndex' has a wrong offset!");

// Function BackendApi.P2PlayerStateExtensionExternalCommands.SendClientConsoleCommand
// 0x0010 (0x0010 - 0x0000)
struct P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand) == 0x000008, "Wrong alignment on P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand");
static_assert(sizeof(P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand) == 0x000010, "Wrong size on P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand");
static_assert(offsetof(P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand, Command) == 0x000000, "Member 'P2PlayerStateExtensionExternalCommands_SendClientConsoleCommand::Command' has a wrong offset!");

// Function BackendApi.P2PlayerStateExtensionExternalCommands.SendClientDevConsoleKeyEnabled
// 0x0001 (0x0001 - 0x0000)
struct P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled) == 0x000001, "Wrong alignment on P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled");
static_assert(sizeof(P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled) == 0x000001, "Wrong size on P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled");
static_assert(offsetof(P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled, bEnabled) == 0x000000, "Member 'P2PlayerStateExtensionExternalCommands_SendClientDevConsoleKeyEnabled::bEnabled' has a wrong offset!");

// Function BackendApi.P2RaidBackendComponent.OnExtractionDroneDown
// 0x00A0 (0x00A0 - 0x0000)
struct P2RaidBackendComponent_OnExtractionDroneDown final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FP2VerbMessage                         InMsg;                                             // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2RaidBackendComponent_OnExtractionDroneDown) == 0x000008, "Wrong alignment on P2RaidBackendComponent_OnExtractionDroneDown");
static_assert(sizeof(P2RaidBackendComponent_OnExtractionDroneDown) == 0x0000A0, "Wrong size on P2RaidBackendComponent_OnExtractionDroneDown");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneDown, InTag) == 0x000000, "Member 'P2RaidBackendComponent_OnExtractionDroneDown::InTag' has a wrong offset!");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneDown, InMsg) == 0x000008, "Member 'P2RaidBackendComponent_OnExtractionDroneDown::InMsg' has a wrong offset!");

// Function BackendApi.P2RaidBackendComponent.OnExtractionDroneExtracted
// 0x00A0 (0x00A0 - 0x0000)
struct P2RaidBackendComponent_OnExtractionDroneExtracted final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FP2VerbMessage                         InMsg;                                             // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2RaidBackendComponent_OnExtractionDroneExtracted) == 0x000008, "Wrong alignment on P2RaidBackendComponent_OnExtractionDroneExtracted");
static_assert(sizeof(P2RaidBackendComponent_OnExtractionDroneExtracted) == 0x0000A0, "Wrong size on P2RaidBackendComponent_OnExtractionDroneExtracted");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneExtracted, InTag) == 0x000000, "Member 'P2RaidBackendComponent_OnExtractionDroneExtracted::InTag' has a wrong offset!");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneExtracted, InMsg) == 0x000008, "Member 'P2RaidBackendComponent_OnExtractionDroneExtracted::InMsg' has a wrong offset!");

// Function BackendApi.P2RaidBackendComponent.OnExtractionDroneLaunched
// 0x00A0 (0x00A0 - 0x0000)
struct P2RaidBackendComponent_OnExtractionDroneLaunched final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FP2VerbMessage                         InMsg;                                             // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2RaidBackendComponent_OnExtractionDroneLaunched) == 0x000008, "Wrong alignment on P2RaidBackendComponent_OnExtractionDroneLaunched");
static_assert(sizeof(P2RaidBackendComponent_OnExtractionDroneLaunched) == 0x0000A0, "Wrong size on P2RaidBackendComponent_OnExtractionDroneLaunched");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneLaunched, InTag) == 0x000000, "Member 'P2RaidBackendComponent_OnExtractionDroneLaunched::InTag' has a wrong offset!");
static_assert(offsetof(P2RaidBackendComponent_OnExtractionDroneLaunched, InMsg) == 0x000008, "Member 'P2RaidBackendComponent_OnExtractionDroneLaunched::InMsg' has a wrong offset!");

// Function BackendApi.P2RaidBackendComponent.OnFinishRecordPlayerResult
// 0x0018 (0x0018 - 0x0000)
struct P2RaidBackendComponent_OnFinishRecordPlayerResult final
{
public:
	class AP2BaseCharacter*                       Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IP2ExtractionPointInterface> ExfilPoint;                                  // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2RaidBackendComponent_OnFinishRecordPlayerResult) == 0x000008, "Wrong alignment on P2RaidBackendComponent_OnFinishRecordPlayerResult");
static_assert(sizeof(P2RaidBackendComponent_OnFinishRecordPlayerResult) == 0x000018, "Wrong size on P2RaidBackendComponent_OnFinishRecordPlayerResult");
static_assert(offsetof(P2RaidBackendComponent_OnFinishRecordPlayerResult, Character) == 0x000000, "Member 'P2RaidBackendComponent_OnFinishRecordPlayerResult::Character' has a wrong offset!");
static_assert(offsetof(P2RaidBackendComponent_OnFinishRecordPlayerResult, ExfilPoint) == 0x000008, "Member 'P2RaidBackendComponent_OnFinishRecordPlayerResult::ExfilPoint' has a wrong offset!");

// Function BackendApi.P2RaidBackendPlayerStateComponent.OnDroneExtracted
// 0x0010 (0x0010 - 0x0000)
struct P2RaidBackendPlayerStateComponent_OnDroneExtracted final
{
public:
	TArray<class UP2Item*>                        InDroneItemList;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2RaidBackendPlayerStateComponent_OnDroneExtracted) == 0x000008, "Wrong alignment on P2RaidBackendPlayerStateComponent_OnDroneExtracted");
static_assert(sizeof(P2RaidBackendPlayerStateComponent_OnDroneExtracted) == 0x000010, "Wrong size on P2RaidBackendPlayerStateComponent_OnDroneExtracted");
static_assert(offsetof(P2RaidBackendPlayerStateComponent_OnDroneExtracted, InDroneItemList) == 0x000000, "Member 'P2RaidBackendPlayerStateComponent_OnDroneExtracted::InDroneItemList' has a wrong offset!");

// Function BackendApi.P2ServerProxySubsystem.OnFinishToLoadPlayerData
// 0x0008 (0x0008 - 0x0000)
struct P2ServerProxySubsystem_OnFinishToLoadPlayerData final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2ServerProxySubsystem_OnFinishToLoadPlayerData) == 0x000008, "Wrong alignment on P2ServerProxySubsystem_OnFinishToLoadPlayerData");
static_assert(sizeof(P2ServerProxySubsystem_OnFinishToLoadPlayerData) == 0x000008, "Wrong size on P2ServerProxySubsystem_OnFinishToLoadPlayerData");
static_assert(offsetof(P2ServerProxySubsystem_OnFinishToLoadPlayerData, InPlayerState) == 0x000000, "Member 'P2ServerProxySubsystem_OnFinishToLoadPlayerData::InPlayerState' has a wrong offset!");

// Function BackendApi.P2TutorialBackendComponent.OnConnectFailed
// 0x0018 (0x0018 - 0x0000)
struct P2TutorialBackendComponent_OnConnectFailed final
{
public:
	class FText                                   Error;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2TutorialBackendComponent_OnConnectFailed) == 0x000008, "Wrong alignment on P2TutorialBackendComponent_OnConnectFailed");
static_assert(sizeof(P2TutorialBackendComponent_OnConnectFailed) == 0x000018, "Wrong size on P2TutorialBackendComponent_OnConnectFailed");
static_assert(offsetof(P2TutorialBackendComponent_OnConnectFailed, Error) == 0x000000, "Member 'P2TutorialBackendComponent_OnConnectFailed::Error' has a wrong offset!");

// Function BackendApi.P2TutorialBackendComponent.OnConnectSuccess
// 0x0030 (0x0030 - 0x0000)
struct P2TutorialBackendComponent_OnConnectSuccess final
{
public:
	class FString                                 InEndpoint;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InAccountId;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InCharacterId;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2TutorialBackendComponent_OnConnectSuccess) == 0x000008, "Wrong alignment on P2TutorialBackendComponent_OnConnectSuccess");
static_assert(sizeof(P2TutorialBackendComponent_OnConnectSuccess) == 0x000030, "Wrong size on P2TutorialBackendComponent_OnConnectSuccess");
static_assert(offsetof(P2TutorialBackendComponent_OnConnectSuccess, InEndpoint) == 0x000000, "Member 'P2TutorialBackendComponent_OnConnectSuccess::InEndpoint' has a wrong offset!");
static_assert(offsetof(P2TutorialBackendComponent_OnConnectSuccess, InAccountId) == 0x000010, "Member 'P2TutorialBackendComponent_OnConnectSuccess::InAccountId' has a wrong offset!");
static_assert(offsetof(P2TutorialBackendComponent_OnConnectSuccess, InCharacterId) == 0x000020, "Member 'P2TutorialBackendComponent_OnConnectSuccess::InCharacterId' has a wrong offset!");

}

