#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BehaviorTreeExtension

#include "Basic.hpp"

#include "AIModule_classes.hpp"
#include "BehaviorTreeExtension_structs.hpp"


namespace SDK
{

// Class BehaviorTreeExtension.BTUtilityDecorator
// 0x0008 (0x0070 - 0x0068)
class UBTUtilityDecorator : public UBTDecorator
{
public:
	int32                                         BucketPriorityValue;                               // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTUtilityDecorator">();
	}
	static class UBTUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTUtilityDecorator>();
	}
};
static_assert(alignof(UBTUtilityDecorator) == 0x000008, "Wrong alignment on UBTUtilityDecorator");
static_assert(sizeof(UBTUtilityDecorator) == 0x000070, "Wrong size on UBTUtilityDecorator");
static_assert(offsetof(UBTUtilityDecorator, BucketPriorityValue) == 0x000068, "Member 'UBTUtilityDecorator::BucketPriorityValue' has a wrong offset!");

// Class BehaviorTreeExtension.BTFixedUtilityDecorator
// 0x0008 (0x0078 - 0x0070)
class UBTFixedUtilityDecorator final : public UBTUtilityDecorator
{
public:
	float                                         Utility;                                           // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTFixedUtilityDecorator">();
	}
	static class UBTFixedUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTFixedUtilityDecorator>();
	}
};
static_assert(alignof(UBTFixedUtilityDecorator) == 0x000008, "Wrong alignment on UBTFixedUtilityDecorator");
static_assert(sizeof(UBTFixedUtilityDecorator) == 0x000078, "Wrong size on UBTFixedUtilityDecorator");
static_assert(offsetof(UBTFixedUtilityDecorator, Utility) == 0x000070, "Member 'UBTFixedUtilityDecorator::Utility' has a wrong offset!");

// Class BehaviorTreeExtension.BTStateTransitionDecorator
// 0x0008 (0x0070 - 0x0068)
class UBTStateTransitionDecorator : public UBTDecorator
{
public:
	int32                                         StateToTransitionId;                               // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateId;                                           // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTStateTransitionDecorator">();
	}
	static class UBTStateTransitionDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTStateTransitionDecorator>();
	}
};
static_assert(alignof(UBTStateTransitionDecorator) == 0x000008, "Wrong alignment on UBTStateTransitionDecorator");
static_assert(sizeof(UBTStateTransitionDecorator) == 0x000070, "Wrong size on UBTStateTransitionDecorator");
static_assert(offsetof(UBTStateTransitionDecorator, StateToTransitionId) == 0x000068, "Member 'UBTStateTransitionDecorator::StateToTransitionId' has a wrong offset!");
static_assert(offsetof(UBTStateTransitionDecorator, StateId) == 0x00006C, "Member 'UBTStateTransitionDecorator::StateId' has a wrong offset!");

// Class BehaviorTreeExtension.BTBlueprintStateTransition
// 0x0000 (0x0070 - 0x0070)
class UBTBlueprintStateTransition final : public UBTStateTransitionDecorator
{
public:
	bool ShouldTransitionFromBlueprint(class AAIController* AIController) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTBlueprintStateTransition">();
	}
	static class UBTBlueprintStateTransition* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTBlueprintStateTransition>();
	}
};
static_assert(alignof(UBTBlueprintStateTransition) == 0x000008, "Wrong alignment on UBTBlueprintStateTransition");
static_assert(sizeof(UBTBlueprintStateTransition) == 0x000070, "Wrong size on UBTBlueprintStateTransition");

// Class BehaviorTreeExtension.BTBlueprintUtilityDecorator
// 0x0000 (0x0070 - 0x0070)
class UBTBlueprintUtilityDecorator final : public UBTUtilityDecorator
{
public:
	float CalculateUtilityFromBlueprint(class AAIController* AIController) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTBlueprintUtilityDecorator">();
	}
	static class UBTBlueprintUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTBlueprintUtilityDecorator>();
	}
};
static_assert(alignof(UBTBlueprintUtilityDecorator) == 0x000008, "Wrong alignment on UBTBlueprintUtilityDecorator");
static_assert(sizeof(UBTBlueprintUtilityDecorator) == 0x000070, "Wrong size on UBTBlueprintUtilityDecorator");

// Class BehaviorTreeExtension.BTInverterDecorator
// 0x0000 (0x0068 - 0x0068)
class UBTInverterDecorator final : public UBTDecorator
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTInverterDecorator">();
	}
	static class UBTInverterDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTInverterDecorator>();
	}
};
static_assert(alignof(UBTInverterDecorator) == 0x000008, "Wrong alignment on UBTInverterDecorator");
static_assert(sizeof(UBTInverterDecorator) == 0x000068, "Wrong size on UBTInverterDecorator");

// Class BehaviorTreeExtension.BTLinearUtilityDecorator
// 0x0000 (0x0070 - 0x0070)
class UBTLinearUtilityDecorator final : public UBTUtilityDecorator
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTLinearUtilityDecorator">();
	}
	static class UBTLinearUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTLinearUtilityDecorator>();
	}
};
static_assert(alignof(UBTLinearUtilityDecorator) == 0x000008, "Wrong alignment on UBTLinearUtilityDecorator");
static_assert(sizeof(UBTLinearUtilityDecorator) == 0x000070, "Wrong size on UBTLinearUtilityDecorator");

// Class BehaviorTreeExtension.BTLogisticUtilityDecorator
// 0x0000 (0x0070 - 0x0070)
class UBTLogisticUtilityDecorator final : public UBTUtilityDecorator
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTLogisticUtilityDecorator">();
	}
	static class UBTLogisticUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTLogisticUtilityDecorator>();
	}
};
static_assert(alignof(UBTLogisticUtilityDecorator) == 0x000008, "Wrong alignment on UBTLogisticUtilityDecorator");
static_assert(sizeof(UBTLogisticUtilityDecorator) == 0x000070, "Wrong size on UBTLogisticUtilityDecorator");

// Class BehaviorTreeExtension.BTQuadraticUtilityDecorator
// 0x0000 (0x0070 - 0x0070)
class UBTQuadraticUtilityDecorator final : public UBTUtilityDecorator
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTQuadraticUtilityDecorator">();
	}
	static class UBTQuadraticUtilityDecorator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTQuadraticUtilityDecorator>();
	}
};
static_assert(alignof(UBTQuadraticUtilityDecorator) == 0x000008, "Wrong alignment on UBTQuadraticUtilityDecorator");
static_assert(sizeof(UBTQuadraticUtilityDecorator) == 0x000070, "Wrong size on UBTQuadraticUtilityDecorator");

// Class BehaviorTreeExtension.BTStateMachineSelector
// 0x0008 (0x0098 - 0x0090)
class UBTStateMachineSelector final : public UBTCompositeNode
{
public:
	int32                                         InitialStateId;                                    // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExitStateMachineId;                                // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTStateMachineSelector">();
	}
	static class UBTStateMachineSelector* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTStateMachineSelector>();
	}
};
static_assert(alignof(UBTStateMachineSelector) == 0x000008, "Wrong alignment on UBTStateMachineSelector");
static_assert(sizeof(UBTStateMachineSelector) == 0x000098, "Wrong size on UBTStateMachineSelector");
static_assert(offsetof(UBTStateMachineSelector, InitialStateId) == 0x000090, "Member 'UBTStateMachineSelector::InitialStateId' has a wrong offset!");
static_assert(offsetof(UBTStateMachineSelector, ExitStateMachineId) == 0x000094, "Member 'UBTStateMachineSelector::ExitStateMachineId' has a wrong offset!");

// Class BehaviorTreeExtension.BTStateTransitionDecoratorLoop
// 0x0010 (0x0080 - 0x0070)
class UBTStateTransitionDecoratorLoop final : public UBTStateTransitionDecorator
{
public:
	int32                                         NumLoops;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInfiniteLoop;                                     // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InfiniteLoopTimeoutTime;                           // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTStateTransitionDecoratorLoop">();
	}
	static class UBTStateTransitionDecoratorLoop* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTStateTransitionDecoratorLoop>();
	}
};
static_assert(alignof(UBTStateTransitionDecoratorLoop) == 0x000008, "Wrong alignment on UBTStateTransitionDecoratorLoop");
static_assert(sizeof(UBTStateTransitionDecoratorLoop) == 0x000080, "Wrong size on UBTStateTransitionDecoratorLoop");
static_assert(offsetof(UBTStateTransitionDecoratorLoop, NumLoops) == 0x000070, "Member 'UBTStateTransitionDecoratorLoop::NumLoops' has a wrong offset!");
static_assert(offsetof(UBTStateTransitionDecoratorLoop, bInfiniteLoop) == 0x000074, "Member 'UBTStateTransitionDecoratorLoop::bInfiniteLoop' has a wrong offset!");
static_assert(offsetof(UBTStateTransitionDecoratorLoop, InfiniteLoopTimeoutTime) == 0x000078, "Member 'UBTStateTransitionDecoratorLoop::InfiniteLoopTimeoutTime' has a wrong offset!");

// Class BehaviorTreeExtension.BTTask_Log
// 0x0010 (0x0080 - 0x0070)
class UBTTask_Log final : public UBTTaskNode
{
public:
	class FString                                 Message;                                           // 0x0070(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTTask_Log">();
	}
	static class UBTTask_Log* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTTask_Log>();
	}
};
static_assert(alignof(UBTTask_Log) == 0x000008, "Wrong alignment on UBTTask_Log");
static_assert(sizeof(UBTTask_Log) == 0x000080, "Wrong size on UBTTask_Log");
static_assert(offsetof(UBTTask_Log, Message) == 0x000070, "Member 'UBTTask_Log::Message' has a wrong offset!");

// Class BehaviorTreeExtension.BTUtilitySelector
// 0x0008 (0x0098 - 0x0090)
class UBTUtilitySelector final : public UBTCompositeNode
{
public:
	EActionSelectionType                          SelectionType;                                     // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SubsetChosenForWeightedRandom;                     // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTUtilitySelector">();
	}
	static class UBTUtilitySelector* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTUtilitySelector>();
	}
};
static_assert(alignof(UBTUtilitySelector) == 0x000008, "Wrong alignment on UBTUtilitySelector");
static_assert(sizeof(UBTUtilitySelector) == 0x000098, "Wrong size on UBTUtilitySelector");
static_assert(offsetof(UBTUtilitySelector, SelectionType) == 0x000090, "Member 'UBTUtilitySelector::SelectionType' has a wrong offset!");
static_assert(offsetof(UBTUtilitySelector, SubsetChosenForWeightedRandom) == 0x000094, "Member 'UBTUtilitySelector::SubsetChosenForWeightedRandom' has a wrong offset!");

// Class BehaviorTreeExtension.BTWeightedRandomSelector
// 0x0010 (0x00A0 - 0x0090)
class UBTWeightedRandomSelector final : public UBTCompositeNode
{
public:
	TArray<int32>                                 Weights;                                           // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTWeightedRandomSelector">();
	}
	static class UBTWeightedRandomSelector* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTWeightedRandomSelector>();
	}
};
static_assert(alignof(UBTWeightedRandomSelector) == 0x000008, "Wrong alignment on UBTWeightedRandomSelector");
static_assert(sizeof(UBTWeightedRandomSelector) == 0x0000A0, "Wrong size on UBTWeightedRandomSelector");
static_assert(offsetof(UBTWeightedRandomSelector, Weights) == 0x000090, "Member 'UBTWeightedRandomSelector::Weights' has a wrong offset!");

}

