#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BehaviorTreeExtension

#include "Basic.hpp"


namespace SDK
{

// Enum BehaviorTreeExtension.EActionSelectionType
// NumValues: 0x0004
enum class EActionSelectionType : uint32
{
	PickHighestValue                         = 0,
	SubsetWeightedRandom                     = 1,
	BucketedWeightedRandom                   = 2,
	EActionSelectionType_MAX                 = 3,
};

// ScriptStruct BehaviorTreeExtension.BTUtilityChild
// 0x000C (0x000C - 0x0000)
struct FBTUtilityChild final
{
public:
	int32                                         ChildIndex;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PriorityValue;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBTUtilityChild) == 0x000004, "Wrong alignment on FBTUtilityChild");
static_assert(sizeof(FBTUtilityChild) == 0x00000C, "Wrong size on FBTUtilityChild");
static_assert(offsetof(FBTUtilityChild, ChildIndex) == 0x000000, "Member 'FBTUtilityChild::ChildIndex' has a wrong offset!");
static_assert(offsetof(FBTUtilityChild, Value) == 0x000004, "Member 'FBTUtilityChild::Value' has a wrong offset!");
static_assert(offsetof(FBTUtilityChild, PriorityValue) == 0x000008, "Member 'FBTUtilityChild::PriorityValue' has a wrong offset!");

}

