#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_InventorySearch

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_InventorySearch.BP_Action_InventorySearch_C.GetInteractionSoundData
// 0x0048 (0x0048 - 0x0000)
struct BP_Action_InventorySearch_C_GetInteractionSoundData final
{
public:
	class UP2InteractionSoundData*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                CallFunc_GetInteractionSoundData_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_GetActorAudioDataAsset_self_CastInput;    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2AudioDataAsset*                      CallFunc_GetActorAudioDataAsset_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_InventorySearch_C_GetInteractionSoundData) == 0x000008, "Wrong alignment on BP_Action_InventorySearch_C_GetInteractionSoundData");
static_assert(sizeof(BP_Action_InventorySearch_C_GetInteractionSoundData) == 0x000048, "Wrong size on BP_Action_InventorySearch_C_GetInteractionSoundData");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, ReturnValue) == 0x000000, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, CallFunc_GetInteractionSoundData_ReturnValue) == 0x000010, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::CallFunc_GetInteractionSoundData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, K2Node_DynamicCast_AsP2Base_Character) == 0x000018, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, CallFunc_GetActorAudioDataAsset_self_CastInput) == 0x000028, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::CallFunc_GetActorAudioDataAsset_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, CallFunc_GetActorAudioDataAsset_ReturnValue) == 0x000038, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::CallFunc_GetActorAudioDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_InventorySearch_C_GetInteractionSoundData, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Action_InventorySearch_C_GetInteractionSoundData::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

