#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_APSentry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_APSentry.BP_APSentry_C
// 0x0028 (0x0398 - 0x0370)
class ABP_APSentry_C final : public AP2LapsDeployableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     P2Action;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OperatingLoopedSFX_Start;                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OperatingLoopedSFX_Stop;                           // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_APSentry(int32 EntryPoint)	 // 0xae1e64;
	void LevelChange_8F48C93D4993C7B032CE84B4889A1C06(int32 NewLevel, int32 NewStackCount)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void StartOperatingSFX()	 // 0xae1e64;
	void StopOperatingSFX()	 // 0xae1e64;

	void TransferredToActor() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_APSentry_C">();
	}
	static class ABP_APSentry_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_APSentry_C>();
	}
};
static_assert(alignof(ABP_APSentry_C) == 0x000008, "Wrong alignment on ABP_APSentry_C");
static_assert(sizeof(ABP_APSentry_C) == 0x000398, "Wrong size on ABP_APSentry_C");
static_assert(offsetof(ABP_APSentry_C, UberGraphFrame) == 0x000370, "Member 'ABP_APSentry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_APSentry_C, Ak) == 0x000378, "Member 'ABP_APSentry_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_APSentry_C, P2Action) == 0x000380, "Member 'ABP_APSentry_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_APSentry_C, OperatingLoopedSFX_Start) == 0x000388, "Member 'ABP_APSentry_C::OperatingLoopedSFX_Start' has a wrong offset!");
static_assert(offsetof(ABP_APSentry_C, OperatingLoopedSFX_Stop) == 0x000390, "Member 'ABP_APSentry_C::OperatingLoopedSFX_Stop' has a wrong offset!");

}

