#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_CleanFacilitySpot

#include "Basic.hpp"

#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_CleanFacilitySpot.BP_Action_CleanFacilitySpot_C.GetInteractionSoundData
// 0x0080 (0x0080 - 0x0000)
struct BP_Action_CleanFacilitySpot_C_GetInteractionSoundData final
{
public:
	class UP2InteractionSoundData*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2FacilitySpotStatus                         Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_DynamicCast_AsP2Facility_Spot;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2InteractionSoundData*                CallFunc_GetInteractionSoundData_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilitySpotStatusInfo              CallFunc_GetFacilitySpotStatus_ReturnValue;        // 0x0060(0x0010)(ConstParm, NoDestructor)
	class UP2InteractionSoundData*                K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData) == 0x000008, "Wrong alignment on BP_Action_CleanFacilitySpot_C_GetInteractionSoundData");
static_assert(sizeof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData) == 0x000080, "Wrong size on BP_Action_CleanFacilitySpot_C_GetInteractionSoundData");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, ReturnValue) == 0x000000, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable) == 0x000008, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable_1) == 0x000010, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable_2) == 0x000018, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable_3) == 0x000020, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable_4) == 0x000028, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_object_Variable_5) == 0x000030, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, CallFunc_GetOwningActor_ReturnValue) == 0x000038, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, Temp_byte_Variable) == 0x000040, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, K2Node_DynamicCast_AsP2Facility_Spot) == 0x000048, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::K2Node_DynamicCast_AsP2Facility_Spot' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, CallFunc_GetInteractionSoundData_ReturnValue) == 0x000058, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::CallFunc_GetInteractionSoundData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, CallFunc_GetFacilitySpotStatus_ReturnValue) == 0x000060, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::CallFunc_GetFacilitySpotStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, K2Node_Select_Default) == 0x000070, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Action_CleanFacilitySpot_C_GetInteractionSoundData, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_Action_CleanFacilitySpot_C_GetInteractionSoundData::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

