#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionContract_Hazards_Bleeding

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ActionContract_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionContract_Hazards_Bleeding.BP_ActionContract_Hazards_Bleeding_C
// 0x0060 (0x0760 - 0x0700)
class UBP_ActionContract_Hazards_Bleeding_C final : public UBP_ActionContract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UP2ContractData*>                In_Contracts;                                      // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EP2ContractState>                      In_States;                                         // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EP2ContractType>                       In_Types;                                          // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  In_Faction_Tags;                                   // 0x0738(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_ActionContract_Hazards_Bleeding(int32 EntryPoint)	 // 0xae1e64;
	void OnDestruction_Event()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ActionContract_Hazards_Bleeding_C">();
	}
	static class UBP_ActionContract_Hazards_Bleeding_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ActionContract_Hazards_Bleeding_C>();
	}
};
static_assert(alignof(UBP_ActionContract_Hazards_Bleeding_C) == 0x000010, "Wrong alignment on UBP_ActionContract_Hazards_Bleeding_C");
static_assert(sizeof(UBP_ActionContract_Hazards_Bleeding_C) == 0x000760, "Wrong size on UBP_ActionContract_Hazards_Bleeding_C");
static_assert(offsetof(UBP_ActionContract_Hazards_Bleeding_C, UberGraphFrame) == 0x000700, "Member 'UBP_ActionContract_Hazards_Bleeding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActionContract_Hazards_Bleeding_C, In_Contracts) == 0x000708, "Member 'UBP_ActionContract_Hazards_Bleeding_C::In_Contracts' has a wrong offset!");
static_assert(offsetof(UBP_ActionContract_Hazards_Bleeding_C, In_States) == 0x000718, "Member 'UBP_ActionContract_Hazards_Bleeding_C::In_States' has a wrong offset!");
static_assert(offsetof(UBP_ActionContract_Hazards_Bleeding_C, In_Types) == 0x000728, "Member 'UBP_ActionContract_Hazards_Bleeding_C::In_Types' has a wrong offset!");
static_assert(offsetof(UBP_ActionContract_Hazards_Bleeding_C, In_Faction_Tags) == 0x000738, "Member 'UBP_ActionContract_Hazards_Bleeding_C::In_Faction_Tags' has a wrong offset!");

}

