#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_APSentry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_APSentry.BP_APSentry_C.ExecuteUbergraph_BP_APSentry
// 0x01B0 (0x01B0 - 0x0000)
struct BP_APSentry_C_ExecuteUbergraph_BP_APSentry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel, int32 NewStackCount)> K2Node_CreateDelegate_OutputDelegate;       // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitStatusEffectLevelChange* CallFunc_WaitStatusEffectLevelChange_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2LapsData*                            K2Node_DynamicCast_AsP2Laps_Data;                  // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EP2DeployableState                            CallFunc_GetDeployState_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry) == 0x000008, "Wrong alignment on BP_APSentry_C_ExecuteUbergraph_BP_APSentry");
static_assert(sizeof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry) == 0x0001B0, "Wrong size on BP_APSentry_C_ExecuteUbergraph_BP_APSentry");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, EntryPoint) == 0x000000, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_CustomEvent_NewLevel) == 0x000004, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_CustomEvent_NewStackCount) == 0x000008, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, Temp_int_Variable) == 0x00001C, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, Temp_int_Variable_1) == 0x000020, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_WaitStatusEffectLevelChange_ReturnValue) == 0x000028, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_WaitStatusEffectLevelChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, Temp_delegate_Variable) == 0x000044, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, Temp_delegate_Variable_1) == 0x000054, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_CreateDelegate_OutputDelegate_2) == 0x000064, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_HasAuthority_ReturnValue) == 0x000074, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_GetItemData_ReturnValue) == 0x000078, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_DynamicCast_AsP2Laps_Data) == 0x000080, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_DynamicCast_AsP2Laps_Data' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0000B0, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_GetDeployState_ReturnValue) == 0x000198, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_GetDeployState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, K2Node_SwitchEnum_CmpSuccess) == 0x000199, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_PostAkEvent_ReturnValue) == 0x00019C, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001A0, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_ExecuteUbergraph_BP_APSentry, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001A8, "Member 'BP_APSentry_C_ExecuteUbergraph_BP_APSentry::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_APSentry.BP_APSentry_C.LevelChange_8F48C93D4993C7B032CE84B4889A1C06
// 0x0008 (0x0008 - 0x0000)
struct BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06 final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06) == 0x000004, "Wrong alignment on BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06");
static_assert(sizeof(BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06) == 0x000008, "Wrong size on BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06");
static_assert(offsetof(BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06, NewLevel) == 0x000000, "Member 'BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06::NewLevel' has a wrong offset!");
static_assert(offsetof(BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06, NewStackCount) == 0x000004, "Member 'BP_APSentry_C_LevelChange_8F48C93D4993C7B032CE84B4889A1C06::NewStackCount' has a wrong offset!");

}

