#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimOrientData

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AnimOrientData.BP_AnimOrientData_C.UpdateAnimOrientData
// 0x0018 (0x0018 - 0x0000)
struct BP_AnimOrientData_C_UpdateAnimOrientData final
{
public:
	bool                                          ShouldOrientToTarget;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OrientAngle;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OrientDuration;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AnimOrientData_C_UpdateAnimOrientData) == 0x000008, "Wrong alignment on BP_AnimOrientData_C_UpdateAnimOrientData");
static_assert(sizeof(BP_AnimOrientData_C_UpdateAnimOrientData) == 0x000018, "Wrong size on BP_AnimOrientData_C_UpdateAnimOrientData");
static_assert(offsetof(BP_AnimOrientData_C_UpdateAnimOrientData, ShouldOrientToTarget) == 0x000000, "Member 'BP_AnimOrientData_C_UpdateAnimOrientData::ShouldOrientToTarget' has a wrong offset!");
static_assert(offsetof(BP_AnimOrientData_C_UpdateAnimOrientData, OrientAngle) == 0x000008, "Member 'BP_AnimOrientData_C_UpdateAnimOrientData::OrientAngle' has a wrong offset!");
static_assert(offsetof(BP_AnimOrientData_C_UpdateAnimOrientData, OrientDuration) == 0x000010, "Member 'BP_AnimOrientData_C_UpdateAnimOrientData::OrientDuration' has a wrong offset!");

}

