#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnomalyBubble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnomalyBubble.BP_AnomalyBubble_C
// 0x0048 (0x08E0 - 0x0898)
class ABP_AnomalyBubble_C final : public AP2AnomalyBubble
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0898(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraParticles;                                  // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_IslandAlert_AnomalyBubble;                 // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Shake_Curve;                                       // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_AnomalyBubble_Cast;                        // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_AnomalyBubble_Stop;                        // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_AnomalyBubble_Start;                       // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Camera_Shake()	 // 0xae1e64;
	void ExecuteUbergraph_BP_AnomalyBubble(int32 EntryPoint)	 // 0xae1e64;
	void Get_Shake_Curve_Time(double* Curve_Float)	 // 0xae1e64;
	void OnActivatedBubble()	 // 0xae1e64;
	void OnRep_BubblePhase()	 // 0xae1e64;
	void PhaseChangedSFX()	 // 0xae1e64;
	void PlayShake(float NormalizedMagnitude)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_AnomalyBubble_C">();
	}
	static class ABP_AnomalyBubble_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_AnomalyBubble_C>();
	}
};
static_assert(alignof(ABP_AnomalyBubble_C) == 0x000008, "Wrong alignment on ABP_AnomalyBubble_C");
static_assert(sizeof(ABP_AnomalyBubble_C) == 0x0008E0, "Wrong size on ABP_AnomalyBubble_C");
static_assert(offsetof(ABP_AnomalyBubble_C, UberGraphFrame) == 0x000898, "Member 'ABP_AnomalyBubble_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, NiagaraParticles) == 0x0008A0, "Member 'ABP_AnomalyBubble_C::NiagaraParticles' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, Ak) == 0x0008A8, "Member 'ABP_AnomalyBubble_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, Niagara) == 0x0008B0, "Member 'ABP_AnomalyBubble_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, AkEvent_IslandAlert_AnomalyBubble) == 0x0008B8, "Member 'ABP_AnomalyBubble_C::AkEvent_IslandAlert_AnomalyBubble' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, Shake_Curve) == 0x0008C0, "Member 'ABP_AnomalyBubble_C::Shake_Curve' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, AkEvent_AnomalyBubble_Cast) == 0x0008C8, "Member 'ABP_AnomalyBubble_C::AkEvent_AnomalyBubble_Cast' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, AkEvent_AnomalyBubble_Stop) == 0x0008D0, "Member 'ABP_AnomalyBubble_C::AkEvent_AnomalyBubble_Stop' has a wrong offset!");
static_assert(offsetof(ABP_AnomalyBubble_C, AkEvent_AnomalyBubble_Start) == 0x0008D8, "Member 'ABP_AnomalyBubble_C::AkEvent_AnomalyBubble_Start' has a wrong offset!");

}

