#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Facility

#include "Basic.hpp"

#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Facility.BP_Action_Facility_C.GetInteractionSoundData
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_Facility_C_GetInteractionSoundData final
{
public:
	class UP2InteractionSoundData*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2InteractionSoundData*                CallFunc_GetInteractionSoundData_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2FacilitySpot*                        K2Node_DynamicCast_AsP2Facility_Spot;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Facility_C_GetInteractionSoundData) == 0x000008, "Wrong alignment on BP_Action_Facility_C_GetInteractionSoundData");
static_assert(sizeof(BP_Action_Facility_C_GetInteractionSoundData) == 0x000028, "Wrong size on BP_Action_Facility_C_GetInteractionSoundData");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, ReturnValue) == 0x000000, "Member 'BP_Action_Facility_C_GetInteractionSoundData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'BP_Action_Facility_C_GetInteractionSoundData::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, CallFunc_GetInteractionSoundData_ReturnValue) == 0x000010, "Member 'BP_Action_Facility_C_GetInteractionSoundData::CallFunc_GetInteractionSoundData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, K2Node_DynamicCast_AsP2Facility_Spot) == 0x000018, "Member 'BP_Action_Facility_C_GetInteractionSoundData::K2Node_DynamicCast_AsP2Facility_Spot' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Action_Facility_C_GetInteractionSoundData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_Action_Facility_C_GetInteractionSoundData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionSoundData, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'BP_Action_Facility_C_GetInteractionSoundData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Action_Facility.BP_Action_Facility_C.GetInteractionText
// 0x0050 (0x0050 - 0x0000)
struct BP_Action_Facility_C_GetInteractionText final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_FacilitySpot_C*                     K2Node_DynamicCast_AsBP_Facility_Spot;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2FacilitySpotStatusInfo              CallFunc_GetFacilitySpotStatus_ReturnValue;        // 0x0038(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Facility_C_GetInteractionText) == 0x000008, "Wrong alignment on BP_Action_Facility_C_GetInteractionText");
static_assert(sizeof(BP_Action_Facility_C_GetInteractionText) == 0x000050, "Wrong size on BP_Action_Facility_C_GetInteractionText");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, InPawn) == 0x000000, "Member 'BP_Action_Facility_C_GetInteractionText::InPawn' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, ReturnValue) == 0x000008, "Member 'BP_Action_Facility_C_GetInteractionText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, CallFunc_GetOwningActor_ReturnValue) == 0x000020, "Member 'BP_Action_Facility_C_GetInteractionText::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, K2Node_DynamicCast_AsBP_Facility_Spot) == 0x000028, "Member 'BP_Action_Facility_C_GetInteractionText::K2Node_DynamicCast_AsBP_Facility_Spot' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Action_Facility_C_GetInteractionText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, CallFunc_GetFacilitySpotStatus_ReturnValue) == 0x000038, "Member 'BP_Action_Facility_C_GetInteractionText::CallFunc_GetFacilitySpotStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Facility_C_GetInteractionText, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'BP_Action_Facility_C_GetInteractionText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

