#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionContract_Hazards_Poison

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ActionContract_Hazards_Poison.BP_ActionContract_Hazards_Poison_C.ExecuteUbergraph_BP_ActionContract_Hazards_Poison
// 0x0060 (0x0060 - 0x0000)
struct BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Hzd_PufferPlant_Poison_C*           K2Node_DynamicCast_AsBP_Hzd_Puffer_Plant_Poison;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Action*>                      CallFunc_GetActionsOfType_OutActions;              // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetActionsOfType_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Action*                              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ContractAction_Togglable_C*         K2Node_DynamicCast_AsBP_Contract_Action_Togglable; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculatePlayerHasContract_ReturnValue;   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison) == 0x000008, "Wrong alignment on BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison");
static_assert(sizeof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison) == 0x000060, "Wrong size on BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, EntryPoint) == 0x000000, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, K2Node_DynamicCast_AsBP_Hzd_Puffer_Plant_Poison) == 0x000020, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::K2Node_DynamicCast_AsBP_Hzd_Puffer_Plant_Poison' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, CallFunc_GetActionsOfType_OutActions) == 0x000030, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::CallFunc_GetActionsOfType_OutActions' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, CallFunc_GetActionsOfType_ReturnValue) == 0x000040, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::CallFunc_GetActionsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, K2Node_DynamicCast_AsBP_Contract_Action_Togglable) == 0x000050, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::K2Node_DynamicCast_AsBP_Contract_Action_Togglable' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison, CallFunc_CalculatePlayerHasContract_ReturnValue) == 0x000059, "Member 'BP_ActionContract_Hazards_Poison_C_ExecuteUbergraph_BP_ActionContract_Hazards_Poison::CallFunc_CalculatePlayerHasContract_ReturnValue' has a wrong offset!");

}

