#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BioArmorComponent_Default

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BioArmorComponent_Default.BP_BioArmorComponent_Default_C.CreateMeshVFX
// 0x0030 (0x0030 - 0x0000)
struct BP_BioArmorComponent_Default_C_CreateMeshVFX final
{
public:
	class USceneComponent*                        Comp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CompTag;                                           // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetInstanceRenderTarget_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BioArmorComponent_Default_C_CreateMeshVFX) == 0x000008, "Wrong alignment on BP_BioArmorComponent_Default_C_CreateMeshVFX");
static_assert(sizeof(BP_BioArmorComponent_Default_C_CreateMeshVFX) == 0x000030, "Wrong size on BP_BioArmorComponent_Default_C_CreateMeshVFX");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, Comp) == 0x000000, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::Comp' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, IsVisible) == 0x000008, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::IsVisible' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, CompTag) == 0x00000C, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::CompTag' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, CallFunc_GetInstanceRenderTarget_ReturnValue) == 0x000018, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::CallFunc_GetInstanceRenderTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000020, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_CreateMeshVFX, CallFunc_Array_Add_ReturnValue) == 0x000028, "Member 'BP_BioArmorComponent_Default_C_CreateMeshVFX::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_BioArmorComponent_Default.BP_BioArmorComponent_Default_C.ExecuteUbergraph_BP_BioArmorComponent_Default
// 0x0004 (0x0004 - 0x0000)
struct BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default) == 0x000004, "Wrong alignment on BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default");
static_assert(sizeof(BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default) == 0x000004, "Wrong size on BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default");
static_assert(offsetof(BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default, EntryPoint) == 0x000000, "Member 'BP_BioArmorComponent_Default_C_ExecuteUbergraph_BP_BioArmorComponent_Default::EntryPoint' has a wrong offset!");

// Function BP_BioArmorComponent_Default.BP_BioArmorComponent_Default_C.InitVFX
// 0x0038 (0x0038 - 0x0000)
struct BP_BioArmorComponent_Default_C_InitVFX final
{
public:
	bool                                          CallFunc_IsLocalFPP_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHideInFppTagName_ReturnValue;          // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetShowInFppTagName_ReturnValue;          // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalFPP_ReturnValue_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshByIndex_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshByIndex_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BioArmorComponent_Default_C_InitVFX) == 0x000008, "Wrong alignment on BP_BioArmorComponent_Default_C_InitVFX");
static_assert(sizeof(BP_BioArmorComponent_Default_C_InitVFX) == 0x000038, "Wrong size on BP_BioArmorComponent_Default_C_InitVFX");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_IsLocalFPP_ReturnValue) == 0x000000, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_IsLocalFPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_GetHideInFppTagName_ReturnValue) == 0x000004, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_GetHideInFppTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_GetShowInFppTagName_ReturnValue) == 0x00000C, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_GetShowInFppTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_IsLocalFPP_ReturnValue_1) == 0x000014, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_IsLocalFPP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_GetPartSkeletalMeshByIndex_ReturnValue) == 0x000018, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_GetPartSkeletalMeshByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_GetPartSkeletalMeshByIndex_ReturnValue_1) == 0x000028, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_GetPartSkeletalMeshByIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BioArmorComponent_Default_C_InitVFX, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_BioArmorComponent_Default_C_InitVFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

