#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Base_ContractRequirement

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Base_ContractRequirement.BP_Base_ContractRequirement_C
// 0x00E0 (0x0208 - 0x0128)
class UBP_Base_ContractRequirement_C : public UP2ContractRequirement
{
public:
	bool                                          SingleInstanced;                                   // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ObjectiveTypeIconInfo               Obj_SingleInstanced;                               // 0x0130(0x0048)(Edit, BlueprintVisible)
	struct FP2ObjectiveTypeIconInfo               Obj_RaidCompletable;                               // 0x0178(0x0048)(Edit, BlueprintVisible)
	struct FP2ObjectiveTypeIconInfo               Obj_SquadCompletable;                              // 0x01C0(0x0048)(Edit, BlueprintVisible)

public:
	struct FP2ObjectiveTypeIconInfo GetObjectiveTypeIconInfo() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Base_ContractRequirement_C">();
	}
	static class UBP_Base_ContractRequirement_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_Base_ContractRequirement_C>();
	}
};
static_assert(alignof(UBP_Base_ContractRequirement_C) == 0x000008, "Wrong alignment on UBP_Base_ContractRequirement_C");
static_assert(sizeof(UBP_Base_ContractRequirement_C) == 0x000208, "Wrong size on UBP_Base_ContractRequirement_C");
static_assert(offsetof(UBP_Base_ContractRequirement_C, SingleInstanced) == 0x000128, "Member 'UBP_Base_ContractRequirement_C::SingleInstanced' has a wrong offset!");
static_assert(offsetof(UBP_Base_ContractRequirement_C, Obj_SingleInstanced) == 0x000130, "Member 'UBP_Base_ContractRequirement_C::Obj_SingleInstanced' has a wrong offset!");
static_assert(offsetof(UBP_Base_ContractRequirement_C, Obj_RaidCompletable) == 0x000178, "Member 'UBP_Base_ContractRequirement_C::Obj_RaidCompletable' has a wrong offset!");
static_assert(offsetof(UBP_Base_ContractRequirement_C, Obj_SquadCompletable) == 0x0001C0, "Member 'UBP_Base_ContractRequirement_C::Obj_SquadCompletable' has a wrong offset!");

}

