#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextHelper_TriggerActor

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextHelper_TriggerActor.BP_ContextHelper_TriggerActor_C.OnActorEndOverlap_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event) == 0x000008, "Wrong alignment on BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event");
static_assert(sizeof(BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event) == 0x000010, "Wrong size on BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event, OverlappedActor) == 0x000000, "Member 'BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event, OtherActor) == 0x000008, "Member 'BP_ContextHelper_TriggerActor_C_OnActorEndOverlap_Event::OtherActor' has a wrong offset!");

// Function BP_ContextHelper_TriggerActor.BP_ContextHelper_TriggerActor_C.OnActorBeginOverlap_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event) == 0x000008, "Wrong alignment on BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event");
static_assert(sizeof(BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event) == 0x000010, "Wrong size on BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event, OverlappedActor) == 0x000000, "Member 'BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event::OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event, OtherActor) == 0x000008, "Member 'BP_ContextHelper_TriggerActor_C_OnActorBeginOverlap_Event::OtherActor' has a wrong offset!");

// Function BP_ContextHelper_TriggerActor.BP_ContextHelper_TriggerActor_C.ExecuteUbergraph_BP_ContextHelper_TriggerActor
// 0x01A0 (0x01A0 - 0x0000)
struct BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate; // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         K2Node_MakeStruct_P2VerbMessage;                   // 0x0040(0x0098)()
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor_1;              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         K2Node_MakeStruct_P2VerbMessage_1;                 // 0x0100(0x0098)()
	bool                                          CallFunc_ObjectIsA_ReturnValue_1;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor) == 0x000008, "Wrong alignment on BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor");
static_assert(sizeof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor) == 0x0001A0, "Wrong size on BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, EntryPoint) == 0x000000, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CustomEvent_OverlappedActor) == 0x000008, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CustomEvent_OtherActor) == 0x000010, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_ObjectIsA_ReturnValue) == 0x000018, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_HasAuthority_ReturnValue_1) == 0x00001A, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_MakeStruct_P2VerbMessage) == 0x000040, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_MakeStruct_P2VerbMessage' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E8, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CustomEvent_OverlappedActor_1) == 0x0000F0, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CustomEvent_OverlappedActor_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_CustomEvent_OtherActor_1) == 0x0000F8, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, K2Node_MakeStruct_P2VerbMessage_1) == 0x000100, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::K2Node_MakeStruct_P2VerbMessage_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_ObjectIsA_ReturnValue_1) == 0x000198, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_ObjectIsA_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor, CallFunc_BooleanAND_ReturnValue_1) == 0x000199, "Member 'BP_ContextHelper_TriggerActor_C_ExecuteUbergraph_BP_ContextHelper_TriggerActor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

