#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Reputation

#include "Basic.hpp"

#include "E_Eval_Number_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_Reputation.BP_ContractRequirement_Reputation_C
// 0x0020 (0x0228 - 0x0208)
class UBP_ContractRequirement_Reputation_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           FactionTag;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MinReputation;                                     // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Eval_Number                                 EvaluationType;                                    // 0x021C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnReputationChanged(int32 InReputation)	 // 0xae1e64;
	void OnMessageReceived_100392264860BBABDEF042B1C674E3A1(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_Reputation(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

	void IsValueAcceptable(int32 InValue, bool* OutResult) const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;
	int32 GetRequiredReputation() const	 // 0xae1e64;
	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_Reputation_C">();
	}
	static class UBP_ContractRequirement_Reputation_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_Reputation_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_Reputation_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_Reputation_C");
static_assert(sizeof(UBP_ContractRequirement_Reputation_C) == 0x000228, "Wrong size on UBP_ContractRequirement_Reputation_C");
static_assert(offsetof(UBP_ContractRequirement_Reputation_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_Reputation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Reputation_C, FactionTag) == 0x000210, "Member 'UBP_ContractRequirement_Reputation_C::FactionTag' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Reputation_C, MinReputation) == 0x000218, "Member 'UBP_ContractRequirement_Reputation_C::MinReputation' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Reputation_C, EvaluationType) == 0x00021C, "Member 'UBP_ContractRequirement_Reputation_C::EvaluationType' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Reputation_C, Async_Action) == 0x000220, "Member 'UBP_ContractRequirement_Reputation_C::Async_Action' has a wrong offset!");

}

