#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_ReturnWithCompletedContract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextRequirement_ReturnWithCompletedContract.BP_ContextRequirement_ReturnWithCompletedContract_C.ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2GameplayContext*                     CallFunc_GetOwningContext_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<EP2ContractType>                       Temp_byte_Variable;                                // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UP2PlayerStateExtensionContextHelper*   CallFunc_GetOwningExtensionContextHelper_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0028(0x0020)(ConstParm)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PreviousGameMode;               // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_CurrentGameMode;                // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& PreviousGameMode, const struct FGameplayTag& CurrentGameMode)> K2Node_CreateDelegate_OutputDelegate; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2GameplayContext*                     CallFunc_GetOwningContext_ReturnValue_1;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStateExtensionContextHelper*   CallFunc_GetOwningExtensionContextHelper_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Contract*>                    CallFunc_GetContractsWithStates_OutContracts;      // 0x00A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract) == 0x000008, "Wrong alignment on BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract");
static_assert(sizeof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract) == 0x0000B8, "Wrong size on BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, EntryPoint) == 0x000000, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetOwningContext_ReturnValue) == 0x000008, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetOwningContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, Temp_byte_Variable) == 0x000010, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetOwningExtensionContextHelper_ReturnValue) == 0x000020, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetOwningExtensionContextHelper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, Temp_struct_Variable) == 0x000028, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_Event_InFirstInitialization) == 0x000048, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_CustomEvent_PreviousGameMode) == 0x00004C, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_CustomEvent_PreviousGameMode' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_CustomEvent_CurrentGameMode) == 0x000054, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_CustomEvent_CurrentGameMode' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x00005C, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000070, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetOwningContext_ReturnValue_1) == 0x000078, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetOwningContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetOwningExtensionContextHelper_ReturnValue_1) == 0x000080, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetOwningExtensionContextHelper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000088, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_DynamicCast_AsP2Player_Controller) == 0x000090, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_GetContractsWithStates_OutContracts) == 0x0000A0, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_GetContractsWithStates_OutContracts' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_ExecuteUbergraph_BP_ContextRequirement_ReturnWithCompletedContract::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ContextRequirement_ReturnWithCompletedContract.BP_ContextRequirement_ReturnWithCompletedContract_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent final
{
public:
	struct FGameplayTag                           PreviousGameMode;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CurrentGameMode;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent) == 0x000004, "Wrong alignment on BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent");
static_assert(sizeof(BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent) == 0x000010, "Wrong size on BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent, PreviousGameMode) == 0x000000, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent::PreviousGameMode' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent, CurrentGameMode) == 0x000008, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_CustomEvent::CurrentGameMode' has a wrong offset!");

// Function BP_ContextRequirement_ReturnWithCompletedContract.BP_ContextRequirement_ReturnWithCompletedContract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize");
static_assert(sizeof(BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContextRequirement_ReturnWithCompletedContract.BP_ContextRequirement_ReturnWithCompletedContract_C.GetRequirementDescription
// 0x0038 (0x0038 - 0x0000)
struct BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription final
{
public:
	bool                                          bGetRichText;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetRequirementDescription_ReturnValue;    // 0x0020(0x0018)()
};
static_assert(alignof(BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription) == 0x000008, "Wrong alignment on BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription");
static_assert(sizeof(BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription) == 0x000038, "Wrong size on BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription, bGetRichText) == 0x000000, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription::bGetRichText' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription, ReturnValue) == 0x000008, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription, CallFunc_GetRequirementDescription_ReturnValue) == 0x000020, "Member 'BP_ContextRequirement_ReturnWithCompletedContract_C_GetRequirementDescription::CallFunc_GetRequirementDescription_ReturnValue' has a wrong offset!");

}

