#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_SpecialTrade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SpecialTradeTypes_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_SpecialTrade.BP_ContextRequirement_SpecialTrade_C
// 0x0020 (0x0080 - 0x0060)
class UBP_ContextRequirement_SpecialTrade_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	E_SpecialTradeTypes                           SpecialTradeType;                                  // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_Trading_Popup_C*                     TradingPopup;                                      // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void OnTradingPopupWidgetInitializedDelegate_Event()	 // 0xae1e64;
	void OnMessageReceived_25A2EA7545204534F199FC996AAE9817(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_SpecialTrade(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_SpecialTrade_C">();
	}
	static class UBP_ContextRequirement_SpecialTrade_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_SpecialTrade_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_SpecialTrade_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_SpecialTrade_C");
static_assert(sizeof(UBP_ContextRequirement_SpecialTrade_C) == 0x000080, "Wrong size on UBP_ContextRequirement_SpecialTrade_C");
static_assert(offsetof(UBP_ContextRequirement_SpecialTrade_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_SpecialTrade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_SpecialTrade_C, SpecialTradeType) == 0x000068, "Member 'UBP_ContextRequirement_SpecialTrade_C::SpecialTradeType' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_SpecialTrade_C, Async_Action) == 0x000070, "Member 'UBP_ContextRequirement_SpecialTrade_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_SpecialTrade_C, TradingPopup) == 0x000078, "Member 'UBP_ContextRequirement_SpecialTrade_C::TradingPopup' has a wrong offset!");

}

