#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Kill

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.AddKill
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Kill_C_AddKill final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_AddKill) == 0x000004, "Wrong alignment on BP_ContractRequirement_Kill_C_AddKill");
static_assert(sizeof(BP_ContractRequirement_Kill_C_AddKill) == 0x000010, "Wrong size on BP_ContractRequirement_Kill_C_AddKill");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, Temp_bool_Variable) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_AddKill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, Temp_byte_Variable) == 0x000001, "Member 'BP_ContractRequirement_Kill_C_AddKill::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, Temp_byte_Variable_1) == 0x000002, "Member 'BP_ContractRequirement_Kill_C_AddKill::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000003, "Member 'BP_ContractRequirement_Kill_C_AddKill::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_ContractRequirement_Kill_C_AddKill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Kill_C_AddKill::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_AddKill, K2Node_Select_Default) == 0x00000C, "Member 'BP_ContractRequirement_Kill_C_AddKill::K2Node_Select_Default' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Kill_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Kill_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Kill_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Kill_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Kill_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0098 (0x0098 - 0x0000)
struct BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FP2VerbMessage                         Message;                                           // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000098, "Wrong size on BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0, Message) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_0::Message' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0098 (0x0098 - 0x0000)
struct BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	struct FP2VerbMessage                         Message;                                           // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000098, "Wrong size on BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1, Message) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_CREATEDELEGATE_PROXYFUNCTION_1::Message' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.ExecuteUbergraph_BP_ContractRequirement_Kill
// 0x0040 (0x0040 - 0x0000)
struct BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2KillAssistSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FP2VerbMessage& Message)> K2Node_CreateDelegate_OutputDelegate;      // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FP2VerbMessage& Message)> K2Node_CreateDelegate_OutputDelegate_1;    // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2KillAssistSubsystem*                 CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill");
static_assert(sizeof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill) == 0x000040, "Wrong size on BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, K2Node_Event_InFirstInitialization) == 0x000010, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000038, "Member 'BP_ContractRequirement_Kill_C_ExecuteUbergraph_BP_ContractRequirement_Kill::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.OnKillMessageReceived
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ContractRequirement_Kill_C_OnKillMessageReceived final
{
public:
	struct FP2VerbMessage                         P2VerbMessage;                                     // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_IsValidKiller_Valid;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidKill_Valid;                        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_OnKillMessageReceived) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_OnKillMessageReceived");
static_assert(sizeof(BP_ContractRequirement_Kill_C_OnKillMessageReceived) == 0x0000A0, "Wrong size on BP_ContractRequirement_Kill_C_OnKillMessageReceived");
static_assert(offsetof(BP_ContractRequirement_Kill_C_OnKillMessageReceived, P2VerbMessage) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_OnKillMessageReceived::P2VerbMessage' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_OnKillMessageReceived, CallFunc_IsValidKiller_Valid) == 0x000098, "Member 'BP_ContractRequirement_Kill_C_OnKillMessageReceived::CallFunc_IsValidKiller_Valid' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_OnKillMessageReceived, CallFunc_IsValidKill_Valid) == 0x000099, "Member 'BP_ContractRequirement_Kill_C_OnKillMessageReceived::CallFunc_IsValidKill_Valid' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.Send UI Message
// 0x0178 (0x0178 - 0x0000)
struct BP_ContractRequirement_Kill_C_Send_UI_Message final
{
public:
	EP2ContractRequirementState                   CallFunc_GetState_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x0018(0x0018)()
	class FText                                   CallFunc_GetTitle_ReturnValue_1;                   // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class UP2Contract*                            CallFunc_GetOwningContract_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2ContractData*                  CallFunc_GetData_ReturnValue;                      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0050)(HasGetValueTypeHash)
	EP2ContractState                              CallFunc_GetState_ReturnValue_1;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    CallFunc_FindPlayerControllerFromActor_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_Send_UI_Message) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_Send_UI_Message");
static_assert(sizeof(BP_ContractRequirement_Kill_C_Send_UI_Message) == 0x000178, "Wrong size on BP_ContractRequirement_Kill_C_Send_UI_Message");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetState_ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetTitle_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetTitle_ReturnValue_1) == 0x000030, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetTitle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000048, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000058, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetOwningContract_ReturnValue) == 0x000090, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetOwningContract_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetData_ReturnValue) == 0x000098, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000A0, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetState_ReturnValue_1) == 0x000128, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, K2Node_MakeArray_Array) == 0x000130, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000140, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_Format_ReturnValue) == 0x000148, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000160, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000168, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_Send_UI_Message, CallFunc_FindPlayerControllerFromActor_ReturnValue) == 0x000170, "Member 'BP_ContractRequirement_Kill_C_Send_UI_Message::CallFunc_FindPlayerControllerFromActor_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Kill_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_Kill_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_Kill_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_Kill_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.GetCount
// 0x00F8 (0x00F8 - 0x0000)
struct BP_ContractRequirement_Kill_C_GetCount final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_Kill_C_GetCount) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_GetCount");
static_assert(sizeof(BP_ContractRequirement_Kill_C_GetCount) == 0x0000F8, "Wrong size on BP_ContractRequirement_Kill_C_GetCount");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_GetCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Kill_C_GetCount::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'BP_ContractRequirement_Kill_C_GetCount::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_ContractRequirement_Kill_C_GetCount::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000078, "Member 'BP_ContractRequirement_Kill_C_GetCount::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'BP_ContractRequirement_Kill_C_GetCount::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_ContractRequirement_Kill_C_GetCount::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetCount, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'BP_ContractRequirement_Kill_C_GetCount::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.GetTitle
// 0x01E0 (0x01E0 - 0x0000)
struct BP_ContractRequirement_Kill_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0118(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0168(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_Kill_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_Kill_C_GetTitle) == 0x0001E0, "Wrong size on BP_ContractRequirement_Kill_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'BP_ContractRequirement_Kill_C_GetTitle::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000C0, "Member 'BP_ContractRequirement_Kill_C_GetTitle::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_3) == 0x000118, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_4) == 0x000168, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, K2Node_MakeArray_Array) == 0x0001B8, "Member 'BP_ContractRequirement_Kill_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_GetTitle, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'BP_ContractRequirement_Kill_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.IsValidKill
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ContractRequirement_Kill_C_IsValidKill final
{
public:
	class UObject*                                InKilled;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  InInstigatorTags;                                  // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTagContainer                  InTargetTags;                                      // 0x0028(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Valid;                                             // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TempInstigatorTags;                                // 0x0050(0x0020)(Edit, BlueprintVisible)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumGameplayTagsInContainer_ReturnValue; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetCurrentWeaponTags_ReturnValue;         // 0x0098(0x0020)()
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2TeamComparison                             CallFunc_CompareTeams_ReturnValue;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_IsValidKill) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_IsValidKill");
static_assert(sizeof(BP_ContractRequirement_Kill_C_IsValidKill) == 0x0000D0, "Wrong size on BP_ContractRequirement_Kill_C_IsValidKill");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, InKilled) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::InKilled' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, InInstigatorTags) == 0x000008, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::InInstigatorTags' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, InTargetTags) == 0x000028, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::InTargetTags' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, Valid) == 0x000048, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::Valid' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, TempInstigatorTags) == 0x000050, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::TempInstigatorTags' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_HasTag_ReturnValue) == 0x000070, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_GetNumGameplayTagsInContainer_ReturnValue) == 0x000074, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_GetNumGameplayTagsInContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_HasAllTags_ReturnValue) == 0x000079, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_BooleanOR_ReturnValue) == 0x00007A, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_GetOwningPawn_ReturnValue) == 0x000080, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, K2Node_DynamicCast_AsP2Hero_Character) == 0x000088, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_HasTag_ReturnValue_1) == 0x000091, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_GetCurrentWeaponTags_ReturnValue) == 0x000098, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_GetCurrentWeaponTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_IsGameplayTagValid_ReturnValue) == 0x0000B8, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_Not_PreBool_ReturnValue) == 0x0000B9, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_CompareTeams_TeamIdA) == 0x0000BC, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_CompareTeams_TeamIdB) == 0x0000C0, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_CompareTeams_ReturnValue) == 0x0000C4, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_BooleanOR_ReturnValue_1) == 0x0000C5, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, K2Node_SwitchEnum_CmpSuccess) == 0x0000C6, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x0000C7, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_HasTag_ReturnValue_2) == 0x0000C8, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C9, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_BooleanOR_ReturnValue_2) == 0x0000CA, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_BooleanAND_ReturnValue) == 0x0000CB, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKill, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CC, "Member 'BP_ContractRequirement_Kill_C_IsValidKill::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_ContractRequirement_Kill.BP_ContractRequirement_Kill_C.IsValidKiller
// 0x0038 (0x0038 - 0x0000)
struct BP_ContractRequirement_Kill_C_IsValidKiller final
{
public:
	class UObject*                                InInstigator;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2TeamComparison                             CallFunc_CompareTeams_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Kill_C_IsValidKiller) == 0x000008, "Wrong alignment on BP_ContractRequirement_Kill_C_IsValidKiller");
static_assert(sizeof(BP_ContractRequirement_Kill_C_IsValidKiller) == 0x000038, "Wrong size on BP_ContractRequirement_Kill_C_IsValidKiller");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKiller, InInstigator) == 0x000000, "Member 'BP_ContractRequirement_Kill_C_IsValidKiller::InInstigator' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKiller, Valid) == 0x000008, "Member 'BP_ContractRequirement_Kill_C_IsValidKiller::Valid' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Kill_C_IsValidKiller, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_Kill_C_IsValidKiller::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
