#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Extract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Extract.BP_ContractRequirement_Extract_C.ExecuteUbergraph_BP_ContractRequirement_Extract
// 0x0050 (0x0050 - 0x0000)
struct BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& ExfilTag)> K2Node_CreateDelegate_OutputDelegate;       // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ExfilTag;                       // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract) == 0x000008, "Wrong alignment on BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract");
static_assert(sizeof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract) == 0x000050, "Wrong size on BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_Event_InFirstInitialization) == 0x000014, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, CallFunc_GetOwningPawn_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_CustomEvent_ExfilTag) == 0x000020, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_CustomEvent_ExfilTag' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_DynamicCast_AsP2Hero_Character) == 0x000028, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000038, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x000040, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000049, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract, CallFunc_IsGameplayTagValid_ReturnValue) == 0x00004A, "Member 'BP_ContractRequirement_Extract_C_ExecuteUbergraph_BP_ContractRequirement_Extract::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Extract.BP_ContractRequirement_Extract_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_ContractRequirement_Extract_C_CustomEvent final
{
public:
	struct FGameplayTag                           ExfilTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Extract_C_CustomEvent) == 0x000004, "Wrong alignment on BP_ContractRequirement_Extract_C_CustomEvent");
static_assert(sizeof(BP_ContractRequirement_Extract_C_CustomEvent) == 0x000008, "Wrong size on BP_ContractRequirement_Extract_C_CustomEvent");
static_assert(offsetof(BP_ContractRequirement_Extract_C_CustomEvent, ExfilTag) == 0x000000, "Member 'BP_ContractRequirement_Extract_C_CustomEvent::ExfilTag' has a wrong offset!");

// Function BP_ContractRequirement_Extract.BP_ContractRequirement_Extract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Extract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Extract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Extract_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Extract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Extract_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Extract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Extract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

}

