#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_FacilityApproach

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_FacilityApproach.BP_ContextRequirement_FacilityApproach_C
// 0x0040 (0x00A0 - 0x0060)
class UBP_ContextRequirement_FacilityApproach_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ApproachDistanceInMeters;                          // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FacilityTag;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EP2FacilitySpotStatus                         FacilityStatus;                                    // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2FacilitySpot*>                Facilities;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Approached;                                        // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2FacilityData*                        FacilityData;                                      // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void OnFacilitySpotInstalledDelegate_Event(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)	 // 0xae1e64;
	void OnFacilitySpotDestroyedDelegate_Event(class AP2FacilitySpot* FacilitySpot, class UP2FacilityData* FacilityData_0)	 // 0xae1e64;
	void OnFacilityChanged(class AP2FacilitySpot* FacilitySpot, bool IsInstalled)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_FacilityApproach(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Simulate(float InDeltaTime)	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

	bool NeedsSimulation() const	 // 0xae1e64;
	class FText GetRequirementDescription(bool bGetRichText) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_FacilityApproach_C">();
	}
	static class UBP_ContextRequirement_FacilityApproach_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_FacilityApproach_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_FacilityApproach_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_FacilityApproach_C");
static_assert(sizeof(UBP_ContextRequirement_FacilityApproach_C) == 0x0000A0, "Wrong size on UBP_ContextRequirement_FacilityApproach_C");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_FacilityApproach_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, ApproachDistanceInMeters) == 0x000068, "Member 'UBP_ContextRequirement_FacilityApproach_C::ApproachDistanceInMeters' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, FacilityTag) == 0x000070, "Member 'UBP_ContextRequirement_FacilityApproach_C::FacilityTag' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, FacilityStatus) == 0x000078, "Member 'UBP_ContextRequirement_FacilityApproach_C::FacilityStatus' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, Facilities) == 0x000080, "Member 'UBP_ContextRequirement_FacilityApproach_C::Facilities' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, Approached) == 0x000090, "Member 'UBP_ContextRequirement_FacilityApproach_C::Approached' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityApproach_C, FacilityData) == 0x000098, "Member 'UBP_ContextRequirement_FacilityApproach_C::FacilityData' has a wrong offset!");

}

