#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_HighlightWidget_Rental

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextEvent_HighlightWidget_Rental.BP_ContextEvent_HighlightWidget_Rental_C.GetWidgetInfos
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos final
{
public:
	struct FP2TutorialWidgetState                 OutWidgetState;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FP2TutorialWidgetInfo>          OutWidgetInfos;                                    // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<struct FP2TutorialWidgetInfo>          WidgetInfos;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FP2TutorialWidgetState                 NextState;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UW_LaptopMain_C*                        LaptopWidget;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FP2TutorialWidgetState                 K2Node_MakeStruct_P2TutorialWidgetState;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetGNBWidget_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_DeploymentWidget_C*                  K2Node_DynamicCast_AsW_Deployment_Widget;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2TutorialWidgetInfo                  K2Node_MakeStruct_P2TutorialWidgetInfo;            // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaptopGNBType                                CallFunc_GetCurrentLaptopGNBType_ReturnValue;      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCurrentFocusWidget_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_1;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetByClass_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_LaptopMain_C*                        K2Node_DynamicCast_AsW_Laptop_Main;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos) == 0x000008, "Wrong alignment on BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos) == 0x0000A0, "Wrong size on BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, OutWidgetState) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::OutWidgetState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, OutWidgetInfos) == 0x000008, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::OutWidgetInfos' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, WidgetInfos) == 0x000018, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::WidgetInfos' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, NextState) == 0x000028, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::NextState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, LaptopWidget) == 0x000030, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::LaptopWidget' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_MakeStruct_P2TutorialWidgetState) == 0x000038, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_MakeStruct_P2TutorialWidgetState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_GetGNBWidget_ReturnValue) == 0x000040, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_GetGNBWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_DynamicCast_AsW_Deployment_Widget) == 0x000048, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_DynamicCast_AsW_Deployment_Widget' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_MakeStruct_P2TutorialWidgetInfo) == 0x000058, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_MakeStruct_P2TutorialWidgetInfo' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_GetCurrentLaptopGNBType_ReturnValue) == 0x000074, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_GetCurrentLaptopGNBType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000075, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_GetCurrentFocusWidget_ReturnValue) == 0x000078, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_GetCurrentFocusWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_ObjectIsA_ReturnValue) == 0x000080, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_ObjectIsA_ReturnValue_1) == 0x000081, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_ObjectIsA_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_BooleanOR_ReturnValue) == 0x000082, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, CallFunc_GetWidgetByClass_ReturnValue) == 0x000088, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::CallFunc_GetWidgetByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_DynamicCast_AsW_Laptop_Main) == 0x000090, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_DynamicCast_AsW_Laptop_Main' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_GetWidgetInfos::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_ContextEvent_HighlightWidget_Rental.BP_ContextEvent_HighlightWidget_Rental_C.ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental
// 0x0020 (0x0020 - 0x0000)
struct BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental) == 0x000008, "Wrong alignment on BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental) == 0x000020, "Wrong size on BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental, EntryPoint) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental, K2Node_Event_DeltaTime) == 0x000004, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000018, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_ExecuteUbergraph_BP_ContextEvent_HighlightWidget_Rental::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ContextEvent_HighlightWidget_Rental.BP_ContextEvent_HighlightWidget_Rental_C.BP_SimulateEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent) == 0x000004, "Wrong alignment on BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent) == 0x000004, "Wrong size on BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent, DeltaTime) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_Rental_C_BP_SimulateEvent::DeltaTime' has a wrong offset!");

}

