#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Deliver

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Deliver.BP_ContractRequirement_Deliver_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Deliver_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Deliver_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_Deliver_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_Deliver_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_Deliver_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Deliver_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Deliver.BP_ContractRequirement_Deliver_C.GetItemsToDeliver
// 0x0050 (0x0050 - 0x0000)
struct BP_ContractRequirement_Deliver_C_GetItemsToDeliver final
{
public:
	struct FP2ExchangeInfo                        ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ContractRequirement_Deliver_C_GetItemsToDeliver) == 0x000008, "Wrong alignment on BP_ContractRequirement_Deliver_C_GetItemsToDeliver");
static_assert(sizeof(BP_ContractRequirement_Deliver_C_GetItemsToDeliver) == 0x000050, "Wrong size on BP_ContractRequirement_Deliver_C_GetItemsToDeliver");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_GetItemsToDeliver, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Deliver_C_GetItemsToDeliver::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Deliver.BP_ContractRequirement_Deliver_C.GetOptionalItemsToDeliver
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver final
{
public:
	struct FP2ExchangeInfo                        ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
	struct FP2ExchangeInfo                        K2Node_MakeStruct_P2ExchangeInfo;                  // 0x0050(0x0050)()
};
static_assert(alignof(BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver) == 0x000008, "Wrong alignment on BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver");
static_assert(sizeof(BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver) == 0x0000A0, "Wrong size on BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver, K2Node_MakeStruct_P2ExchangeInfo) == 0x000050, "Member 'BP_ContractRequirement_Deliver_C_GetOptionalItemsToDeliver::K2Node_MakeStruct_P2ExchangeInfo' has a wrong offset!");

// Function BP_ContractRequirement_Deliver.BP_ContractRequirement_Deliver_C.MeetsRequirementCharacters
// 0x0078 (0x0078 - 0x0000)
struct BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters final
{
public:
	TArray<class AP2HeroCharacter*>               InCharacterList;                                   // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentAmount;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MeetsRequirementCharacters_ReturnValue;   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Item*>                        CallFunc_GetItemsFromEquipment_Items;              // 0x0040(0x0010)(ReferenceParm)
	class UP2Item*                                CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemStackAmount_ReturnValue;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters) == 0x000008, "Wrong alignment on BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters");
static_assert(sizeof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters) == 0x000078, "Wrong size on BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, InCharacterList) == 0x000000, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::InCharacterList' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CurrentAmount) == 0x000014, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CurrentAmount' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_MeetsRequirementCharacters_ReturnValue) == 0x00001C, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_MeetsRequirementCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_GetItemsFromEquipment_Items) == 0x000040, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_GetItemsFromEquipment_Items' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_GetItemStackAmount_ReturnValue) == 0x00005C, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_GetItemStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_IsItemPureStackable_ReturnValue) == 0x000060, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_SelectInt_ReturnValue) == 0x000064, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, Temp_int_Loop_Counter_Variable_1) == 0x00006C, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Less_IntInt_ReturnValue_1) == 0x000071, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'BP_ContractRequirement_Deliver_C_MeetsRequirementCharacters::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_ContractRequirement_Deliver.BP_ContractRequirement_Deliver_C.ShouldCheckboxTickUI
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideout_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCheckboxTickUI_ReturnValue;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI) == 0x000001, "Wrong alignment on BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI");
static_assert(sizeof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI) == 0x000004, "Wrong size on BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI, CallFunc_IsHideout_ReturnValue) == 0x000001, "Member 'BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI::CallFunc_IsHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI, CallFunc_ShouldCheckboxTickUI_ReturnValue) == 0x000002, "Member 'BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI::CallFunc_ShouldCheckboxTickUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'BP_ContractRequirement_Deliver_C_ShouldCheckboxTickUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

