#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_OpenLaptop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_OpenLaptop.BP_ContextRequirement_OpenLaptop_C
// 0x0018 (0x0078 - 0x0060)
class UBP_ContextRequirement_OpenLaptop_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ELaptopGNBType                                TabType;                                           // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnLaptopGNBChanged(ELaptopGNBType InNewGNBType)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_OpenLaptop(int32 EntryPoint)	 // 0xae1e64;
	void DetectLaptop()	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_OpenLaptop_C">();
	}
	static class UBP_ContextRequirement_OpenLaptop_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_OpenLaptop_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_OpenLaptop_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_OpenLaptop_C");
static_assert(sizeof(UBP_ContextRequirement_OpenLaptop_C) == 0x000078, "Wrong size on UBP_ContextRequirement_OpenLaptop_C");
static_assert(offsetof(UBP_ContextRequirement_OpenLaptop_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_OpenLaptop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_OpenLaptop_C, TabType) == 0x000068, "Member 'UBP_ContextRequirement_OpenLaptop_C::TabType' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_OpenLaptop_C, Async_Action) == 0x000070, "Member 'UBP_ContextRequirement_OpenLaptop_C::Async_Action' has a wrong offset!");

}

