#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_ResearchStep

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C
// 0x0038 (0x0160 - 0x0128)
class UBP_ContractRequirement_ResearchStep_C final : public UP2ContractRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0128(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          DesiredState;                                      // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryId                        ResearchNodeRI;                                    // 0x013C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ResearchNodeDataInfo                ResearchNodeDataInfo;                              // 0x0150(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AquireDataRegistryCallBack(const struct FDataRegistryId& ItemId, const struct FDataRegistryLookup& ResolvedLookup, EDataRegistryAcquireStatus Status)	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_ResearchStep(int32 EntryPoint)	 // 0xae1e64;
	void OnInitializeExtentions(const class AP2PlayerState* InPlayerState)	 // 0xae1e64;
	void OnResearchStepChanged(class UP2ResearchNode* InResearchNode, class UP2ResearchStep* InResearchStep, EP2ResearchStepState InNewState, EP2ResearchStepState InOldState)	 // 0xae1e64;
	void OnResearchStepStateChanged(EP2ResearchStepState NewState)	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_ResearchStep_C">();
	}
	static class UBP_ContractRequirement_ResearchStep_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_ResearchStep_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_ResearchStep_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_ResearchStep_C");
static_assert(sizeof(UBP_ContractRequirement_ResearchStep_C) == 0x000160, "Wrong size on UBP_ContractRequirement_ResearchStep_C");
static_assert(offsetof(UBP_ContractRequirement_ResearchStep_C, UberGraphFrame) == 0x000128, "Member 'UBP_ContractRequirement_ResearchStep_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_ResearchStep_C, Async_Action) == 0x000130, "Member 'UBP_ContractRequirement_ResearchStep_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_ResearchStep_C, DesiredState) == 0x000138, "Member 'UBP_ContractRequirement_ResearchStep_C::DesiredState' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_ResearchStep_C, ResearchNodeRI) == 0x00013C, "Member 'UBP_ContractRequirement_ResearchStep_C::ResearchNodeRI' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_ResearchStep_C, ResearchNodeDataInfo) == 0x000150, "Member 'UBP_ContractRequirement_ResearchStep_C::ResearchNodeDataInfo' has a wrong offset!");

}

