#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_HighlightWidget_LootContext

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ContextEvent_HighlightWidgets_classes.hpp"
#include "Hideout_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextEvent_HighlightWidget_LootContext.BP_ContextEvent_HighlightWidget_LootContext_C
// 0x0020 (0x00B8 - 0x0098)
class UBP_ContextEvent_HighlightWidget_LootContext_C final : public UBP_ContextEvent_HighlightWidgets_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Duration;                                          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Timer;                                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinished;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ActivateEvent()	 // 0xae1e64;
	void BP_SimulateEvent(float DeltaTime)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextEvent_HighlightWidget_LootContext(int32 EntryPoint)	 // 0xae1e64;
	void GetWidgetInfos(struct FP2TutorialWidgetState* OutWidgetState, TArray<struct FP2TutorialWidgetInfo>* OutWidgetInfos)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextEvent_HighlightWidget_LootContext_C">();
	}
	static class UBP_ContextEvent_HighlightWidget_LootContext_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextEvent_HighlightWidget_LootContext_C>();
	}
};
static_assert(alignof(UBP_ContextEvent_HighlightWidget_LootContext_C) == 0x000008, "Wrong alignment on UBP_ContextEvent_HighlightWidget_LootContext_C");
static_assert(sizeof(UBP_ContextEvent_HighlightWidget_LootContext_C) == 0x0000B8, "Wrong size on UBP_ContextEvent_HighlightWidget_LootContext_C");
static_assert(offsetof(UBP_ContextEvent_HighlightWidget_LootContext_C, UberGraphFrame) == 0x000098, "Member 'UBP_ContextEvent_HighlightWidget_LootContext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_HighlightWidget_LootContext_C, Duration) == 0x0000A0, "Member 'UBP_ContextEvent_HighlightWidget_LootContext_C::Duration' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_HighlightWidget_LootContext_C, Timer) == 0x0000A8, "Member 'UBP_ContextEvent_HighlightWidget_LootContext_C::Timer' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_HighlightWidget_LootContext_C, bFinished) == 0x0000B0, "Member 'UBP_ContextEvent_HighlightWidget_LootContext_C::bFinished' has a wrong offset!");

}

