#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_HighlightWidgets

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextEvent_HighlightWidgets.BP_ContextEvent_HighlightWidgets_C.BP_ShouldActivateOnLoad
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad final
{
public:
	class UP2GameplayContext*                     InContext;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2GameplayContextState                       InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad) == 0x000008, "Wrong alignment on BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad");
static_assert(sizeof(BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad) == 0x000010, "Wrong size on BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad");
static_assert(offsetof(BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad, InContext) == 0x000000, "Member 'BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad::InContext' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad, InState) == 0x000008, "Member 'BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad::InState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad, ReturnValue) == 0x000009, "Member 'BP_ContextEvent_HighlightWidgets_C_BP_ShouldActivateOnLoad::ReturnValue' has a wrong offset!");

// Function BP_ContextEvent_HighlightWidgets.BP_ContextEvent_HighlightWidgets_C.NeedsSimulation
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextEvent_HighlightWidgets_C_NeedsSimulation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidgets_C_NeedsSimulation) == 0x000001, "Wrong alignment on BP_ContextEvent_HighlightWidgets_C_NeedsSimulation");
static_assert(sizeof(BP_ContextEvent_HighlightWidgets_C_NeedsSimulation) == 0x000001, "Wrong size on BP_ContextEvent_HighlightWidgets_C_NeedsSimulation");
static_assert(offsetof(BP_ContextEvent_HighlightWidgets_C_NeedsSimulation, ReturnValue) == 0x000000, "Member 'BP_ContextEvent_HighlightWidgets_C_NeedsSimulation::ReturnValue' has a wrong offset!");

}

