#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_C4

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_C4.BP_C4_C.ExecuteUbergraph_BP_C4
// 0x0090 (0x0090 - 0x0000)
struct BP_C4_C_ExecuteUbergraph_BP_C4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2DeployableData*                      K2Node_DynamicCast_AsP2Deployable_Data;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue_1;     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue_1;                // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2DeployableData*                      K2Node_DynamicCast_AsP2Deployable_Data_1;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_C4_C_ExecuteUbergraph_BP_C4) == 0x000008, "Wrong alignment on BP_C4_C_ExecuteUbergraph_BP_C4");
static_assert(sizeof(BP_C4_C_ExecuteUbergraph_BP_C4) == 0x000090, "Wrong size on BP_C4_C_ExecuteUbergraph_BP_C4");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, EntryPoint) == 0x000000, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_GetItemData_ReturnValue) == 0x000008, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_DynamicCast_AsP2Deployable_Data) == 0x000020, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_DynamicCast_AsP2Deployable_Data' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_HasAuthority_ReturnValue) == 0x00003C, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000058, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000070, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_TryPostEventAtLocation_ReturnValue_1) == 0x000074, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_TryPostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, CallFunc_GetItemData_ReturnValue_1) == 0x000078, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::CallFunc_GetItemData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_DynamicCast_AsP2Deployable_Data_1) == 0x000080, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_DynamicCast_AsP2Deployable_Data_1' has a wrong offset!");
static_assert(offsetof(BP_C4_C_ExecuteUbergraph_BP_C4, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_C4_C_ExecuteUbergraph_BP_C4::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

