#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_AutoStartContract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C
// 0x0058 (0x0260 - 0x0208)
class UBP_ContractRequirement_AutoStartContract_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           LocationTargetTag;                                 // 0x0210(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeSpentRequirement;                              // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisitsRequirement;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LocationsVisited;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsOwnerInsideLocation;                             // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeSpent;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AP2HeroCharacter*>               InstigatorsInsideLocation;                         // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void IsValidInstigator(class UObject* Actor, bool* Valid)	 // 0xae1e64;
	void IsSquadMember(class UObject* Actor, bool* OnSameTeam)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_AutoStartContract(int32 EntryPoint)	 // 0xae1e64;
	void BP_Simulate(float InDeltaTime)	 // 0xae1e64;

	bool NeedsSimulation() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;
	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_AutoStartContract_C">();
	}
	static class UBP_ContractRequirement_AutoStartContract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_AutoStartContract_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_AutoStartContract_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_AutoStartContract_C");
static_assert(sizeof(UBP_ContractRequirement_AutoStartContract_C) == 0x000260, "Wrong size on UBP_ContractRequirement_AutoStartContract_C");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_AutoStartContract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, LocationTargetTag) == 0x000210, "Member 'UBP_ContractRequirement_AutoStartContract_C::LocationTargetTag' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, Async_Action) == 0x000218, "Member 'UBP_ContractRequirement_AutoStartContract_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, TimeSpentRequirement) == 0x000220, "Member 'UBP_ContractRequirement_AutoStartContract_C::TimeSpentRequirement' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, VisitsRequirement) == 0x000228, "Member 'UBP_ContractRequirement_AutoStartContract_C::VisitsRequirement' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, LocationsVisited) == 0x000230, "Member 'UBP_ContractRequirement_AutoStartContract_C::LocationsVisited' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, IsOwnerInsideLocation) == 0x000240, "Member 'UBP_ContractRequirement_AutoStartContract_C::IsOwnerInsideLocation' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, TimeSpent) == 0x000248, "Member 'UBP_ContractRequirement_AutoStartContract_C::TimeSpent' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_AutoStartContract_C, InstigatorsInsideLocation) == 0x000250, "Member 'UBP_ContractRequirement_AutoStartContract_C::InstigatorsInsideLocation' has a wrong offset!");

}

