#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextREquirement_GameplayMessage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextREquirement_GameplayMessage.BP_ContextREquirement_GameplayMessage_C
// 0x0040 (0x00A0 - 0x0060)
class UBP_ContextREquirement_GameplayMessage_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           MessageChannel;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RequiredVerbTag;                                   // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ExactMatchRequired;                                // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0088(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextREquirement_GameplayMessage(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

	class FText GetRequirementDescription(bool bGetRichText) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextREquirement_GameplayMessage_C">();
	}
	static class UBP_ContextREquirement_GameplayMessage_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextREquirement_GameplayMessage_C>();
	}
};
static_assert(alignof(UBP_ContextREquirement_GameplayMessage_C) == 0x000008, "Wrong alignment on UBP_ContextREquirement_GameplayMessage_C");
static_assert(sizeof(UBP_ContextREquirement_GameplayMessage_C) == 0x0000A0, "Wrong size on UBP_ContextREquirement_GameplayMessage_C");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextREquirement_GameplayMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, MessageChannel) == 0x000068, "Member 'UBP_ContextREquirement_GameplayMessage_C::MessageChannel' has a wrong offset!");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, RequiredVerbTag) == 0x000070, "Member 'UBP_ContextREquirement_GameplayMessage_C::RequiredVerbTag' has a wrong offset!");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, ExactMatchRequired) == 0x000078, "Member 'UBP_ContextREquirement_GameplayMessage_C::ExactMatchRequired' has a wrong offset!");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, Async_Action) == 0x000080, "Member 'UBP_ContextREquirement_GameplayMessage_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContextREquirement_GameplayMessage_C, Description) == 0x000088, "Member 'UBP_ContextREquirement_GameplayMessage_C::Description' has a wrong offset!");

}

