#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_OpenLaptop

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hideout_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextRequirement_OpenLaptop.BP_ContextRequirement_OpenLaptop_C.OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A) == 0x000008, "Wrong alignment on BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A");
static_assert(sizeof(BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A) == 0x000010, "Wrong size on BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A, ProxyObject) == 0x000000, "Member 'BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A, ActualChannel) == 0x000008, "Member 'BP_ContextRequirement_OpenLaptop_C_OnMessageReceived_96AA1EAD4B3CB09C49D49995F764B43A::ActualChannel' has a wrong offset!");

// Function BP_ContextRequirement_OpenLaptop.BP_ContextRequirement_OpenLaptop_C.OnLaptopGNBChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged final
{
public:
	ELaptopGNBType                                InNewGNBType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged) == 0x000001, "Wrong alignment on BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged");
static_assert(sizeof(BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged) == 0x000001, "Wrong size on BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged, InNewGNBType) == 0x000000, "Member 'BP_ContextRequirement_OpenLaptop_C_OnLaptopGNBChanged::InNewGNBType' has a wrong offset!");

// Function BP_ContextRequirement_OpenLaptop.BP_ContextRequirement_OpenLaptop_C.ExecuteUbergraph_BP_ContextRequirement_OpenLaptop
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2HUDGameplayMessage                  Temp_struct_Variable;                              // 0x0008(0x0018)(NoDestructor, ContainsInstancedReference)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2HUDGameplayMessage                  Temp_struct_Variable_1;                            // 0x0040(0x0018)(NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ELaptopGNBType InNewGNBType)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetByClass_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_LaptopMain_C*                        K2Node_DynamicCast_AsW_Laptop_Main;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaptopGNBType                                CallFunc_GetCurrentLaptopGNBType_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaptopGNBType                                K2Node_CustomEvent_InNewGNBType;                   // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidgetByClass_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_LaptopMain_C*                        K2Node_DynamicCast_AsW_Laptop_Main_1;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop) == 0x000008, "Wrong alignment on BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop");
static_assert(sizeof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop) == 0x0000B8, "Wrong size on BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, EntryPoint) == 0x000000, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, Temp_struct_Variable) == 0x000008, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_CustomEvent_ProxyObject) == 0x000020, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_CustomEvent_ActualChannel) == 0x000028, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, Temp_struct_Variable_1) == 0x000040, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, Temp_struct_Variable_2) == 0x000058, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, Temp_object_Variable) == 0x000060, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000068, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_GetPayload_ReturnValue) == 0x000070, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_Event_InFirstInitialization) == 0x000084, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_GetWidgetByClass_ReturnValue) == 0x000088, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_GetWidgetByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_DynamicCast_AsW_Laptop_Main) == 0x000090, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_DynamicCast_AsW_Laptop_Main' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_GetCurrentLaptopGNBType_ReturnValue) == 0x000099, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_GetCurrentLaptopGNBType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_CustomEvent_InNewGNBType) == 0x00009A, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_CustomEvent_InNewGNBType' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009B, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00009C, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_GetWidgetByClass_ReturnValue_1) == 0x0000A0, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_GetWidgetByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_DynamicCast_AsW_Laptop_Main_1) == 0x0000A8, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_DynamicCast_AsW_Laptop_Main_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop, CallFunc_IsValid_ReturnValue_1) == 0x0000B1, "Member 'BP_ContextRequirement_OpenLaptop_C_ExecuteUbergraph_BP_ContextRequirement_OpenLaptop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ContextRequirement_OpenLaptop.BP_ContextRequirement_OpenLaptop_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_OpenLaptop_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_OpenLaptop_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContextRequirement_OpenLaptop_C_BP_Initialize");
static_assert(sizeof(BP_ContextRequirement_OpenLaptop_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContextRequirement_OpenLaptop_C_BP_Initialize");
static_assert(offsetof(BP_ContextRequirement_OpenLaptop_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContextRequirement_OpenLaptop_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

}

