#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Item

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.BindTeamStateEvents
// 0x0080 (0x0080 - 0x0000)
struct BP_ContractRequirement_Item_C_BindTeamStateEvents final
{
public:
	class AP2TeamStatePrivate*                    PrivateTeamState;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AActor* PlayerLeaving, const class AP2TeamStatePrivate* PreviousTeamStatePrivate, const class AP2TeamStatePrivate* NewTeamStatePrivate)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class AActor* PlayerJoining, const class AP2TeamStatePrivate* PreviousTeamStatePrivate, const class AP2TeamStatePrivate* NewTeamStatePrivate)> K2Node_CreateDelegate_OutputDelegate_1; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* PossessedPawn)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* UnpossessedPawn)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2BaseCharacter* Character)> K2Node_CreateDelegate_OutputDelegate_4;       // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2GameMode* GameMode, class AP2BaseCharacter* Character)> K2Node_CreateDelegate_OutputDelegate_5; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate_6; // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_BindTeamStateEvents) == 0x000008, "Wrong alignment on BP_ContractRequirement_Item_C_BindTeamStateEvents");
static_assert(sizeof(BP_ContractRequirement_Item_C_BindTeamStateEvents) == 0x000080, "Wrong size on BP_ContractRequirement_Item_C_BindTeamStateEvents");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, PrivateTeamState) == 0x000000, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::PrivateTeamState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_4) == 0x00004C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_5) == 0x00005C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_BindTeamStateEvents, K2Node_CreateDelegate_OutputDelegate_6) == 0x00006C, "Member 'BP_ContractRequirement_Item_C_BindTeamStateEvents::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Item_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Item_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Item_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Item_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Item_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Item_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.Calculate Stash Items
// 0x0060 (0x0060 - 0x0000)
struct BP_ContractRequirement_Item_C_Calculate_Stash_Items final
{
public:
	TArray<class UP2Item*>                        StashItems;                                        // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Container*>                   CallFunc_FindStashContainers_ReturnContainers;     // 0x0020(0x0010)(ReferenceParm)
	TArray<class UP2Item*>                        CallFunc_GetItemsFromContainers_Items;             // 0x0030(0x0010)(ReferenceParm)
	class UP2Item*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemStackAmount_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_Calculate_Stash_Items) == 0x000008, "Wrong alignment on BP_ContractRequirement_Item_C_Calculate_Stash_Items");
static_assert(sizeof(BP_ContractRequirement_Item_C_Calculate_Stash_Items) == 0x000060, "Wrong size on BP_ContractRequirement_Item_C_Calculate_Stash_Items");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, StashItems) == 0x000000, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::StashItems' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_FindStashContainers_ReturnContainers) == 0x000020, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_FindStashContainers_ReturnContainers' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_GetItemsFromContainers_Items) == 0x000030, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_GetItemsFromContainers_Items' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_IsItemPureStackable_ReturnValue) == 0x00004C, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_GetItemStackAmount_ReturnValue) == 0x000050, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_GetItemStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_Calculate_Stash_Items, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'BP_ContractRequirement_Item_C_Calculate_Stash_Items::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.CalculateEquipmentManagerItems
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems final
{
public:
	bool                                          IncludeSelf;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class APawn*, class UP2Item*>            FoundItems;                                        // 0x0008(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2TeamStatePrivate*                    CallFunc_GetPrivateTeamState_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          CallFunc_GetTeamPawns_ReturnValue;                 // 0x0080(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems) == 0x000008, "Wrong alignment on BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems");
static_assert(sizeof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems) == 0x0000A0, "Wrong size on BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, IncludeSelf) == 0x000000, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::IncludeSelf' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, FoundItems) == 0x000008, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::FoundItems' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, Temp_int_Array_Index_Variable) == 0x000058, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_GetOwningPawn_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000070, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_GetPrivateTeamState_ReturnValue) == 0x000078, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_GetPrivateTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_GetTeamPawns_ReturnValue) == 0x000080, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_GetTeamPawns_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_ContractRequirement_Item_C_CalculateEquipmentManagerItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.CalculatePlayerItems
// 0x0080 (0x0080 - 0x0000)
struct BP_ContractRequirement_Item_C_CalculatePlayerItems final
{
public:
	class APawn*                                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Item*>                        CallFunc_GetItemsFromEquipment_Items;              // 0x0020(0x0010)(ReferenceParm)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Item*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemStackAmount_ReturnValue;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_CalculatePlayerItems) == 0x000008, "Wrong alignment on BP_ContractRequirement_Item_C_CalculatePlayerItems");
static_assert(sizeof(BP_ContractRequirement_Item_C_CalculatePlayerItems) == 0x000080, "Wrong size on BP_ContractRequirement_Item_C_CalculatePlayerItems");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, Player) == 0x000000, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::Player' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, K2Node_DynamicCast_AsP2Hero_Character) == 0x000010, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_GetItemsFromEquipment_Items) == 0x000020, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_GetItemsFromEquipment_Items' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_GetHealth_ReturnValue) == 0x000030, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_IsItemPureStackable_ReturnValue) == 0x000041, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_GetOwningPawn_ReturnValue) == 0x000048, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_GetItemStackAmount_ReturnValue) == 0x000050, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_GetItemStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_SelectInt_ReturnValue) == 0x000058, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Map_Find_Value) == 0x000068, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Map_Find_ReturnValue) == 0x00006C, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_CalculatePlayerItems, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'BP_ContractRequirement_Item_C_CalculatePlayerItems::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_ContractRequirement_Item.BP_ContractRequirement_Item_C.ExecuteUbergraph_BP_ContractRequirement_Item
// 0x0290 (0x0290 - 0x0000)
struct BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2TeamStatePrivate*                    CallFunc_GetPrivateTeamState_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideout_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2GameMode*                            K2Node_CustomEvent_GameMode;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_CustomEvent_Character_1;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_2;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_PlayerJoining;                  // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AP2TeamStatePrivate*              K2Node_CustomEvent_PreviousTeamStatePrivate_1;     // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AP2TeamStatePrivate*              K2Node_CustomEvent_NewTeamStatePrivate_1;          // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_PlayerLeaving;                  // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AP2TeamStatePrivate*              K2Node_CustomEvent_PreviousTeamStatePrivate;       // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AP2TeamStatePrivate*              K2Node_CustomEvent_NewTeamStatePrivate;            // 0x00A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue_1;                    // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State_1;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPawn_ReturnValue_2;                    // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_4;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_5;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2TeamStatePrivate*                    CallFunc_GetPrivateTeamState_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideout_ReturnValue_1;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0114(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_6;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_PossessedPawn;                  // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_CustomEvent_UnpossessedPawn;                // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_CustomEvent_Character;                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0150(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_7;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_3;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   CallFunc_GetState_ReturnValue;                     // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0164(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2ContainerComponent*>          CallFunc_FindStashContainerComponents_ReturnContainerComponents; // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ContainerComponent*                  CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State_2;             // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_1;        // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_3; // 0x01EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue_1; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State_3;             // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0214(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UpdateState;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_2;  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_2;        // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue_2; // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_CustomEvent_FacilitySpot;                   // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            K2Node_CustomEvent_Facility;                       // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate_6; // 0x027C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item) == 0x000008, "Wrong alignment on BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item");
static_assert(sizeof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item) == 0x000290, "Wrong size on BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetOwningPawn_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetPrivateTeamState_ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetPrivateTeamState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_IsHideout_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_IsHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, Temp_byte_Variable) == 0x000019, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_Event_InFirstInitialization) == 0x00001A, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, Temp_byte_Variable_1) == 0x00001B, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000020, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_AsP2Hero_Character) == 0x000030, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_GameMode) == 0x000040, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_GameMode' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_Character_1) == 0x000048, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetOwningPawn_ReturnValue_2) == 0x000050, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetOwningPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetOwningPawn_ReturnValue_3) == 0x000070, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetOwningPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_PlayerJoining) == 0x000078, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_PlayerJoining' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_PreviousTeamStatePrivate_1) == 0x000080, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_PreviousTeamStatePrivate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_NewTeamStatePrivate_1) == 0x000088, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_NewTeamStatePrivate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_PlayerLeaving) == 0x000090, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_PlayerLeaving' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_PreviousTeamStatePrivate) == 0x000098, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_PreviousTeamStatePrivate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_CustomEvent_NewTeamStatePrivate) == 0x0000A0, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_CustomEvent_NewTeamStatePrivate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_AsP2Player_State) == 0x0000A8, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetPawn_ReturnValue) == 0x0000B8, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetPawn_ReturnValue_1) == 0x0000C0, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_Map_Remove_ReturnValue) == 0x0000C8, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0000C9, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_AsP2Player_State_1) == 0x0000D0, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_AsP2Player_State_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetPawn_ReturnValue_2) == 0x0000E0, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item, CallFunc_GetOwningPawn_ReturnValue_4) == 0x0000E8, "Member 'BP_ContractRequirement_Item_C_ExecuteUbergraph_BP_ContractRequirement_Item::CallFunc_GetOwningPawn_ReturnValue_4' has a wrong offset!");
