#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_FacilityInteract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C.OnMessageReceived_48A2489F432A012F87FD2AB22C117852
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852) == 0x000008, "Wrong alignment on BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852");
static_assert(sizeof(BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852) == 0x000010, "Wrong size on BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852, ProxyObject) == 0x000000, "Member 'BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852, ActualChannel) == 0x000008, "Member 'BP_ContextRequirement_FacilityInteract_C_OnMessageReceived_48A2489F432A012F87FD2AB22C117852::ActualChannel' has a wrong offset!");

// Function BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C.ExecuteUbergraph_BP_ContextRequirement_FacilityInteract
// 0x0098 (0x0098 - 0x0000)
struct BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilityMessage_Operate             Temp_struct_Variable;                              // 0x0028(0x0020)(NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2FacilityMessage_Operate             Temp_struct_Variable_2;                            // 0x0070(0x0020)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract) == 0x000008, "Wrong alignment on BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract");
static_assert(sizeof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract) == 0x000098, "Wrong size on BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, EntryPoint) == 0x000000, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, Temp_struct_Variable) == 0x000028, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, Temp_struct_Variable_1) == 0x000048, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, Temp_object_Variable) == 0x000058, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000060, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, K2Node_Event_InFirstInitialization) == 0x000069, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, Temp_struct_Variable_2) == 0x000070, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_GetPayload_ReturnValue) == 0x000092, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract, CallFunc_IsValid_ReturnValue_1) == 0x000093, "Member 'BP_ContextRequirement_FacilityInteract_C_ExecuteUbergraph_BP_ContextRequirement_FacilityInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_FacilityInteract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_FacilityInteract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContextRequirement_FacilityInteract_C_BP_Initialize");
static_assert(sizeof(BP_ContextRequirement_FacilityInteract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContextRequirement_FacilityInteract_C_BP_Initialize");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContextRequirement_FacilityInteract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C.NeedsSimulation
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_FacilityInteract_C_NeedsSimulation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_FacilityInteract_C_NeedsSimulation) == 0x000001, "Wrong alignment on BP_ContextRequirement_FacilityInteract_C_NeedsSimulation");
static_assert(sizeof(BP_ContextRequirement_FacilityInteract_C_NeedsSimulation) == 0x000001, "Wrong size on BP_ContextRequirement_FacilityInteract_C_NeedsSimulation");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_NeedsSimulation, ReturnValue) == 0x000000, "Member 'BP_ContextRequirement_FacilityInteract_C_NeedsSimulation::ReturnValue' has a wrong offset!");

// Function BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C.GetRequirementDescription
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription final
{
public:
	bool                                          bGetRichText;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription) == 0x000008, "Wrong alignment on BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription");
static_assert(sizeof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription) == 0x0000A0, "Wrong size on BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, bGetRichText) == 0x000000, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::bGetRichText' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, ReturnValue) == 0x000008, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BP_ContextRequirement_FacilityInteract_C_GetRequirementDescription::CallFunc_Format_ReturnValue' has a wrong offset!");

}

