#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Enter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_Enter.BP_ContractRequirement_Enter_C
// 0x0128 (0x0330 - 0x0208)
class UBP_ContractRequirement_Enter_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           DEPRECATING_LocationTargetTag_USE_CONTAINER_INSTEAD; // 0x0210(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  LocationTargetTagContainer;                        // 0x0220(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeSpentRequirement;                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisitsRequirement;                                 // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LocationsVisited;                                  // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsOwnerInsideLocation;                             // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeSpent;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AP2HeroCharacter*>               InstigatorsInsideLocation;                         // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           CompletedTimerHandle;                              // 0x0280(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   ObjectiveCompleted;                                // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ContractCompleted;                                 // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ObjectiveUncompleted;                              // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   ArrayOfTags;                                       // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, class UAsyncAction_ListenForGameplayMessage*> Async_Actions;           // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void Clear_Listen_Events()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_Enter(int32 EntryPoint)	 // 0xae1e64;
	void IsSquadMember(class UObject* Actor, bool* OnSameTeam)	 // 0xae1e64;
	void IsValidInstigator(class UObject* Actor, bool* Valid)	 // 0xae1e64;
	void OnMessageReceived_138564834A7C525816ACEB8E82742B0A(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnTimeCompleted()	 // 0xae1e64;
	void Send_UI_Message()	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;
	bool NeedsSimulation() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_Enter_C">();
	}
	static class UBP_ContractRequirement_Enter_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_Enter_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_Enter_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_Enter_C");
static_assert(sizeof(UBP_ContractRequirement_Enter_C) == 0x000330, "Wrong size on UBP_ContractRequirement_Enter_C");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_Enter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, DEPRECATING_LocationTargetTag_USE_CONTAINER_INSTEAD) == 0x000210, "Member 'UBP_ContractRequirement_Enter_C::DEPRECATING_LocationTargetTag_USE_CONTAINER_INSTEAD' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, Async_Action) == 0x000218, "Member 'UBP_ContractRequirement_Enter_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, LocationTargetTagContainer) == 0x000220, "Member 'UBP_ContractRequirement_Enter_C::LocationTargetTagContainer' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, TimeSpentRequirement) == 0x000240, "Member 'UBP_ContractRequirement_Enter_C::TimeSpentRequirement' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, VisitsRequirement) == 0x000248, "Member 'UBP_ContractRequirement_Enter_C::VisitsRequirement' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, LocationsVisited) == 0x000250, "Member 'UBP_ContractRequirement_Enter_C::LocationsVisited' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, IsOwnerInsideLocation) == 0x000260, "Member 'UBP_ContractRequirement_Enter_C::IsOwnerInsideLocation' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, TimeSpent) == 0x000268, "Member 'UBP_ContractRequirement_Enter_C::TimeSpent' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, InstigatorsInsideLocation) == 0x000270, "Member 'UBP_ContractRequirement_Enter_C::InstigatorsInsideLocation' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, CompletedTimerHandle) == 0x000280, "Member 'UBP_ContractRequirement_Enter_C::CompletedTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, ObjectiveCompleted) == 0x000288, "Member 'UBP_ContractRequirement_Enter_C::ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, ContractCompleted) == 0x0002A0, "Member 'UBP_ContractRequirement_Enter_C::ContractCompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, ObjectiveUncompleted) == 0x0002B8, "Member 'UBP_ContractRequirement_Enter_C::ObjectiveUncompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, ArrayOfTags) == 0x0002D0, "Member 'UBP_ContractRequirement_Enter_C::ArrayOfTags' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Enter_C, Async_Actions) == 0x0002E0, "Member 'UBP_ContractRequirement_Enter_C::Async_Actions' has a wrong offset!");

}

