#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_AutoStartContract

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.IsValidInstigator
// 0x0020 (0x0020 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_IsValidInstigator final
{
public:
	class UObject*                                Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSquadMember_OnSameTeam;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator) == 0x000008, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_IsValidInstigator");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator) == 0x000020, "Wrong size on BP_ContractRequirement_AutoStartContract_C_IsValidInstigator");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, Actor) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::Actor' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, Valid) == 0x000008, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::Valid' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, CallFunc_IsSquadMember_OnSameTeam) == 0x000009, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::CallFunc_IsSquadMember_OnSameTeam' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsValidInstigator, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_ContractRequirement_AutoStartContract_C_IsValidInstigator::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.IsSquadMember
// 0x0028 (0x0028 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_IsSquadMember final
{
public:
	class UObject*                                Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          OnSameTeam;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2TeamComparison                             CallFunc_CompareTeams_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember) == 0x000008, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_IsSquadMember");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember) == 0x000028, "Wrong size on BP_ContractRequirement_AutoStartContract_C_IsSquadMember");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, Actor) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::Actor' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, OnSameTeam) == 0x000008, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::OnSameTeam' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, CallFunc_CompareTeams_TeamIdA) == 0x000018, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::CallFunc_CompareTeams_TeamIdA' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, CallFunc_CompareTeams_TeamIdB) == 0x00001C, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::CallFunc_CompareTeams_TeamIdB' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, CallFunc_CompareTeams_ReturnValue) == 0x000020, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::CallFunc_CompareTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_IsSquadMember, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BP_ContractRequirement_AutoStartContract_C_IsSquadMember::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.ExecuteUbergraph_BP_ContractRequirement_AutoStartContract
// 0x0030 (0x0030 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2GameMode_Tutorial*                   K2Node_DynamicCast_AsP2Game_Mode_Tutorial;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   CallFunc_GetState_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            CallFunc_GetOwningContract_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract) == 0x000008, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract) == 0x000030, "Wrong size on BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, K2Node_DynamicCast_AsP2Game_Mode_Tutorial) == 0x000010, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::K2Node_DynamicCast_AsP2Game_Mode_Tutorial' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, K2Node_Event_InDeltaTime) == 0x00001C, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, CallFunc_GetState_ReturnValue) == 0x000020, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000021, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract, CallFunc_GetOwningContract_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_AutoStartContract_C_ExecuteUbergraph_BP_ContractRequirement_AutoStartContract::CallFunc_GetOwningContract_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.BP_Simulate
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_BP_Simulate final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_BP_Simulate) == 0x000004, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_BP_Simulate");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_BP_Simulate) == 0x000004, "Wrong size on BP_ContractRequirement_AutoStartContract_C_BP_Simulate");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_BP_Simulate, InDeltaTime) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_BP_Simulate::InDeltaTime' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.NeedsSimulation
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_NeedsSimulation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_NeedsSimulation) == 0x000001, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_NeedsSimulation");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_NeedsSimulation) == 0x000001, "Wrong size on BP_ContractRequirement_AutoStartContract_C_NeedsSimulation");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_NeedsSimulation, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_NeedsSimulation::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.GetTitle
// 0x0198 (0x0198 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0120(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_GetTitle) == 0x000198, "Wrong size on BP_ContractRequirement_AutoStartContract_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000118, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_3) == 0x000120, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, K2Node_MakeArray_Array) == 0x000170, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetTitle, CallFunc_Format_ReturnValue) == 0x000180, "Member 'BP_ContractRequirement_AutoStartContract_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_AutoStartContract.BP_ContractRequirement_AutoStartContract_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_AutoStartContract_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

}

