#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Contract

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Contract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Contract_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Contract_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Contract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.ExecuteUbergraph_BP_ContractRequirement_Contract
// 0x0060 (0x0060 - 0x0000)
struct BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            K2Node_CustomEvent_InContract_1;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InNewState_1;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InOldState_1;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            CallFunc_GetFactionContractFromAll_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              CallFunc_GetState_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)> K2Node_CreateDelegate_OutputDelegate; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Faction*                             K2Node_CustomEvent_InFaction;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            K2Node_CustomEvent_InContract;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InNewState;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InOldState;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract) == 0x000008, "Wrong alignment on BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract");
static_assert(sizeof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract) == 0x000060, "Wrong size on BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, Temp_bool_Variable) == 0x000004, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_Event_InFirstInitialization) == 0x000005, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InContract_1) == 0x000018, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InContract_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InNewState_1) == 0x000020, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InNewState_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InOldState_1) == 0x000021, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InOldState_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000023, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_IsValid_ReturnValue_2) == 0x000024, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_GetFactionContractFromAll_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_GetFactionContractFromAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_GetState_ReturnValue) == 0x000030, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000044, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InFaction) == 0x000048, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InFaction' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InContract) == 0x000050, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InContract' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InNewState) == 0x000058, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_CustomEvent_InOldState) == 0x000059, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_CustomEvent_InOldState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, Temp_byte_Variable) == 0x00005A, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, CallFunc_IsValid_ReturnValue_3) == 0x00005B, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, Temp_byte_Variable_1) == 0x00005C, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract, K2Node_Select_Default) == 0x00005D, "Member 'BP_ContractRequirement_Contract_C_ExecuteUbergraph_BP_ContractRequirement_Contract::K2Node_Select_Default' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.OnContractStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Contract_C_OnContractStateChanged final
{
public:
	class UP2Contract*                            InContract;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InNewState;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InOldState;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_OnContractStateChanged) == 0x000008, "Wrong alignment on BP_ContractRequirement_Contract_C_OnContractStateChanged");
static_assert(sizeof(BP_ContractRequirement_Contract_C_OnContractStateChanged) == 0x000010, "Wrong size on BP_ContractRequirement_Contract_C_OnContractStateChanged");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnContractStateChanged, InContract) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_OnContractStateChanged::InContract' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnContractStateChanged, InNewState) == 0x000008, "Member 'BP_ContractRequirement_Contract_C_OnContractStateChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnContractStateChanged, InOldState) == 0x000009, "Member 'BP_ContractRequirement_Contract_C_OnContractStateChanged::InOldState' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.OnRequiredContractStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged final
{
public:
	class UP2Faction*                             InFaction;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            InContract;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InNewState;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InOldState;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged) == 0x000008, "Wrong alignment on BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged");
static_assert(sizeof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged) == 0x000018, "Wrong size on BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged, InFaction) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged::InFaction' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged, InContract) == 0x000008, "Member 'BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged::InContract' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged, InNewState) == 0x000010, "Member 'BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged, InOldState) == 0x000011, "Member 'BP_ContractRequirement_Contract_C_OnRequiredContractStateChanged::InOldState' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Contract_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_Contract_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_Contract_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_Contract_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.GetPrecedingContractData
// 0x0020 (0x0020 - 0x0000)
struct BP_ContractRequirement_Contract_C_GetPrecedingContractData final
{
public:
	const class UP2ContractData*                  ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ContractData*                  Temp_object_Variable;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2ContractData*                  K2Node_Select_Default;                             // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Contract_C_GetPrecedingContractData) == 0x000008, "Wrong alignment on BP_ContractRequirement_Contract_C_GetPrecedingContractData");
static_assert(sizeof(BP_ContractRequirement_Contract_C_GetPrecedingContractData) == 0x000020, "Wrong size on BP_ContractRequirement_Contract_C_GetPrecedingContractData");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetPrecedingContractData, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_GetPrecedingContractData::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetPrecedingContractData, Temp_bool_Variable) == 0x000008, "Member 'BP_ContractRequirement_Contract_C_GetPrecedingContractData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetPrecedingContractData, Temp_object_Variable) == 0x000010, "Member 'BP_ContractRequirement_Contract_C_GetPrecedingContractData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetPrecedingContractData, K2Node_Select_Default) == 0x000018, "Member 'BP_ContractRequirement_Contract_C_GetPrecedingContractData::K2Node_Select_Default' has a wrong offset!");

// Function BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C.GetTitle
// 0x0190 (0x0190 - 0x0000)
struct BP_ContractRequirement_Contract_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	EP2ContractState                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0098(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_Contract_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_Contract_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_Contract_C_GetTitle) == 0x000190, "Wrong size on BP_ContractRequirement_Contract_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Contract_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_byte_Variable) == 0x000018, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable) == 0x000020, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable_1) == 0x000038, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable_2) == 0x000050, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable_3) == 0x000068, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable_4) == 0x000080, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, Temp_text_Variable_5) == 0x000098, "Member 'BP_ContractRequirement_Contract_C_GetTitle::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, K2Node_Select_Default) == 0x0000B0, "Member 'BP_ContractRequirement_Contract_C_GetTitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_ContractRequirement_Contract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'BP_ContractRequirement_Contract_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, K2Node_MakeArray_Array) == 0x000168, "Member 'BP_ContractRequirement_Contract_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Contract_C_GetTitle, CallFunc_Format_ReturnValue) == 0x000178, "Member 'BP_ContractRequirement_Contract_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

}

