#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_ResearchStep

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.AquireDataRegistryCallBack
// 0x0038 (0x0038 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack final
{
public:
	struct FDataRegistryId                        ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryLookup                    ResolvedLookup;                                    // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EDataRegistryAcquireStatus                    Status;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack) == 0x000008, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack) == 0x000038, "Wrong size on BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack, ItemId) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack::ItemId' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack, ResolvedLookup) == 0x000010, "Member 'BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack::ResolvedLookup' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack, Status) == 0x000030, "Member 'BP_ContractRequirement_ResearchStep_C_AquireDataRegistryCallBack::Status' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_ResearchStep_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.ExecuteUbergraph_BP_ContractRequirement_ResearchStep
// 0x0178 (0x0178 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UP2ResearchNode* InResearchNode, class UP2ResearchStep* InResearchStep, EP2ResearchStepState InNewState, EP2ResearchStepState InOldState)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          K2Node_CustomEvent_NewState;                       // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionResearch*        CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStateExtensionResearch*        CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State_1;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_1; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AP2PlayerState*                   K2Node_CustomEvent_InPlayerState;                  // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_2;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStateExtensionResearch*        CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_2; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_3; // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_3;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_CustomEvent_ItemId;                         // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryLookup                    K2Node_CustomEvent_ResolvedLookup;                 // 0x00C8(0x0020)(HasGetValueTypeHash)
	EDataRegistryAcquireStatus                    K2Node_CustomEvent_Status;                         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State_2;             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDataRegistryId& ItemId, const struct FDataRegistryLookup& ResolvedLookup, EDataRegistryAcquireStatus Status)> K2Node_CreateDelegate_OutputDelegate_4; // 0x00FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AcquireItemBP_ReturnValue;                // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ResearchNode*                        CallFunc_GetResearchNodeWithData_ReturnValue;      // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchNode*                        CallFunc_GetResearchNodeWithData_ReturnValue_1;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2ResearchStep*>                CallFunc_GetResearchStepsWithData_ReturnValue;     // 0x0128(0x0010)(ReferenceParm)
	class UP2ResearchStep*                        CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          CallFunc_GetState_ReturnValue;                     // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UP2ResearchNode* InResearchNode, class UP2ResearchStep* InResearchStep, EP2ResearchStepState InNewState, EP2ResearchStepState InOldState)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ResearchNode*                        K2Node_CustomEvent_InResearchNode;                 // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchStep*                        K2Node_CustomEvent_InResearchStep;                 // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          K2Node_CustomEvent_InNewState;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          K2Node_CustomEvent_InOldState;                     // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep) == 0x000008, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep) == 0x000178, "Wrong size on BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, Temp_byte_Variable) == 0x000014, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, Temp_byte_Variable_1) == 0x000015, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_Event_InFirstInitialization) == 0x000016, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_NewState) == 0x000017, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_MakeLiteralByte_ReturnValue) == 0x000020, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_AsP2Player_State) == 0x000030, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000040, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_1) == 0x000048, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_AsP2Player_State_1) == 0x000050, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_AsP2Player_State_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_InPlayerState) == 0x000070, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_InPlayerState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerController_ReturnValue_2) == 0x000078, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_2) == 0x000090, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate_3) == 0x00009C, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetOwningPlayerController_ReturnValue_3) == 0x0000B0, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetOwningPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_ItemId) == 0x0000B8, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_ItemId' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_ResolvedLookup) == 0x0000C8, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_ResolvedLookup' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_Status) == 0x0000E8, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_AsP2Player_State_2) == 0x0000F0, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_AsP2Player_State_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F9, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000FC, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetCachedItemBP_ReturnValue) == 0x00010C, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetCachedItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_AcquireItemBP_ReturnValue) == 0x00010D, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_AcquireItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetResearchNodeWithData_ReturnValue) == 0x000110, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetResearchNodeWithData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetResearchNodeWithData_ReturnValue_1) == 0x000118, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetResearchNodeWithData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_3) == 0x000120, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_4) == 0x000121, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetResearchStepsWithData_ReturnValue) == 0x000128, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetResearchStepsWithData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_Array_Get_Item) == 0x000138, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_5) == 0x000140, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_IsValid_ReturnValue_6) == 0x000141, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GetState_ReturnValue) == 0x000142, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_Array_IsEmpty_ReturnValue) == 0x000143, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, Temp_bool_Variable) == 0x000144, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000145, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CreateDelegate_OutputDelegate_5) == 0x000148, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000158, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_InResearchNode) == 0x000160, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_InResearchNode' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_InResearchStep) == 0x000168, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_InResearchStep' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_InNewState) == 0x000170, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_CustomEvent_InOldState) == 0x000171, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_CustomEvent_InOldState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep, K2Node_Select_Default) == 0x000172, "Member 'BP_ContractRequirement_ResearchStep_C_ExecuteUbergraph_BP_ContractRequirement_ResearchStep::K2Node_Select_Default' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.OnInitializeExtentions
// 0x0008 (0x0008 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions) == 0x000008, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions) == 0x000008, "Wrong size on BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions, InPlayerState) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_OnInitializeExtentions::InPlayerState' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.OnResearchStepChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged final
{
public:
	class UP2ResearchNode*                        InResearchNode;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchStep*                        InResearchStep;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          InNewState;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchStepState                          InOldState;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged) == 0x000008, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged) == 0x000018, "Wrong size on BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged, InResearchNode) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged::InResearchNode' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged, InResearchStep) == 0x000008, "Member 'BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged::InResearchStep' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged, InNewState) == 0x000010, "Member 'BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged, InOldState) == 0x000011, "Member 'BP_ContractRequirement_ResearchStep_C_OnResearchStepChanged::InOldState' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.OnResearchStepStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged final
{
public:
	EP2ResearchStepState                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged) == 0x000001, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged) == 0x000001, "Wrong size on BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged, NewState) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_OnResearchStepStateChanged::NewState' has a wrong offset!");

// Function BP_ContractRequirement_ResearchStep.BP_ContractRequirement_ResearchStep_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_ResearchStep_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_ResearchStep_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_ResearchStep_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_ResearchStep_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_ResearchStep_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_ResearchStep_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_ResearchStep_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

}

