#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_FactionLevel

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"
#include "Game_structs.hpp"
#include "E_Eval_Number_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C
// 0x0020 (0x0228 - 0x0208)
class UBP_ContractRequirement_FactionLevel_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           FactionTag;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         FactionLevel;                                      // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_FactionLevel(int32 EntryPoint)	 // 0xae1e64;
	void OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnReputationChanged(int32 InReputation)	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;
	int32 GetRequiredFactionLevel() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;
	void IsValueAcceptable(int32 InValue, bool* OutResult) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_FactionLevel_C">();
	}
	static class UBP_ContractRequirement_FactionLevel_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_FactionLevel_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_FactionLevel_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_FactionLevel_C");
static_assert(sizeof(UBP_ContractRequirement_FactionLevel_C) == 0x000228, "Wrong size on UBP_ContractRequirement_FactionLevel_C");
static_assert(offsetof(UBP_ContractRequirement_FactionLevel_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_FactionLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_FactionLevel_C, FactionTag) == 0x000210, "Member 'UBP_ContractRequirement_FactionLevel_C::FactionTag' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_FactionLevel_C, FactionLevel) == 0x000218, "Member 'UBP_ContractRequirement_FactionLevel_C::FactionLevel' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_FactionLevel_C, Async_Action) == 0x000220, "Member 'UBP_ContractRequirement_FactionLevel_C::Async_Action' has a wrong offset!");

}

