#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_PlayerLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C
// 0x0010 (0x0218 - 0x0208)
class UBP_ContractRequirement_PlayerLevel_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CurrentLevel;                                      // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredLevel;                                     // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void Completed_F9EF05474248F51C3BD7DD971A1AFAE6(int32 Level)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_PlayerLevel(int32 EntryPoint)	 // 0xae1e64;
	void OnPMCLevelChanged(int32 InLevel)	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;
	int32 GetRequiredPMCLevel() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_PlayerLevel_C">();
	}
	static class UBP_ContractRequirement_PlayerLevel_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_PlayerLevel_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_PlayerLevel_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_PlayerLevel_C");
static_assert(sizeof(UBP_ContractRequirement_PlayerLevel_C) == 0x000218, "Wrong size on UBP_ContractRequirement_PlayerLevel_C");
static_assert(offsetof(UBP_ContractRequirement_PlayerLevel_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_PlayerLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_PlayerLevel_C, CurrentLevel) == 0x000210, "Member 'UBP_ContractRequirement_PlayerLevel_C::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_PlayerLevel_C, RequiredLevel) == 0x000214, "Member 'UBP_ContractRequirement_PlayerLevel_C::RequiredLevel' has a wrong offset!");

}

