#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_HighlightWidget_InstallLaptop

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextEvent_HighlightWidget_InstallLaptop.BP_ContextEvent_HighlightWidget_InstallLaptop_C.GetWidgetInfos
// 0x0030 (0x0030 - 0x0000)
struct BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos final
{
public:
	struct FP2TutorialWidgetState                 OutWidgetState;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FP2TutorialWidgetInfo>          OutWidgetInfos;                                    // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	struct FP2TutorialWidgetState                 CallFunc_UpdateCurrentState_OutNextState;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FP2TutorialWidgetInfo>          CallFunc_UpdateCurrentState_OutWidgetInfo;         // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos) == 0x000008, "Wrong alignment on BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos) == 0x000030, "Wrong size on BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos, OutWidgetState) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos::OutWidgetState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos, OutWidgetInfos) == 0x000008, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos::OutWidgetInfos' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos, CallFunc_UpdateCurrentState_OutNextState) == 0x000018, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos::CallFunc_UpdateCurrentState_OutNextState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos, CallFunc_UpdateCurrentState_OutWidgetInfo) == 0x000020, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_GetWidgetInfos::CallFunc_UpdateCurrentState_OutWidgetInfo' has a wrong offset!");

// Function BP_ContextEvent_HighlightWidget_InstallLaptop.BP_ContextEvent_HighlightWidget_InstallLaptop_C.UpdateCurrentState
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState final
{
public:
	struct FP2TutorialWidgetState                 OutNextState;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FP2TutorialWidgetInfo>          OutWidgetInfo;                                     // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class UW_DirectFacilityInstallWidget_C*       FacilityInstallWidget;                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FP2TutorialWidgetInfo>          WidgetInfo;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FP2TutorialWidgetState                 NextState;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FP2TutorialWidgetInfo                  K2Node_MakeStruct_P2TutorialWidgetInfo;            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FP2TutorialWidgetState                 K2Node_MakeStruct_P2TutorialWidgetState;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2TutorialWidgetState                 K2Node_MakeStruct_P2TutorialWidgetState_1;         // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2DirectFacilityInstallItem*           CallFunc_GetItemFromList_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_DirectFacilityInstall_Item_C*        K2Node_DynamicCast_AsW_Direct_Facility_Install_Item; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2TutorialWidgetInfo                  K2Node_MakeStruct_P2TutorialWidgetInfo_1;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2TutorialWidgetState                 K2Node_MakeStruct_P2TutorialWidgetState_2;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetWidgetByClass_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_DirectFacilityInstallWidget_C*       K2Node_DynamicCast_AsW_Direct_Facility_Install_Widget; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState) == 0x000008, "Wrong alignment on BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState) == 0x0000C0, "Wrong size on BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, OutNextState) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::OutNextState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, OutWidgetInfo) == 0x000008, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::OutWidgetInfo' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, FacilityInstallWidget) == 0x000018, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::FacilityInstallWidget' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, WidgetInfo) == 0x000020, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::WidgetInfo' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, NextState) == 0x000030, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::NextState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_MakeStruct_P2TutorialWidgetInfo) == 0x000038, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_MakeStruct_P2TutorialWidgetInfo' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_MakeStruct_P2TutorialWidgetState) == 0x000050, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_MakeStruct_P2TutorialWidgetState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_Array_AddUnique_ReturnValue) == 0x000058, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_MakeStruct_P2TutorialWidgetState_1) == 0x00005C, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_MakeStruct_P2TutorialWidgetState_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_GetItemFromList_ReturnValue) == 0x000068, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_GetItemFromList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_DynamicCast_AsW_Direct_Facility_Install_Item) == 0x000070, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_DynamicCast_AsW_Direct_Facility_Install_Item' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_MakeStruct_P2TutorialWidgetInfo_1) == 0x000080, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_MakeStruct_P2TutorialWidgetInfo_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_IsSelected_ReturnValue) == 0x000098, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00009C, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_MakeStruct_P2TutorialWidgetState_2) == 0x0000A0, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_MakeStruct_P2TutorialWidgetState_2' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, CallFunc_GetWidgetByClass_ReturnValue) == 0x0000A8, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::CallFunc_GetWidgetByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_DynamicCast_AsW_Direct_Facility_Install_Widget) == 0x0000B0, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_DynamicCast_AsW_Direct_Facility_Install_Widget' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_UpdateCurrentState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_ContextEvent_HighlightWidget_InstallLaptop.BP_ContextEvent_HighlightWidget_InstallLaptop_C.NeedsSimulation
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation) == 0x000001, "Wrong alignment on BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation");
static_assert(sizeof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation) == 0x000001, "Wrong size on BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation");
static_assert(offsetof(BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation, ReturnValue) == 0x000000, "Member 'BP_ContextEvent_HighlightWidget_InstallLaptop_C_NeedsSimulation::ReturnValue' has a wrong offset!");

}

