#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_Contract

#include "Basic.hpp"

#include "DataRegistry_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C.OnContractStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ContextRequirement_Contract_C_OnContractStateChanged final
{
public:
	class UP2Faction*                             InFaction;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            InContract;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InNewState;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InOldState;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_Contract_C_OnContractStateChanged) == 0x000008, "Wrong alignment on BP_ContextRequirement_Contract_C_OnContractStateChanged");
static_assert(sizeof(BP_ContextRequirement_Contract_C_OnContractStateChanged) == 0x000018, "Wrong size on BP_ContextRequirement_Contract_C_OnContractStateChanged");
static_assert(offsetof(BP_ContextRequirement_Contract_C_OnContractStateChanged, InFaction) == 0x000000, "Member 'BP_ContextRequirement_Contract_C_OnContractStateChanged::InFaction' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_OnContractStateChanged, InContract) == 0x000008, "Member 'BP_ContextRequirement_Contract_C_OnContractStateChanged::InContract' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_OnContractStateChanged, InNewState) == 0x000010, "Member 'BP_ContextRequirement_Contract_C_OnContractStateChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_OnContractStateChanged, InOldState) == 0x000011, "Member 'BP_ContextRequirement_Contract_C_OnContractStateChanged::InOldState' has a wrong offset!");

// Function BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C.ExecuteUbergraph_BP_ContextRequirement_Contract
// 0x0150 (0x0150 - 0x0000)
struct BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Faction*                             K2Node_CustomEvent_InFaction;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            K2Node_CustomEvent_InContract;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InNewState;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InOldState;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2ContractStateQuery                  CallFunc_Array_Get_Item;                           // 0x0060(0x0014)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidDataRegistryId_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryId                        K2Node_CustomEvent_ItemId;                         // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryLookup                    K2Node_CustomEvent_ResolvedLookup;                 // 0x0090(0x0020)(HasGetValueTypeHash)
	EDataRegistryAcquireStatus                    K2Node_CustomEvent_Status;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FDataRegistryId& ItemId, const struct FDataRegistryLookup& ResolvedLookup, EDataRegistryAcquireStatus Status)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AcquireItemBP_ReturnValue;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2ContractData*                        CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            CallFunc_GetFactionContractFromAll_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2ContractStateQuery                  CallFunc_Array_Get_Item_2;                         // 0x0110(0x0014)(NoDestructor)
	bool                                          CallFunc_EqualEqual_DataRegistryId_ReturnValue;    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            CallFunc_Array_Get_Item_3;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            CallFunc_Array_Get_Item_4;                         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              CallFunc_GetState_ReturnValue;                     // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract) == 0x000008, "Wrong alignment on BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract");
static_assert(sizeof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract) == 0x000150, "Wrong size on BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, EntryPoint) == 0x000000, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Array_Index_Variable_1) == 0x000008, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Array_Index_Variable_2) == 0x000014, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Array_Index_Variable_3) == 0x000020, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Loop_Counter_Variable_2) == 0x000024, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue_2) == 0x000028, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_Event_InFirstInitialization) == 0x00002C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_InFaction) == 0x000030, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_InFaction' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_InContract) == 0x000038, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_InContract' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_InNewState) == 0x000040, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_InNewState' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_InOldState) == 0x000041, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_InOldState' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Loop_Counter_Variable_3) == 0x000054, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue_3) == 0x000058, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Loop_Counter_Variable_4) == 0x00005C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue_4) == 0x000074, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValidDataRegistryId_ReturnValue) == 0x000078, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValidDataRegistryId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_ItemId) == 0x000080, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_ItemId' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_ResolvedLookup) == 0x000090, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_ResolvedLookup' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CustomEvent_Status) == 0x0000B0, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CustomEvent_Status' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Less_IntInt_ReturnValue) == 0x0000B1, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B2, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_GetCachedItemBP_ReturnValue) == 0x0000B3, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_GetCachedItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_1) == 0x0000B4, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_2) == 0x0000B8, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000BC, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C0, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_AcquireItemBP_ReturnValue) == 0x0000D0, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_AcquireItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Add_IntInt_ReturnValue_5) == 0x0000D4, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_3) == 0x0000D8, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Variable) == 0x0000DC, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValid_ReturnValue) == 0x0000E9, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_4) == 0x0000EC, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_GetOwningPlayerController_ReturnValue) == 0x0000F0, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F8, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_GetFactionContractFromAll_ReturnValue) == 0x000100, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_GetFactionContractFromAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValid_ReturnValue_2) == 0x000109, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_BooleanAND_ReturnValue) == 0x00010A, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_int_Array_Index_Variable_4) == 0x00010C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Get_Item_2) == 0x000110, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_EqualEqual_DataRegistryId_ReturnValue) == 0x000124, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_EqualEqual_DataRegistryId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, Temp_bool_True_if_break_was_hit_Variable) == 0x000125, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Not_PreBool_ReturnValue) == 0x000126, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_BooleanAND_ReturnValue_1) == 0x000127, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Get_Item_3) == 0x000128, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_5) == 0x000130, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValid_ReturnValue_3) == 0x000134, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Less_IntInt_ReturnValue_3) == 0x000135, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Get_Item_4) == 0x000138, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_6) == 0x000140, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_IsValid_ReturnValue_4) == 0x000144, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Less_IntInt_ReturnValue_4) == 0x000145, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_GetState_ReturnValue) == 0x000146, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_Array_Length_ReturnValue_7) == 0x000148, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, K2Node_SwitchEnum_CmpSuccess) == 0x00014C, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00014D, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_BooleanAND_ReturnValue_2) == 0x00014E, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract, CallFunc_BooleanOR_ReturnValue) == 0x00014F, "Member 'BP_ContextRequirement_Contract_C_ExecuteUbergraph_BP_ContextRequirement_Contract::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C.CustomEvent
// 0x0038 (0x0038 - 0x0000)
struct BP_ContextRequirement_Contract_C_CustomEvent final
{
public:
	struct FDataRegistryId                        ItemId;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataRegistryLookup                    ResolvedLookup;                                    // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	EDataRegistryAcquireStatus                    Status;                                            // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_Contract_C_CustomEvent) == 0x000008, "Wrong alignment on BP_ContextRequirement_Contract_C_CustomEvent");
static_assert(sizeof(BP_ContextRequirement_Contract_C_CustomEvent) == 0x000038, "Wrong size on BP_ContextRequirement_Contract_C_CustomEvent");
static_assert(offsetof(BP_ContextRequirement_Contract_C_CustomEvent, ItemId) == 0x000000, "Member 'BP_ContextRequirement_Contract_C_CustomEvent::ItemId' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_CustomEvent, ResolvedLookup) == 0x000010, "Member 'BP_ContextRequirement_Contract_C_CustomEvent::ResolvedLookup' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_CustomEvent, Status) == 0x000030, "Member 'BP_ContextRequirement_Contract_C_CustomEvent::Status' has a wrong offset!");

// Function BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextRequirement_Contract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContextRequirement_Contract_C_BP_Initialize");
static_assert(sizeof(BP_ContextRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContextRequirement_Contract_C_BP_Initialize");
static_assert(offsetof(BP_ContextRequirement_Contract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContextRequirement_Contract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C.GetRequirementDescription
// 0x0020 (0x0020 - 0x0000)
struct BP_ContextRequirement_Contract_C_GetRequirementDescription final
{
public:
	bool                                          bGetRichText;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ContextRequirement_Contract_C_GetRequirementDescription) == 0x000008, "Wrong alignment on BP_ContextRequirement_Contract_C_GetRequirementDescription");
static_assert(sizeof(BP_ContextRequirement_Contract_C_GetRequirementDescription) == 0x000020, "Wrong size on BP_ContextRequirement_Contract_C_GetRequirementDescription");
static_assert(offsetof(BP_ContextRequirement_Contract_C_GetRequirementDescription, bGetRichText) == 0x000000, "Member 'BP_ContextRequirement_Contract_C_GetRequirementDescription::bGetRichText' has a wrong offset!");
static_assert(offsetof(BP_ContextRequirement_Contract_C_GetRequirementDescription, ReturnValue) == 0x000008, "Member 'BP_ContextRequirement_Contract_C_GetRequirementDescription::ReturnValue' has a wrong offset!");

}

