#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_FacilityInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_FacilityInteract.BP_ContextRequirement_FacilityInteract_C
// 0x0038 (0x0098 - 0x0060)
class UBP_ContextRequirement_FacilityInteract_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2FacilityData*                        FacilityData;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EP2FacilitySpotStatus                         FacilitySpotStatus;                                // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideDescription;                               // 0x0080(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnMessageReceived_48A2489F432A012F87FD2AB22C117852(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_FacilityInteract(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

	bool NeedsSimulation() const	 // 0xae1e64;
	class FText GetRequirementDescription(bool bGetRichText) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_FacilityInteract_C">();
	}
	static class UBP_ContextRequirement_FacilityInteract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_FacilityInteract_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_FacilityInteract_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_FacilityInteract_C");
static_assert(sizeof(UBP_ContextRequirement_FacilityInteract_C) == 0x000098, "Wrong size on UBP_ContextRequirement_FacilityInteract_C");
static_assert(offsetof(UBP_ContextRequirement_FacilityInteract_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_FacilityInteract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityInteract_C, FacilityData) == 0x000068, "Member 'UBP_ContextRequirement_FacilityInteract_C::FacilityData' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityInteract_C, Async_Action) == 0x000070, "Member 'UBP_ContextRequirement_FacilityInteract_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityInteract_C, FacilitySpotStatus) == 0x000078, "Member 'UBP_ContextRequirement_FacilityInteract_C::FacilitySpotStatus' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_FacilityInteract_C, OverrideDescription) == 0x000080, "Member 'UBP_ContextRequirement_FacilityInteract_C::OverrideDescription' has a wrong offset!");

}

