#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Interact

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Interact_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Interact_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Interact_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Interact_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Interact_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.ExecuteUbergraph_BP_ContractRequirement_Interact
// 0x03C8 (0x03C8 - 0x0000)
struct BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable;                              // 0x0008(0x0098)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Valid_Instigator_Valid;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable_2;                            // 0x00D0(0x0098)()
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         Temp_struct_Variable_3;                            // 0x0188(0x0098)()
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0220(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable_1;                            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         Temp_struct_Variable_5;                            // 0x0230(0x0098)()
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue_1;                 // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject_1;                  // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel_1;                // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x1];                                      // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1; // 0x02E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwningController_ReturnValue;          // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetRequirementTag_ReturnValue;            // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetRequirementTag_ReturnValue_1;          // 0x0308(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         K2Node_MakeStruct_P2VerbMessage;                   // 0x0310(0x0098)()
	struct FGameplayTag                           CallFunc_GetRequirementTag_ReturnValue_2;          // 0x03A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue_1;  // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaidCompletable_ReturnValue;            // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetRequirementTag_ReturnValue_3;          // 0x03BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact");
static_assert(sizeof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact) == 0x0003C8, "Wrong size on BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable) == 0x000008, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable_1) == 0x0000A0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_object_Variable) == 0x0000A8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_Is_Valid_Instigator_Valid) == 0x0000B0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_Is_Valid_Instigator_Valid' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x0000B8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000C0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable_2) == 0x0000D0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CustomEvent_ProxyObject) == 0x000168, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CustomEvent_ActualChannel) == 0x000170, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable_3) == 0x000188, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable_4) == 0x000220, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_object_Variable_1) == 0x000228, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, Temp_struct_Variable_5) == 0x000230, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetPayload_ReturnValue) == 0x0002C8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetPayload_ReturnValue_1) == 0x0002C9, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetPayload_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_Event_InFirstInitialization) == 0x0002CA, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CustomEvent_ProxyObject_1) == 0x0002D0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CustomEvent_ProxyObject_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CustomEvent_ActualChannel_1) == 0x0002D8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CustomEvent_ActualChannel_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_IsValid_ReturnValue_1) == 0x0002E0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_HasTag_ReturnValue) == 0x0002E1, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_BooleanAND_ReturnValue) == 0x0002E2, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E4, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetOwningController_ReturnValue) == 0x0002F8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetOwningController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetRequirementTag_ReturnValue) == 0x000300, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetRequirementTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetRequirementTag_ReturnValue_1) == 0x000308, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetRequirementTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, K2Node_MakeStruct_P2VerbMessage) == 0x000310, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::K2Node_MakeStruct_P2VerbMessage' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetRequirementTag_ReturnValue_2) == 0x0003A8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetRequirementTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_ListenForGameplayMessages_ReturnValue_1) == 0x0003B0, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_ListenForGameplayMessages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_IsRaidCompletable_ReturnValue) == 0x0003B8, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_IsRaidCompletable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_IsValid_ReturnValue_2) == 0x0003B9, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_GetRequirementTag_ReturnValue_3) == 0x0003BC, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_GetRequirementTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_MatchesTag_ReturnValue) == 0x0003C4, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact, CallFunc_IsValid_ReturnValue_3) == 0x0003C5, "Member 'BP_ContractRequirement_Interact_C_ExecuteUbergraph_BP_ContractRequirement_Interact::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB");
static_assert(sizeof(BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB) == 0x000010, "Wrong size on BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB");
static_assert(offsetof(BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB, ProxyObject) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB, ActualChannel) == 0x000008, "Member 'BP_ContractRequirement_Interact_C_OnMessageReceived_4F5DBEBE4ED20767D14293913ECA3CDB::ActualChannel' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.OnMessageReceived_74DCF7D64AE202517A3559BEB354497D
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D");
static_assert(sizeof(BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D) == 0x000010, "Wrong size on BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D");
static_assert(offsetof(BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D, ProxyObject) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D, ActualChannel) == 0x000008, "Member 'BP_ContractRequirement_Interact_C_OnMessageReceived_74DCF7D64AE202517A3559BEB354497D::ActualChannel' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.Send UI Message
// 0x0178 (0x0178 - 0x0000)
struct BP_ContractRequirement_Interact_C_Send_UI_Message final
{
public:
	EP2ContractRequirementState                   CallFunc_GetState_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTitle_ReturnValue;                     // 0x0018(0x0018)()
	class FText                                   CallFunc_GetTitle_ReturnValue_1;                   // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	class UP2Contract*                            CallFunc_GetOwningContract_ReturnValue;            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2ContractData*                  CallFunc_GetData_ReturnValue;                      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0050)(HasGetValueTypeHash)
	EP2ContractState                              CallFunc_GetState_ReturnValue_1;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0148(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    CallFunc_FindPlayerControllerFromActor_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_Send_UI_Message) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_Send_UI_Message");
static_assert(sizeof(BP_ContractRequirement_Interact_C_Send_UI_Message) == 0x000178, "Wrong size on BP_ContractRequirement_Interact_C_Send_UI_Message");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetState_ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetTitle_ReturnValue) == 0x000018, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetTitle_ReturnValue_1) == 0x000030, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetTitle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000048, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000058, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetOwningContract_ReturnValue) == 0x000090, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetOwningContract_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetData_ReturnValue) == 0x000098, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000A0, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetState_ReturnValue_1) == 0x000128, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, K2Node_MakeArray_Array) == 0x000130, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000140, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_Format_ReturnValue) == 0x000148, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000160, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000168, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Send_UI_Message, CallFunc_FindPlayerControllerFromActor_ReturnValue) == 0x000170, "Member 'BP_ContractRequirement_Interact_C_Send_UI_Message::CallFunc_FindPlayerControllerFromActor_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Interact_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_Interact_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_Interact_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_Interact_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.GetTitle
// 0x01C0 (0x01C0 - 0x0000)
struct BP_ContractRequirement_Interact_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C8(0x0050)(HasGetValueTypeHash)
	EP2ContractRequirementState                   CallFunc_GetState_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0120(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A8(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_Interact_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_Interact_C_GetTitle) == 0x0001C0, "Wrong size on BP_ContractRequirement_Interact_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C8, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_GetState_ReturnValue) == 0x000118, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000119, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_3) == 0x000120, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_BooleanOR_ReturnValue) == 0x000170, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, K2Node_MakeArray_Array_1) == 0x000178, "Member 'BP_ContractRequirement_Interact_C_GetTitle::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_BooleanAND_ReturnValue) == 0x000188, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_Format_ReturnValue) == 0x000190, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_GetTitle, CallFunc_Format_ReturnValue_1) == 0x0001A8, "Member 'BP_ContractRequirement_Interact_C_GetTitle::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_ContractRequirement_Interact.BP_ContractRequirement_Interact_C.Is Valid Instigator
// 0x0038 (0x0038 - 0x0000)
struct BP_ContractRequirement_Interact_C_Is_Valid_Instigator final
{
public:
	class UObject*                                InInstigator;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdA;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CompareTeams_TeamIdB;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2TeamComparison                             CallFunc_CompareTeams_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Interact_C_Is_Valid_Instigator) == 0x000008, "Wrong alignment on BP_ContractRequirement_Interact_C_Is_Valid_Instigator");
static_assert(sizeof(BP_ContractRequirement_Interact_C_Is_Valid_Instigator) == 0x000038, "Wrong size on BP_ContractRequirement_Interact_C_Is_Valid_Instigator");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Is_Valid_Instigator, InInstigator) == 0x000000, "Member 'BP_ContractRequirement_Interact_C_Is_Valid_Instigator::InInstigator' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Interact_C_Is_Valid_Instigator, Valid) == 0x000008, "Member 'BP_ContractRequirement_Interact_C_Is_Valid_Instigator::Valid' has a wrong offset!");
