#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_ShowCheckboxUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextEvent_ShowCheckboxUI.BP_ContextEvent_ShowCheckboxUI_C
// 0x0050 (0x0090 - 0x0040)
class UBP_ContextEvent_ShowCheckboxUI_C final : public UP2GameplayContextEvent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EP2GameplayContextRequirementType             RequirementType;                                   // 0x0048(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0050(0x0018)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                   Text;                                              // 0x0068(0x0018)(Edit, BlueprintVisible, Net)
	class UP2ItemData*                            IconItemData;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContextualHelperWidgetIconType             IconType;                                          // 0x0088(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI(int32 EntryPoint)	 // 0xae1e64;
	bool BP_ShouldActivateOnLoad(class UP2GameplayContext* InContext, EP2GameplayContextState InState)	 // 0xae1e64;
	void BP_CancelEvent()	 // 0xae1e64;
	void BP_ActivateEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextEvent_ShowCheckboxUI_C">();
	}
	static class UBP_ContextEvent_ShowCheckboxUI_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextEvent_ShowCheckboxUI_C>();
	}
};
static_assert(alignof(UBP_ContextEvent_ShowCheckboxUI_C) == 0x000008, "Wrong alignment on UBP_ContextEvent_ShowCheckboxUI_C");
static_assert(sizeof(UBP_ContextEvent_ShowCheckboxUI_C) == 0x000090, "Wrong size on UBP_ContextEvent_ShowCheckboxUI_C");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, UberGraphFrame) == 0x000040, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, RequirementType) == 0x000048, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::RequirementType' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, Title) == 0x000050, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::Title' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, Text) == 0x000068, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::Text' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, IconItemData) == 0x000080, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::IconItemData' has a wrong offset!");
static_assert(offsetof(UBP_ContextEvent_ShowCheckboxUI_C, IconType) == 0x000088, "Member 'UBP_ContextEvent_ShowCheckboxUI_C::IconType' has a wrong offset!");

}

