#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ClothingUpgrade_AR

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ClothingUpgrade_AR.BP_ClothingUpgrade_AR_C
// 0x0018 (0x03A0 - 0x0388)
class ABP_ClothingUpgrade_AR_C final : public AP2Facility_ClothingUpgrade
{
public:
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ClothingUpgrade_AR_C">();
	}
	static class ABP_ClothingUpgrade_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_ClothingUpgrade_AR_C>();
	}
};
static_assert(alignof(ABP_ClothingUpgrade_AR_C) == 0x000008, "Wrong alignment on ABP_ClothingUpgrade_AR_C");
static_assert(sizeof(ABP_ClothingUpgrade_AR_C) == 0x0003A0, "Wrong size on ABP_ClothingUpgrade_AR_C");
static_assert(offsetof(ABP_ClothingUpgrade_AR_C, P2FacilityBoundary1) == 0x000388, "Member 'ABP_ClothingUpgrade_AR_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_ClothingUpgrade_AR_C, StaticMesh) == 0x000390, "Member 'ABP_ClothingUpgrade_AR_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ClothingUpgrade_AR_C, SharedRoot) == 0x000398, "Member 'ABP_ClothingUpgrade_AR_C::SharedRoot' has a wrong offset!");

}

