#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextREquirement_GameplayMessage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextREquirement_GameplayMessage.BP_ContextREquirement_GameplayMessage_C.OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6) == 0x000008, "Wrong alignment on BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6");
static_assert(sizeof(BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6) == 0x000010, "Wrong size on BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6, ProxyObject) == 0x000000, "Member 'BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6, ActualChannel) == 0x000008, "Member 'BP_ContextREquirement_GameplayMessage_C_OnMessageReceived_41D43E094F4E09406DF4EB88066B12C6::ActualChannel' has a wrong offset!");

// Function BP_ContextREquirement_GameplayMessage.BP_ContextREquirement_GameplayMessage_C.ExecuteUbergraph_BP_ContextREquirement_GameplayMessage
// 0x0188 (0x0188 - 0x0000)
struct BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable;                              // 0x0008(0x0098)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         Temp_struct_Variable_1;                            // 0x00C8(0x0098)()
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage) == 0x000008, "Wrong alignment on BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage");
static_assert(sizeof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage) == 0x000188, "Wrong size on BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, EntryPoint) == 0x000000, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, Temp_struct_Variable) == 0x000008, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, K2Node_CustomEvent_ProxyObject) == 0x0000A8, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, K2Node_CustomEvent_ActualChannel) == 0x0000B0, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, Temp_struct_Variable_1) == 0x0000C8, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, Temp_struct_Variable_2) == 0x000160, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, Temp_object_Variable) == 0x000168, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, CallFunc_GetPayload_ReturnValue) == 0x000170, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000178, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, CallFunc_MatchesTag_ReturnValue) == 0x000180, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, CallFunc_IsValid_ReturnValue_1) == 0x000181, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage, K2Node_Event_InFirstInitialization) == 0x000182, "Member 'BP_ContextREquirement_GameplayMessage_C_ExecuteUbergraph_BP_ContextREquirement_GameplayMessage::K2Node_Event_InFirstInitialization' has a wrong offset!");

// Function BP_ContextREquirement_GameplayMessage.BP_ContextREquirement_GameplayMessage_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContextREquirement_GameplayMessage_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextREquirement_GameplayMessage_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContextREquirement_GameplayMessage_C_BP_Initialize");
static_assert(sizeof(BP_ContextREquirement_GameplayMessage_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContextREquirement_GameplayMessage_C_BP_Initialize");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContextREquirement_GameplayMessage_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContextREquirement_GameplayMessage.BP_ContextREquirement_GameplayMessage_C.GetRequirementDescription
// 0x0020 (0x0020 - 0x0000)
struct BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription final
{
public:
	bool                                          bGetRichText;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription) == 0x000008, "Wrong alignment on BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription");
static_assert(sizeof(BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription) == 0x000020, "Wrong size on BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription, bGetRichText) == 0x000000, "Member 'BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription::bGetRichText' has a wrong offset!");
static_assert(offsetof(BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription, ReturnValue) == 0x000008, "Member 'BP_ContextREquirement_GameplayMessage_C_GetRequirementDescription::ReturnValue' has a wrong offset!");

}

