#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CinematicCharacter

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CinematicCharacter.BP_CinematicCharacter_C
// 0x0018 (0x02C8 - 0x02B0)
class ABP_CinematicCharacter_C final : public AActor
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_CinematicCharacter_C">();
	}
	static class ABP_CinematicCharacter_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_CinematicCharacter_C>();
	}
};
static_assert(alignof(ABP_CinematicCharacter_C) == 0x000008, "Wrong alignment on ABP_CinematicCharacter_C");
static_assert(sizeof(ABP_CinematicCharacter_C) == 0x0002C8, "Wrong size on ABP_CinematicCharacter_C");
static_assert(offsetof(ABP_CinematicCharacter_C, Capsule) == 0x0002B0, "Member 'ABP_CinematicCharacter_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C, SkeletalMesh) == 0x0002B8, "Member 'ABP_CinematicCharacter_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_CinematicCharacter_C, Camera) == 0x0002C0, "Member 'ABP_CinematicCharacter_C::Camera' has a wrong offset!");

}

