#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Craft

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_Craft_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_Craft_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_Craft_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_Craft_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_Craft_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.ExecuteUbergraph_BP_ContractRequirement_Craft
// 0x0398 (0x0398 - 0x0000)
struct BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility_Craft* InFacility, const struct FP2CraftingDataRow& InCraftingDataRow)> K2Node_CreateDelegate_OutputDelegate_1; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility_Craft* InFacility, const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)> K2Node_CreateDelegate_OutputDelegate_2; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2Facility_Craft*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ReferenceParm)
	class AP2Facility_Craft*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    CallFunc_GetOwnerController_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility_Craft*                      K2Node_CustomEvent_InFacility_1;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_CustomEvent_InCraftingDataRow_1;            // 0x0070(0x00C0)(ConstParm)
	float                                         K2Node_CustomEvent_InStartTimeNormalized;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility_Craft*                      K2Node_CustomEvent_InFacility;                     // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_CustomEvent_InCraftingDataRow;              // 0x0140(0x00C0)(ConstParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwningController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2Facility_Craft*                      K2Node_CustomEvent_InFacitily;                     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility_Craft*                      CallFunc_Array_Get_Item_1;                         // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideout_ReturnValue;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2Facility_Craft*                      CallFunc_Array_Get_Item_2;                         // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class UP2FacilityData* FacilityData)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0260(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_CustomEvent_FacilitySpot_1;                 // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityData*                        K2Node_CustomEvent_FacilityData;                   // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            CallFunc_GetFacility_ReturnValue;                  // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility_Craft*                      K2Node_DynamicCast_AsP2Facility_Craft;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_CustomEvent_FacilitySpot;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            K2Node_CustomEvent_Facility;                       // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    CallFunc_GetOwnerController_ReturnValue_1;         // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility_Craft*                      K2Node_DynamicCast_AsP2Facility_Craft_1;           // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwningController_ReturnValue_1;        // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_1;        // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue_1; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0328(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class UP2FacilityData* FacilityData)> K2Node_CreateDelegate_OutputDelegate_5; // 0x033C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_2;  // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_2;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0364(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue_2; // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class UP2FacilityData* FacilityData)> K2Node_CreateDelegate_OutputDelegate_7; // 0x0380(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft");
static_assert(sizeof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft) == 0x000398, "Wrong size on BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_Event_InFirstInitialization) == 0x00003C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwnerController_ReturnValue) == 0x000060, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwnerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InFacility_1) == 0x000068, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InFacility_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InCraftingDataRow_1) == 0x000070, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InStartTimeNormalized) == 0x000130, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InFacility) == 0x000138, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InFacility' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InCraftingDataRow) == 0x000140, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Loop_Counter_Variable) == 0x000200, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwningController_ReturnValue) == 0x000208, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwningController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000210, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Add_IntInt_ReturnValue) == 0x000214, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_InFacitily) == 0x000218, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_InFacitily' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Array_Index_Variable_2) == 0x000220, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Get_Item_1) == 0x000228, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Length_ReturnValue_1) == 0x000234, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsHideout_ReturnValue) == 0x000238, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Loop_Counter_Variable_1) == 0x00023C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Get_Item_2) == 0x000240, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_1) == 0x000248, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Less_IntInt_ReturnValue) == 0x000249, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Add_IntInt_ReturnValue_1) == 0x00024C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Length_ReturnValue_2) == 0x000250, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Less_IntInt_ReturnValue_1) == 0x000254, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000258, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_3) == 0x000260, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_AsP2Player_Controller) == 0x000270, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_FacilitySpot_1) == 0x000280, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_FacilitySpot_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_FacilityData) == 0x000288, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_FacilityData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetPlayerStateExtensionHideout_ReturnValue) == 0x000290, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetPlayerStateExtensionHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetFacility_ReturnValue) == 0x000298, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetFacility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_2) == 0x0002A0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_3) == 0x0002A1, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_AsP2Facility_Craft) == 0x0002A8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_AsP2Facility_Craft' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_bSuccess_1) == 0x0002B0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_Contains_ReturnValue) == 0x0002B1, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_RemoveItem_ReturnValue) == 0x0002B2, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_FacilitySpot) == 0x0002B8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_FacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CustomEvent_Facility) == 0x0002C0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CustomEvent_Facility' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_4) == 0x0002C8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwnerController_ReturnValue_1) == 0x0002D0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwnerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_AsP2Facility_Craft_1) == 0x0002D8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_AsP2Facility_Craft_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_bSuccess_2) == 0x0002E0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, Temp_int_Loop_Counter_Variable_2) == 0x0002E4, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002E8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002EC, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_Array_AddUnique_ReturnValue) == 0x0002F0, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwningController_ReturnValue_1) == 0x0002F8, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwningController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000300, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000308, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_AsP2Player_Controller_1) == 0x000310, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_AsP2Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_bSuccess_3) == 0x000318, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetPlayerStateExtensionHideout_ReturnValue_1) == 0x000320, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetPlayerStateExtensionHideout_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_4) == 0x000328, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_5) == 0x000338, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_5) == 0x00033C, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetOwningPlayerController_ReturnValue_2) == 0x000350, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetOwningPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_AsP2Player_Controller_2) == 0x000358, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_AsP2Player_Controller_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_DynamicCast_bSuccess_4) == 0x000360, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_6) == 0x000364, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_GetPlayerStateExtensionHideout_ReturnValue_2) == 0x000378, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_GetPlayerStateExtensionHideout_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, K2Node_CreateDelegate_OutputDelegate_7) == 0x000380, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft, CallFunc_IsValid_ReturnValue_6) == 0x000390, "Member 'BP_ContractRequirement_Craft_C_ExecuteUbergraph_BP_ContractRequirement_Craft::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnCancelCraft
// 0x0138 (0x0138 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnCancelCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingRow;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ExchangeInfo                        CallFunc_Array_Get_Item;                           // 0x00D8(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnCancelCraft) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnCancelCraft");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnCancelCraft) == 0x000138, "Wrong size on BP_ContractRequirement_Craft_C_OnCancelCraft");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, InCraftingRow) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::InCraftingRow' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, Temp_bool_True_if_break_was_hit_Variable) == 0x0000C0, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, Temp_int_Array_Index_Variable) == 0x0000CC, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraft, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000131, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraft::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnCancelCraftEvent_Event
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event final
{
public:
	class AP2Facility_Craft*                      InFacility;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event) == 0x0000C8, "Wrong size on BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event, InFacility) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event::InFacility' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event, InCraftingDataRow) == 0x000008, "Member 'BP_ContractRequirement_Craft_C_OnCancelCraftEvent_Event::InCraftingDataRow' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnFacilityAddedBindEvents
// 0x0008 (0x0008 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents final
{
public:
	class AP2Facility_Craft*                      InFacitily;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents) == 0x000008, "Wrong size on BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents, InFacitily) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnFacilityAddedBindEvents::InFacitily' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnFacilitySpotDestroyed
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed final
{
public:
	class AP2FacilitySpot*                        FacilitySpot;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityData*                        FacilityData;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed) == 0x000010, "Wrong size on BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed, FacilitySpot) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed::FacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed, FacilityData) == 0x000008, "Member 'BP_ContractRequirement_Craft_C_OnFacilitySpotDestroyed::FacilityData' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnFacilitySpotInstalled
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled final
{
public:
	class AP2FacilitySpot*                        FacilitySpot;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            Facility;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled) == 0x000010, "Wrong size on BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled, FacilitySpot) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled::FacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled, Facility) == 0x000008, "Member 'BP_ContractRequirement_Craft_C_OnFacilitySpotInstalled::Facility' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnStartCraft
// 0x0138 (0x0138 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnStartCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingRow;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ExchangeInfo                        CallFunc_Array_Get_Item;                           // 0x00D8(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnStartCraft) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnStartCraft");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnStartCraft) == 0x000138, "Wrong size on BP_ContractRequirement_Craft_C_OnStartCraft");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, InCraftingRow) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::InCraftingRow' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, Temp_bool_True_if_break_was_hit_Variable) == 0x0000C0, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_Not_PreBool_ReturnValue) == 0x0000C8, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, Temp_int_Array_Index_Variable) == 0x0000CC, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraft, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000131, "Member 'BP_ContractRequirement_Craft_C_OnStartCraft::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C.OnStartCraftEvent_Event
// 0x00D0 (0x00D0 - 0x0000)
struct BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event final
{
public:
	class AP2Facility_Craft*                      InFacility;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0008(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InStartTimeNormalized;                             // 0x00C8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event) == 0x000008, "Wrong alignment on BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event");
static_assert(sizeof(BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event) == 0x0000D0, "Wrong size on BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event, InFacility) == 0x000000, "Member 'BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event::InFacility' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event, InCraftingDataRow) == 0x000008, "Member 'BP_ContractRequirement_Craft_C_OnStartCraftEvent_Event::InCraftingDataRow' has a wrong offset!");
