#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_Contract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "BP_ContextRequirement_Base_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_Contract.BP_ContextRequirement_Contract_C
// 0x0070 (0x00D0 - 0x0060)
class UBP_ContextRequirement_Contract_C final : public UBP_ContextRequirement_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   Description;                                       // 0x0068(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FP2ContractDataFinder                  FoundData;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FP2ContractStateQuery>          Query;                                             // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UP2ContractData*>                ContractDataList;                                  // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LoadCounter;                                       // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Contract*>                    ContractList;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsFirst;                                          // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMeetsQuery;                                       // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnContractStateChanged(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_Contract(int32 EntryPoint)	 // 0xae1e64;
	void CustomEvent(const struct FDataRegistryId& ItemId, const struct FDataRegistryLookup& ResolvedLookup, EDataRegistryAcquireStatus Status)	 // 0xae1e64;
	void CheckContractState()	 // 0xae1e64;
	void CheckContract()	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;

	class FText GetRequirementDescription(bool bGetRichText) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_Contract_C">();
	}
	static class UBP_ContextRequirement_Contract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_Contract_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_Contract_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_Contract_C");
static_assert(sizeof(UBP_ContextRequirement_Contract_C) == 0x0000D0, "Wrong size on UBP_ContextRequirement_Contract_C");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_Contract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, Description) == 0x000068, "Member 'UBP_ContextRequirement_Contract_C::Description' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, FoundData) == 0x000080, "Member 'UBP_ContextRequirement_Contract_C::FoundData' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, Query) == 0x000090, "Member 'UBP_ContextRequirement_Contract_C::Query' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, ContractDataList) == 0x0000A0, "Member 'UBP_ContextRequirement_Contract_C::ContractDataList' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, LoadCounter) == 0x0000B0, "Member 'UBP_ContextRequirement_Contract_C::LoadCounter' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, ContractList) == 0x0000B8, "Member 'UBP_ContextRequirement_Contract_C::ContractList' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, bIsFirst) == 0x0000C8, "Member 'UBP_ContextRequirement_Contract_C::bIsFirst' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_Contract_C, bMeetsQuery) == 0x0000C9, "Member 'UBP_ContextRequirement_Contract_C::bMeetsQuery' has a wrong offset!");

}

