#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_FactionLevel

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Eval_Number_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_FactionLevel_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.ExecuteUbergraph_BP_ContractRequirement_FactionLevel
// 0x01D8 (0x01D8 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2FactionMessage_Reputation           Temp_struct_Variable_1;                            // 0x0030(0x0010)(NoDestructor)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2FactionMessage_Reputation           Temp_struct_Variable_2;                            // 0x0048(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2FactionData*                   CallFunc_GetData_ReturnValue;                      // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InReputation;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_2;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFactionReputation_ReturnValue;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_3;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Faction*                             CallFunc_GetFactionWithTag_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2FactionLevelData                    CallFunc_GetFactionLevelByReputation_OutLevel;     // 0x00C8(0x00F8)()
	bool                                          CallFunc_GetFactionLevelByReputation_ReturnValue;  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x01C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel) == 0x000008, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel) == 0x0001D8, "Wrong size on BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_struct_Variable) == 0x000010, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_object_Variable) == 0x000018, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000020, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_bool_Variable) == 0x000028, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_byte_Variable) == 0x00002A, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_byte_Variable_1) == 0x00002B, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_struct_Variable_1) == 0x000030, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetPayload_ReturnValue) == 0x000040, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_Event_InFirstInitialization) == 0x000041, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, Temp_struct_Variable_2) == 0x000048, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000060, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetData_ReturnValue) == 0x000070, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_MatchesTag_ReturnValue) == 0x000078, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_CustomEvent_ProxyObject) == 0x000080, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_CustomEvent_ActualChannel) == 0x000088, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_CustomEvent_InReputation) == 0x000090, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_CustomEvent_InReputation' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetOwningPlayerController_ReturnValue_2) == 0x000098, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetOwningPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue_3) == 0x0000A0, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetFactionReputation_ReturnValue) == 0x0000A4, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetFactionReputation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetOwningPlayerController_ReturnValue_3) == 0x0000A8, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetOwningPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue_4) == 0x0000B0, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetFactionWithTag_ReturnValue) == 0x0000B8, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetFactionWithTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_IsValid_ReturnValue_5) == 0x0000C0, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetFactionLevelByReputation_OutLevel) == 0x0000C8, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetFactionLevelByReputation_OutLevel' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GetFactionLevelByReputation_ReturnValue) == 0x0001C0, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GetFactionLevelByReputation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001C1, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_CreateDelegate_OutputDelegate) == 0x0001C4, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel, K2Node_Select_Default) == 0x0001D4, "Member 'BP_ContractRequirement_FactionLevel_C_ExecuteUbergraph_BP_ContractRequirement_FactionLevel::K2Node_Select_Default' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0) == 0x000008, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0) == 0x000010, "Wrong size on BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0, ProxyObject) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0, ActualChannel) == 0x000008, "Member 'BP_ContractRequirement_FactionLevel_C_OnMessageReceived_F0230B2A411787A9E29115A55BD8C9C0::ActualChannel' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.OnReputationChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_OnReputationChanged final
{
public:
	int32                                         InReputation;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_OnReputationChanged) == 0x000004, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_OnReputationChanged");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_OnReputationChanged) == 0x000004, "Wrong size on BP_ContractRequirement_FactionLevel_C_OnReputationChanged");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_OnReputationChanged, InReputation) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_OnReputationChanged::InReputation' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_FactionLevel_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.GetRequiredFactionLevel
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel) == 0x000004, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel) == 0x000004, "Wrong size on BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_GetRequiredFactionLevel::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.GetTitle
// 0x01E8 (0x01E8 - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0050)(HasGetValueTypeHash)
	const class UP2FactionData*                   CallFunc_GetFactionData_ReturnValue;               // 0x00F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_Eval_Number                                 Temp_byte_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0158(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0170(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_GetTitle) == 0x0001E8, "Wrong size on BP_ContractRequirement_FactionLevel_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_text_Variable) == 0x000018, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_text_Variable_1) == 0x000030, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_text_Variable_2) == 0x000048, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_text_Variable_3) == 0x000060, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_text_Variable_4) == 0x000078, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000090, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000A0, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, CallFunc_GetFactionData_ReturnValue) == 0x0000F8, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::CallFunc_GetFactionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, Temp_byte_Variable) == 0x000100, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, K2Node_Select_Default) == 0x000158, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, K2Node_MakeStruct_FormatArgumentData_2) == 0x000170, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, K2Node_MakeArray_Array) == 0x0001C0, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_GetTitle, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'BP_ContractRequirement_FactionLevel_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_FactionLevel.BP_ContractRequirement_FactionLevel_C.IsValueAcceptable
// 0x000C (0x000C - 0x0000)
struct BP_ContractRequirement_FactionLevel_C_IsValueAcceptable final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutResult;                                         // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_FactionLevel_C_IsValueAcceptable) == 0x000004, "Wrong alignment on BP_ContractRequirement_FactionLevel_C_IsValueAcceptable");
static_assert(sizeof(BP_ContractRequirement_FactionLevel_C_IsValueAcceptable) == 0x00000C, "Wrong size on BP_ContractRequirement_FactionLevel_C_IsValueAcceptable");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_IsValueAcceptable, InValue) == 0x000000, "Member 'BP_ContractRequirement_FactionLevel_C_IsValueAcceptable::InValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_FactionLevel_C_IsValueAcceptable, OutResult) == 0x000004, "Member 'BP_ContractRequirement_FactionLevel_C_IsValueAcceptable::OutResult' has a wrong offset!");
