#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextEvent_ShowCheckboxUI

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ContextEvent_ShowCheckboxUI.BP_ContextEvent_ShowCheckboxUI_C.ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI
// 0x0078 (0x0078 - 0x0000)
struct BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwningController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2GameplayContext*                     CallFunc_GetOwningGameplayContext_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HUD*                                 CallFunc_GetP2HUD_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetOwningController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0040(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller_1;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetP2HUD_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2GameplayContext*                     CallFunc_GetOwningGameplayContext_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI) == 0x000008, "Wrong alignment on BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI");
static_assert(sizeof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI) == 0x000078, "Wrong size on BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, EntryPoint) == 0x000000, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetOwningController_ReturnValue) == 0x000008, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetOwningController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetOwningGameplayContext_ReturnValue) == 0x000010, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetOwningGameplayContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, K2Node_DynamicCast_AsP2Player_Controller) == 0x000018, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetP2HUD_ReturnValue) == 0x000028, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetP2HUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetOwningController_ReturnValue_1) == 0x000038, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetOwningController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, Temp_delegate_Variable) == 0x000040, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, K2Node_DynamicCast_AsP2Player_Controller_1) == 0x000050, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::K2Node_DynamicCast_AsP2Player_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_PostEvent_ReturnValue) == 0x00005C, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetP2HUD_ReturnValue_1) == 0x000060, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetP2HUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_GetOwningGameplayContext_ReturnValue_1) == 0x000068, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_GetOwningGameplayContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_ContextEvent_ShowCheckboxUI_C_ExecuteUbergraph_BP_ContextEvent_ShowCheckboxUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ContextEvent_ShowCheckboxUI.BP_ContextEvent_ShowCheckboxUI_C.BP_ShouldActivateOnLoad
// 0x0010 (0x0010 - 0x0000)
struct BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad final
{
public:
	class UP2GameplayContext*                     InContext;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2GameplayContextState                       InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad) == 0x000008, "Wrong alignment on BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad");
static_assert(sizeof(BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad) == 0x000010, "Wrong size on BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad, InContext) == 0x000000, "Member 'BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad::InContext' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad, InState) == 0x000008, "Member 'BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad::InState' has a wrong offset!");
static_assert(offsetof(BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad, ReturnValue) == 0x000009, "Member 'BP_ContextEvent_ShowCheckboxUI_C_BP_ShouldActivateOnLoad::ReturnValue' has a wrong offset!");

}

