#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Call_In_AUV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Call_In_AUV_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.ExecuteUbergraph_BP_Call_In_AUV
// 0x0498 (0x0498 - 0x0000)
struct BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_IsInsideAnomaly_OutDistance;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsInsideAnomaly_OutClosestPoint;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInsideAnomaly_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2ExfiltrationAUV*                     K2Node_CustomEvent_InAUV;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       K2Node_CustomEvent_InState;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_TimeToWait;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_SetTime;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerTime_Time;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerTime_Time_1;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeLeft_TimeLeft;                     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetTimeLeft_TimeLeft_1;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_1;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x00A8(0x0018)()
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue_1;        // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0128(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x01B8(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x02AC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue;              // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0300(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0350(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0360(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03B0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03D8(0x0018)()
	TDelegate<void(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)> K2Node_CreateDelegate_OutputDelegate_2; // 0x03F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_Select_Default;                             // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2ExfiltrationAUV*                     K2Node_Select_Default_1;                           // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_Select_Default_2;                           // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_Select_Default_3;                           // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_Select_Default_4;                           // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_IsInsideAnomaly_OutDistance_1;            // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsInsideAnomaly_OutClosestPoint_1;        // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInsideAnomaly_ReturnValue_1;            // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x2];                                      // 0x0482(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast;         // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FromSeconds_Seconds_ImplicitCast_1;       // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV");
static_assert(sizeof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV) == 0x000498, "Wrong size on BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, EntryPoint) == 0x000000, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_OutDistance) == 0x000020, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_OutDistance' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_OutClosestPoint) == 0x000028, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_OutClosestPoint' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_ReturnValue) == 0x000040, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_bool_Variable) == 0x000041, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_bool_Variable_1) == 0x000042, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_bool_Variable_2) == 0x000043, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_bool_Variable_3) == 0x000044, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_bool_Variable_4) == 0x000045, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_HasAuthority_ReturnValue) == 0x000046, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CustomEvent_InAUV) == 0x000050, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CustomEvent_InAUV' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CustomEvent_InState) == 0x000058, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005A, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CustomEvent_TimeToWait) == 0x000060, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CustomEvent_TimeToWait' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CustomEvent_SetTime) == 0x000070, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CustomEvent_SetTime' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetServerTime_Time) == 0x000078, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetServerTime_Time' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetServerTime_Time_1) == 0x000080, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetServerTime_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetTimeLeft_TimeLeft) == 0x000088, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetTimeLeft_TimeLeft' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetTimeLeft_TimeLeft_1) == 0x000090, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetTimeLeft_TimeLeft_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_FromSeconds_ReturnValue) == 0x000098, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_FromSeconds_ReturnValue_1) == 0x0000A0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_FromSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x0000A8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_AsTimespan_Timespan_ReturnValue_1) == 0x0000C0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_AsTimespan_Timespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeStruct_FormatArgumentData_1) == 0x000128, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_BreakVector2D_X) == 0x000178, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_BreakVector2D_Y) == 0x000180, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_BreakVector2D_X_1) == 0x000188, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_BreakVector2D_Y_1) == 0x000190, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_RandomFloatInRange_ReturnValue) == 0x000198, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001A0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001A8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_struct_Variable) == 0x0001B8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_HasAuthority_ReturnValue_1) == 0x0002A8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, Temp_delegate_Variable) == 0x0002AC, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_PostEvent_ReturnValue) == 0x0002BC, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CreateDelegate_OutputDelegate) == 0x0002C0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002D0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002E0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002E8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_GetGameMode_ReturnValue) == 0x0002F0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_HasMatchStarted_ReturnValue) == 0x0002F8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_HasMatchStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeStruct_FormatArgumentData_2) == 0x000300, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeArray_Array) == 0x000350, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeStruct_FormatArgumentData_3) == 0x000360, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_Format_ReturnValue) == 0x0003B0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_MakeArray_Array_1) == 0x0003C8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_Format_ReturnValue_1) == 0x0003D8, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003F0, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue) == 0x000400, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue_1) == 0x000401, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Select_Default) == 0x000408, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Select_Default_1) == 0x000410, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue_2) == 0x000418, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue_3) == 0x000419, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Select_Default_2) == 0x000420, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue_4) == 0x000428, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Select_Default_3) == 0x000430, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsValid_ReturnValue_5) == 0x000438, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, K2Node_Select_Default_4) == 0x000440, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000448, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_OutDistance_1) == 0x000460, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_OutDistance_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_OutClosestPoint_1) == 0x000468, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_OutClosestPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_IsInsideAnomaly_ReturnValue_1) == 0x000480, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_IsInsideAnomaly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000481, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000484, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000488, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_FromSeconds_Seconds_ImplicitCast) == 0x00048C, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_FromSeconds_Seconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV, CallFunc_FromSeconds_Seconds_ImplicitCast_1) == 0x000490, "Member 'BP_Call_In_AUV_C_ExecuteUbergraph_BP_Call_In_AUV::CallFunc_FromSeconds_Seconds_ImplicitCast_1' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.GetServerTime
// 0x0020 (0x0020 - 0x0000)
struct BP_Call_In_AUV_C_GetServerTime final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_GetServerTime) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_GetServerTime");
static_assert(sizeof(BP_Call_In_AUV_C_GetServerTime) == 0x000020, "Wrong size on BP_Call_In_AUV_C_GetServerTime");
static_assert(offsetof(BP_Call_In_AUV_C_GetServerTime, Time) == 0x000000, "Member 'BP_Call_In_AUV_C_GetServerTime::Time' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetServerTime, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_Call_In_AUV_C_GetServerTime::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetServerTime, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000010, "Member 'BP_Call_In_AUV_C_GetServerTime::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetServerTime, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Call_In_AUV_C_GetServerTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.GetTimeLeft
// 0x0020 (0x0020 - 0x0000)
struct BP_Call_In_AUV_C_GetTimeLeft final
{
public:
	double                                        TimeLeft;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerTime_Time;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_GetTimeLeft) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_GetTimeLeft");
static_assert(sizeof(BP_Call_In_AUV_C_GetTimeLeft) == 0x000020, "Wrong size on BP_Call_In_AUV_C_GetTimeLeft");
static_assert(offsetof(BP_Call_In_AUV_C_GetTimeLeft, TimeLeft) == 0x000000, "Member 'BP_Call_In_AUV_C_GetTimeLeft::TimeLeft' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetTimeLeft, CallFunc_GetServerTime_Time) == 0x000008, "Member 'BP_Call_In_AUV_C_GetTimeLeft::CallFunc_GetServerTime_Time' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetTimeLeft, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Call_In_AUV_C_GetTimeLeft::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_GetTimeLeft, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Call_In_AUV_C_GetTimeLeft::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.IsCallable
// 0x0002 (0x0002 - 0x0000)
struct BP_Call_In_AUV_C_IsCallable final
{
public:
	bool                                          Callable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_IsCallable) == 0x000001, "Wrong alignment on BP_Call_In_AUV_C_IsCallable");
static_assert(sizeof(BP_Call_In_AUV_C_IsCallable) == 0x000002, "Wrong size on BP_Call_In_AUV_C_IsCallable");
static_assert(offsetof(BP_Call_In_AUV_C_IsCallable, Callable) == 0x000000, "Member 'BP_Call_In_AUV_C_IsCallable::Callable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_IsCallable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_Call_In_AUV_C_IsCallable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.OnRep_State
// 0x000C (0x000C - 0x0000)
struct BP_Call_In_AUV_C_OnRep_State final
{
public:
	E_Call_In_AUV                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Call_In_AUV                                 Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_OnRep_State) == 0x000001, "Wrong alignment on BP_Call_In_AUV_C_OnRep_State");
static_assert(sizeof(BP_Call_In_AUV_C_OnRep_State) == 0x00000C, "Wrong size on BP_Call_In_AUV_C_OnRep_State");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_byte_Variable) == 0x000000, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable) == 0x000001, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_1) == 0x000002, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_2) == 0x000003, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_3) == 0x000004, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_byte_Variable_1) == 0x000005, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_4) == 0x000006, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_5) == 0x000007, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_6) == 0x000008, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, Temp_bool_Variable_7) == 0x000009, "Member 'BP_Call_In_AUV_C_OnRep_State::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, K2Node_Select_Default) == 0x00000A, "Member 'BP_Call_In_AUV_C_OnRep_State::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnRep_State, K2Node_Select_Default_1) == 0x00000B, "Member 'BP_Call_In_AUV_C_OnRep_State::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.OnStateChangedDelegate_Event
// 0x0010 (0x0010 - 0x0000)
struct BP_Call_In_AUV_C_OnStateChangedDelegate_Event final
{
public:
	class AP2ExfiltrationAUV*                     InAUV;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_OnStateChangedDelegate_Event) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_OnStateChangedDelegate_Event");
static_assert(sizeof(BP_Call_In_AUV_C_OnStateChangedDelegate_Event) == 0x000010, "Wrong size on BP_Call_In_AUV_C_OnStateChangedDelegate_Event");
static_assert(offsetof(BP_Call_In_AUV_C_OnStateChangedDelegate_Event, InAUV) == 0x000000, "Member 'BP_Call_In_AUV_C_OnStateChangedDelegate_Event::InAUV' has a wrong offset!");
static_assert(offsetof(BP_Call_In_AUV_C_OnStateChangedDelegate_Event, InState) == 0x000008, "Member 'BP_Call_In_AUV_C_OnStateChangedDelegate_Event::InState' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Call_In_AUV_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Call_In_AUV_C_ReceiveTick");
static_assert(sizeof(BP_Call_In_AUV_C_ReceiveTick) == 0x000004, "Wrong size on BP_Call_In_AUV_C_ReceiveTick");
static_assert(offsetof(BP_Call_In_AUV_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Call_In_AUV_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.SetCalled
// 0x0008 (0x0008 - 0x0000)
struct BP_Call_In_AUV_C_SetCalled final
{
public:
	double                                        SetTime;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_SetCalled) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_SetCalled");
static_assert(sizeof(BP_Call_In_AUV_C_SetCalled) == 0x000008, "Wrong size on BP_Call_In_AUV_C_SetCalled");
static_assert(offsetof(BP_Call_In_AUV_C_SetCalled, SetTime) == 0x000000, "Member 'BP_Call_In_AUV_C_SetCalled::SetTime' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.SetWaiting
// 0x0008 (0x0008 - 0x0000)
struct BP_Call_In_AUV_C_SetWaiting final
{
public:
	double                                        TimeToWait;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_SetWaiting) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_SetWaiting");
static_assert(sizeof(BP_Call_In_AUV_C_SetWaiting) == 0x000008, "Wrong size on BP_Call_In_AUV_C_SetWaiting");
static_assert(offsetof(BP_Call_In_AUV_C_SetWaiting, TimeToWait) == 0x000000, "Member 'BP_Call_In_AUV_C_SetWaiting::TimeToWait' has a wrong offset!");

// Function BP_Call_In_AUV.BP_Call_In_AUV_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Call_In_AUV_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Call_In_AUV_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Call_In_AUV_C_UserConstructionScript");
static_assert(sizeof(BP_Call_In_AUV_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Call_In_AUV_C_UserConstructionScript");
static_assert(offsetof(BP_Call_In_AUV_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Call_In_AUV_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

