#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractsFunctionLibrary

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractsFunctionLibrary.BP_ContractsFunctionLibrary_C.CalculatePlayerHasContract
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract final
{
public:
	TArray<class UP2ContractData*>                InContracts;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<EP2ContractState>                      InStates;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<EP2ContractType>                       InTypes;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  InFactionTags;                                     // 0x0030(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  FactionsToCheck;                                   // 0x0060(0x0020)(Edit, BlueprintVisible)
	TArray<EP2ContractType>                       In_Types;                                          // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<EP2ContractState>                      In_States;                                         // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<class UP2ContractData*>                ContractsToCheck;                                  // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class AP2PlayerController*                    CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingContracts_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract) == 0x000008, "Wrong alignment on BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract");
static_assert(sizeof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract) == 0x0000C0, "Wrong size on BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, InContracts) == 0x000000, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::InContracts' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, InStates) == 0x000010, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::InStates' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, InTypes) == 0x000020, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::InTypes' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, InFactionTags) == 0x000030, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::InFactionTags' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, __WorldContext) == 0x000050, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, ReturnValue) == 0x000058, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, FactionsToCheck) == 0x000060, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::FactionsToCheck' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, In_Types) == 0x000080, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::In_Types' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, In_States) == 0x000090, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::In_States' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, ContractsToCheck) == 0x0000A0, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::ContractsToCheck' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000B0, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract, CallFunc_HasMatchingContracts_ReturnValue) == 0x0000B8, "Member 'BP_ContractsFunctionLibrary_C_CalculatePlayerHasContract::CallFunc_HasMatchingContracts_ReturnValue' has a wrong offset!");

// Function BP_ContractsFunctionLibrary.BP_ContractsFunctionLibrary_C.GenerateLoot
// 0x0070 (0x0070 - 0x0000)
struct BP_ContractsFunctionLibrary_C_GenerateLoot final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         MinItemsToSpawn;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxItemsToSpawn;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2ItemData*>                    LootTable;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2ItemData*>                    SpawnableLoot;                                     // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<class UP2ItemData*>                    CallFunc_GenerateLootTable_SpawnArray;             // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemData*                            CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Item*                                CallFunc_AddItemDataActor_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractsFunctionLibrary_C_GenerateLoot) == 0x000008, "Wrong alignment on BP_ContractsFunctionLibrary_C_GenerateLoot");
static_assert(sizeof(BP_ContractsFunctionLibrary_C_GenerateLoot) == 0x000070, "Wrong size on BP_ContractsFunctionLibrary_C_GenerateLoot");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, InActor) == 0x000000, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::InActor' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, MinItemsToSpawn) == 0x000008, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::MinItemsToSpawn' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, MaxItemsToSpawn) == 0x00000C, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::MaxItemsToSpawn' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, LootTable) == 0x000010, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::LootTable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, __WorldContext) == 0x000020, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, SpawnableLoot) == 0x000028, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::SpawnableLoot' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_GenerateLootTable_SpawnArray) == 0x000038, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_GenerateLootTable_SpawnArray' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000048, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, Temp_int_Variable) == 0x000050, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLoot, CallFunc_AddItemDataActor_ReturnValue) == 0x000068, "Member 'BP_ContractsFunctionLibrary_C_GenerateLoot::CallFunc_AddItemDataActor_ReturnValue' has a wrong offset!");

// Function BP_ContractsFunctionLibrary.BP_ContractsFunctionLibrary_C.GenerateLootTable
// 0x0070 (0x0070 - 0x0000)
struct BP_ContractsFunctionLibrary_C_GenerateLootTable final
{
public:
	TArray<class UP2ItemData*>                    LootToSpawn;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2ItemData*>                    SpawnArray;                                        // 0x0018(0x0010)(Parm, OutParm)
	TArray<class UP2ItemData*>                    LootTable;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2ItemData*                            CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractsFunctionLibrary_C_GenerateLootTable) == 0x000008, "Wrong alignment on BP_ContractsFunctionLibrary_C_GenerateLootTable");
static_assert(sizeof(BP_ContractsFunctionLibrary_C_GenerateLootTable) == 0x000070, "Wrong size on BP_ContractsFunctionLibrary_C_GenerateLootTable");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, LootToSpawn) == 0x000000, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::LootToSpawn' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, __WorldContext) == 0x000010, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, SpawnArray) == 0x000018, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::SpawnArray' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, LootTable) == 0x000028, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::LootTable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, Temp_int_Variable) == 0x000048, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Array_Get_Item_1) == 0x00004C, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_GenerateLootTable, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'BP_ContractsFunctionLibrary_C_GenerateLootTable::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_ContractsFunctionLibrary.BP_ContractsFunctionLibrary_C.HighlightActor
// 0x0028 (0x0028 - 0x0000)
struct BP_ContractsFunctionLibrary_C_HighlightActor final
{
public:
	bool                                          HighlightEnabled;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         TargetMesh;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               InteractableContractActiveMaterial;                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractsFunctionLibrary_C_HighlightActor) == 0x000008, "Wrong alignment on BP_ContractsFunctionLibrary_C_HighlightActor");
static_assert(sizeof(BP_ContractsFunctionLibrary_C_HighlightActor) == 0x000028, "Wrong size on BP_ContractsFunctionLibrary_C_HighlightActor");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_HighlightActor, HighlightEnabled) == 0x000000, "Member 'BP_ContractsFunctionLibrary_C_HighlightActor::HighlightEnabled' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_HighlightActor, TargetMesh) == 0x000008, "Member 'BP_ContractsFunctionLibrary_C_HighlightActor::TargetMesh' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_HighlightActor, __WorldContext) == 0x000010, "Member 'BP_ContractsFunctionLibrary_C_HighlightActor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_HighlightActor, InteractableContractActiveMaterial) == 0x000018, "Member 'BP_ContractsFunctionLibrary_C_HighlightActor::InteractableContractActiveMaterial' has a wrong offset!");
static_assert(offsetof(BP_ContractsFunctionLibrary_C_HighlightActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_ContractsFunctionLibrary_C_HighlightActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

