#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractAction_Base

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractAction_Base.BP_ContractAction_Base_C.ExecuteUbergraph_BP_ContractAction_Base
// 0x0038 (0x0038 - 0x0000)
struct BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_InPawn;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2InteractionParameters               K2Node_Event_InParameters;                         // 0x0010(0x0020)(ConstParm, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base) == 0x000008, "Wrong alignment on BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base");
static_assert(sizeof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base) == 0x000038, "Wrong size on BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base");
static_assert(offsetof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base, EntryPoint) == 0x000000, "Member 'BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base, K2Node_Event_InPawn) == 0x000008, "Member 'BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base::K2Node_Event_InPawn' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base, K2Node_Event_InParameters) == 0x000010, "Member 'BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base::K2Node_Event_InParameters' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base, CallFunc_GetOwningActor_ReturnValue) == 0x000030, "Member 'BP_ContractAction_Base_C_ExecuteUbergraph_BP_ContractAction_Base::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");

// Function BP_ContractAction_Base.BP_ContractAction_Base_C.OnPostInteraction
// 0x0028 (0x0028 - 0x0000)
struct BP_ContractAction_Base_C_OnPostInteraction final
{
public:
	class APawn*                                  InPawn;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2InteractionParameters               InParameters;                                      // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_ContractAction_Base_C_OnPostInteraction) == 0x000008, "Wrong alignment on BP_ContractAction_Base_C_OnPostInteraction");
static_assert(sizeof(BP_ContractAction_Base_C_OnPostInteraction) == 0x000028, "Wrong size on BP_ContractAction_Base_C_OnPostInteraction");
static_assert(offsetof(BP_ContractAction_Base_C_OnPostInteraction, InPawn) == 0x000000, "Member 'BP_ContractAction_Base_C_OnPostInteraction::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_OnPostInteraction, InParameters) == 0x000008, "Member 'BP_ContractAction_Base_C_OnPostInteraction::InParameters' has a wrong offset!");

// Function BP_ContractAction_Base.BP_ContractAction_Base_C.IsAvailableForInteraction
// 0x0060 (0x0060 - 0x0000)
struct BP_ContractAction_Base_C_IsAvailableForInteraction final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2AvailableForInteractionResult       ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	float                                         CallFunc_GetRaidTimeRemainingSec_ReturnValue;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2AvailableForInteractionResult       CallFunc_IsAvailableForInteraction_ReturnValue;    // 0x0018(0x000C)(NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Interactable_ActionUnlock_Base_C*   K2Node_DynamicCast_AsBP_Interactable_Action_Unlock_Base; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Action*                              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractAction_Base_C_IsAvailableForInteraction) == 0x000008, "Wrong alignment on BP_ContractAction_Base_C_IsAvailableForInteraction");
static_assert(sizeof(BP_ContractAction_Base_C_IsAvailableForInteraction) == 0x000060, "Wrong size on BP_ContractAction_Base_C_IsAvailableForInteraction");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, InPawn) == 0x000000, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, ReturnValue) == 0x000008, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_GetRaidTimeRemainingSec_ReturnValue) == 0x000014, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_GetRaidTimeRemainingSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_IsAvailableForInteraction_ReturnValue) == 0x000018, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_IsAvailableForInteraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_GetOwningActor_ReturnValue) == 0x000030, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, K2Node_DynamicCast_AsBP_Interactable_Action_Unlock_Base) == 0x000038, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::K2Node_DynamicCast_AsBP_Interactable_Action_Unlock_Base' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000041, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, K2Node_SwitchInteger_CmpSuccess) == 0x000042, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, K2Node_SwitchInteger_CmpSuccess_1) == 0x000043, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Base_C_IsAvailableForInteraction, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000058, "Member 'BP_ContractAction_Base_C_IsAvailableForInteraction::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

