#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_PlayerLevel

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_BP_Initialize");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_BP_Initialize) == 0x000001, "Wrong size on BP_ContractRequirement_PlayerLevel_C_BP_Initialize");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.Completed_F9EF05474248F51C3BD7DD971A1AFAE6
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6 final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6) == 0x000004, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6) == 0x000004, "Wrong size on BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6, Level) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_Completed_F9EF05474248F51C3BD7DD971A1AFAE6::Level' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.ExecuteUbergraph_BP_ContractRequirement_PlayerLevel
// 0x0058 (0x0058 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Level)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   Temp_byte_Variable_1;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InLevel;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2LevelChanged_AsyncAction*            CallFunc_ListenLevelChangedEvent_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractRequirementState                   K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel) == 0x000008, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel) == 0x000058, "Wrong size on BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, EntryPoint) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, K2Node_CustomEvent_Level) == 0x000004, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, Temp_int_Variable) == 0x000018, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, Temp_bool_Variable) == 0x00001C, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, Temp_byte_Variable) == 0x00001D, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, Temp_byte_Variable_1) == 0x00001E, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, K2Node_Event_InFirstInitialization) == 0x00001F, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, K2Node_CustomEvent_InLevel) == 0x000020, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::K2Node_CustomEvent_InLevel' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_GetOwningPawn_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_ListenLevelChangedEvent_ReturnValue) == 0x000038, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_ListenLevelChangedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, K2Node_Select_Default) == 0x000040, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000048, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel, CallFunc_GetCurrentLevel_ReturnValue) == 0x000050, "Member 'BP_ContractRequirement_PlayerLevel_C_ExecuteUbergraph_BP_ContractRequirement_PlayerLevel::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.OnPMCLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged) == 0x000004, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged) == 0x000004, "Wrong size on BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged, InLevel) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_OnPMCLevelChanged::InLevel' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.GetCompleteCondition
// 0x0001 (0x0001 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition final
{
public:
	EP2ContractRequirementCompleteCondition       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition) == 0x000001, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition) == 0x000001, "Wrong size on BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_GetCompleteCondition::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.GetRequiredPMCLevel
// 0x0004 (0x0004 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel) == 0x000004, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel) == 0x000004, "Wrong size on BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_GetRequiredPMCLevel::ReturnValue' has a wrong offset!");

// Function BP_ContractRequirement_PlayerLevel.BP_ContractRequirement_PlayerLevel_C.GetTitle
// 0x0040 (0x0040 - 0x0000)
struct BP_ContractRequirement_PlayerLevel_C_GetTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0028(0x0018)()
};
static_assert(alignof(BP_ContractRequirement_PlayerLevel_C_GetTitle) == 0x000008, "Wrong alignment on BP_ContractRequirement_PlayerLevel_C_GetTitle");
static_assert(sizeof(BP_ContractRequirement_PlayerLevel_C_GetTitle) == 0x000040, "Wrong size on BP_ContractRequirement_PlayerLevel_C_GetTitle");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_GetTitle, ReturnValue) == 0x000000, "Member 'BP_ContractRequirement_PlayerLevel_C_GetTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_GetTitle, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_ContractRequirement_PlayerLevel_C_GetTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ContractRequirement_PlayerLevel_C_GetTitle, CallFunc_Format_ReturnValue) == 0x000028, "Member 'BP_ContractRequirement_PlayerLevel_C_GetTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

}

