#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Call_In_AUV_V2

#include "Basic.hpp"

#include "E_Call_In_AUV_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Call_In_AUV_V2.BP_Call_In_AUV_V2_C
// 0x0170 (0x0420 - 0x02B0)
class ABP_Call_In_AUV_V2_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SphereOpen2;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SphereOpen1;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SphereOpen;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Beam1;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Beam;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ColiCore2;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2MapComponent*                        MapComponentCalledIn;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2MapComponent*                        MapComponentAvailable;                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     P2Action;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_0FAF7C0C48D45C6A473F1089D636C2DD; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_0FAF7C0C48D45C6A473F1089D636C2DD; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_Call_In_AUV                                 State;                                             // 0x0320(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExfilAUV_CallIn_Sphere_C*           Sphere;                                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Exfil_TriggerZone_C*                Exfil_Trigger;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_ExfilAUV_Callin_Vanilla_C*          AUV;                                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        CountDownTimeStamp;                                // 0x0340(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CountdownDuration;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TimeScaleExtracted;                                // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TimeScaleStart;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ExfilDuration;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ETATime;                                           // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueTag                        Notification_Gameplay_Cue;                         // 0x0380(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UMaterialInstanceDynamic*               Material;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_Handle;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondToLast;                                      // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SecondToLastTime;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 Supported_Seq;                                     // 0x03A8(0x0010)(Edit, BlueprintVisible)
	class UAkAudioEvent*                          Zero1_AkEvent_Extraction_Portal_Standby;           // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero2_AkEvent_Extraction_Portal_Actvation_Start;   // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero2_AkEvent_Alarm_Activate;                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero3_AkEvent_Extraction_Portal_Activation_Pulse;  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero4_AkEvent_Extraction_Portal_Actvation_Complete; // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero5_AkEvent_Alarm_Close;                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero5_AkEvent_Extraction_Portal_Close;             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Broke;                                             // 0x03F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Fix_Tries;                                         // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Spawn;                         // 0x03F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Wormhole;                      // 0x0400(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Eta_Timer;                                         // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CountDownSequence;                                 // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CurveFloat;                                        // 0x0418(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Available_FX()	 // 0xae1e64;
	void Check_anomaly()	 // 0xae1e64;
	void Destroy_Self()	 // 0xae1e64;
	void Disable_Extract_Sequences(int32 Sequence_ID)	 // 0xae1e64;
	void End_FX()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Call_In_AUV_V2(int32 EntryPoint)	 // 0xae1e64;
	void Exfiltrated()	 // 0xae1e64;
	void GetPulseCurveFloat(double* float_0)	 // 0xae1e64;
	void GetServerTime(double* Time)	 // 0xae1e64;
	void GetTimeLeft(double* TimeLeft)	 // 0xae1e64;
	void IsCallable(bool* Callable)	 // 0xae1e64;
	void OnExfiltrated()	 // 0xae1e64;
	void OnPostInteract()	 // 0xae1e64;
	void OnRep_State()	 // 0xae1e64;
	void OnRep_Timer_Handle()	 // 0xae1e64;
	void OnStateChangedDelegate_Event(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)	 // 0xae1e64;
	void PlayShake(float NormalizedMagnitude)	 // 0xae1e64;
	void PulseCycle()	 // 0xae1e64;
	void PulseFX(double NewParam)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ScaleSphere(double ALPHA)	 // 0xae1e64;
	void SetArrived()	 // 0xae1e64;
	void SetAvailable()	 // 0xae1e64;
	void SetCalled(double SetTime)	 // 0xae1e64;
	void SetWaiting(double TimeToWait)	 // 0xae1e64;
	void StartFX()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;
	void UserConstructionScript()	 // 0xae1e64;
	void Waiting_FX()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Call_In_AUV_V2_C">();
	}
	static class ABP_Call_In_AUV_V2_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Call_In_AUV_V2_C>();
	}
};
static_assert(alignof(ABP_Call_In_AUV_V2_C) == 0x000008, "Wrong alignment on ABP_Call_In_AUV_V2_C");
static_assert(sizeof(ABP_Call_In_AUV_V2_C) == 0x000420, "Wrong size on ABP_Call_In_AUV_V2_C");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Call_In_AUV_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Ak) == 0x0002B8, "Member 'ABP_Call_In_AUV_V2_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SM_SphereOpen2) == 0x0002C0, "Member 'ABP_Call_In_AUV_V2_C::SM_SphereOpen2' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SM_SphereOpen1) == 0x0002C8, "Member 'ABP_Call_In_AUV_V2_C::SM_SphereOpen1' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SM_SphereOpen) == 0x0002D0, "Member 'ABP_Call_In_AUV_V2_C::SM_SphereOpen' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Beam1) == 0x0002D8, "Member 'ABP_Call_In_AUV_V2_C::Beam1' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Beam) == 0x0002E0, "Member 'ABP_Call_In_AUV_V2_C::Beam' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SM_ColiCore2) == 0x0002E8, "Member 'ABP_Call_In_AUV_V2_C::SM_ColiCore2' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, MapComponentCalledIn) == 0x0002F0, "Member 'ABP_Call_In_AUV_V2_C::MapComponentCalledIn' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, MapComponentAvailable) == 0x0002F8, "Member 'ABP_Call_In_AUV_V2_C::MapComponentAvailable' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, P2Action) == 0x000300, "Member 'ABP_Call_In_AUV_V2_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, DefaultSceneRoot) == 0x000308, "Member 'ABP_Call_In_AUV_V2_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Timeline_NewTrack_0_0FAF7C0C48D45C6A473F1089D636C2DD) == 0x000310, "Member 'ABP_Call_In_AUV_V2_C::Timeline_NewTrack_0_0FAF7C0C48D45C6A473F1089D636C2DD' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Timeline__Direction_0FAF7C0C48D45C6A473F1089D636C2DD) == 0x000314, "Member 'ABP_Call_In_AUV_V2_C::Timeline__Direction_0FAF7C0C48D45C6A473F1089D636C2DD' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Timeline) == 0x000318, "Member 'ABP_Call_In_AUV_V2_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, State) == 0x000320, "Member 'ABP_Call_In_AUV_V2_C::State' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Sphere) == 0x000328, "Member 'ABP_Call_In_AUV_V2_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Exfil_Trigger) == 0x000330, "Member 'ABP_Call_In_AUV_V2_C::Exfil_Trigger' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, AUV) == 0x000338, "Member 'ABP_Call_In_AUV_V2_C::AUV' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, CountDownTimeStamp) == 0x000340, "Member 'ABP_Call_In_AUV_V2_C::CountDownTimeStamp' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, CountdownDuration) == 0x000348, "Member 'ABP_Call_In_AUV_V2_C::CountdownDuration' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, TimeScaleExtracted) == 0x000350, "Member 'ABP_Call_In_AUV_V2_C::TimeScaleExtracted' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, TimeScaleStart) == 0x000360, "Member 'ABP_Call_In_AUV_V2_C::TimeScaleStart' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, ExfilDuration) == 0x000370, "Member 'ABP_Call_In_AUV_V2_C::ExfilDuration' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, ETATime) == 0x000378, "Member 'ABP_Call_In_AUV_V2_C::ETATime' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Notification_Gameplay_Cue) == 0x000380, "Member 'ABP_Call_In_AUV_V2_C::Notification_Gameplay_Cue' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Material) == 0x000388, "Member 'ABP_Call_In_AUV_V2_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Timer_Handle) == 0x000390, "Member 'ABP_Call_In_AUV_V2_C::Timer_Handle' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SecondToLast) == 0x000398, "Member 'ABP_Call_In_AUV_V2_C::SecondToLast' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, SecondToLastTime) == 0x0003A0, "Member 'ABP_Call_In_AUV_V2_C::SecondToLastTime' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Supported_Seq) == 0x0003A8, "Member 'ABP_Call_In_AUV_V2_C::Supported_Seq' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero1_AkEvent_Extraction_Portal_Standby) == 0x0003B8, "Member 'ABP_Call_In_AUV_V2_C::Zero1_AkEvent_Extraction_Portal_Standby' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero2_AkEvent_Extraction_Portal_Actvation_Start) == 0x0003C0, "Member 'ABP_Call_In_AUV_V2_C::Zero2_AkEvent_Extraction_Portal_Actvation_Start' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero2_AkEvent_Alarm_Activate) == 0x0003C8, "Member 'ABP_Call_In_AUV_V2_C::Zero2_AkEvent_Alarm_Activate' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero3_AkEvent_Extraction_Portal_Activation_Pulse) == 0x0003D0, "Member 'ABP_Call_In_AUV_V2_C::Zero3_AkEvent_Extraction_Portal_Activation_Pulse' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero4_AkEvent_Extraction_Portal_Actvation_Complete) == 0x0003D8, "Member 'ABP_Call_In_AUV_V2_C::Zero4_AkEvent_Extraction_Portal_Actvation_Complete' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero5_AkEvent_Alarm_Close) == 0x0003E0, "Member 'ABP_Call_In_AUV_V2_C::Zero5_AkEvent_Alarm_Close' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Zero5_AkEvent_Extraction_Portal_Close) == 0x0003E8, "Member 'ABP_Call_In_AUV_V2_C::Zero5_AkEvent_Extraction_Portal_Close' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Broke) == 0x0003F0, "Member 'ABP_Call_In_AUV_V2_C::Broke' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Fix_Tries) == 0x0003F4, "Member 'ABP_Call_In_AUV_V2_C::Fix_Tries' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, NS_ExtractionTunnel_Spawn) == 0x0003F8, "Member 'ABP_Call_In_AUV_V2_C::NS_ExtractionTunnel_Spawn' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, NS_ExtractionTunnel_Wormhole) == 0x000400, "Member 'ABP_Call_In_AUV_V2_C::NS_ExtractionTunnel_Wormhole' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, Eta_Timer) == 0x000408, "Member 'ABP_Call_In_AUV_V2_C::Eta_Timer' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, CountDownSequence) == 0x000410, "Member 'ABP_Call_In_AUV_V2_C::CountDownSequence' has a wrong offset!");
static_assert(offsetof(ABP_Call_In_AUV_V2_C, CurveFloat) == 0x000418, "Member 'ABP_Call_In_AUV_V2_C::CurveFloat' has a wrong offset!");

}

