#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Item

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_Item.BP_ContractRequirement_Item_C
// 0x0128 (0x0330 - 0x0208)
class UBP_ContractRequirement_Item_C : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CurrentNum;                                        // 0x0210(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ExchangeInfo                        Items;                                             // 0x0218(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UP2ItemData*                            OptionalItemDataToCompletion_;                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         InventoryNum;                                      // 0x0270(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StashNum;                                          // 0x0274(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APawn*, int32>                     NumPerPlayer;                                      // 0x0278(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AP2FacilityStash*>               Stashes;                                           // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          HideItemIconBeforeCollecting;                      // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Changed_Objective_text;                        // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveCompleted;                                // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ContractCompleted;                                 // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ObjectiveUncompleted;                              // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ItemAddedAnyTime;                                  // 0x0328(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowStash;                                        // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindTeamStateEvents(class AP2TeamStatePrivate* PrivateTeamState)	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Reset()	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void Calculate_Stash_Items()	 // 0xae1e64;
	void CalculateEquipmentManagerItems(bool IncludeSelf)	 // 0xae1e64;
	void CalculatePlayerItems(class APawn* Player)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_Item(int32 EntryPoint)	 // 0xae1e64;
	void GetItemsFromContainers(TArray<class UP2Container*>& Comtainers, TArray<class UP2Item*>* Items_0)	 // 0xae1e64;
	int32 GetLogCount()	 // 0xae1e64;
	void IsItemOwnerAlive(class UP2Item* Item, bool* IsAlive)	 // 0xae1e64;
	void OnFacilitySpotChanged(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)	 // 0xae1e64;
	void OnFinishActivateInitialExtentions(const class AP2PlayerState* InPlayerState)	 // 0xae1e64;
	void OnHidoutExtensionReady(bool UpdateState_0)	 // 0xae1e64;
	void OnItemChanged(class UP2Item* InItem, bool InAdded, int32 InStackDelta)	 // 0xae1e64;
	void OnItemsOnStashChanged(const class UP2Item* InItem, bool InAdded, int32 InStackDelta)	 // 0xae1e64;
	void OnMemberExfiltratedDelegate_Event(class AP2GameMode* GameMode, class AP2BaseCharacter* Character)	 // 0xae1e64;
	void OnPlayerJoiningTeam(const class AActor* PlayerJoining, const class AP2TeamStatePrivate* PreviousTeamStatePrivate, const class AP2TeamStatePrivate* NewTeamStatePrivate)	 // 0xae1e64;
	void OnPlayerLeavingTeam(const class AActor* PlayerLeaving, const class AP2TeamStatePrivate* PreviousTeamStatePrivate, const class AP2TeamStatePrivate* NewTeamStatePrivate)	 // 0xae1e64;
	void OnStashActorsChanged(bool CalculateItemsAndUpdate)	 // 0xae1e64;
	void OnTeamMemberDied(class AP2BaseCharacter* Character)	 // 0xae1e64;
	void OnTeamMemberPossessed(class APawn* PossessedPawn)	 // 0xae1e64;
	void OnTeamMemberUnpossessed(class APawn* UnpossessedPawn)	 // 0xae1e64;
	void Send_UI_Message()	 // 0xae1e64;
	void UnBindTeamStateEvents(class AP2TeamStatePrivate* PrivateTeamState)	 // 0xae1e64;
	void UpdateCurrentNum()	 // 0xae1e64;
	void UpdateState()	 // 0xae1e64;

	void FindStashContainerComponents(TArray<class UP2ContainerComponent*>* ReturnContainerComponents) const	 // 0xae1e64;
	void FindStashContainers(TArray<class UP2Container*>* ReturnContainers) const	 // 0xae1e64;
	class FText GetComplateLogTitle() const	 // 0xae1e64;
	class FText GetCount() const	 // 0xae1e64;
	void GetItemsFromEquipment(class UP2EquipmentManagerComponent* EquimentManager, TArray<class UP2Item*>* Items_0) const	 // 0xae1e64;
	bool GetShowItemIcon() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_Item_C">();
	}
	static class UBP_ContractRequirement_Item_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_Item_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_Item_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_Item_C");
static_assert(sizeof(UBP_ContractRequirement_Item_C) == 0x000330, "Wrong size on UBP_ContractRequirement_Item_C");
static_assert(offsetof(UBP_ContractRequirement_Item_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, CurrentNum) == 0x000210, "Member 'UBP_ContractRequirement_Item_C::CurrentNum' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, Items) == 0x000218, "Member 'UBP_ContractRequirement_Item_C::Items' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, OptionalItemDataToCompletion_) == 0x000268, "Member 'UBP_ContractRequirement_Item_C::OptionalItemDataToCompletion_' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, InventoryNum) == 0x000270, "Member 'UBP_ContractRequirement_Item_C::InventoryNum' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, StashNum) == 0x000274, "Member 'UBP_ContractRequirement_Item_C::StashNum' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, NumPerPlayer) == 0x000278, "Member 'UBP_ContractRequirement_Item_C::NumPerPlayer' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, Stashes) == 0x0002C8, "Member 'UBP_ContractRequirement_Item_C::Stashes' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, HideItemIconBeforeCollecting) == 0x0002D8, "Member 'UBP_ContractRequirement_Item_C::HideItemIconBeforeCollecting' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, Use_Changed_Objective_text) == 0x0002D9, "Member 'UBP_ContractRequirement_Item_C::Use_Changed_Objective_text' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, ObjectiveCompleted) == 0x0002E0, "Member 'UBP_ContractRequirement_Item_C::ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, ContractCompleted) == 0x0002F8, "Member 'UBP_ContractRequirement_Item_C::ContractCompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, ObjectiveUncompleted) == 0x000310, "Member 'UBP_ContractRequirement_Item_C::ObjectiveUncompleted' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, ItemAddedAnyTime) == 0x000328, "Member 'UBP_ContractRequirement_Item_C::ItemAddedAnyTime' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Item_C, AllowStash) == 0x000329, "Member 'UBP_ContractRequirement_Item_C::AllowStash' has a wrong offset!");

}

