#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContextRequirement_ClickCraftingRecipe

#include "Basic.hpp"

#include "E_ClickCraftingRecipeType_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContextRequirement_ClickCraftingRecipe.BP_ContextRequirement_ClickCraftingRecipe_C
// 0x0060 (0x00C0 - 0x0060)
class UBP_ContextRequirement_ClickCraftingRecipe_C final : public UP2GameplayContextRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UP2CraftingWidget>       CraftingWidget;                                    // 0x0068(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, InstancedReference, HasGetValueTypeHash)
	class FName                                   Widget_Name;                                       // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<E_ClickCraftingRecipeType>             RecipeTypes;                                       // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldLootOnlyRecipe;                              // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UnbindOnClickedEvent()	 // 0xae1e64;
	void OnMessageReceived_C08022E24B0F036E02BA758084DDAF1D(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnClickCraftingRecipe(class UP2CraftingItemWidget* InItemWidget, bool bIsChecked)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContextRequirement_ClickCraftingRecipe(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BindOnClickedEvent()	 // 0xae1e64;

	class FText GetRequirementDescription(bool bGetRichText) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContextRequirement_ClickCraftingRecipe_C">();
	}
	static class UBP_ContextRequirement_ClickCraftingRecipe_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContextRequirement_ClickCraftingRecipe_C>();
	}
};
static_assert(alignof(UBP_ContextRequirement_ClickCraftingRecipe_C) == 0x000008, "Wrong alignment on UBP_ContextRequirement_ClickCraftingRecipe_C");
static_assert(sizeof(UBP_ContextRequirement_ClickCraftingRecipe_C) == 0x0000C0, "Wrong size on UBP_ContextRequirement_ClickCraftingRecipe_C");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, UberGraphFrame) == 0x000060, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, CraftingWidget) == 0x000068, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::CraftingWidget' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, Widget_Name) == 0x000098, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::Widget_Name' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, Async_Action) == 0x0000A0, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, RecipeTypes) == 0x0000A8, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::RecipeTypes' has a wrong offset!");
static_assert(offsetof(UBP_ContextRequirement_ClickCraftingRecipe_C, ShouldLootOnlyRecipe) == 0x0000B8, "Member 'UBP_ContextRequirement_ClickCraftingRecipe_C::ShouldLootOnlyRecipe' has a wrong offset!");

}

