#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractAction_Togglable

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractAction_Togglable.BP_ContractAction_Togglable_C.IsAvailableForInteraction
// 0x0030 (0x0030 - 0x0000)
struct BP_ContractAction_Togglable_C_IsAvailableForInteraction final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2AvailableForInteractionResult       ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FP2AvailableForInteractionResult       K2Node_MakeStruct_P2AvailableForInteractionResult; // 0x0014(0x000C)(NoDestructor)
	struct FP2AvailableForInteractionResult       CallFunc_IsAvailableForInteraction_ReturnValue;    // 0x0020(0x000C)(NoDestructor)
};
static_assert(alignof(BP_ContractAction_Togglable_C_IsAvailableForInteraction) == 0x000008, "Wrong alignment on BP_ContractAction_Togglable_C_IsAvailableForInteraction");
static_assert(sizeof(BP_ContractAction_Togglable_C_IsAvailableForInteraction) == 0x000030, "Wrong size on BP_ContractAction_Togglable_C_IsAvailableForInteraction");
static_assert(offsetof(BP_ContractAction_Togglable_C_IsAvailableForInteraction, InPawn) == 0x000000, "Member 'BP_ContractAction_Togglable_C_IsAvailableForInteraction::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_IsAvailableForInteraction, ReturnValue) == 0x000008, "Member 'BP_ContractAction_Togglable_C_IsAvailableForInteraction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_IsAvailableForInteraction, K2Node_MakeStruct_P2AvailableForInteractionResult) == 0x000014, "Member 'BP_ContractAction_Togglable_C_IsAvailableForInteraction::K2Node_MakeStruct_P2AvailableForInteractionResult' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_IsAvailableForInteraction, CallFunc_IsAvailableForInteraction_ReturnValue) == 0x000020, "Member 'BP_ContractAction_Togglable_C_IsAvailableForInteraction::CallFunc_IsAvailableForInteraction_ReturnValue' has a wrong offset!");

// Function BP_ContractAction_Togglable.BP_ContractAction_Togglable_C.WasPerformedAlready
// 0x0010 (0x0010 - 0x0000)
struct BP_ContractAction_Togglable_C_WasPerformedAlready final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasPerformedAlready_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractAction_Togglable_C_WasPerformedAlready) == 0x000008, "Wrong alignment on BP_ContractAction_Togglable_C_WasPerformedAlready");
static_assert(sizeof(BP_ContractAction_Togglable_C_WasPerformedAlready) == 0x000010, "Wrong size on BP_ContractAction_Togglable_C_WasPerformedAlready");
static_assert(offsetof(BP_ContractAction_Togglable_C_WasPerformedAlready, InPawn) == 0x000000, "Member 'BP_ContractAction_Togglable_C_WasPerformedAlready::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_WasPerformedAlready, ReturnValue) == 0x000008, "Member 'BP_ContractAction_Togglable_C_WasPerformedAlready::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_WasPerformedAlready, CallFunc_WasPerformedAlready_ReturnValue) == 0x000009, "Member 'BP_ContractAction_Togglable_C_WasPerformedAlready::CallFunc_WasPerformedAlready_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_WasPerformedAlready, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_ContractAction_Togglable_C_WasPerformedAlready::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractAction_Togglable_C_WasPerformedAlready, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'BP_ContractAction_Togglable_C_WasPerformedAlready::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

