#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractStaticCondition_Anomaly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ContractStaticCondition_Anomaly.BP_ContractStaticCondition_Anomaly_C.CheckStaticCondition
// 0x0048 (0x0048 - 0x0000)
struct BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition final
{
public:
	const class UP2ContractData*                  InContractData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UObject*                          InWorldContextObject;                              // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2DynamicAnomaly*                      CallFunc_FindAnomalyActor_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateOn_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_WorldCheckIsAvailableUntilTime_OutDistance; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_WorldCheckIsAvailableUntilTime_OutClosestPoint; // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WorldCheckIsAvailableUntilTime_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_WorldCheckIsAvailableUntilTime_InUntilTime_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition) == 0x000008, "Wrong alignment on BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition");
static_assert(sizeof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition) == 0x000048, "Wrong size on BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, InContractData) == 0x000000, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::InContractData' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, InWorldContextObject) == 0x000008, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, ReturnValue) == 0x000010, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_FindAnomalyActor_ReturnValue) == 0x000018, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_FindAnomalyActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_IsStateOn_ReturnValue) == 0x000021, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_IsStateOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_WorldCheckIsAvailableUntilTime_OutDistance) == 0x000024, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_WorldCheckIsAvailableUntilTime_OutDistance' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_WorldCheckIsAvailableUntilTime_OutClosestPoint) == 0x000028, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_WorldCheckIsAvailableUntilTime_OutClosestPoint' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_WorldCheckIsAvailableUntilTime_ReturnValue) == 0x000040, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_WorldCheckIsAvailableUntilTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition, CallFunc_WorldCheckIsAvailableUntilTime_InUntilTime_ImplicitCast) == 0x000044, "Member 'BP_ContractStaticCondition_Anomaly_C_CheckStaticCondition::CallFunc_WorldCheckIsAvailableUntilTime_InUntilTime_ImplicitCast' has a wrong offset!");

}

