#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Craft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_Craft.BP_ContractRequirement_Craft_C
// 0x0020 (0x0228 - 0x0208)
class UBP_ContractRequirement_Craft_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AP2Facility_Craft*>              CraftFacilities;                                   // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, Transient, DisableEditOnInstance)
	class UP2ItemData*                            ItemToCraft;                                       // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Reset()	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_Craft(int32 EntryPoint)	 // 0xae1e64;
	void OnCancelCraft(const struct FP2CraftingDataRow& InCraftingRow)	 // 0xae1e64;
	void OnCancelCraftEvent_Event(class AP2Facility_Craft* InFacility, const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void OnFacilityAddedBindEvents(class AP2Facility_Craft* InFacitily)	 // 0xae1e64;
	void OnFacilitySpotDestroyed(class AP2FacilitySpot* FacilitySpot, class UP2FacilityData* FacilityData)	 // 0xae1e64;
	void OnFacilitySpotInstalled(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)	 // 0xae1e64;
	void OnStartCraft(const struct FP2CraftingDataRow& InCraftingRow)	 // 0xae1e64;
	void OnStartCraftEvent_Event(class AP2Facility_Craft* InFacility, const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_Craft_C">();
	}
	static class UBP_ContractRequirement_Craft_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_Craft_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_Craft_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_Craft_C");
static_assert(sizeof(UBP_ContractRequirement_Craft_C) == 0x000228, "Wrong size on UBP_ContractRequirement_Craft_C");
static_assert(offsetof(UBP_ContractRequirement_Craft_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_Craft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Craft_C, CraftFacilities) == 0x000210, "Member 'UBP_ContractRequirement_Craft_C::CraftFacilities' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Craft_C, ItemToCraft) == 0x000220, "Member 'UBP_ContractRequirement_Craft_C::ItemToCraft' has a wrong offset!");

}

