#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ContractRequirement_Contract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BP_Base_ContractRequirement_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ContractRequirement_Contract.BP_ContractRequirement_Contract_C
// 0x0030 (0x0238 - 0x0208)
class UBP_ContractRequirement_Contract_C final : public UBP_Base_ContractRequirement_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2ContractData*                        ContractData;                                      // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              WantedContractState;                               // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            RequiredCachedContract;                            // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CreateNewUIThread;                                 // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ContractRequirement_Contract(int32 EntryPoint)	 // 0xae1e64;
	void OnContractStateChanged(class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)	 // 0xae1e64;
	void OnRequiredContractStateChanged(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;
	const class UP2ContractData* GetPrecedingContractData() const	 // 0xae1e64;
	class FText GetTitle() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ContractRequirement_Contract_C">();
	}
	static class UBP_ContractRequirement_Contract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ContractRequirement_Contract_C>();
	}
};
static_assert(alignof(UBP_ContractRequirement_Contract_C) == 0x000008, "Wrong alignment on UBP_ContractRequirement_Contract_C");
static_assert(sizeof(UBP_ContractRequirement_Contract_C) == 0x000238, "Wrong size on UBP_ContractRequirement_Contract_C");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, UberGraphFrame) == 0x000208, "Member 'UBP_ContractRequirement_Contract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, ContractData) == 0x000210, "Member 'UBP_ContractRequirement_Contract_C::ContractData' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, WantedContractState) == 0x000218, "Member 'UBP_ContractRequirement_Contract_C::WantedContractState' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, Async_Action) == 0x000220, "Member 'UBP_ContractRequirement_Contract_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, RequiredCachedContract) == 0x000228, "Member 'UBP_ContractRequirement_Contract_C::RequiredCachedContract' has a wrong offset!");
static_assert(offsetof(UBP_ContractRequirement_Contract_C, CreateNewUIThread) == 0x000230, "Member 'UBP_ContractRequirement_Contract_C::CreateNewUIThread' has a wrong offset!");

}

