#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleHazard_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DestructibleHazard_Base.BP_DestructibleHazard_Base_C
// 0x0058 (0x0308 - 0x02B0)
class ABP_DestructibleHazard_Base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2DamageListenerComponent*             P2DamageListener;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2DestructibleComponent*               P2Destructible;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         DestroySpawnables;                                 // 0x02D8(0x0010)(Edit, BlueprintVisible)
	TSubclassOf<class UP2GameplayEffect_Damage>   Damage_Effect_Class;                               // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Penetration;                                       // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExplosionCameraShake;                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSpringSimData*                     ExplosionAnimSpring;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyEvent()	 // 0xae1e64;
	void ExecuteUbergraph_BP_DestructibleHazard_Base(int32 EntryPoint)	 // 0xae1e64;
	void OnHit(const struct FP2HitInfo& Info)	 // 0xae1e64;
	void PlayLocalCameraShakes()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_DestructibleHazard_Base_C">();
	}
	static class ABP_DestructibleHazard_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_DestructibleHazard_Base_C>();
	}
};
static_assert(alignof(ABP_DestructibleHazard_Base_C) == 0x000008, "Wrong alignment on ABP_DestructibleHazard_Base_C");
static_assert(sizeof(ABP_DestructibleHazard_Base_C) == 0x000308, "Wrong size on ABP_DestructibleHazard_Base_C");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_DestructibleHazard_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, P2DamageListener) == 0x0002B8, "Member 'ABP_DestructibleHazard_Base_C::P2DamageListener' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, P2Destructible) == 0x0002C0, "Member 'ABP_DestructibleHazard_Base_C::P2Destructible' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, StaticMesh) == 0x0002C8, "Member 'ABP_DestructibleHazard_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, DefaultSceneRoot) == 0x0002D0, "Member 'ABP_DestructibleHazard_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, DestroySpawnables) == 0x0002D8, "Member 'ABP_DestructibleHazard_Base_C::DestroySpawnables' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, Damage_Effect_Class) == 0x0002E8, "Member 'ABP_DestructibleHazard_Base_C::Damage_Effect_Class' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, Radius) == 0x0002F0, "Member 'ABP_DestructibleHazard_Base_C::Radius' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, Penetration) == 0x0002F4, "Member 'ABP_DestructibleHazard_Base_C::Penetration' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, ExplosionCameraShake) == 0x0002F8, "Member 'ABP_DestructibleHazard_Base_C::ExplosionCameraShake' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_C, ExplosionAnimSpring) == 0x000300, "Member 'ABP_DestructibleHazard_Base_C::ExplosionAnimSpring' has a wrong offset!");

}

