#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Drone_ExtractionDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AICommon_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Drone_ExtractionDrone.BP_Drone_ExtractionDrone_C
// 0x00C0 (0x0DC0 - 0x0D00)
class ABP_Drone_ExtractionDrone_C final : public AP2ExtractionDroneActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        RotorMotion;                                       // 0x0D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FLRotorMotion;                                     // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FRRotorMotion;                                     // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BLRotorMotion;                                     // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BRRotorMotion;                                     // 0x0D28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0D30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_SmokeTrail;                                     // 0x0D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_GroundCollision;                                // 0x0D40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Explosion;                                      // 0x0D48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_DamagedSmoke;                                   // 0x0D50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  AkAmbientComponent;                                // 0x0D58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Countdown;                     // 0x0D60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ARV_Container;                                  // 0x0D68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReplicatedVelocity;                                // 0x0D70(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Deploy;                                            // 0x0D88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D89[0x7];                                      // 0x0D89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          DeployAkEvent;                                     // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ShotDownAkEvent;                                   // 0x0D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UP2MapMarkerComponent>      DroneMarkerComp;                                   // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UP2MapMarkerComponent*                  DroneMapMarker;                                    // 0x0DA8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           RotorBoneNames;                                    // 0x0DB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CreateMapMarker()	 // 0xae1e64;
	void DestroyMapMarker()	 // 0xae1e64;
	void DroneShotDownSFX(class UP2HealthComponent* HealthComponent_0, const struct FP2FinalBlowImpulseData& Impulse)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Drone_ExtractionDrone(int32 EntryPoint)	 // 0xae1e64;
	void HandleGroundCollision()	 // 0xae1e64;
	void Initlialize()	 // 0xae1e64;
	void OnDamageUp()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void SetRotorsVisibility(bool Visible)	 // 0xae1e64;
	void StartFlyingSFX()	 // 0xae1e64;
	void StartTunnelVFX()	 // 0xae1e64;
	void StopFlyingSFX()	 // 0xae1e64;
	void Transfer_to_actor()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Drone_ExtractionDrone_C">();
	}
	static class ABP_Drone_ExtractionDrone_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Drone_ExtractionDrone_C>();
	}
};
static_assert(alignof(ABP_Drone_ExtractionDrone_C) == 0x000010, "Wrong alignment on ABP_Drone_ExtractionDrone_C");
static_assert(sizeof(ABP_Drone_ExtractionDrone_C) == 0x000DC0, "Wrong size on ABP_Drone_ExtractionDrone_C");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, UberGraphFrame) == 0x000D00, "Member 'ABP_Drone_ExtractionDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, RotorMotion) == 0x000D08, "Member 'ABP_Drone_ExtractionDrone_C::RotorMotion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, FLRotorMotion) == 0x000D10, "Member 'ABP_Drone_ExtractionDrone_C::FLRotorMotion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, FRRotorMotion) == 0x000D18, "Member 'ABP_Drone_ExtractionDrone_C::FRRotorMotion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, BLRotorMotion) == 0x000D20, "Member 'ABP_Drone_ExtractionDrone_C::BLRotorMotion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, BRRotorMotion) == 0x000D28, "Member 'ABP_Drone_ExtractionDrone_C::BRRotorMotion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, Decal) == 0x000D30, "Member 'ABP_Drone_ExtractionDrone_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, NS_SmokeTrail) == 0x000D38, "Member 'ABP_Drone_ExtractionDrone_C::NS_SmokeTrail' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, NS_GroundCollision) == 0x000D40, "Member 'ABP_Drone_ExtractionDrone_C::NS_GroundCollision' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, NS_Explosion) == 0x000D48, "Member 'ABP_Drone_ExtractionDrone_C::NS_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, NS_DamagedSmoke) == 0x000D50, "Member 'ABP_Drone_ExtractionDrone_C::NS_DamagedSmoke' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, AkAmbientComponent) == 0x000D58, "Member 'ABP_Drone_ExtractionDrone_C::AkAmbientComponent' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, NS_ExtractionTunnel_Countdown) == 0x000D60, "Member 'ABP_Drone_ExtractionDrone_C::NS_ExtractionTunnel_Countdown' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, SM_ARV_Container) == 0x000D68, "Member 'ABP_Drone_ExtractionDrone_C::SM_ARV_Container' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, ReplicatedVelocity) == 0x000D70, "Member 'ABP_Drone_ExtractionDrone_C::ReplicatedVelocity' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, Deploy) == 0x000D88, "Member 'ABP_Drone_ExtractionDrone_C::Deploy' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, DeployAkEvent) == 0x000D90, "Member 'ABP_Drone_ExtractionDrone_C::DeployAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, ShotDownAkEvent) == 0x000D98, "Member 'ABP_Drone_ExtractionDrone_C::ShotDownAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, DroneMarkerComp) == 0x000DA0, "Member 'ABP_Drone_ExtractionDrone_C::DroneMarkerComp' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, DroneMapMarker) == 0x000DA8, "Member 'ABP_Drone_ExtractionDrone_C::DroneMapMarker' has a wrong offset!");
static_assert(offsetof(ABP_Drone_ExtractionDrone_C, RotorBoneNames) == 0x000DB0, "Member 'ABP_Drone_ExtractionDrone_C::RotorBoneNames' has a wrong offset!");

}

