#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DynamicAnomaly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_DynamicAnomaly.BP_DynamicAnomaly_C.AnomalyPulseTrigger
// 0x0004 (0x0004 - 0x0000)
struct BP_DynamicAnomaly_C_AnomalyPulseTrigger final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DynamicAnomaly_C_AnomalyPulseTrigger) == 0x000004, "Wrong alignment on BP_DynamicAnomaly_C_AnomalyPulseTrigger");
static_assert(sizeof(BP_DynamicAnomaly_C_AnomalyPulseTrigger) == 0x000004, "Wrong size on BP_DynamicAnomaly_C_AnomalyPulseTrigger");
static_assert(offsetof(BP_DynamicAnomaly_C_AnomalyPulseTrigger, Intensity) == 0x000000, "Member 'BP_DynamicAnomaly_C_AnomalyPulseTrigger::Intensity' has a wrong offset!");

// Function BP_DynamicAnomaly.BP_DynamicAnomaly_C.ExecuteUbergraph_BP_DynamicAnomaly
// 0x0218 (0x0218 - 0x0000)
struct BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController_Hideout*            CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool InValue)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InValue;                        // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Call_In_AUV_V2_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0078(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2AnomalyReplicatedInfo               CallFunc_GetAnomalyInfo_ReturnValue;               // 0x0098(0x0020)(ConstParm, NoDestructor)
	TArray<class ABP_ExfilAUV_Managed_C*>         CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00B8(0x0010)(ReferenceParm)
	struct FP2AnomalyReplicatedInfo               CallFunc_GetAnomalyInfo_ReturnValue_1;             // 0x00C8(0x0020)(ConstParm, NoDestructor)
	class ABP_ExfilAUV_Managed_C*                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2AnomalyReplicatedInfo               CallFunc_GetAnomalyInfo_ReturnValue_2;             // 0x00F4(0x0020)(ConstParm, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Intensity;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ZoneAtmos_Base_C*                   K2Node_DynamicCast_AsBP_Zone_Atmos_Base;           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZoneAtmos_Base*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2AnomalyReplicatedInfo               CallFunc_GetAnomalyInfo_ReturnValue_3;             // 0x0140(0x0020)(ConstParm, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Call_In_AUV_V2_C*                   CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2AnomalyConfig*                 CallFunc_GetAnomalyConfigDifficulty_ReturnValue;   // 0x0170(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnomalyWarningValueByKey_ReturnValue;  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0180(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly) == 0x000008, "Wrong alignment on BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly");
static_assert(sizeof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly) == 0x000218, "Wrong size on BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, EntryPoint) == 0x000000, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, Temp_int_Array_Index_Variable) == 0x000070, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_HasAuthority_ReturnValue) == 0x000074, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_HasAuthority_ReturnValue_1) == 0x000075, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_HasAuthority_ReturnValue_2) == 0x000076, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_CustomEvent_InValue) == 0x000077, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_CustomEvent_InValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAllActorsOfClass_OutActors) == 0x000078, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyInfo_ReturnValue) == 0x000098, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000B8, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyInfo_ReturnValue_1) == 0x0000C8, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyInfo_ReturnValue_2) == 0x0000F4, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, Temp_int_Loop_Counter_Variable_1) == 0x000114, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000118, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Less_IntInt_ReturnValue_1) == 0x00011A, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_Event_Intensity) == 0x000120, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_Event_Intensity' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_IsValid_ReturnValue) == 0x000124, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_DynamicCast_AsBP_Zone_Atmos_Base) == 0x000128, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_DynamicCast_AsBP_Zone_Atmos_Base' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetActorOfClass_ReturnValue) == 0x000138, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyInfo_ReturnValue_3) == 0x000140, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, Temp_int_Array_Index_Variable_1) == 0x000160, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyConfigDifficulty_ReturnValue) == 0x000170, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyConfigDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_GetAnomalyWarningValueByKey_ReturnValue) == 0x000178, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_GetAnomalyWarningValueByKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_MakeStruct_FormatArgumentData_1) == 0x000180, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, K2Node_MakeArray_Array) == 0x0001D0, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Format_ReturnValue) == 0x0001E0, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_Vector_Zero_ReturnValue) == 0x0001F8, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000210, "Member 'BP_DynamicAnomaly_C_ExecuteUbergraph_BP_DynamicAnomaly::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DynamicAnomaly.BP_DynamicAnomaly_C.OnStateChanged_Event
// 0x0001 (0x0001 - 0x0000)
struct BP_DynamicAnomaly_C_OnStateChanged_Event final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DynamicAnomaly_C_OnStateChanged_Event) == 0x000001, "Wrong alignment on BP_DynamicAnomaly_C_OnStateChanged_Event");
static_assert(sizeof(BP_DynamicAnomaly_C_OnStateChanged_Event) == 0x000001, "Wrong size on BP_DynamicAnomaly_C_OnStateChanged_Event");
static_assert(offsetof(BP_DynamicAnomaly_C_OnStateChanged_Event, InValue) == 0x000000, "Member 'BP_DynamicAnomaly_C_OnStateChanged_Event::InValue' has a wrong offset!");

}

