#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrowningImmunity_Component

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DrowningImmunity_Component.BP_DrowningImmunity_Component_C.CheckInWater
// 0x0068 (0x0068 - 0x0000)
struct BP_DrowningImmunity_Component_C_CheckInWater final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilitySystemComponent*              CallFunc_GetP2AbilitySystemComponent_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeXY_ReturnValue;                      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DrowningImmunity_Component_C_CheckInWater) == 0x000008, "Wrong alignment on BP_DrowningImmunity_Component_C_CheckInWater");
static_assert(sizeof(BP_DrowningImmunity_Component_C_CheckInWater) == 0x000068, "Wrong size on BP_DrowningImmunity_Component_C_CheckInWater");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, DeltaTime) == 0x000000, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_GetP2AbilitySystemComponent_ReturnValue) == 0x000010, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_GetP2AbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000024, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000031, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000040, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_VSizeXY_ReturnValue) == 0x000058, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_VSizeXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_CheckInWater, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_DrowningImmunity_Component_C_CheckInWater::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_DrowningImmunity_Component.BP_DrowningImmunity_Component_C.ExecuteUbergraph_BP_DrowningImmunity_Component
// 0x0060 (0x0060 - 0x0000)
struct BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              CallFunc_GetP2AbilitySystemComponent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_CheckInWater_DeltaTime_ImplicitCast;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component) == 0x000008, "Wrong alignment on BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component");
static_assert(sizeof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component) == 0x000060, "Wrong size on BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, EntryPoint) == 0x000000, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_GetP2AbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_GetP2AbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000024, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_GetOwner_ReturnValue) == 0x000038, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, K2Node_DynamicCast_AsP2Hero_Character) == 0x000048, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component, CallFunc_CheckInWater_DeltaTime_ImplicitCast) == 0x000058, "Member 'BP_DrowningImmunity_Component_C_ExecuteUbergraph_BP_DrowningImmunity_Component::CallFunc_CheckInWater_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_DrowningImmunity_Component.BP_DrowningImmunity_Component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DrowningImmunity_Component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DrowningImmunity_Component_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DrowningImmunity_Component_C_ReceiveTick");
static_assert(sizeof(BP_DrowningImmunity_Component_C_ReceiveTick) == 0x000004, "Wrong size on BP_DrowningImmunity_Component_C_ReceiveTick");
static_assert(offsetof(BP_DrowningImmunity_Component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DrowningImmunity_Component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

