#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Debug_HealthBar_Component

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Debug_HealthBar_Component.BP_Debug_HealthBar_Component_C.ApplyState
// 0x0001 (0x0001 - 0x0000)
struct BP_Debug_HealthBar_Component_C_ApplyState final
{
public:
	bool                                          InEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_HealthBar_Component_C_ApplyState) == 0x000001, "Wrong alignment on BP_Debug_HealthBar_Component_C_ApplyState");
static_assert(sizeof(BP_Debug_HealthBar_Component_C_ApplyState) == 0x000001, "Wrong size on BP_Debug_HealthBar_Component_C_ApplyState");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ApplyState, InEnabled) == 0x000000, "Member 'BP_Debug_HealthBar_Component_C_ApplyState::InEnabled' has a wrong offset!");

// Function BP_Debug_HealthBar_Component.BP_Debug_HealthBar_Component_C.CheckDeath
// 0x0018 (0x0018 - 0x0000)
struct BP_Debug_HealthBar_Component_C_CheckDeath final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_HealthBar_Component_C_CheckDeath) == 0x000008, "Wrong alignment on BP_Debug_HealthBar_Component_C_CheckDeath");
static_assert(sizeof(BP_Debug_HealthBar_Component_C_CheckDeath) == 0x000018, "Wrong size on BP_Debug_HealthBar_Component_C_CheckDeath");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_CheckDeath, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_Debug_HealthBar_Component_C_CheckDeath::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_CheckDeath, K2Node_DynamicCast_AsP2Base_Character) == 0x000008, "Member 'BP_Debug_HealthBar_Component_C_CheckDeath::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_CheckDeath, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Debug_HealthBar_Component_C_CheckDeath::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_CheckDeath, CallFunc_IsDead_ReturnValue) == 0x000011, "Member 'BP_Debug_HealthBar_Component_C_CheckDeath::CallFunc_IsDead_ReturnValue' has a wrong offset!");

// Function BP_Debug_HealthBar_Component.BP_Debug_HealthBar_Component_C.ExecuteUbergraph_BP_Debug_HealthBar_Component
// 0x0178 (0x0178 - 0x0000)
struct BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETickMode                                     Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETickMode                                     Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_Debug_HealthBar_C*                   K2Node_DynamicCast_AsW_Debug_Health_Bar;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0070(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_InEnabled;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETickMode                                     K2Node_Select_Default;                             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue_1;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component) == 0x000008, "Wrong alignment on BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component");
static_assert(sizeof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component) == 0x000178, "Wrong size on BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, EntryPoint) == 0x000000, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_byte_Variable) == 0x000008, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_Conv_IntToBool_ReturnValue) == 0x000009, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_byte_Variable_1) == 0x00000A, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_GetWidget_ReturnValue) == 0x000010, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_DynamicCast_AsW_Debug_Health_Bar) == 0x000020, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_DynamicCast_AsW_Debug_Health_Bar' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_DynamicCast_AsP2Base_Character) == 0x000030, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_bool_Variable) == 0x000039, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000048, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x00004C, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_IsLocallyControlled_ReturnValue) == 0x000068, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000070, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_CustomEvent_InEnabled) == 0x000158, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_CustomEvent_InEnabled' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_byte_Variable_2) == 0x000159, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_Select_Default) == 0x00015A, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_GetWidget_ReturnValue_1) == 0x000160, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_GetWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_byte_Variable_3) == 0x000169, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, Temp_bool_Variable_1) == 0x00016A, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, K2Node_Select_Default_1) == 0x00016B, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component, CallFunc_MakeVector_Z_ImplicitCast) == 0x000170, "Member 'BP_Debug_HealthBar_Component_C_ExecuteUbergraph_BP_Debug_HealthBar_Component::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function BP_Debug_HealthBar_Component.BP_Debug_HealthBar_Component_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Debug_HealthBar_Component_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Debug_HealthBar_Component_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Debug_HealthBar_Component_C_ReceiveTick");
static_assert(sizeof(BP_Debug_HealthBar_Component_C_ReceiveTick) == 0x000004, "Wrong size on BP_Debug_HealthBar_Component_C_ReceiveTick");
static_assert(offsetof(BP_Debug_HealthBar_Component_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Debug_HealthBar_Component_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

