#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DynamicAnomaly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DynamicAnomaly.BP_DynamicAnomaly_C
// 0x0050 (0x0790 - 0x0740)
class ABP_DynamicAnomaly_C final : public AP2DynamicAnomaly
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0740(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraPlayer;                                     // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PulseOnoff_Pulse_304FCD8444746A0D7EFA55BE6927D657; // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PulseOnoff__Direction_304FCD8444746A0D7EFA55BE6927D657; // 0x075C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PulseOnOff;                                        // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Pulse_8DF231C546AB102B35714996C6E21B99;   // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_8DF231C546AB102B35714996C6E21B99; // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76D[0x3];                                      // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Pulse_Timeline_Pulse_521302D44A648854FEEF8C8D7CB1A1CF; // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pulse_Timeline__Direction_521302D44A648854FEEF8C8D7CB1A1CF; // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pulse_Timeline;                                    // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AZoneAtmos_Base*                        ZoneAtmos;                                         // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnomalyPulseTrigger(float Intensity)	 // 0xae1e64;
	void ExecuteUbergraph_BP_DynamicAnomaly(int32 EntryPoint)	 // 0xae1e64;
	void OnMatchStarting()	 // 0xae1e64;
	void OnStateChanged_Event(bool InValue)	 // 0xae1e64;
	void Pulse_Timeline__FinishedFunc()	 // 0xae1e64;
	void Pulse_Timeline__UpdateFunc()	 // 0xae1e64;
	void PulseOnoff__FinishedFunc()	 // 0xae1e64;
	void PulseOnoff__UpdateFunc()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_DynamicAnomaly_C">();
	}
	static class ABP_DynamicAnomaly_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_DynamicAnomaly_C>();
	}
};
static_assert(alignof(ABP_DynamicAnomaly_C) == 0x000010, "Wrong alignment on ABP_DynamicAnomaly_C");
static_assert(sizeof(ABP_DynamicAnomaly_C) == 0x000790, "Wrong size on ABP_DynamicAnomaly_C");
static_assert(offsetof(ABP_DynamicAnomaly_C, UberGraphFrame) == 0x000740, "Member 'ABP_DynamicAnomaly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, NiagaraPlayer) == 0x000748, "Member 'ABP_DynamicAnomaly_C::NiagaraPlayer' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Niagara) == 0x000750, "Member 'ABP_DynamicAnomaly_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, PulseOnoff_Pulse_304FCD8444746A0D7EFA55BE6927D657) == 0x000758, "Member 'ABP_DynamicAnomaly_C::PulseOnoff_Pulse_304FCD8444746A0D7EFA55BE6927D657' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, PulseOnoff__Direction_304FCD8444746A0D7EFA55BE6927D657) == 0x00075C, "Member 'ABP_DynamicAnomaly_C::PulseOnoff__Direction_304FCD8444746A0D7EFA55BE6927D657' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, PulseOnOff) == 0x000760, "Member 'ABP_DynamicAnomaly_C::PulseOnOff' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Timeline_Pulse_8DF231C546AB102B35714996C6E21B99) == 0x000768, "Member 'ABP_DynamicAnomaly_C::Timeline_Pulse_8DF231C546AB102B35714996C6E21B99' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Timeline__Direction_8DF231C546AB102B35714996C6E21B99) == 0x00076C, "Member 'ABP_DynamicAnomaly_C::Timeline__Direction_8DF231C546AB102B35714996C6E21B99' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Timeline) == 0x000770, "Member 'ABP_DynamicAnomaly_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Pulse_Timeline_Pulse_521302D44A648854FEEF8C8D7CB1A1CF) == 0x000778, "Member 'ABP_DynamicAnomaly_C::Pulse_Timeline_Pulse_521302D44A648854FEEF8C8D7CB1A1CF' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Pulse_Timeline__Direction_521302D44A648854FEEF8C8D7CB1A1CF) == 0x00077C, "Member 'ABP_DynamicAnomaly_C::Pulse_Timeline__Direction_521302D44A648854FEEF8C8D7CB1A1CF' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, Pulse_Timeline) == 0x000780, "Member 'ABP_DynamicAnomaly_C::Pulse_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_DynamicAnomaly_C, ZoneAtmos) == 0x000788, "Member 'ABP_DynamicAnomaly_C::ZoneAtmos' has a wrong offset!");

}

