#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrowningImmunity_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrowningImmunity_Component.BP_DrowningImmunity_Component_C
// 0x0048 (0x0110 - 0x00C8)
class UBP_DrowningImmunity_Component_C final : public UP2PawnComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AP2HeroCharacter*                       Hero;                                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         ImmunityEffects;                                   // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsInWater;                                         // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    ImmunityEffectHandles;                             // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        InputBuffer;                                       // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InputDurationThreshold;                            // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckInWater(double DeltaTime)	 // 0xae1e64;
	void ExecuteUbergraph_BP_DrowningImmunity_Component(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_DrowningImmunity_Component_C">();
	}
	static class UBP_DrowningImmunity_Component_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_DrowningImmunity_Component_C>();
	}
};
static_assert(alignof(UBP_DrowningImmunity_Component_C) == 0x000008, "Wrong alignment on UBP_DrowningImmunity_Component_C");
static_assert(sizeof(UBP_DrowningImmunity_Component_C) == 0x000110, "Wrong size on UBP_DrowningImmunity_Component_C");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, UberGraphFrame) == 0x0000C8, "Member 'UBP_DrowningImmunity_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, Hero) == 0x0000D0, "Member 'UBP_DrowningImmunity_Component_C::Hero' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, ImmunityEffects) == 0x0000D8, "Member 'UBP_DrowningImmunity_Component_C::ImmunityEffects' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, IsInWater) == 0x0000E8, "Member 'UBP_DrowningImmunity_Component_C::IsInWater' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, ImmunityEffectHandles) == 0x0000F0, "Member 'UBP_DrowningImmunity_Component_C::ImmunityEffectHandles' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, InputBuffer) == 0x000100, "Member 'UBP_DrowningImmunity_Component_C::InputBuffer' has a wrong offset!");
static_assert(offsetof(UBP_DrowningImmunity_Component_C, InputDurationThreshold) == 0x000108, "Member 'UBP_DrowningImmunity_Component_C::InputDurationThreshold' has a wrong offset!");

}

