#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleHazard_Base_Proximity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_DestructibleHazard_Base_Proximity_C_BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity
// 0x01E8 (0x01E8 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2CharacterMovementComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue_1;         // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWalking_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentAcceleration_ReturnValue;       // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMovementSpeedIndex_ReturnValue;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_1;  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_2;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetTimelineEffects_OnAlert_Value_ImplicitCast; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity) == 0x0001E8, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, EntryPoint) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_TryPostEventOnAkComponent_ReturnValue) == 0x000004, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_TryPostEventOnAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_AsCharacter) == 0x000110, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_AsPawn) == 0x000120, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_IsPlayerControlled_ReturnValue) == 0x000129, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_GetComponentByClass_ReturnValue) == 0x000130, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000138, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherActor) == 0x000140, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherComp) == 0x000148, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000150, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_AsPawn_1) == 0x000158, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_AsPawn_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_DynamicCast_bSuccess_2) == 0x000160, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_IsPlayerControlled_ReturnValue_1) == 0x000161, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_IsPlayerControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, K2Node_Event_DeltaSeconds) == 0x000164, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_IsWalking_ReturnValue) == 0x000168, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_IsWalking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Not_PreBool_ReturnValue) == 0x000169, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_GetCurrentAcceleration_ReturnValue) == 0x000170, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_GetCurrentAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_GetMovementSpeedIndex_ReturnValue) == 0x000188, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_GetMovementSpeedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_BreakVector_X) == 0x000190, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_BreakVector_Y) == 0x000198, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_BreakVector_Z) == 0x0001A0, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0001B8, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_HasAuthority_ReturnValue) == 0x0001C1, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001C2, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0001C3, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x0001C8, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_TryPostEventOnAkComponent_ReturnValue_1) == 0x0001D0, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_TryPostEventOnAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_TryPostEventOnAkComponent_ReturnValue_2) == 0x0001D4, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_TryPostEventOnAkComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_SetTimelineEffects_OnAlert_Value_ImplicitCast) == 0x0001D8, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_SetTimelineEffects_OnAlert_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001E0, "Member 'BP_DestructibleHazard_Base_Proximity_C_ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.OnRep_ActivateProximity
// 0x0020 (0x0020 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity) == 0x000020, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000018, "Member 'BP_DestructibleHazard_Base_Proximity_C_OnRep_ActivateProximity::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.OnTimelineFinished
// 0x0004 (0x0004 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished final
{
public:
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished) == 0x000004, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished) == 0x000004, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished, CallFunc_TryPostEventOnAkComponent_ReturnValue) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_OnTimelineFinished::CallFunc_TryPostEventOnAkComponent_ReturnValue' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_ReceiveTick");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_ReceiveTick) == 0x000004, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_ReceiveTick");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.SetTimelineEffects_OnAlert
// 0x0030 (0x0030 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_A_ImplicitCast;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert) == 0x000030, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, Value) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::Value' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, CallFunc_Sin_ReturnValue) == 0x000008, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, CallFunc_Abs_ReturnValue) == 0x000010, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, CallFunc_Sin_A_ImplicitCast) == 0x000020, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::CallFunc_Sin_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000028, "Member 'BP_DestructibleHazard_Base_Proximity_C_SetTimelineEffects_OnAlert::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.UpdateTimelineEffects
// 0x0004 (0x0004 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects) == 0x000004, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects) == 0x000004, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects, Value) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_UpdateTimelineEffects::Value' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.IsAvailableForInteraction
// 0x0001 (0x0001 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction) == 0x000001, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction) == 0x000001, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction, ReturnValue) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteraction::ReturnValue' has a wrong offset!");

// Function BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C.IsAvailableForInteractionForPawn
// 0x0010 (0x0010 - 0x0000)
struct BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn");
static_assert(sizeof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn) == 0x000010, "Wrong size on BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn, InPawn) == 0x000000, "Member 'BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn::InPawn' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn, ReturnValue) == 0x000008, "Member 'BP_DestructibleHazard_Base_Proximity_C_IsAvailableForInteractionForPawn::ReturnValue' has a wrong offset!");

}

