#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleHazard_Base_Proximity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BP_DestructibleHazard_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DestructibleHazard_Base_Proximity.BP_DestructibleHazard_Base_Proximity_C
// 0x0068 (0x0370 - 0x0308)
class ABP_DestructibleHazard_Base_Proximity_C : public ABP_DestructibleHazard_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DestructibleHazard_Base_Proximity_C; // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Shot_DestroyAlpha_65DA04AE485B6A0DC7E4F59B274248FE; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Shot__Direction_65DA04AE485B6A0DC7E4F59B274248FE; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Shot;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_DestroyAlpha_731F0B684C731B9FC4C731A80DEF47BC; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_731F0B684C731B9FC4C731A80DEF47BC; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ActivateProximity;                                 // 0x0340(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	EP2DestructibleState                          New_Destructible_State_0;                          // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          InflateAudioEvent;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             ActorCharacter;                                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UP2CharacterMovementComponent*          CompCharMovement;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroyed;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOnAlert;                                         // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AlertTimer;                                        // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_DestructibleHazard_Base_Proximity_P2Destructible_K2Node_ComponentBoundEvent_2_OnDestructibleDestroyed__DelegateSignature()	 // 0xae1e64;
	void BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)	 // 0xae1e64;
	void BndEvt__BP_DestructibleHazard_Base_Proximity_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)	 // 0xae1e64;
	void ExecuteUbergraph_BP_DestructibleHazard_Base_Proximity(int32 EntryPoint)	 // 0xae1e64;
	void OnRep_ActivateProximity()	 // 0xae1e64;
	void OnRep_DisableTick()	 // 0xae1e64;
	void OnTimelineFinished()	 // 0xae1e64;
	void PlayAnimation()	 // 0xae1e64;
	void PlayAnimationShot()	 // 0xae1e64;
	void PlayLocalCameraShakes()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ResetTimelineEffects()	 // 0xae1e64;
	void SetTimelineEffects_OnAlert(float Value)	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;
	void Timeline_Shot__FinishedFunc()	 // 0xae1e64;
	void Timeline_Shot__UpdateFunc()	 // 0xae1e64;
	void UpdateTimelineEffects(float Value)	 // 0xae1e64;

	bool IsAvailableForInteraction() const	 // 0xae1e64;
	bool IsAvailableForInteractionForPawn(const class APawn* InPawn) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_DestructibleHazard_Base_Proximity_C">();
	}
	static class ABP_DestructibleHazard_Base_Proximity_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_DestructibleHazard_Base_Proximity_C>();
	}
};
static_assert(alignof(ABP_DestructibleHazard_Base_Proximity_C) == 0x000008, "Wrong alignment on ABP_DestructibleHazard_Base_Proximity_C");
static_assert(sizeof(ABP_DestructibleHazard_Base_Proximity_C) == 0x000370, "Wrong size on ABP_DestructibleHazard_Base_Proximity_C");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, UberGraphFrame_BP_DestructibleHazard_Base_Proximity_C) == 0x000308, "Member 'ABP_DestructibleHazard_Base_Proximity_C::UberGraphFrame_BP_DestructibleHazard_Base_Proximity_C' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Ak) == 0x000310, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Sphere) == 0x000318, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline_Shot_DestroyAlpha_65DA04AE485B6A0DC7E4F59B274248FE) == 0x000320, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline_Shot_DestroyAlpha_65DA04AE485B6A0DC7E4F59B274248FE' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline_Shot__Direction_65DA04AE485B6A0DC7E4F59B274248FE) == 0x000324, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline_Shot__Direction_65DA04AE485B6A0DC7E4F59B274248FE' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline_Shot) == 0x000328, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline_Shot' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline_DestroyAlpha_731F0B684C731B9FC4C731A80DEF47BC) == 0x000330, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline_DestroyAlpha_731F0B684C731B9FC4C731A80DEF47BC' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline__Direction_731F0B684C731B9FC4C731A80DEF47BC) == 0x000334, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline__Direction_731F0B684C731B9FC4C731A80DEF47BC' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, Timeline) == 0x000338, "Member 'ABP_DestructibleHazard_Base_Proximity_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, ActivateProximity) == 0x000340, "Member 'ABP_DestructibleHazard_Base_Proximity_C::ActivateProximity' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, New_Destructible_State_0) == 0x000341, "Member 'ABP_DestructibleHazard_Base_Proximity_C::New_Destructible_State_0' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, InflateAudioEvent) == 0x000348, "Member 'ABP_DestructibleHazard_Base_Proximity_C::InflateAudioEvent' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, ActorCharacter) == 0x000350, "Member 'ABP_DestructibleHazard_Base_Proximity_C::ActorCharacter' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, CompCharMovement) == 0x000358, "Member 'ABP_DestructibleHazard_Base_Proximity_C::CompCharMovement' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, IsDestroyed) == 0x000360, "Member 'ABP_DestructibleHazard_Base_Proximity_C::IsDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, IsOnAlert) == 0x000361, "Member 'ABP_DestructibleHazard_Base_Proximity_C::IsOnAlert' has a wrong offset!");
static_assert(offsetof(ABP_DestructibleHazard_Base_Proximity_C, AlertTimer) == 0x000368, "Member 'ABP_DestructibleHazard_Base_Proximity_C::AlertTimer' has a wrong offset!");

}

