#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleHazard_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_DestructibleHazard_Base.BP_DestructibleHazard_Base_C.ExecuteUbergraph_BP_DestructibleHazard_Base
// 0x0220 (0x0220 - 0x0000)
struct BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilitySystemComponent*              CallFunc_AddComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2HitInfo                             K2Node_Event_Info;                                 // 0x0018(0x0108)(ConstParm, NoDestructor, ContainsInstancedReference)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_158[0x8];                                      // 0x0158(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base) == 0x000010, "Wrong alignment on BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base");
static_assert(sizeof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base) == 0x000220, "Wrong size on BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, EntryPoint) == 0x000000, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_AddComponentByClass_ReturnValue) == 0x000008, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, K2Node_Event_Info) == 0x000018, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000120, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, Temp_int_Loop_Counter_Variable) == 0x00013C, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000140, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_Less_IntInt_ReturnValue) == 0x0001C0, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001C8, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D0, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_Add_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_IsValidClass_ReturnValue) == 0x0001DC, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_GetComponentBounds_Origin) == 0x0001E0, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_GetComponentBounds_BoxExtent) == 0x0001F8, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base, CallFunc_GetComponentBounds_SphereRadius) == 0x000210, "Member 'BP_DestructibleHazard_Base_C_ExecuteUbergraph_BP_DestructibleHazard_Base::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");

// Function BP_DestructibleHazard_Base.BP_DestructibleHazard_Base_C.OnHit
// 0x0108 (0x0108 - 0x0000)
struct BP_DestructibleHazard_Base_C_OnHit final
{
public:
	struct FP2HitInfo                             Info;                                              // 0x0000(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_DestructibleHazard_Base_C_OnHit) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_C_OnHit");
static_assert(sizeof(BP_DestructibleHazard_Base_C_OnHit) == 0x000108, "Wrong size on BP_DestructibleHazard_Base_C_OnHit");
static_assert(offsetof(BP_DestructibleHazard_Base_C_OnHit, Info) == 0x000000, "Member 'BP_DestructibleHazard_Base_C_OnHit::Info' has a wrong offset!");

// Function BP_DestructibleHazard_Base.BP_DestructibleHazard_Base_C.PlayLocalCameraShakes
// 0x0018 (0x0018 - 0x0000)
struct BP_DestructibleHazard_Base_C_PlayLocalCameraShakes final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DestructibleHazard_Base_C_PlayLocalCameraShakes) == 0x000008, "Wrong alignment on BP_DestructibleHazard_Base_C_PlayLocalCameraShakes");
static_assert(sizeof(BP_DestructibleHazard_Base_C_PlayLocalCameraShakes) == 0x000018, "Wrong size on BP_DestructibleHazard_Base_C_PlayLocalCameraShakes");
static_assert(offsetof(BP_DestructibleHazard_Base_C_PlayLocalCameraShakes, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_DestructibleHazard_Base_C_PlayLocalCameraShakes::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

