#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageCalculation_LightFixtures

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_DamageCalculation_LightFixtures.BP_DamageCalculation_LightFixtures_C.CalculateDamage
// 0x01C8 (0x01C8 - 0x0000)
struct BP_DamageCalculation_LightFixtures_C_CalculateDamage final
{
public:
	struct FP2DamageCalculationContext            Context;                                           // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FP2DamageCalculationResult             OutResult;                                         // 0x00C0(0x0050)(Parm, OutParm)
	struct FP2DamageCalculationResult             K2Node_MakeStruct_P2DamageCalculationResult;       // 0x0110(0x0050)()
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0164(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2DamageCalculationResult             K2Node_MakeStruct_P2DamageCalculationResult_1;     // 0x0178(0x0050)()
};
static_assert(alignof(BP_DamageCalculation_LightFixtures_C_CalculateDamage) == 0x000008, "Wrong alignment on BP_DamageCalculation_LightFixtures_C_CalculateDamage");
static_assert(sizeof(BP_DamageCalculation_LightFixtures_C_CalculateDamage) == 0x0001C8, "Wrong size on BP_DamageCalculation_LightFixtures_C_CalculateDamage");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, Context) == 0x000000, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::Context' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, OutResult) == 0x0000C0, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::OutResult' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, K2Node_MakeStruct_P2DamageCalculationResult) == 0x000110, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::K2Node_MakeStruct_P2DamageCalculationResult' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, CallFunc_HasTag_ReturnValue) == 0x000160, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, Temp_struct_Variable) == 0x000164, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, CallFunc_Map_Find_Value) == 0x00016C, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, CallFunc_Map_Find_ReturnValue) == 0x000170, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamageCalculation_LightFixtures_C_CalculateDamage, K2Node_MakeStruct_P2DamageCalculationResult_1) == 0x000178, "Member 'BP_DamageCalculation_LightFixtures_C_CalculateDamage::K2Node_MakeStruct_P2DamageCalculationResult_1' has a wrong offset!");

}

