#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Drone_ExtractionDrone

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Drone_ExtractionDrone.BP_Drone_ExtractionDrone_C.DroneShotDownSFX
// 0x0030 (0x0030 - 0x0000)
struct BP_Drone_ExtractionDrone_C_DroneShotDownSFX final
{
public:
	class UP2HealthComponent*                     HealthComponent_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FP2FinalBlowImpulseData                Impulse;                                           // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Drone_ExtractionDrone_C_DroneShotDownSFX) == 0x000008, "Wrong alignment on BP_Drone_ExtractionDrone_C_DroneShotDownSFX");
static_assert(sizeof(BP_Drone_ExtractionDrone_C_DroneShotDownSFX) == 0x000030, "Wrong size on BP_Drone_ExtractionDrone_C_DroneShotDownSFX");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_DroneShotDownSFX, HealthComponent_0) == 0x000000, "Member 'BP_Drone_ExtractionDrone_C_DroneShotDownSFX::HealthComponent_0' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_DroneShotDownSFX, Impulse) == 0x000008, "Member 'BP_Drone_ExtractionDrone_C_DroneShotDownSFX::Impulse' has a wrong offset!");

// Function BP_Drone_ExtractionDrone.BP_Drone_ExtractionDrone_C.ExecuteUbergraph_BP_Drone_ExtractionDrone
// 0x01A0 (0x01A0 - 0x0000)
struct BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2HealthComponent*                     K2Node_CustomEvent_HealthComponent;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FP2FinalBlowImpulseData                K2Node_CustomEvent_Impulse;                        // 0x0090(0x0028)(ConstParm, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalVelocity_ReturnValue;             // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0130(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindTeamFromObject_bIsPartOfTeam;         // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTeamFromObject_TeamId;                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UP2HealthComponent* HealthComponent, const struct FP2FinalBlowImpulseData& Impulse)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2MapMarkerComponent*                  CallFunc_AddComponentByClass_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPC_Value_ImplicitCast;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone) == 0x000008, "Wrong alignment on BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone");
static_assert(sizeof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone) == 0x0001A0, "Wrong size on BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, EntryPoint) == 0x000000, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, Temp_delegate_Variable) == 0x000004, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_4) == 0x000054, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_5) == 0x000064, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_HasAuthority_ReturnValue) == 0x000074, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_HasAuthority_ReturnValue_1) == 0x000075, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_6) == 0x000078, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CustomEvent_HealthComponent) == 0x000088, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CustomEvent_HealthComponent' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CustomEvent_Impulse) == 0x000090, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CustomEvent_Impulse' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_Event_DeltaSeconds) == 0x0000B8, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_HasAuthority_ReturnValue_2) == 0x0000BC, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_GetLocalVelocity_ReturnValue) == 0x0000C0, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_GetLocalVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_VSize_ReturnValue) == 0x0000D8, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_SelectVector_ReturnValue) == 0x0000E0, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_FClamp_ReturnValue) == 0x000100, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_PostAkEvent_ReturnValue) == 0x000108, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_GetHealth_ReturnValue) == 0x00010C, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_GetMaxHealth_ReturnValue) == 0x000110, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_7) == 0x000120, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, Temp_delegate_Variable_1) == 0x000130, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_GetInstigator_ReturnValue) == 0x000140, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_PostAkEvent_ReturnValue_1) == 0x000148, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_DynamicCast_AsP2Hero_Character) == 0x000150, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_FindTeamFromObject_bIsPartOfTeam) == 0x000159, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_FindTeamFromObject_bIsPartOfTeam' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_FindTeamFromObject_TeamId) == 0x00015C, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_FindTeamFromObject_TeamId' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, K2Node_CreateDelegate_OutputDelegate_8) == 0x000160, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_AddComponentByClass_ReturnValue) == 0x000170, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000178, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_SetRTPC_Value_ImplicitCast) == 0x000180, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_SetRTPC_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x000190, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000198, "Member 'BP_Drone_ExtractionDrone_C_ExecuteUbergraph_BP_Drone_ExtractionDrone::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

// Function BP_Drone_ExtractionDrone.BP_Drone_ExtractionDrone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Drone_ExtractionDrone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Drone_ExtractionDrone_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Drone_ExtractionDrone_C_ReceiveTick");
static_assert(sizeof(BP_Drone_ExtractionDrone_C_ReceiveTick) == 0x000004, "Wrong size on BP_Drone_ExtractionDrone_C_ReceiveTick");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Drone_ExtractionDrone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Drone_ExtractionDrone.BP_Drone_ExtractionDrone_C.SetRotorsVisibility
// 0x0020 (0x0020 - 0x0000)
struct BP_Drone_ExtractionDrone_C_SetRotorsVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility) == 0x000004, "Wrong alignment on BP_Drone_ExtractionDrone_C_SetRotorsVisibility");
static_assert(sizeof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility) == 0x000020, "Wrong size on BP_Drone_ExtractionDrone_C_SetRotorsVisibility");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, Visible) == 0x000000, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::Visible' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Drone_ExtractionDrone_C_SetRotorsVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Drone_ExtractionDrone_C_SetRotorsVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

