#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExfilAUV_Managed

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.Disable Extract Sequences
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_Managed_C_Disable_Extract_Sequences final
{
public:
	int32                                         Sequence_ID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_Disable_Extract_Sequences) == 0x000004, "Wrong alignment on BP_ExfilAUV_Managed_C_Disable_Extract_Sequences");
static_assert(sizeof(BP_ExfilAUV_Managed_C_Disable_Extract_Sequences) == 0x000004, "Wrong size on BP_ExfilAUV_Managed_C_Disable_Extract_Sequences");
static_assert(offsetof(BP_ExfilAUV_Managed_C_Disable_Extract_Sequences, Sequence_ID) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_Disable_Extract_Sequences::Sequence_ID' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.ExecuteUbergraph_BP_ExfilAUV_Managed
// 0x05A0 (0x05A0 - 0x0000)
struct BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DurationSec;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_InPawn_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 K2Node_Event_Seat_1;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 K2Node_CustomEvent_Skel;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enter;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Get_Pod_from_Seat_Pod;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_AUV_Pod_C*                         K2Node_DynamicCast_AsABP_AUV_Pod;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0200(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_Map_Keys_Keys;                            // 0x0350(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Map_Find_Value;                           // 0x0370(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2[0xE];                                      // 0x03D2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x03E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0440(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APawn*                                  K2Node_Event_InPawn;                               // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 K2Node_Event_Seat;                                 // 0x0530(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Sequence_ID;                    // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Get_Pod_from_Seat_Pod_1;                  // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2PodDoorState                        K2Node_Event_NewState;                             // 0x0550(0x0030)(ConstParm)
	class USkeletalMeshComponent*                 CallFunc_GetPodSkeletalMeshComponent_ReturnValue;  // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_AUV_Pod_C*                         K2Node_DynamicCast_AsABP_AUV_Pod_1;                // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed) == 0x000010, "Wrong alignment on BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed");
static_assert(sizeof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed) == 0x0005A0, "Wrong size on BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, EntryPoint) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_DurationSec) == 0x00000C, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_DurationSec' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_InPawn_1) == 0x000010, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_InPawn_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_Seat_1) == 0x000018, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_Seat_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_CustomEvent_Skel) == 0x000020, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_CustomEvent_Skel' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_CustomEvent_Enter) == 0x000028, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_CustomEvent_Enter' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Get_Pod_from_Seat_Pod) == 0x000030, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Get_Pod_from_Seat_Pod' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_GetAnimInstance_ReturnValue) == 0x000038, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_DynamicCast_AsABP_AUV_Pod) == 0x000040, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_DynamicCast_AsABP_AUV_Pod' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Rotation) == 0x000068, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Scale) == 0x000080, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_RLerp_ReturnValue) == 0x000098, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000B0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Location_1) == 0x000198, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Rotation_1) == 0x0001B0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_BreakTransform_Scale_1) == 0x0001C8, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, Temp_int_Loop_Counter_Variable) == 0x0001E0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_VLerp_ReturnValue) == 0x0001E8, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000200, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Add_IntInt_ReturnValue) == 0x0002E8, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_MakeTransform_ReturnValue) == 0x0002F0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Map_Keys_Keys) == 0x000350, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Array_Get_Item) == 0x000360, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Array_Length_ReturnValue) == 0x000368, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Map_Find_Value) == 0x000370, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Map_Find_ReturnValue) == 0x0003D0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Less_IntInt_ReturnValue) == 0x0003D1, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_TLerp_ReturnValue) == 0x0003E0, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000440, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_InPawn) == 0x000528, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_InPawn' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_Seat) == 0x000530, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_Seat' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_CustomEvent_Sequence_ID) == 0x000538, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_CustomEvent_Sequence_ID' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Get_Pod_from_Seat_Pod_1) == 0x000540, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Get_Pod_from_Seat_Pod_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_Array_Contains_ReturnValue) == 0x000548, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_Event_NewState) == 0x000550, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_GetPodSkeletalMeshComponent_ReturnValue) == 0x000580, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_GetPodSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000588, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_DynamicCast_AsABP_AUV_Pod_1) == 0x000590, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_DynamicCast_AsABP_AUV_Pod_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed, K2Node_DynamicCast_bSuccess_1) == 0x000598, "Member 'BP_ExfilAUV_Managed_C_ExecuteUbergraph_BP_ExfilAUV_Managed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.Get Pod from Seat
// 0x0018 (0x0018 - 0x0000)
struct BP_ExfilAUV_Managed_C_Get_Pod_from_Seat final
{
public:
	class UP2ExfiltrationAUVSeat*                 Seat;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Pod;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_Get_Pod_from_Seat");
static_assert(sizeof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat) == 0x000018, "Wrong size on BP_ExfilAUV_Managed_C_Get_Pod_from_Seat");
static_assert(offsetof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat, Seat) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_Get_Pod_from_Seat::Seat' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat, Pod) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_Get_Pod_from_Seat::Pod' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'BP_ExfilAUV_Managed_C_Get_Pod_from_Seat::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_Get_Pod_from_Seat, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'BP_ExfilAUV_Managed_C_Get_Pod_from_Seat::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.OnPlayerEnteringPod
// 0x0010 (0x0010 - 0x0000)
struct BP_ExfilAUV_Managed_C_OnPlayerEnteringPod final
{
public:
	class APawn*                                  InPawn;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 Seat;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_OnPlayerEnteringPod) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_OnPlayerEnteringPod");
static_assert(sizeof(BP_ExfilAUV_Managed_C_OnPlayerEnteringPod) == 0x000010, "Wrong size on BP_ExfilAUV_Managed_C_OnPlayerEnteringPod");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnPlayerEnteringPod, InPawn) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_OnPlayerEnteringPod::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnPlayerEnteringPod, Seat) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_OnPlayerEnteringPod::Seat' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.OnPlayerExitingPod
// 0x0010 (0x0010 - 0x0000)
struct BP_ExfilAUV_Managed_C_OnPlayerExitingPod final
{
public:
	class APawn*                                  InPawn;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 Seat;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_OnPlayerExitingPod) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_OnPlayerExitingPod");
static_assert(sizeof(BP_ExfilAUV_Managed_C_OnPlayerExitingPod) == 0x000010, "Wrong size on BP_ExfilAUV_Managed_C_OnPlayerExitingPod");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnPlayerExitingPod, InPawn) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_OnPlayerExitingPod::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnPlayerExitingPod, Seat) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_OnPlayerExitingPod::Seat' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.OnPodDoorStateChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_ExfilAUV_Managed_C_OnPodDoorStateChanged final
{
public:
	struct FP2PodDoorState                        NewState;                                          // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_OnPodDoorStateChanged) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_OnPodDoorStateChanged");
static_assert(sizeof(BP_ExfilAUV_Managed_C_OnPodDoorStateChanged) == 0x000030, "Wrong size on BP_ExfilAUV_Managed_C_OnPodDoorStateChanged");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnPodDoorStateChanged, NewState) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_OnPodDoorStateChanged::NewState' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.OnStateChanged_Notify
// 0x0048 (0x0048 - 0x0000)
struct BP_ExfilAUV_Managed_C_OnStateChanged_Notify final
{
public:
	EP2ExfiltrationAUVState                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_OnStateChanged_Notify");
static_assert(sizeof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify) == 0x000048, "Wrong size on BP_ExfilAUV_Managed_C_OnStateChanged_Notify");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, NewState) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::NewState' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, ReturnValue) == 0x000001, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_byte_Variable) == 0x000002, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable) == 0x000018, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_1) == 0x00001C, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_2) == 0x000020, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_3) == 0x000024, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_4) == 0x000028, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_5) == 0x00002C, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_6) == 0x000030, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, Temp_real_Variable_7) == 0x000034, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, CallFunc_IsDedicatedServer_ReturnValue) == 0x000039, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003B, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, K2Node_Select_Default) == 0x00003C, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_OnStateChanged_Notify, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_ExfilAUV_Managed_C_OnStateChanged_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.PlayPodDoorAnim
// 0x0010 (0x0010 - 0x0000)
struct BP_ExfilAUV_Managed_C_PlayPodDoorAnim final
{
public:
	class USkeletalMeshComponent*                 Skel;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Enter;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_PlayPodDoorAnim) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_PlayPodDoorAnim");
static_assert(sizeof(BP_ExfilAUV_Managed_C_PlayPodDoorAnim) == 0x000010, "Wrong size on BP_ExfilAUV_Managed_C_PlayPodDoorAnim");
static_assert(offsetof(BP_ExfilAUV_Managed_C_PlayPodDoorAnim, Skel) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_PlayPodDoorAnim::Skel' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_PlayPodDoorAnim, Enter) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_PlayPodDoorAnim::Enter' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.StartExfilSequence
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_Managed_C_StartExfilSequence final
{
public:
	float                                         DurationSec;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_StartExfilSequence) == 0x000004, "Wrong alignment on BP_ExfilAUV_Managed_C_StartExfilSequence");
static_assert(sizeof(BP_ExfilAUV_Managed_C_StartExfilSequence) == 0x000004, "Wrong size on BP_ExfilAUV_Managed_C_StartExfilSequence");
static_assert(offsetof(BP_ExfilAUV_Managed_C_StartExfilSequence, DurationSec) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_StartExfilSequence::DurationSec' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.UpdateLightColor
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_Managed_C_UpdateLightColor final
{
public:
	float                                         ParameterValue;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_UpdateLightColor) == 0x000004, "Wrong alignment on BP_ExfilAUV_Managed_C_UpdateLightColor");
static_assert(sizeof(BP_ExfilAUV_Managed_C_UpdateLightColor) == 0x000004, "Wrong size on BP_ExfilAUV_Managed_C_UpdateLightColor");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdateLightColor, ParameterValue) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_UpdateLightColor::ParameterValue' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.UpdatePodDoorStates
// 0x0010 (0x0010 - 0x0000)
struct BP_ExfilAUV_Managed_C_UpdatePodDoorStates final
{
public:
	class USkeletalMeshComponent*                 Pod;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOpen;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2PodDisplayState                            Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2PodDisplayState                            Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2PodDisplayState                            K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates) == 0x000008, "Wrong alignment on BP_ExfilAUV_Managed_C_UpdatePodDoorStates");
static_assert(sizeof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates) == 0x000010, "Wrong size on BP_ExfilAUV_Managed_C_UpdatePodDoorStates");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, Pod) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::Pod' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, bIsOpen) == 0x000008, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::bIsOpen' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, Temp_byte_Variable) == 0x000009, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, CallFunc_HasAuthority_ReturnValue) == 0x00000A, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, Temp_byte_Variable_1) == 0x00000B, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, Temp_bool_Variable) == 0x00000C, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UpdatePodDoorStates, K2Node_Select_Default) == 0x00000D, "Member 'BP_ExfilAUV_Managed_C_UpdatePodDoorStates::K2Node_Select_Default' has a wrong offset!");

// Function BP_ExfilAUV_Managed.BP_ExfilAUV_Managed_C.UserConstructionScript
// 0x08C0 (0x08C0 - 0x0000)
struct BP_ExfilAUV_Managed_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0218(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0308(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F3[0x1];                                      // 0x03F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0468(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0470(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CA[0x2];                                      // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0508(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0520(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0538(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0564(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x05B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C2[0x6];                                      // 0x05C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x05C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x06B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_798[0x8];                                      // 0x0798(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x07A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_2;       // 0x0800(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_3;       // 0x0860(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Managed_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_ExfilAUV_Managed_C_UserConstructionScript");
static_assert(sizeof(BP_ExfilAUV_Managed_C_UserConstructionScript) == 0x0008C0, "Wrong size on BP_ExfilAUV_Managed_C_UserConstructionScript");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_ExfilAUV_Managed_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Managed_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ExfilAUV_Managed_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
