#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionTunnel_MapComponent

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.BP_UpdateMapMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh final
{
public:
	class UP2MapMeshComponent*                    InMeshComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh) == 0x000008, "Wrong size on BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh, InMeshComponent) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapMesh::InMeshComponent' has a wrong offset!");

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.BP_UpdateMapWidget
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget final
{
public:
	class UP2MapWidgetComponent*                  InWidgetComponent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget) == 0x000008, "Wrong size on BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget, InWidgetComponent) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_BP_UpdateMapWidget::InWidgetComponent' has a wrong offset!");

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.ExecuteUbergraph_BP_ExtractionTunnel_MapComponent
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2MapMeshComponent*                    K2Node_Event_InMeshComponent;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2MapWidgetComponent*                  K2Node_Event_InWidgetComponent;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_Extraction_Stem_C*                   K2Node_DynamicCast_AsW_Extraction_Stem;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ExtractionTunnel_C*                  K2Node_DynamicCast_AsW_Extraction_Tunnel;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2MapExfiltrationStateSettings        CallFunc_Map_Find_Value;                           // 0x0054(0x0014)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExtractionTunnel*                    K2Node_CustomEvent_InTunnel;                       // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_Select_Default;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2MapExfiltrationStateSettings        CallFunc_Map_Find_Value_1;                         // 0x0094(0x0014)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 K2Node_Select_Default_2;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent) == 0x0000C0, "Wrong size on BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, EntryPoint) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, Temp_bool_Variable) == 0x000004, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, Temp_real_Variable) == 0x000008, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, Temp_real_Variable_1) == 0x00000C, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, Temp_bool_Variable_1) == 0x000010, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_Event_InMeshComponent) == 0x000018, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_Event_InMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_Event_InWidgetComponent) == 0x000020, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_Event_InWidgetComponent' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_GetWidget_ReturnValue) == 0x000030, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_DynamicCast_AsW_Extraction_Stem) == 0x000038, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_DynamicCast_AsW_Extraction_Stem' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_DynamicCast_AsW_Extraction_Tunnel) == 0x000048, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_DynamicCast_AsW_Extraction_Tunnel' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Map_Find_Value) == 0x000054, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, Temp_bool_Variable_2) == 0x000069, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_CustomEvent_InTunnel) == 0x000070, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_CustomEvent_InTunnel' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_BooleanAND_ReturnValue) == 0x000078, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_BooleanOR_ReturnValue) == 0x000079, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_Select_Default) == 0x00007C, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000080, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_Select_Default_1) == 0x000090, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Map_Find_Value_1) == 0x000094, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Map_Find_ReturnValue_1) == 0x0000A8, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_BooleanAND_ReturnValue_1) == 0x0000A9, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, K2Node_Select_Default_2) == 0x0000AC, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x0000B0, "Member 'BP_ExtractionTunnel_MapComponent_C_ExecuteUbergraph_BP_ExtractionTunnel_MapComponent::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.Set Mesh State
// 0x0020 (0x0020 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State final
{
public:
	class FName                                   State;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2MapExfiltrationStateSettings        CallFunc_Map_Find_Value;                           // 0x0008(0x0014)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State) == 0x000004, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State) == 0x000020, "Wrong size on BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State, State) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State::State' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State, CallFunc_Map_Find_Value) == 0x000008, "Member 'BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State, CallFunc_Map_Find_ReturnValue) == 0x00001C, "Member 'BP_ExtractionTunnel_MapComponent_C_Set_Mesh_State::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.SetNearInTimeAnomaly
// 0x0001 (0x0001 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly final
{
public:
	bool                                          InbIsNearInTimeAnomaly;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly) == 0x000001, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly) == 0x000001, "Wrong size on BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly, InbIsNearInTimeAnomaly) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_SetNearInTimeAnomaly::InbIsNearInTimeAnomaly' has a wrong offset!");

// Function BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C.SetOwner
// 0x0008 (0x0008 - 0x0000)
struct BP_ExtractionTunnel_MapComponent_C_SetOwner final
{
public:
	class AP2ExtractionTunnel*                    InTunnel;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_MapComponent_C_SetOwner) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_MapComponent_C_SetOwner");
static_assert(sizeof(BP_ExtractionTunnel_MapComponent_C_SetOwner) == 0x000008, "Wrong size on BP_ExtractionTunnel_MapComponent_C_SetOwner");
static_assert(offsetof(BP_ExtractionTunnel_MapComponent_C_SetOwner, InTunnel) == 0x000000, "Member 'BP_ExtractionTunnel_MapComponent_C_SetOwner::InTunnel' has a wrong offset!");

}

