#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExfilAUV_Callin_Vanilla

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ExfilAUV_Callin_Vanilla.BP_ExfilAUV_Callin_Vanilla_C.ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla
// 0x0008 (0x0008 - 0x0000)
struct BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DurationSec;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla) == 0x000004, "Wrong alignment on BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla");
static_assert(sizeof(BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla) == 0x000008, "Wrong size on BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla, EntryPoint) == 0x000000, "Member 'BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla, K2Node_Event_DurationSec) == 0x000004, "Member 'BP_ExfilAUV_Callin_Vanilla_C_ExecuteUbergraph_BP_ExfilAUV_Callin_Vanilla::K2Node_Event_DurationSec' has a wrong offset!");

// Function BP_ExfilAUV_Callin_Vanilla.BP_ExfilAUV_Callin_Vanilla_C.OnStateChanged_Notify
// 0x0050 (0x0050 - 0x0000)
struct BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify final
{
public:
	EP2ExfiltrationAUVState                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify) == 0x000008, "Wrong alignment on BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify");
static_assert(sizeof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify) == 0x000050, "Wrong size on BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, NewState) == 0x000000, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::NewState' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, ReturnValue) == 0x000001, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable) == 0x000002, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_1) == 0x000019, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_2) == 0x00001A, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_3) == 0x00001B, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_4) == 0x00001C, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_5) == 0x00001D, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_6) == 0x00001E, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_bool_Variable_7) == 0x00001F, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_byte_Variable) == 0x000020, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable) == 0x000024, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_1) == 0x000028, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_2) == 0x00002C, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_3) == 0x000030, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_4) == 0x000034, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_5) == 0x000038, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_6) == 0x00003C, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_real_Variable_7) == 0x000040, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, CallFunc_HasAuthority_ReturnValue) == 0x000044, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, K2Node_Select_Default) == 0x000048, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, Temp_byte_Variable_1) == 0x00004C, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify, K2Node_Select_Default_1) == 0x00004D, "Member 'BP_ExfilAUV_Callin_Vanilla_C_OnStateChanged_Notify::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_ExfilAUV_Callin_Vanilla.BP_ExfilAUV_Callin_Vanilla_C.StartExfilSequence
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence final
{
public:
	float                                         DurationSec;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence) == 0x000004, "Wrong alignment on BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence");
static_assert(sizeof(BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence) == 0x000004, "Wrong size on BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence, DurationSec) == 0x000000, "Member 'BP_ExfilAUV_Callin_Vanilla_C_StartExfilSequence::DurationSec' has a wrong offset!");

// Function BP_ExfilAUV_Callin_Vanilla.BP_ExfilAUV_Callin_Vanilla_C.UpdateLightColor
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor final
{
public:
	float                                         ParameterValue;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor) == 0x000004, "Wrong alignment on BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor");
static_assert(sizeof(BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor) == 0x000004, "Wrong size on BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor");
static_assert(offsetof(BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor, ParameterValue) == 0x000000, "Member 'BP_ExfilAUV_Callin_Vanilla_C_UpdateLightColor::ParameterValue' has a wrong offset!");

}

