#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionTunnel_MapComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtractionTunnel_MapComponent.BP_ExtractionTunnel_MapComponent_C
// 0x0070 (0x0260 - 0x01F0)
class UBP_ExtractionTunnel_MapComponent_C final : public UP2MapComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FName, struct FP2MapExfiltrationStateSettings> MeshStates;                            // 0x01F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   CurrentMeshState;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsNearInTimeAnomaly;                              // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExtractionTunnel*                    Owner;                                             // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_UpdateMapMesh(class UP2MapMeshComponent* InMeshComponent)	 // 0xae1e64;
	void BP_UpdateMapWidget(class UP2MapWidgetComponent* InWidgetComponent)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ExtractionTunnel_MapComponent(int32 EntryPoint)	 // 0xae1e64;
	void Set_Mesh_State(class FName State)	 // 0xae1e64;
	void SetNearInTimeAnomaly(bool InbIsNearInTimeAnomaly)	 // 0xae1e64;
	void SetOwner(class AP2ExtractionTunnel* InTunnel)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ExtractionTunnel_MapComponent_C">();
	}
	static class UBP_ExtractionTunnel_MapComponent_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ExtractionTunnel_MapComponent_C>();
	}
};
static_assert(alignof(UBP_ExtractionTunnel_MapComponent_C) == 0x000010, "Wrong alignment on UBP_ExtractionTunnel_MapComponent_C");
static_assert(sizeof(UBP_ExtractionTunnel_MapComponent_C) == 0x000260, "Wrong size on UBP_ExtractionTunnel_MapComponent_C");
static_assert(offsetof(UBP_ExtractionTunnel_MapComponent_C, UberGraphFrame) == 0x0001F0, "Member 'UBP_ExtractionTunnel_MapComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ExtractionTunnel_MapComponent_C, MeshStates) == 0x0001F8, "Member 'UBP_ExtractionTunnel_MapComponent_C::MeshStates' has a wrong offset!");
static_assert(offsetof(UBP_ExtractionTunnel_MapComponent_C, CurrentMeshState) == 0x000248, "Member 'UBP_ExtractionTunnel_MapComponent_C::CurrentMeshState' has a wrong offset!");
static_assert(offsetof(UBP_ExtractionTunnel_MapComponent_C, bIsNearInTimeAnomaly) == 0x000250, "Member 'UBP_ExtractionTunnel_MapComponent_C::bIsNearInTimeAnomaly' has a wrong offset!");
static_assert(offsetof(UBP_ExtractionTunnel_MapComponent_C, Owner) == 0x000258, "Member 'UBP_ExtractionTunnel_MapComponent_C::Owner' has a wrong offset!");

}

