#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExfilAUV_CallIn_Sphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C
// 0x0120 (0x0680 - 0x0560)
class ABP_ExfilAUV_CallIn_Sphere_C final : public AP2ExfiltrationAUV
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_SphereOpen2;                                    // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SphereOpen1;                                    // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint7;                                      // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionBR1;                                         // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint6;                                      // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionBL1;                                         // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionFR1;                                         // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint5;                                      // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatBR1;                                           // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatFR1;                                           // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatBL1;                                           // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatFL;                                            // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatBR;                                            // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatBL;                                            // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ExfiltrationAUVSeat*                 SeatFR;                                            // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SphereOpen;                                     // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint3;                                      // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint4;                                      // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint2;                                      // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DetachPoint1;                                      // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionFR;                                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionBR;                                          // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionFL;                                          // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     ActionBL;                                          // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ExfilDest;                                         // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collisiion;                                        // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnStateChanged;                                    // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ALPHA;                                             // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Uptoggle;                                          // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Materials;                                         // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StartChange;                                       // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Enable_TIck()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere(int32 EntryPoint)	 // 0xae1e64;
	void FinishExfilSequence()	 // 0xae1e64;
	bool OnStateChanged_Notify(EP2ExfiltrationAUVState NewState)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ScaleSphere(double DeltaTime)	 // 0xae1e64;
	void Sphere_Hide(bool Bool)	 // 0xae1e64;
	void SphereFX()	 // 0xae1e64;
	void Start_Timer()	 // 0xae1e64;
	void StartExfilSequence(float DurationSec)	 // 0xae1e64;
	void UpdateLightColor(const float ParameterValue)	 // 0xae1e64;
	void UserConstructionScript()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ExfilAUV_CallIn_Sphere_C">();
	}
	static class ABP_ExfilAUV_CallIn_Sphere_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_ExfilAUV_CallIn_Sphere_C>();
	}
};
static_assert(alignof(ABP_ExfilAUV_CallIn_Sphere_C) == 0x000010, "Wrong alignment on ABP_ExfilAUV_CallIn_Sphere_C");
static_assert(sizeof(ABP_ExfilAUV_CallIn_Sphere_C) == 0x000680, "Wrong size on ABP_ExfilAUV_CallIn_Sphere_C");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, UberGraphFrame) == 0x000560, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SM_SphereOpen2) == 0x000568, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SM_SphereOpen2' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SM_SphereOpen1) == 0x000570, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SM_SphereOpen1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint7) == 0x000578, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint7' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionBR1) == 0x000580, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionBR1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint6) == 0x000588, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint6' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionBL1) == 0x000590, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionBL1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionFR1) == 0x000598, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionFR1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint5) == 0x0005A0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint5' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, Scene) == 0x0005A8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatBR1) == 0x0005B0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatBR1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatFR1) == 0x0005B8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatFR1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatBL1) == 0x0005C0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatBL1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, Arrow) == 0x0005C8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatFL) == 0x0005D0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatFL' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatBR) == 0x0005D8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatBR' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatBL) == 0x0005E0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatBL' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SeatFR) == 0x0005E8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SeatFR' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, SM_SphereOpen) == 0x0005F0, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::SM_SphereOpen' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint3) == 0x0005F8, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint3' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint4) == 0x000600, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint4' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint2) == 0x000608, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint2' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, DetachPoint1) == 0x000610, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::DetachPoint1' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionFR) == 0x000618, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionFR' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionBR) == 0x000620, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionBR' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionFL) == 0x000628, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionFL' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ActionBL) == 0x000630, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ActionBL' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ExfilDest) == 0x000638, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ExfilDest' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, Collisiion) == 0x000640, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::Collisiion' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, OnStateChanged) == 0x000648, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::OnStateChanged' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, ALPHA) == 0x000658, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::ALPHA' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, Uptoggle) == 0x000660, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::Uptoggle' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, Materials) == 0x000668, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::Materials' has a wrong offset!");
static_assert(offsetof(ABP_ExfilAUV_CallIn_Sphere_C, StartChange) == 0x000670, "Member 'ABP_ExfilAUV_CallIn_Sphere_C::StartChange' has a wrong offset!");

}

