#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionTunnel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ExtractionTunnel.BP_ExtractionTunnel_C
// 0x0148 (0x04F8 - 0x03B0)
class ABP_ExtractionTunnel_C : public AP2ExtractionTunnel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ThrowableCollision;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2MapMarkerComponent*                  P2MapMarker;                                       // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_DeSpawn;                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AIDangerSourceComponent*             P2AIDangerSource;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  P2AkAmbientSound;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Collision;                                         // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        AkSocket;                                          // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Countdown;                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Wormhole;                      // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_ExtractionTunnel_Spawn;                         // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CountdownProgress_Countdown_388171CC4C32D29F5E606CBDE4E43169; // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CountdownProgress__Direction_388171CC4C32D29F5E606CBDE4E43169; // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40D[0x3];                                      // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CountdownProgress;                                 // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Collapse_7A992CBE487D2005C09B919FB2240054; // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_7A992CBE487D2005C09B919FB2240054; // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Pulse_Frequency_4D40E4D4476DF7492F1573B1A56BD6A9;  // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Pulse__Direction_4D40E4D4476DF7492F1573B1A56BD6A9; // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Pulse;                                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CountDownSequence;                                 // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MapComponentClass;                                 // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_ExtractionTunnel_MapComponent_C*    CurrentMapComponent;                               // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero1_AkEvent_Extraction_Portal_Standby;           // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero2_AkEvent_Extraction_Portal_Actvation_Loop;    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero2_AkEvent_Extraction_Portal_Actvation_Start;   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero2_AkEvent_Alarm_Activate;                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero3_AkEvent_Extraction_Portal_Activation_Pulse;  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero4_AkEvent_Extraction_Countdown_Start;          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero4_AkEvent_Extraction_Countdown_Pulse;          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero5_AkEvent_Alarm_Close;                         // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Zero5_AkEvent_Extraction_Portal_Close;             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkComponent_Alarm;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugBadLocation;                                  // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         Debug_Actors_to_Ignore;                            // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnPulseFX;                                         // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMaterialInstanceDynamic*               MI_Post_Process;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CurrentState;                                      // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 MarkerClass;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RenderMapWidgetTimer;                              // 0x04F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Collapsed()	 // 0xae1e64;
	void Compass_Ping()	 // 0xae1e64;
	void Countdown()	 // 0xae1e64;
	void CountdownFX()	 // 0xae1e64;
	void CountdownProgress__FinishedFunc()	 // 0xae1e64;
	void CountdownProgress__UpdateFunc()	 // 0xae1e64;
	void DebugExtractionTunnelPlacement()	 // 0xae1e64;
	void DestroyMapComponent()	 // 0xae1e64;
	void Disable_Marker()	 // 0xae1e64;
	void EnableRenderMapWidgetEveryTick(bool Enable)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ExtractionTunnel(int32 EntryPoint)	 // 0xae1e64;
	void Formation()	 // 0xae1e64;
	void GetActorsToIgnore()	 // 0xae1e64;
	void GetPulseCurveFloat(double* float_0)	 // 0xae1e64;
	void Idle()	 // 0xae1e64;
	void Inactive()	 // 0xae1e64;
	void Initiation()	 // 0xae1e64;
	void OnConsumedByAnomaly(EP2ExtractionTunnelState StateBeforeConsumption)	 // 0xae1e64;
	void OnGetNearInTimeAnomaly()	 // 0xae1e64;
	void OnStateChanged(EP2ExtractionTunnelState NewState, EP2ExtractionTunnelState OldState)	 // 0xae1e64;
	void PlayShake(float NormalizedMagnitude, double Falloff)	 // 0xae1e64;
	void PlaySound_Alarm_Extraction_Closure()	 // 0xae1e64;
	void PlaySound_Extraction_Countdown_Start()	 // 0xae1e64;
	void Pulse__FinishedFunc()	 // 0xae1e64;
	void Pulse__UpdateFunc()	 // 0xae1e64;
	void PulseFX()	 // 0xae1e64;
	void RenderMapWidgetTick()	 // 0xae1e64;
	void ServerPulse()	 // 0xae1e64;
	void SetStateDebug(EP2ExtractionTunnelState InState)	 // 0xae1e64;
	void Spawning()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;
	void UpdateMapComponent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ExtractionTunnel_C">();
	}
	static class ABP_ExtractionTunnel_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_ExtractionTunnel_C>();
	}
};
static_assert(alignof(ABP_ExtractionTunnel_C) == 0x000008, "Wrong alignment on ABP_ExtractionTunnel_C");
static_assert(sizeof(ABP_ExtractionTunnel_C) == 0x0004F8, "Wrong size on ABP_ExtractionTunnel_C");
static_assert(offsetof(ABP_ExtractionTunnel_C, UberGraphFrame) == 0x0003B0, "Member 'ABP_ExtractionTunnel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, ThrowableCollision) == 0x0003B8, "Member 'ABP_ExtractionTunnel_C::ThrowableCollision' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, P2MapMarker) == 0x0003C0, "Member 'ABP_ExtractionTunnel_C::P2MapMarker' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, NS_ExtractionTunnel_DeSpawn) == 0x0003C8, "Member 'ABP_ExtractionTunnel_C::NS_ExtractionTunnel_DeSpawn' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, P2AIDangerSource) == 0x0003D0, "Member 'ABP_ExtractionTunnel_C::P2AIDangerSource' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, P2AkAmbientSound) == 0x0003D8, "Member 'ABP_ExtractionTunnel_C::P2AkAmbientSound' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Collision) == 0x0003E0, "Member 'ABP_ExtractionTunnel_C::Collision' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, AkSocket) == 0x0003E8, "Member 'ABP_ExtractionTunnel_C::AkSocket' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, NS_ExtractionTunnel_Countdown) == 0x0003F0, "Member 'ABP_ExtractionTunnel_C::NS_ExtractionTunnel_Countdown' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, NS_ExtractionTunnel_Wormhole) == 0x0003F8, "Member 'ABP_ExtractionTunnel_C::NS_ExtractionTunnel_Wormhole' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, NS_ExtractionTunnel_Spawn) == 0x000400, "Member 'ABP_ExtractionTunnel_C::NS_ExtractionTunnel_Spawn' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CountdownProgress_Countdown_388171CC4C32D29F5E606CBDE4E43169) == 0x000408, "Member 'ABP_ExtractionTunnel_C::CountdownProgress_Countdown_388171CC4C32D29F5E606CBDE4E43169' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CountdownProgress__Direction_388171CC4C32D29F5E606CBDE4E43169) == 0x00040C, "Member 'ABP_ExtractionTunnel_C::CountdownProgress__Direction_388171CC4C32D29F5E606CBDE4E43169' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CountdownProgress) == 0x000410, "Member 'ABP_ExtractionTunnel_C::CountdownProgress' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Timeline_Collapse_7A992CBE487D2005C09B919FB2240054) == 0x000418, "Member 'ABP_ExtractionTunnel_C::Timeline_Collapse_7A992CBE487D2005C09B919FB2240054' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Timeline__Direction_7A992CBE487D2005C09B919FB2240054) == 0x00041C, "Member 'ABP_ExtractionTunnel_C::Timeline__Direction_7A992CBE487D2005C09B919FB2240054' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Timeline) == 0x000420, "Member 'ABP_ExtractionTunnel_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Pulse_Frequency_4D40E4D4476DF7492F1573B1A56BD6A9) == 0x000428, "Member 'ABP_ExtractionTunnel_C::Pulse_Frequency_4D40E4D4476DF7492F1573B1A56BD6A9' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Pulse__Direction_4D40E4D4476DF7492F1573B1A56BD6A9) == 0x00042C, "Member 'ABP_ExtractionTunnel_C::Pulse__Direction_4D40E4D4476DF7492F1573B1A56BD6A9' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Pulse) == 0x000430, "Member 'ABP_ExtractionTunnel_C::Pulse' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CountDownSequence) == 0x000438, "Member 'ABP_ExtractionTunnel_C::CountDownSequence' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, MapComponentClass) == 0x000440, "Member 'ABP_ExtractionTunnel_C::MapComponentClass' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CurrentMapComponent) == 0x000448, "Member 'ABP_ExtractionTunnel_C::CurrentMapComponent' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero1_AkEvent_Extraction_Portal_Standby) == 0x000450, "Member 'ABP_ExtractionTunnel_C::Zero1_AkEvent_Extraction_Portal_Standby' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero2_AkEvent_Extraction_Portal_Actvation_Loop) == 0x000458, "Member 'ABP_ExtractionTunnel_C::Zero2_AkEvent_Extraction_Portal_Actvation_Loop' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero2_AkEvent_Extraction_Portal_Actvation_Start) == 0x000460, "Member 'ABP_ExtractionTunnel_C::Zero2_AkEvent_Extraction_Portal_Actvation_Start' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero2_AkEvent_Alarm_Activate) == 0x000468, "Member 'ABP_ExtractionTunnel_C::Zero2_AkEvent_Alarm_Activate' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero3_AkEvent_Extraction_Portal_Activation_Pulse) == 0x000470, "Member 'ABP_ExtractionTunnel_C::Zero3_AkEvent_Extraction_Portal_Activation_Pulse' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero4_AkEvent_Extraction_Countdown_Start) == 0x000478, "Member 'ABP_ExtractionTunnel_C::Zero4_AkEvent_Extraction_Countdown_Start' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero4_AkEvent_Extraction_Countdown_Pulse) == 0x000480, "Member 'ABP_ExtractionTunnel_C::Zero4_AkEvent_Extraction_Countdown_Pulse' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero5_AkEvent_Alarm_Close) == 0x000488, "Member 'ABP_ExtractionTunnel_C::Zero5_AkEvent_Alarm_Close' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Zero5_AkEvent_Extraction_Portal_Close) == 0x000490, "Member 'ABP_ExtractionTunnel_C::Zero5_AkEvent_Extraction_Portal_Close' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, AkComponent_Alarm) == 0x000498, "Member 'ABP_ExtractionTunnel_C::AkComponent_Alarm' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, DebugBadLocation) == 0x0004A0, "Member 'ABP_ExtractionTunnel_C::DebugBadLocation' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Object_Types) == 0x0004A8, "Member 'ABP_ExtractionTunnel_C::Object_Types' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, Debug_Actors_to_Ignore) == 0x0004B8, "Member 'ABP_ExtractionTunnel_C::Debug_Actors_to_Ignore' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, OnPulseFX) == 0x0004C8, "Member 'ABP_ExtractionTunnel_C::OnPulseFX' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, MI_Post_Process) == 0x0004D8, "Member 'ABP_ExtractionTunnel_C::MI_Post_Process' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, CurrentState) == 0x0004E0, "Member 'ABP_ExtractionTunnel_C::CurrentState' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, MarkerClass) == 0x0004E8, "Member 'ABP_ExtractionTunnel_C::MarkerClass' has a wrong offset!");
static_assert(offsetof(ABP_ExtractionTunnel_C, RenderMapWidgetTimer) == 0x0004F0, "Member 'ABP_ExtractionTunnel_C::RenderMapWidgetTimer' has a wrong offset!");

}

