#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Exfil_TriggerZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.AddExfilGE
// 0x01A8 (0x01A8 - 0x0000)
struct BP_Exfil_TriggerZone_C_AddExfilGE final
{
public:
	class AP2HeroCharacter*                       Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0010(0x0010)()
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_SetDuration_ReturnValue;                  // 0x0028(0x0010)()
	struct FGameplayEffectQuery                   K2Node_MakeStruct_GameplayEffectQuery;             // 0x0038(0x0150)(ContainsInstancedReference)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffects_ReturnValue;             // 0x0190(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_AddExfilGE) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_AddExfilGE");
static_assert(sizeof(BP_Exfil_TriggerZone_C_AddExfilGE) == 0x0001A8, "Wrong size on BP_Exfil_TriggerZone_C_AddExfilGE");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, Hero) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::Hero' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000020, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_SetDuration_ReturnValue) == 0x000028, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_SetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, K2Node_MakeStruct_GameplayEffectQuery) == 0x000038, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::K2Node_MakeStruct_GameplayEffectQuery' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000188, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_GetActiveEffects_ReturnValue) == 0x000190, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_GetActiveEffects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_AddExfilGE, CallFunc_Array_IsEmpty_ReturnValue) == 0x0001A0, "Member 'BP_Exfil_TriggerZone_C_AddExfilGE::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.BndEvt__BP_Exfil_TriggerZone_Extraction Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.BndEvt__BP_Exfil_TriggerZone_Extraction Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Exfil_TriggerZone_C_BndEvt__BP_Exfil_TriggerZone_Extraction_Volume_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.ExecuteUbergraph_BP_Exfil_TriggerZone
// 0x0170 (0x0170 - 0x0000)
struct BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ExfilDuration;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sphere_Emission_DeltaTime_ImplicitCast;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Scale_Sphere_DeltaTime_ImplicitCast;      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone");
static_assert(sizeof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone) == 0x000170, "Wrong size on BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, EntryPoint) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000110, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherActor) == 0x000118, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherComp) == 0x000120, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000128, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_DynamicCast_AsP2Hero_Character) == 0x000130, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x000140, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_Array_RemoveItem_ReturnValue) == 0x000149, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_Array_AddUnique_ReturnValue) == 0x00014C, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_Event_DeltaSeconds) == 0x000150, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_HasAuthority_ReturnValue_1) == 0x000154, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_HasAuthority_ReturnValue_2) == 0x000155, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_HasAuthority_ReturnValue_3) == 0x000156, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_HasAuthority_ReturnValue_4) == 0x000157, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, K2Node_CustomEvent_ExfilDuration) == 0x000158, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::K2Node_CustomEvent_ExfilDuration' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_Sphere_Emission_DeltaTime_ImplicitCast) == 0x000160, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_Sphere_Emission_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone, CallFunc_Scale_Sphere_DeltaTime_ImplicitCast) == 0x000168, "Member 'BP_Exfil_TriggerZone_C_ExecuteUbergraph_BP_Exfil_TriggerZone::CallFunc_Scale_Sphere_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.ExfilTimerElapsed
// 0x0148 (0x0148 - 0x0000)
struct BP_Exfil_TriggerZone_C_ExfilTimerElapsed final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0030(0x00F0)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_ExfilTimerElapsed");
static_assert(sizeof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed) == 0x000148, "Wrong size on BP_Exfil_TriggerZone_C_ExfilTimerElapsed");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_GetLocalViewActor_ReturnValue) == 0x000028, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_GetLocalViewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000030, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_Array_Get_Item) == 0x000128, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000138, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ExfilTimerElapsed, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000140, "Member 'BP_Exfil_TriggerZone_C_ExfilTimerElapsed::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Exfil_TriggerZone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Exfil_TriggerZone_C_ReceiveTick");
static_assert(sizeof(BP_Exfil_TriggerZone_C_ReceiveTick) == 0x000004, "Wrong size on BP_Exfil_TriggerZone_C_ReceiveTick");
static_assert(offsetof(BP_Exfil_TriggerZone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.RemoveExfilGE
// 0x0010 (0x0010 - 0x0000)
struct BP_Exfil_TriggerZone_C_RemoveExfilGE final
{
public:
	class AP2HeroCharacter*                       Hero;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_RemoveExfilGE) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_RemoveExfilGE");
static_assert(sizeof(BP_Exfil_TriggerZone_C_RemoveExfilGE) == 0x000010, "Wrong size on BP_Exfil_TriggerZone_C_RemoveExfilGE");
static_assert(offsetof(BP_Exfil_TriggerZone_C_RemoveExfilGE, Hero) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_RemoveExfilGE::Hero' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_RemoveExfilGE, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_RemoveExfilGE::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.Scale Sphere
// 0x0008 (0x0008 - 0x0000)
struct BP_Exfil_TriggerZone_C_Scale_Sphere final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_Scale_Sphere) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_Scale_Sphere");
static_assert(sizeof(BP_Exfil_TriggerZone_C_Scale_Sphere) == 0x000008, "Wrong size on BP_Exfil_TriggerZone_C_Scale_Sphere");
static_assert(offsetof(BP_Exfil_TriggerZone_C_Scale_Sphere, DeltaTime) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_Scale_Sphere::DeltaTime' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.SetExfilDuration
// 0x0008 (0x0008 - 0x0000)
struct BP_Exfil_TriggerZone_C_SetExfilDuration final
{
public:
	double                                        ExfilDuration_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_SetExfilDuration) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_SetExfilDuration");
static_assert(sizeof(BP_Exfil_TriggerZone_C_SetExfilDuration) == 0x000008, "Wrong size on BP_Exfil_TriggerZone_C_SetExfilDuration");
static_assert(offsetof(BP_Exfil_TriggerZone_C_SetExfilDuration, ExfilDuration_0) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_SetExfilDuration::ExfilDuration_0' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.Sphere Emission
// 0x0010 (0x0010 - 0x0000)
struct BP_Exfil_TriggerZone_C_Sphere_Emission final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Target;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_Sphere_Emission) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_Sphere_Emission");
static_assert(sizeof(BP_Exfil_TriggerZone_C_Sphere_Emission) == 0x000010, "Wrong size on BP_Exfil_TriggerZone_C_Sphere_Emission");
static_assert(offsetof(BP_Exfil_TriggerZone_C_Sphere_Emission, DeltaTime) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_Sphere_Emission::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_Sphere_Emission, Target) == 0x000008, "Member 'BP_Exfil_TriggerZone_C_Sphere_Emission::Target' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.StartCountdown
// 0x0020 (0x0020 - 0x0000)
struct BP_Exfil_TriggerZone_C_StartCountdown final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_StartCountdown) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_StartCountdown");
static_assert(sizeof(BP_Exfil_TriggerZone_C_StartCountdown) == 0x000020, "Wrong size on BP_Exfil_TriggerZone_C_StartCountdown");
static_assert(offsetof(BP_Exfil_TriggerZone_C_StartCountdown, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_StartCountdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_StartCountdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'BP_Exfil_TriggerZone_C_StartCountdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Exfil_TriggerZone_C_StartCountdown, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000018, "Member 'BP_Exfil_TriggerZone_C_StartCountdown::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_Exfil_TriggerZone.BP_Exfil_TriggerZone_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Exfil_TriggerZone_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Exfil_TriggerZone_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Exfil_TriggerZone_C_UserConstructionScript");
static_assert(sizeof(BP_Exfil_TriggerZone_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Exfil_TriggerZone_C_UserConstructionScript");
static_assert(offsetof(BP_Exfil_TriggerZone_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_Exfil_TriggerZone_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

