#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EndOfRaidSequence

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_EndOfRaidSequence.BP_EndOfRaidSequence_C.ExecuteUbergraph_BP_EndOfRaidSequence
// 0x0090 (0x0090 - 0x0000)
struct BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRaidTimeRemainingSec_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPulseCurveFloat_OutTime;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPulseCurveFloat_OutIntensity;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRaidTimeRemainingSec_ReturnValue_1;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRaidTimeRemainingSec_ReturnValue_2;    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPulseCurveFloat_InTime_ImplicitCast;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayShake_NormalizedMagnitude_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1;  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FFloor_A_ImplicitCast;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence) == 0x000008, "Wrong alignment on BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence");
static_assert(sizeof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence) == 0x000090, "Wrong size on BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, EntryPoint) == 0x000000, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_bool_Has_Been_Initd_Variable_1) == 0x000006, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetRaidTimeRemainingSec_ReturnValue) == 0x000008, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetRaidTimeRemainingSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00000C, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetPulseCurveFloat_OutTime) == 0x000010, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetPulseCurveFloat_OutTime' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetPulseCurveFloat_OutIntensity) == 0x000018, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetPulseCurveFloat_OutIntensity' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_delegate_Variable) == 0x000020, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_PostEvent_ReturnValue) == 0x000030, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetRaidTimeRemainingSec_ReturnValue_1) == 0x000034, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetRaidTimeRemainingSec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_delegate_Variable_1) == 0x000038, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_PostEvent_ReturnValue_1) == 0x00004C, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, Temp_bool_IsClosed_Variable_1) == 0x000050, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetRaidTimeRemainingSec_ReturnValue_2) == 0x000054, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetRaidTimeRemainingSec_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_FFloor_ReturnValue) == 0x000058, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_Delay_Duration_ImplicitCast) == 0x000060, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_GetPulseCurveFloat_InTime_ImplicitCast) == 0x000068, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_GetPulseCurveFloat_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_PlayShake_NormalizedMagnitude_ImplicitCast) == 0x000078, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_PlayShake_NormalizedMagnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1) == 0x000080, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence, CallFunc_FFloor_A_ImplicitCast) == 0x000088, "Member 'BP_EndOfRaidSequence_C_ExecuteUbergraph_BP_EndOfRaidSequence::CallFunc_FFloor_A_ImplicitCast' has a wrong offset!");

// Function BP_EndOfRaidSequence.BP_EndOfRaidSequence_C.GetPulseCurveFloat
// 0x0050 (0x0050 - 0x0000)
struct BP_EndOfRaidSequence_C_GetPulseCurveFloat final
{
public:
	double                                        InTime;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutTime;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OutIntensity;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorValue_ReturnValue;               // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVectorValue_InTime_ImplicitCast;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfRaidSequence_C_GetPulseCurveFloat) == 0x000008, "Wrong alignment on BP_EndOfRaidSequence_C_GetPulseCurveFloat");
static_assert(sizeof(BP_EndOfRaidSequence_C_GetPulseCurveFloat) == 0x000050, "Wrong size on BP_EndOfRaidSequence_C_GetPulseCurveFloat");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, InTime) == 0x000000, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::InTime' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, OutTime) == 0x000008, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::OutTime' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, OutIntensity) == 0x000010, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::OutIntensity' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, CallFunc_GetVectorValue_ReturnValue) == 0x000018, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::CallFunc_GetVectorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, CallFunc_BreakVector_Y) == 0x000038, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, CallFunc_BreakVector_Z) == 0x000040, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_GetPulseCurveFloat, CallFunc_GetVectorValue_InTime_ImplicitCast) == 0x000048, "Member 'BP_EndOfRaidSequence_C_GetPulseCurveFloat::CallFunc_GetVectorValue_InTime_ImplicitCast' has a wrong offset!");

// Function BP_EndOfRaidSequence.BP_EndOfRaidSequence_C.PlayShake
// 0x0118 (0x0118 - 0x0000)
struct BP_EndOfRaidSequence_C_PlayShake final
{
public:
	const class UAnimSpringSimData*               CameraShake;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UAnimSpringSimData*               WeaponShake;                                       // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         NormalizedMagnitude;                               // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Falloff;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 GameplayCue;                                       // 0x0020(0x00F0)(Edit, BlueprintVisible, ContainsInstancedReference)
	float                                         CallFunc_PlayCameraShakeAnimSpring_Falloff_ImplicitCast; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EndOfRaidSequence_C_PlayShake) == 0x000008, "Wrong alignment on BP_EndOfRaidSequence_C_PlayShake");
static_assert(sizeof(BP_EndOfRaidSequence_C_PlayShake) == 0x000118, "Wrong size on BP_EndOfRaidSequence_C_PlayShake");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, CameraShake) == 0x000000, "Member 'BP_EndOfRaidSequence_C_PlayShake::CameraShake' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, WeaponShake) == 0x000008, "Member 'BP_EndOfRaidSequence_C_PlayShake::WeaponShake' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, NormalizedMagnitude) == 0x000010, "Member 'BP_EndOfRaidSequence_C_PlayShake::NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, Falloff) == 0x000018, "Member 'BP_EndOfRaidSequence_C_PlayShake::Falloff' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, GameplayCue) == 0x000020, "Member 'BP_EndOfRaidSequence_C_PlayShake::GameplayCue' has a wrong offset!");
static_assert(offsetof(BP_EndOfRaidSequence_C_PlayShake, CallFunc_PlayCameraShakeAnimSpring_Falloff_ImplicitCast) == 0x000110, "Member 'BP_EndOfRaidSequence_C_PlayShake::CallFunc_PlayCameraShakeAnimSpring_Falloff_ImplicitCast' has a wrong offset!");

}

