#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExtractionTunnel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ExtractionTunnel.BP_ExtractionTunnel_C.Collapsed
// 0x0001 (0x0001 - 0x0000)
struct BP_ExtractionTunnel_C_Collapsed final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_C_Collapsed) == 0x000001, "Wrong alignment on BP_ExtractionTunnel_C_Collapsed");
static_assert(sizeof(BP_ExtractionTunnel_C_Collapsed) == 0x000001, "Wrong size on BP_ExtractionTunnel_C_Collapsed");
static_assert(offsetof(BP_ExtractionTunnel_C_Collapsed, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ExtractionTunnel_C_Collapsed::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_ExtractionTunnel.BP_ExtractionTunnel_C.Countdown
// 0x0018 (0x0018 - 0x0000)
struct BP_ExtractionTunnel_C_Countdown final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_C_Countdown) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_C_Countdown");
static_assert(sizeof(BP_ExtractionTunnel_C_Countdown) == 0x000018, "Wrong size on BP_ExtractionTunnel_C_Countdown");
static_assert(offsetof(BP_ExtractionTunnel_C_Countdown, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ExtractionTunnel_C_Countdown::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_Countdown, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_ExtractionTunnel_C_Countdown::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_Countdown, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_ExtractionTunnel_C_Countdown::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_ExtractionTunnel.BP_ExtractionTunnel_C.DestroyMapComponent
// 0x0001 (0x0001 - 0x0000)
struct BP_ExtractionTunnel_C_DestroyMapComponent final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_C_DestroyMapComponent) == 0x000001, "Wrong alignment on BP_ExtractionTunnel_C_DestroyMapComponent");
static_assert(sizeof(BP_ExtractionTunnel_C_DestroyMapComponent) == 0x000001, "Wrong size on BP_ExtractionTunnel_C_DestroyMapComponent");
static_assert(offsetof(BP_ExtractionTunnel_C_DestroyMapComponent, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_ExtractionTunnel_C_DestroyMapComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ExtractionTunnel.BP_ExtractionTunnel_C.EnableRenderMapWidgetEveryTick
// 0x0020 (0x0020 - 0x0000)
struct BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_TimerExistsHandle_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick");
static_assert(sizeof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick) == 0x000020, "Wrong size on BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick");
static_assert(offsetof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick, Enable) == 0x000000, "Member 'BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick::Enable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick, CallFunc_K2_TimerExistsHandle_ReturnValue) == 0x000001, "Member 'BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick::CallFunc_K2_TimerExistsHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_ExtractionTunnel_C_EnableRenderMapWidgetEveryTick::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_ExtractionTunnel.BP_ExtractionTunnel_C.ExecuteUbergraph_BP_ExtractionTunnel
// 0x0958 (0x0958 - 0x0000)
struct BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      K2Node_Event_NewState;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      K2Node_Event_OldState;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      K2Node_Event_StateBeforeConsumption;               // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPulseCurveFloat_Float;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPulseCurveFloat_Float_1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPulseCurveFloat_Float_2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_1;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_2;             // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_3;             // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_4;             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStateTimeRemaining_ReturnValue;        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_Vector3fToString_ReturnValue;        // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0180(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0198(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0200(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0250(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0268(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0278(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02C8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x02F8(0x0050)(HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0360(0x0010)(ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0388(0x0018)()
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue;    // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ExtractionTunnel_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x03C0(0x0010)(ReferenceParm)
	class ABP_Hero_C*                             CallFunc_GetActorOfClass_ReturnValue;              // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x03D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x03F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0410(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0500(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x05EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x05ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EE[0x2];                                      // 0x05EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x05F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0610(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0640(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0658(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68C[0x4];                                      // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0690(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x06E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x07D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D9[0x7];                                      // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x08E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8EA[0x2];                                      // 0x08EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStateTimeRemaining_ReturnValue_1;      // 0x08EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_1;  // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_5;             // 0x08F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x08F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F6[0x2];                                      // 0x08F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPulseCurveFloat_Float_3;               // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0900(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearInTimeAnomaly_ReturnValue;          // 0x0918(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0919(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91A[0x2];                                      // 0x091A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast;         // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayShake_NormalizedMagnitude_ImplicitCast; // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_Conv_Vector3fToString_InVec_ImplicitCast; // 0x0930(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93C[0x4];                                      // 0x093C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPlayRate_NewRate_ImplicitCast_1;       // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel) == 0x000008, "Wrong alignment on BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel");
static_assert(sizeof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel) == 0x000958, "Wrong size on BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, EntryPoint) == 0x000000, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, Temp_object_Variable) == 0x000008, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, Temp_object_Variable_1) == 0x000018, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_Event_NewState) == 0x000034, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_Event_OldState) == 0x000035, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_SwitchEnum_CmpSuccess) == 0x000036, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_Event_StateBeforeConsumption) == 0x000037, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_Event_StateBeforeConsumption' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue) == 0x000038, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000039, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetPulseCurveFloat_Float) == 0x000040, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetPulseCurveFloat_Float' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetPulseCurveFloat_Float_1) == 0x000048, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetPulseCurveFloat_Float_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000058, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetPulseCurveFloat_Float_2) == 0x000068, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetPulseCurveFloat_Float_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_1) == 0x000070, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_MapRangeClamped_ReturnValue) == 0x000078, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000080, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BooleanOR_ReturnValue) == 0x000081, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_2) == 0x000082, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_3) == 0x000083, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000084, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000085, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BooleanOR_ReturnValue_1) == 0x000086, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000087, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BooleanAND_ReturnValue) == 0x000088, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_4) == 0x000089, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetStateTimeRemaining_ReturnValue) == 0x00008C, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetStateTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000090, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BooleanOR_ReturnValue_2) == 0x000091, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_X) == 0x0000E0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000110, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000118, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000130, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000148, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_Vector3fToString_ReturnValue) == 0x000160, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_Vector3fToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetDisplayName_ReturnValue) == 0x000170, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_StringToText_ReturnValue) == 0x000180, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000198, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeStruct_FormatArgumentData) == 0x0001B0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeStruct_FormatArgumentData_1) == 0x000200, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000250, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeArray_Array) == 0x000268, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeStruct_FormatArgumentData_2) == 0x000278, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Format_ReturnValue) == 0x0002C8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002E0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeStruct_FormatArgumentData_3) == 0x0002F8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000348, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, K2Node_MakeArray_Array_1) == 0x000360, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000370, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Format_ReturnValue_1) == 0x000388, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0003A0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_TryPostEventOnAkComponent_ReturnValue) == 0x0003B8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_TryPostEventOnAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetAllActorsOfClass_OutActors) == 0x0003C0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetActorOfClass_ReturnValue) == 0x0003D0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceMultiForObjects_OutHits) == 0x0003D8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceMultiForObjects_ReturnValue) == 0x0003E8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetDistanceTo_ReturnValue) == 0x0003EC, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0003F0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x0003F8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x000408, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceSingle_OutHit) == 0x000410, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceSingle_ReturnValue) == 0x0004F8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Array_Get_Item) == 0x000500, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Array_Length_ReturnValue) == 0x0005E8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_bBlockingHit) == 0x0005EC, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_bInitialOverlap) == 0x0005ED, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_Time) == 0x0005F0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_Distance) == 0x0005F4, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_Location) == 0x0005F8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_ImpactPoint) == 0x000610, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_Normal) == 0x000628, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_ImpactNormal) == 0x000640, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_PhysMat) == 0x000658, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_HitActor) == 0x000660, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_HitComponent) == 0x000668, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_HitBoneName) == 0x000670, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_BoneName) == 0x000678, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_HitItem) == 0x000680, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_ElementIndex) == 0x000684, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_FaceIndex) == 0x000688, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_TraceStart) == 0x000690, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakHitResult_TraceEnd) == 0x0006A8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Less_IntInt_ReturnValue) == 0x0006C0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0006C8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceSingle_OutHit_1) == 0x0006E0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_LineTraceSingle_ReturnValue_1) == 0x0007C8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_SphereTraceSingle_OutHit) == 0x0007D0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_SphereTraceSingle_ReturnValue) == 0x0008B8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_X_1) == 0x0008C0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_Y_1) == 0x0008C8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_BreakVector_Z_1) == 0x0008D0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x0008D8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0008E0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_IsValid_ReturnValue) == 0x0008E8, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_IsValid_ReturnValue_1) == 0x0008E9, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetStateTimeRemaining_ReturnValue_1) == 0x0008EC, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetStateTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_TryPostEventOnAkComponent_ReturnValue_1) == 0x0008F0, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_TryPostEventOnAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_5) == 0x0008F4, "Member 'BP_ExtractionTunnel_C_ExecuteUbergraph_BP_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_5' has a wrong offset!");
