#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExfilAUV_CallIn_Sphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere
// 0x0040 (0x0040 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DurationSec;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ScaleSphere_DeltaTime_ImplicitCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere) == 0x000008, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere) == 0x000040, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, EntryPoint) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_byte_Variable) == 0x000004, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable) == 0x000005, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_1) == 0x000006, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_2) == 0x000007, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_3) == 0x000008, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_4) == 0x000009, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_5) == 0x00000A, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_6) == 0x00000B, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, Temp_bool_Variable_7) == 0x00000C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, CallFunc_HasAuthority_ReturnValue) == 0x00000D, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, K2Node_Event_DurationSec) == 0x000028, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::K2Node_Event_DurationSec' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, K2Node_Select_Default) == 0x000030, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere, CallFunc_ScaleSphere_DeltaTime_ImplicitCast) == 0x000038, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ExecuteUbergraph_BP_ExfilAUV_CallIn_Sphere::CallFunc_ScaleSphere_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.OnStateChanged_Notify
// 0x0050 (0x0050 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify final
{
public:
	EP2ExfiltrationAUVState                       NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_1;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify) == 0x000008, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify) == 0x000050, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, NewState) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::NewState' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, ReturnValue) == 0x000001, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable) == 0x000002, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_1) == 0x000019, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_2) == 0x00001A, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_3) == 0x00001B, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_4) == 0x00001C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_5) == 0x00001D, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_6) == 0x00001E, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_bool_Variable_7) == 0x00001F, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_byte_Variable) == 0x000020, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable) == 0x000024, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_1) == 0x000028, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_2) == 0x00002C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_3) == 0x000030, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_4) == 0x000034, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_5) == 0x000038, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_6) == 0x00003C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_real_Variable_7) == 0x000040, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, CallFunc_HasAuthority_ReturnValue) == 0x000044, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, Temp_byte_Variable_1) == 0x000045, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, K2Node_Select_Default) == 0x000048, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify, K2Node_Select_Default_1) == 0x00004C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_OnStateChanged_Notify::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick) == 0x000004, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.ScaleSphere
// 0x0330 (0x0330 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Target;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Start;                                             // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue_1;                  // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x0220(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast;         // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_DeltaTime_ImplicitCast_1;       // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_Current_ImplicitCast;  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere) == 0x000010, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere) == 0x000330, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, DeltaTime) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, Target) == 0x000008, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::Target' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, Start) == 0x000010, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::Start' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_VInterpTo_ReturnValue) == 0x000030, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000048, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00004C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_VInterpTo_ReturnValue_1) == 0x000050, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_VInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000068, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0000D0, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0001B8, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_MakeTransform_ReturnValue_1) == 0x0001C0, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_K2_SetRelativeTransform_SweepHitResult_1) == 0x000220, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_K2_SetRelativeTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_VInterpTo_DeltaTime_ImplicitCast) == 0x000308, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_VInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_VInterpTo_DeltaTime_ImplicitCast_1) == 0x00030C, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_VInterpTo_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_FInterpTo_Constant_Current_ImplicitCast) == 0x000310, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_FInterpTo_Constant_Current_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000318, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000320, "Member 'BP_ExfilAUV_CallIn_Sphere_C_ScaleSphere::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.Sphere Hide
// 0x0001 (0x0001 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide) == 0x000001, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide) == 0x000001, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide, Bool) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_Sphere_Hide::Bool' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.StartExfilSequence
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence final
{
public:
	float                                         DurationSec;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence) == 0x000004, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence) == 0x000004, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence, DurationSec) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_StartExfilSequence::DurationSec' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.UpdateLightColor
// 0x0004 (0x0004 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor final
{
public:
	float                                         ParameterValue;                                    // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor) == 0x000004, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor) == 0x000004, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor, ParameterValue) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_UpdateLightColor::ParameterValue' has a wrong offset!");

// Function BP_ExfilAUV_CallIn_Sphere.BP_ExfilAUV_CallIn_Sphere_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript");
static_assert(sizeof(BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript) == 0x000008, "Wrong size on BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript");
static_assert(offsetof(BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_ExfilAUV_CallIn_Sphere_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

