#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Workbench_Drone_AR

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Workbench_Drone_AR.BP_Facility_Workbench_Drone_AR_C
// 0x00C8 (0x08B8 - 0x07F0)
class ABP_Facility_Workbench_Drone_AR_C final : public AP2Facility_Drone
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal9;                                            // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal8;                                            // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal7;                                            // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal6;                                            // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal5;                                            // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal4;                                            // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow5;                                            // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow4;                                            // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight4;                                        // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  AkLight;                                           // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Workbench_Drone_AR_C">();
	}
	static class ABP_Facility_Workbench_Drone_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Workbench_Drone_AR_C>();
	}
};
static_assert(alignof(ABP_Facility_Workbench_Drone_AR_C) == 0x000008, "Wrong alignment on ABP_Facility_Workbench_Drone_AR_C");
static_assert(sizeof(ABP_Facility_Workbench_Drone_AR_C) == 0x0008B8, "Wrong size on ABP_Facility_Workbench_Drone_AR_C");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, StaticMesh) == 0x0007F0, "Member 'ABP_Facility_Workbench_Drone_AR_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, P2FacilityBoundary) == 0x0007F8, "Member 'ABP_Facility_Workbench_Drone_AR_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal9) == 0x000800, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal9' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal8) == 0x000808, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal8' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal7) == 0x000810, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal6) == 0x000818, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal5) == 0x000820, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal4) == 0x000828, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal3) == 0x000830, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal2) == 0x000838, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal1) == 0x000840, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Billboard) == 0x000848, "Member 'ABP_Facility_Workbench_Drone_AR_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow5) == 0x000850, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Decal) == 0x000858, "Member 'ABP_Facility_Workbench_Drone_AR_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow4) == 0x000860, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, SpotLight4) == 0x000868, "Member 'ABP_Facility_Workbench_Drone_AR_C::SpotLight4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow3) == 0x000870, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, SpotLight3) == 0x000878, "Member 'ABP_Facility_Workbench_Drone_AR_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow2) == 0x000880, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, SpotLight2) == 0x000888, "Member 'ABP_Facility_Workbench_Drone_AR_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow1) == 0x000890, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, SpotLight1) == 0x000898, "Member 'ABP_Facility_Workbench_Drone_AR_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, Arrow) == 0x0008A0, "Member 'ABP_Facility_Workbench_Drone_AR_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, SpotLight) == 0x0008A8, "Member 'ABP_Facility_Workbench_Drone_AR_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_AR_C, AkLight) == 0x0008B0, "Member 'ABP_Facility_Workbench_Drone_AR_C::AkLight' has a wrong offset!");

}

