#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Decorative_FloodLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Decorative_FloodLight.BP_Facility_Decorative_FloodLight_C
// 0x0038 (0x03C0 - 0x0388)
class ABP_Facility_Decorative_FloodLight_C final : public AP2Facility_InteractiveDeco
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Decorative_FloodLight(int32 EntryPoint)	 // 0xae1e64;
	void CustomEvent(class AP2Facility* InFacility)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Decorative_FloodLight_C">();
	}
	static class ABP_Facility_Decorative_FloodLight_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Decorative_FloodLight_C>();
	}
};
static_assert(alignof(ABP_Facility_Decorative_FloodLight_C) == 0x000008, "Wrong alignment on ABP_Facility_Decorative_FloodLight_C");
static_assert(sizeof(ABP_Facility_Decorative_FloodLight_C) == 0x0003C0, "Wrong size on ABP_Facility_Decorative_FloodLight_C");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, UberGraphFrame) == 0x000388, "Member 'ABP_Facility_Decorative_FloodLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, PointLight) == 0x000390, "Member 'ABP_Facility_Decorative_FloodLight_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, SpotLight) == 0x000398, "Member 'ABP_Facility_Decorative_FloodLight_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, Arrow) == 0x0003A0, "Member 'ABP_Facility_Decorative_FloodLight_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, P2FacilityBoundary1) == 0x0003A8, "Member 'ABP_Facility_Decorative_FloodLight_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, StaticMesh) == 0x0003B0, "Member 'ABP_Facility_Decorative_FloodLight_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_FloodLight_C, SharedRoot) == 0x0003B8, "Member 'ABP_Facility_Decorative_FloodLight_C::SharedRoot' has a wrong offset!");

}

