#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_VerticalGarden_AR

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C.ExecuteUbergraph_BP_Facility_VerticalGarden_AR
// 0x02E8 (0x02E8 - 0x0000)
struct BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility* InFacility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_2;                  // 0x0078(0x00C0)(ConstParm)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_1;                  // 0x0138(0x00C0)(ConstParm)
	float                                         K2Node_Event_InStartTimeNormalized;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility*                            K2Node_CustomEvent_InFacility;                     // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow;                    // 0x0220(0x00C0)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR");
static_assert(sizeof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR) == 0x0002E8, "Wrong size on BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, EntryPoint) == 0x000000, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable) == 0x000004, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable_3) == 0x000034, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable_4) == 0x000044, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, Temp_delegate_Variable_5) == 0x000054, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_Event_InCraftingDataRow_2) == 0x000078, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_Event_InCraftingDataRow_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_Event_InCraftingDataRow_1) == 0x000138, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_Event_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_Event_InStartTimeNormalized) == 0x0001F8, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_Event_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue) == 0x0001FC, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue_1) == 0x000200, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue_2) == 0x000204, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue_3) == 0x000208, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_CustomEvent_InFacility) == 0x000210, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_CustomEvent_InFacility' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue_4) == 0x000218, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, K2Node_Event_InCraftingDataRow) == 0x000220, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::K2Node_Event_InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR, CallFunc_PostAkEvent_ReturnValue_5) == 0x0002E0, "Member 'BP_Facility_VerticalGarden_AR_C_ExecuteUbergraph_BP_Facility_VerticalGarden_AR::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");

// Function BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C.MuteCraftingSound
// 0x0008 (0x0008 - 0x0000)
struct BP_Facility_VerticalGarden_AR_C_MuteCraftingSound final
{
public:
	class AP2Facility*                            InFacility;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_VerticalGarden_AR_C_MuteCraftingSound) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_AR_C_MuteCraftingSound");
static_assert(sizeof(BP_Facility_VerticalGarden_AR_C_MuteCraftingSound) == 0x000008, "Wrong size on BP_Facility_VerticalGarden_AR_C_MuteCraftingSound");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_MuteCraftingSound, InFacility) == 0x000000, "Member 'BP_Facility_VerticalGarden_AR_C_MuteCraftingSound::InFacility' has a wrong offset!");

// Function BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C.ReceiveCancelCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft) == 0x0000C0, "Wrong size on BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_AR_C_ReceiveCancelCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C.ReceiveCompleteCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft) == 0x0000C0, "Wrong size on BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_AR_C_ReceiveCompleteCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C.ReceiveStartCraft
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InStartTimeNormalized;                             // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft) == 0x0000C8, "Wrong size on BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft::InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft, InStartTimeNormalized) == 0x0000C0, "Member 'BP_Facility_VerticalGarden_AR_C_ReceiveStartCraft::InStartTimeNormalized' has a wrong offset!");

}

