#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Craft

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Craft.BP_Facility_Craft_C
// 0x0040 (0x0450 - 0x0410)
class ABP_Facility_Craft_C : public AP2Facility_Craft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_FacilityProgress_3D_C*               W_Facility_Progress_3D;                            // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          FadeInAnimSwitch;                                  // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NewState)> OnSetStateEvent;                                  // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LastNumProductionEvents;                           // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentState;                                      // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMenuOpened;                                       // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Delay_AutoReset;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Facility_Craft(int32 EntryPoint)	 // 0xae1e64;
	void GetCraftingDataRowByIndex(int32 Index_0, struct FP2CraftingDataRow* outCraftingDataRow)	 // 0xae1e64;
	void GetCraftingLifetime(const struct FP2CraftingDataRow& InCraftingDataRow, double* outLifetime)	 // 0xae1e64;
	void GetCurrentState(int32* OutState)	 // 0xae1e64;
	void GetStaticMeshByCraftingDataRow(const struct FP2CraftingDataRow& InCraftingDataRow, bool* bValidRD, class UStaticMesh** StaticMesh, TArray<class UMaterialInterface*>* Materials)	 // 0xae1e64;
	void OnChangeProduction(class AP2Facility_Production* InFacility, const class UP2ProductionEvent* InProductionEvent, const bool bWasCompleted, const bool bWasAdded)	 // 0xae1e64;
	void OnMenuClose(class AP2Facility* InFacility)	 // 0xae1e64;
	void OnMenuOpen(class AP2Facility* InFacility)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;
	void ResetStateToIdle()	 // 0xae1e64;
	void SetState(int32 InNewState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Craft_C">();
	}
	static class ABP_Facility_Craft_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Craft_C>();
	}
};
static_assert(alignof(ABP_Facility_Craft_C) == 0x000008, "Wrong alignment on ABP_Facility_Craft_C");
static_assert(sizeof(ABP_Facility_Craft_C) == 0x000450, "Wrong size on ABP_Facility_Craft_C");
static_assert(offsetof(ABP_Facility_Craft_C, UberGraphFrame) == 0x000410, "Member 'ABP_Facility_Craft_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, W_Facility_Progress_3D) == 0x000418, "Member 'ABP_Facility_Craft_C::W_Facility_Progress_3D' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, FadeInAnimSwitch) == 0x000420, "Member 'ABP_Facility_Craft_C::FadeInAnimSwitch' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, OnSetStateEvent) == 0x000428, "Member 'ABP_Facility_Craft_C::OnSetStateEvent' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, LastNumProductionEvents) == 0x000438, "Member 'ABP_Facility_Craft_C::LastNumProductionEvents' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, CurrentState) == 0x00043C, "Member 'ABP_Facility_Craft_C::CurrentState' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, bMenuOpened) == 0x000440, "Member 'ABP_Facility_Craft_C::bMenuOpened' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Craft_C, Delay_AutoReset) == 0x000448, "Member 'ABP_Facility_Craft_C::Delay_AutoReset' has a wrong offset!");

}

