#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Wage_AR

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Wage_AR.BP_Facility_Wage_AR_C
// 0x0028 (0x0400 - 0x03D8)
class ABP_Facility_Wage_AR_C final : public AP2Facility_Wage
{
public:
	class USkeletalMeshComponent*                 SK_Facility_DNASequencer_Base_01;                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	class UCameraComponent* GetDefaultCameraComponent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Wage_AR_C">();
	}
	static class ABP_Facility_Wage_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Wage_AR_C>();
	}
};
static_assert(alignof(ABP_Facility_Wage_AR_C) == 0x000008, "Wrong alignment on ABP_Facility_Wage_AR_C");
static_assert(sizeof(ABP_Facility_Wage_AR_C) == 0x000400, "Wrong size on ABP_Facility_Wage_AR_C");
static_assert(offsetof(ABP_Facility_Wage_AR_C, SK_Facility_DNASequencer_Base_01) == 0x0003D8, "Member 'ABP_Facility_Wage_AR_C::SK_Facility_DNASequencer_Base_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_AR_C, Camera) == 0x0003E0, "Member 'ABP_Facility_Wage_AR_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_AR_C, P2FacilityBoundary1) == 0x0003E8, "Member 'ABP_Facility_Wage_AR_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_AR_C, StaticMesh) == 0x0003F0, "Member 'ABP_Facility_Wage_AR_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_AR_C, SharedRoot) == 0x0003F8, "Member 'ABP_Facility_Wage_AR_C::SharedRoot' has a wrong offset!");

}

