#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facilities_Stash_Main

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facilities_Stash_Main.BP_Facilities_Stash_Main_C
// 0x0038 (0x03D8 - 0x03A0)
class ABP_Facilities_Stash_Main_C final : public AP2FacilityStash
{
public:
	class USpotLightComponent*                    SpotLight_Stationary_1;                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Slot0_Camera;                                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Template_3;                                     // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facilities_Stash_Main_C">();
	}
	static class ABP_Facilities_Stash_Main_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facilities_Stash_Main_C>();
	}
};
static_assert(alignof(ABP_Facilities_Stash_Main_C) == 0x000008, "Wrong alignment on ABP_Facilities_Stash_Main_C");
static_assert(sizeof(ABP_Facilities_Stash_Main_C) == 0x0003D8, "Wrong size on ABP_Facilities_Stash_Main_C");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, SpotLight_Stationary_1) == 0x0003A0, "Member 'ABP_Facilities_Stash_Main_C::SpotLight_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, Slot0_Camera) == 0x0003A8, "Member 'ABP_Facilities_Stash_Main_C::Slot0_Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, StaticMesh1) == 0x0003B0, "Member 'ABP_Facilities_Stash_Main_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, StaticMesh) == 0x0003B8, "Member 'ABP_Facilities_Stash_Main_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, P2FacilityBoundary) == 0x0003C0, "Member 'ABP_Facilities_Stash_Main_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, SM_Template_3) == 0x0003C8, "Member 'ABP_Facilities_Stash_Main_C::SM_Template_3' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_Main_C, SharedRoot) == 0x0003D0, "Member 'ABP_Facilities_Stash_Main_C::SharedRoot' has a wrong offset!");

}

