#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Printer_Level_01_Working

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Facility_Printer_classes.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C
// 0x01A8 (0x0718 - 0x0570)
class ABP_Facility_Printer_Level_01_Working_C final : public ABP_Facility_Printer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_Printer_Level_01_Working_C; // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight_Key1;                                    // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder18;                                        // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder17;                                        // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder16;                                        // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder15;                                        // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder14;                                        // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder13;                                        // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder12;                                        // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder11;                                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder10;                                        // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh22;                                      // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Printable_Shadow;                               // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PrinterCube;                                    // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Print_MidsectionCenter;                            // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Printable_MidSection;                           // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Printable;                                      // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PrintTable_Center;                                 // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Material_Shadow;                                   // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PrintProgress;                                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PrintSpeed;                                        // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Print;                                             // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Facility_Printer_Level_01_C*       As_ABP_Facility_Printer_Level_01;                  // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       dynamicMatInstances;                               // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FP2CraftingDataRow                     CraftingDataRow;                                   // 0x0658(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CleanPrinter()	 // 0xae1e64;
	void CompletePrinting()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Printer_Level_01_Working(int32 EntryPoint)	 // 0xae1e64;
	void Printing(double DeltaTime)	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveEndCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void StartPrinting(const struct FP2CraftingDataRow& InCraftData, double StartPrintProgress)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Printer_Level_01_Working_C">();
	}
	static class ABP_Facility_Printer_Level_01_Working_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Printer_Level_01_Working_C>();
	}
};
static_assert(alignof(ABP_Facility_Printer_Level_01_Working_C) == 0x000008, "Wrong alignment on ABP_Facility_Printer_Level_01_Working_C");
static_assert(sizeof(ABP_Facility_Printer_Level_01_Working_C) == 0x000718, "Wrong size on ABP_Facility_Printer_Level_01_Working_C");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, UberGraphFrame_BP_Facility_Printer_Level_01_Working_C) == 0x000570, "Member 'ABP_Facility_Printer_Level_01_Working_C::UberGraphFrame_BP_Facility_Printer_Level_01_Working_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SpotLight_Key1) == 0x000578, "Member 'ABP_Facility_Printer_Level_01_Working_C::SpotLight_Key1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder18) == 0x000580, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder18' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder17) == 0x000588, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder17' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder16) == 0x000590, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder16' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder15) == 0x000598, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder15' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder14) == 0x0005A0, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder14' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder13) == 0x0005A8, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder13' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder12) == 0x0005B0, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder12' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder11) == 0x0005B8, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder11' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Cylinder10) == 0x0005C0, "Member 'ABP_Facility_Printer_Level_01_Working_C::Cylinder10' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, StaticMesh22) == 0x0005C8, "Member 'ABP_Facility_Printer_Level_01_Working_C::StaticMesh22' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, StaticMesh21) == 0x0005D0, "Member 'ABP_Facility_Printer_Level_01_Working_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, StaticMesh20) == 0x0005D8, "Member 'ABP_Facility_Printer_Level_01_Working_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, StaticMesh19) == 0x0005E0, "Member 'ABP_Facility_Printer_Level_01_Working_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SM_Printable_Shadow) == 0x0005E8, "Member 'ABP_Facility_Printer_Level_01_Working_C::SM_Printable_Shadow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SM_PrinterCube) == 0x0005F0, "Member 'ABP_Facility_Printer_Level_01_Working_C::SM_PrinterCube' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SceneCaptureComponent2D) == 0x0005F8, "Member 'ABP_Facility_Printer_Level_01_Working_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Print_MidsectionCenter) == 0x000600, "Member 'ABP_Facility_Printer_Level_01_Working_C::Print_MidsectionCenter' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SM_Printable_MidSection) == 0x000608, "Member 'ABP_Facility_Printer_Level_01_Working_C::SM_Printable_MidSection' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, SM_Printable) == 0x000610, "Member 'ABP_Facility_Printer_Level_01_Working_C::SM_Printable' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, PrintTable_Center) == 0x000618, "Member 'ABP_Facility_Printer_Level_01_Working_C::PrintTable_Center' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Material_Shadow) == 0x000620, "Member 'ABP_Facility_Printer_Level_01_Working_C::Material_Shadow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, PrintProgress) == 0x000628, "Member 'ABP_Facility_Printer_Level_01_Working_C::PrintProgress' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, PrintSpeed) == 0x000630, "Member 'ABP_Facility_Printer_Level_01_Working_C::PrintSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, Print) == 0x000638, "Member 'ABP_Facility_Printer_Level_01_Working_C::Print' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, As_ABP_Facility_Printer_Level_01) == 0x000640, "Member 'ABP_Facility_Printer_Level_01_Working_C::As_ABP_Facility_Printer_Level_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, dynamicMatInstances) == 0x000648, "Member 'ABP_Facility_Printer_Level_01_Working_C::dynamicMatInstances' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_Level_01_Working_C, CraftingDataRow) == 0x000658, "Member 'ABP_Facility_Printer_Level_01_Working_C::CraftingDataRow' has a wrong offset!");

}

