#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FacilitySpot_UGVConsole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_FacilitySpot_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FacilitySpot_UGVConsole.BP_FacilitySpot_UGVConsole_C
// 0x0070 (0x04F0 - 0x0480)
class ABP_FacilitySpot_UGVConsole_C final : public ABP_FacilitySpot_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         LightActorArray;                                   // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	bool                                          FTUE_LightOn;                                      // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UActorComponent*, double>          LightComponentDefaultValueMap;                     // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_Facility_Decorative_FixtureOldLamp_Ceiling_01_C* CenterLIght;                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void OnSpotStatusChanged(class AP2FacilitySpot* InFacilitySpot, const struct FP2FacilitySpotStatusInfo& InOldStatus, const struct FP2FacilitySpotStatusInfo& InNewStatus)	 // 0xae1e64;
	void ExecuteUbergraph_BP_FacilitySpot_UGVConsole(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_FacilitySpot_UGVConsole_C">();
	}
	static class ABP_FacilitySpot_UGVConsole_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_FacilitySpot_UGVConsole_C>();
	}
};
static_assert(alignof(ABP_FacilitySpot_UGVConsole_C) == 0x000010, "Wrong alignment on ABP_FacilitySpot_UGVConsole_C");
static_assert(sizeof(ABP_FacilitySpot_UGVConsole_C) == 0x0004F0, "Wrong size on ABP_FacilitySpot_UGVConsole_C");
static_assert(offsetof(ABP_FacilitySpot_UGVConsole_C, UberGraphFrame) == 0x000478, "Member 'ABP_FacilitySpot_UGVConsole_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FacilitySpot_UGVConsole_C, LightActorArray) == 0x000480, "Member 'ABP_FacilitySpot_UGVConsole_C::LightActorArray' has a wrong offset!");
static_assert(offsetof(ABP_FacilitySpot_UGVConsole_C, FTUE_LightOn) == 0x000490, "Member 'ABP_FacilitySpot_UGVConsole_C::FTUE_LightOn' has a wrong offset!");
static_assert(offsetof(ABP_FacilitySpot_UGVConsole_C, LightComponentDefaultValueMap) == 0x000498, "Member 'ABP_FacilitySpot_UGVConsole_C::LightComponentDefaultValueMap' has a wrong offset!");
static_assert(offsetof(ABP_FacilitySpot_UGVConsole_C, CenterLIght) == 0x0004E8, "Member 'ABP_FacilitySpot_UGVConsole_C::CenterLIght' has a wrong offset!");

}

