#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_ChemLab

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_ChemLab.BP_Facility_ChemLab_C
// 0x0230 (0x0680 - 0x0450)
class ABP_Facility_ChemLab_C final : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_ChemLab_C;              // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight_Bounce_2;                                // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Progress_Stationary_NoShadow_2;          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Bounce_Stationary_NoShadow_1;            // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_KeyLight_4;                              // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_KeyLight_3;                              // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_KeyLight_2;                              // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Slot0_Camera;                                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Product;                                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Lamp;                                              // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight1;                                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight4;                                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight3;                                        // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facilitiy_ChemLab_Base_01_A;                    // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_08;                         // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_07;                         // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_06;                         // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_05;                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Medium_01;                        // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_04;                         // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_03;                         // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Bounce_1;                                // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Large_01;                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LabBottles_01_Small_02;                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  P2AkAmbient;                                       // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_KeyLight_1;                              // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     CurrentCraftingDataRow;                            // 0x0550(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTransform                             SM_Product_Rest;                                   // 0x0610(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     HologramMaterial;                                  // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EnsureCraftingStateIfQueueHasWork()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_ChemLab(int32 EntryPoint)	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void OnSetState(int32 NewState)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_ChemLab_C">();
	}
	static class ABP_Facility_ChemLab_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_ChemLab_C>();
	}
};
static_assert(alignof(ABP_Facility_ChemLab_C) == 0x000010, "Wrong alignment on ABP_Facility_ChemLab_C");
static_assert(sizeof(ABP_Facility_ChemLab_C) == 0x000680, "Wrong size on ABP_Facility_ChemLab_C");
static_assert(offsetof(ABP_Facility_ChemLab_C, UberGraphFrame_BP_Facility_ChemLab_C) == 0x000450, "Member 'ABP_Facility_ChemLab_C::UberGraphFrame_BP_Facility_ChemLab_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_Bounce_2) == 0x000458, "Member 'ABP_Facility_ChemLab_C::SpotLight_Bounce_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, RectLight_Progress_Stationary_NoShadow_2) == 0x000460, "Member 'ABP_Facility_ChemLab_C::RectLight_Progress_Stationary_NoShadow_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, RectLight_Bounce_Stationary_NoShadow_1) == 0x000468, "Member 'ABP_Facility_ChemLab_C::RectLight_Bounce_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, StaticMesh) == 0x000470, "Member 'ABP_Facility_ChemLab_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_KeyLight_4) == 0x000478, "Member 'ABP_Facility_ChemLab_C::SpotLight_KeyLight_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_KeyLight_3) == 0x000480, "Member 'ABP_Facility_ChemLab_C::SpotLight_KeyLight_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_KeyLight_2) == 0x000488, "Member 'ABP_Facility_ChemLab_C::SpotLight_KeyLight_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, Slot0_Camera) == 0x000490, "Member 'ABP_Facility_ChemLab_C::Slot0_Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_Product) == 0x000498, "Member 'ABP_Facility_ChemLab_C::SM_Product' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, Lamp) == 0x0004A0, "Member 'ABP_Facility_ChemLab_C::Lamp' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, RectLight1) == 0x0004A8, "Member 'ABP_Facility_ChemLab_C::RectLight1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, RectLight4) == 0x0004B0, "Member 'ABP_Facility_ChemLab_C::RectLight4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, RectLight3) == 0x0004B8, "Member 'ABP_Facility_ChemLab_C::RectLight3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SK_Facilitiy_ChemLab_Base_01_A) == 0x0004C0, "Member 'ABP_Facility_ChemLab_C::SK_Facilitiy_ChemLab_Base_01_A' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_08) == 0x0004C8, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_08' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_07) == 0x0004D0, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_07' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_06) == 0x0004D8, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_06' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_05) == 0x0004E0, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_05' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Medium_01) == 0x0004E8, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Medium_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_04) == 0x0004F0, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_04' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_03) == 0x0004F8, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_03' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, StaticMesh4) == 0x000500, "Member 'ABP_Facility_ChemLab_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, StaticMesh3) == 0x000508, "Member 'ABP_Facility_ChemLab_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight2) == 0x000510, "Member 'ABP_Facility_ChemLab_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_Bounce_1) == 0x000518, "Member 'ABP_Facility_ChemLab_C::SpotLight_Bounce_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Large_01) == 0x000520, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Large_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_LabBottles_01_Small_02) == 0x000528, "Member 'ABP_Facility_ChemLab_C::SM_LabBottles_01_Small_02' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, P2FacilityBoundary) == 0x000530, "Member 'ABP_Facility_ChemLab_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, Ak) == 0x000538, "Member 'ABP_Facility_ChemLab_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, P2AkAmbient) == 0x000540, "Member 'ABP_Facility_ChemLab_C::P2AkAmbient' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SpotLight_KeyLight_1) == 0x000548, "Member 'ABP_Facility_ChemLab_C::SpotLight_KeyLight_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, CurrentCraftingDataRow) == 0x000550, "Member 'ABP_Facility_ChemLab_C::CurrentCraftingDataRow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, SM_Product_Rest) == 0x000610, "Member 'ABP_Facility_ChemLab_C::SM_Product_Rest' has a wrong offset!");
static_assert(offsetof(ABP_Facility_ChemLab_C, HologramMaterial) == 0x000670, "Member 'ABP_Facility_ChemLab_C::HologramMaterial' has a wrong offset!");

}

