#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Delivery

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Delivery.BP_Facility_Delivery_C
// 0x0030 (0x0308 - 0x02D8)
class ABP_Facility_Delivery_C final : public AP2FacilityDeliveryInfoActor
{
public:
	class UStaticMeshComponent*                   X_4;                                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   X_3;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   X_5;                                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   X_2;                                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Root;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Line_Bottom;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Delivery_C">();
	}
	static class ABP_Facility_Delivery_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Delivery_C>();
	}
};
static_assert(alignof(ABP_Facility_Delivery_C) == 0x000008, "Wrong alignment on ABP_Facility_Delivery_C");
static_assert(sizeof(ABP_Facility_Delivery_C) == 0x000308, "Wrong size on ABP_Facility_Delivery_C");
static_assert(offsetof(ABP_Facility_Delivery_C, X_4) == 0x0002D8, "Member 'ABP_Facility_Delivery_C::X_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Delivery_C, X_3) == 0x0002E0, "Member 'ABP_Facility_Delivery_C::X_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Delivery_C, X_5) == 0x0002E8, "Member 'ABP_Facility_Delivery_C::X_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Delivery_C, X_2) == 0x0002F0, "Member 'ABP_Facility_Delivery_C::X_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Delivery_C, Root) == 0x0002F8, "Member 'ABP_Facility_Delivery_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Delivery_C, SM_Line_Bottom) == 0x000300, "Member 'ABP_Facility_Delivery_C::SM_Line_Bottom' has a wrong offset!");

}

