#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_AmmoPlantAdv

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_AmmoPlantAdv.BP_Facility_AmmoPlantAdv_C
// 0x0190 (0x05A0 - 0x0410)
class ABP_Facility_AmmoPlantAdv_C final : public AP2Facility_Craft
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlantAdv_02;                           // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlantAdv_01;                           // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_014;                             // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_012;                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_013;                             // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_010;                             // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_01;                              // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_04;                              // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_05;                              // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_06;                              // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_07;                              // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_03;                              // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_09;                              // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Temp_AmmoPlant_08;                              // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  Static;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube24;                                            // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube23;                                            // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube22;                                            // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube21;                                            // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube20;                                            // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube19;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube18;                                            // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube17;                                            // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube16;                                            // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube15;                                            // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube14;                                            // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube13;                                            // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube12;                                            // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube10;                                            // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube9;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight4;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_cardboards_08;                                  // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_cardboards_03;                                  // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_cardboards_02;                                  // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ammo_Crate_01b2;                                // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ammo_Crate_01b1;                                // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Ammo_Crate_01b;                                 // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_liquid_storage_water_barrel;                    // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_auto_repair_props_02_pliers_01;                 // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_auto_repair_props_04_box_tray;                  // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_cardboards_12;                                  // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Facility_VerticalGarden_Level_01_Desk;          // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Facility_VerticalGarden_Level_01_Desk1;         // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bucket_01;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StaticMeshes;                                      // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_AmmoPlantAdv(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_AmmoPlantAdv_C">();
	}
	static class ABP_Facility_AmmoPlantAdv_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_AmmoPlantAdv_C>();
	}
};
static_assert(alignof(ABP_Facility_AmmoPlantAdv_C) == 0x000008, "Wrong alignment on ABP_Facility_AmmoPlantAdv_C");
static_assert(sizeof(ABP_Facility_AmmoPlantAdv_C) == 0x0005A0, "Wrong size on ABP_Facility_AmmoPlantAdv_C");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, UberGraphFrame) == 0x000410, "Member 'ABP_Facility_AmmoPlantAdv_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlantAdv_02) == 0x000418, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlantAdv_02' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlantAdv_01) == 0x000420, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlantAdv_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_014) == 0x000428, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_014' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_012) == 0x000430, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_012' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_013) == 0x000438, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_013' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_010) == 0x000440, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_010' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_01) == 0x000448, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_04) == 0x000450, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_04' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_05) == 0x000458, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_05' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_06) == 0x000460, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_06' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_07) == 0x000468, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_07' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_03) == 0x000470, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_03' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_09) == 0x000478, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_09' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Temp_AmmoPlant_08) == 0x000480, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Temp_AmmoPlant_08' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, P2FacilityBoundary) == 0x000488, "Member 'ABP_Facility_AmmoPlantAdv_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Ak) == 0x000490, "Member 'ABP_Facility_AmmoPlantAdv_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Static) == 0x000498, "Member 'ABP_Facility_AmmoPlantAdv_C::Static' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube24) == 0x0004A0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube24' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube23) == 0x0004A8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube23' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube22) == 0x0004B0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube22' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube21) == 0x0004B8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube21' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube20) == 0x0004C0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube20' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube19) == 0x0004C8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube19' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube18) == 0x0004D0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube18' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube17) == 0x0004D8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube17' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube16) == 0x0004E0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube16' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube15) == 0x0004E8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube15' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube14) == 0x0004F0, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube14' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube13) == 0x0004F8, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube13' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube12) == 0x000500, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube12' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube10) == 0x000508, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube10' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, Cube9) == 0x000510, "Member 'ABP_Facility_AmmoPlantAdv_C::Cube9' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SpotLight1) == 0x000518, "Member 'ABP_Facility_AmmoPlantAdv_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, RectLight4) == 0x000520, "Member 'ABP_Facility_AmmoPlantAdv_C::RectLight4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_cardboards_08) == 0x000528, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_cardboards_08' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_cardboards_03) == 0x000530, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_cardboards_03' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_cardboards_02) == 0x000538, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_cardboards_02' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Ammo_Crate_01b2) == 0x000540, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Ammo_Crate_01b2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Ammo_Crate_01b1) == 0x000548, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Ammo_Crate_01b1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Ammo_Crate_01b) == 0x000550, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Ammo_Crate_01b' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_liquid_storage_water_barrel) == 0x000558, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_liquid_storage_water_barrel' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_auto_repair_props_02_pliers_01) == 0x000560, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_auto_repair_props_02_pliers_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_auto_repair_props_04_box_tray) == 0x000568, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_auto_repair_props_04_box_tray' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_cardboards_12) == 0x000570, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_cardboards_12' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Facility_VerticalGarden_Level_01_Desk) == 0x000578, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Facility_VerticalGarden_Level_01_Desk' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Facility_VerticalGarden_Level_01_Desk1) == 0x000580, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Facility_VerticalGarden_Level_01_Desk1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, StaticMesh6) == 0x000588, "Member 'ABP_Facility_AmmoPlantAdv_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, SM_Bucket_01) == 0x000590, "Member 'ABP_Facility_AmmoPlantAdv_C::SM_Bucket_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlantAdv_C, StaticMeshes) == 0x000598, "Member 'ABP_Facility_AmmoPlantAdv_C::StaticMeshes' has a wrong offset!");

}

