#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Decorative_Contract_FishTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Decorative_Contract_FishTank.BP_Facility_Decorative_Contract_FishTank_C
// 0x0118 (0x0490 - 0x0378)
class ABP_Facility_Decorative_Contract_FishTank_C final : public AP2Facility_Decoration
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SKM_FishCEO;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Bottom_2;            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Top;                 // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Side_3;              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Side_2;              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Side_1;              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Stationary_Bottom_1;            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Key;                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Fishtank_Bubbles;                               // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Boids_Fish_Tank;                                // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WireBundle_Crn90_25cm_04;                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WireBundle_Crn90_25cm_03;                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WireBundle_Crn90_25cm_02;                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_WireBundle_Crn90_25cm_01;                       // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_OFF;                                     // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Coral_Spathulata_S_01;                     // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Weed_Kelp_Big_01;                          // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Rock_C_1;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Coral_Acropora_S_01;                       // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Coral_Elkhorn_L_01;                        // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Coral_Group_Pillar_L_02;                   // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fixture_Neon_Single_01;                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     P2Action;                                          // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane1;                                            // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_UNDW_Coral_Group_Pillar_L_01;                   // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Seconds;                                     // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               FishLookatRotation;                                // 0x0460(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                FishStartLocation;                                 // 0x0478(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Facility_Decorative_Contract_FishTank(int32 EntryPoint)	 // 0xae1e64;
	void PostInteraction(class UP2ActionBaseComponent* InActionComponent, class UP2Action* InAction, class APawn* InPawnInstigator)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Decorative_Contract_FishTank_C">();
	}
	static class ABP_Facility_Decorative_Contract_FishTank_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Decorative_Contract_FishTank_C>();
	}
};
static_assert(alignof(ABP_Facility_Decorative_Contract_FishTank_C) == 0x000008, "Wrong alignment on ABP_Facility_Decorative_Contract_FishTank_C");
static_assert(sizeof(ABP_Facility_Decorative_Contract_FishTank_C) == 0x000490, "Wrong size on ABP_Facility_Decorative_Contract_FishTank_C");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, UberGraphFrame) == 0x000378, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SKM_FishCEO) == 0x000380, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SKM_FishCEO' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Bottom_2) == 0x000388, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Bottom_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Top) == 0x000390, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Top' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Side_3) == 0x000398, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Side_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Side_2) == 0x0003A0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Side_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Side_1) == 0x0003A8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Side_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, RectLight_NoShadow_Stationary_Bottom_1) == 0x0003B0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::RectLight_NoShadow_Stationary_Bottom_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SpotLight_Top_Key) == 0x0003B8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SpotLight_Top_Key' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, NS_Fishtank_Bubbles) == 0x0003C0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::NS_Fishtank_Bubbles' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, NS_Boids_Fish_Tank) == 0x0003C8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::NS_Boids_Fish_Tank' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, P2FacilityBoundary) == 0x0003D0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_WireBundle_Crn90_25cm_04) == 0x0003D8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_WireBundle_Crn90_25cm_04' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_WireBundle_Crn90_25cm_03) == 0x0003E0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_WireBundle_Crn90_25cm_03' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_WireBundle_Crn90_25cm_02) == 0x0003E8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_WireBundle_Crn90_25cm_02' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_WireBundle_Crn90_25cm_01) == 0x0003F0, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_WireBundle_Crn90_25cm_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SpotLight_OFF) == 0x0003F8, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SpotLight_OFF' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Coral_Spathulata_S_01) == 0x000400, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Coral_Spathulata_S_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Weed_Kelp_Big_01) == 0x000408, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Weed_Kelp_Big_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Rock_C_1) == 0x000410, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Rock_C_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Coral_Acropora_S_01) == 0x000418, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Coral_Acropora_S_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Coral_Elkhorn_L_01) == 0x000420, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Coral_Elkhorn_L_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Coral_Group_Pillar_L_02) == 0x000428, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Coral_Group_Pillar_L_02' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_Fixture_Neon_Single_01) == 0x000430, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_Fixture_Neon_Single_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, P2Action) == 0x000438, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, Plane1) == 0x000440, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::Plane1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, Plane) == 0x000448, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, SM_UNDW_Coral_Group_Pillar_L_01) == 0x000450, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::SM_UNDW_Coral_Group_Pillar_L_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, Delta_Seconds) == 0x000458, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, FishLookatRotation) == 0x000460, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::FishLookatRotation' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Contract_FishTank_C, FishStartLocation) == 0x000478, "Member 'ABP_Facility_Decorative_Contract_FishTank_C::FishStartLocation' has a wrong offset!");

}

