#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_EngineeringTable

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_EngineeringTable.BP_Facility_EngineeringTable_C
// 0x0240 (0x0690 - 0x0450)
class ABP_Facility_EngineeringTable_C final : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_EngineeringTable_C;     // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight_EngTable_Top_Stationary_2;               // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_8;          // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_7;          // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_6;          // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_5;          // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_4;          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_3;          // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_sidetable;                              // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Slot0_Camera;                                      // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Facility_EngiTable_Cover_01;                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EngineeringTable_Screen;                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EngineeringTable_NozzleArc;                     // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_EngineeringTable_Wash;                          // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facility_EngiTable_Base_01_B;                   // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Printable;                                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_2;          // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_OFF_1;                                   // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_OFF_2;                                   // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_EngTable_ProgressBar_Stationary_1;       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_EngTable_Stationary_NoShadow_1;          // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_EngTable_Top_Stationary_1;               // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_EngTable_Inside_Stationary_1;            // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StaticMeshes;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             PrintableRestTransformLS;                          // 0x0520(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPhysicalMaterial*>              PhysMat_Metal;                                     // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       PrintableMIDs;                                     // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        PrintAge;                                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PrintLifetime;                                     // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BeginWashPercentage;                               // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WashTimer;                                         // 0x05B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     CurrentCraftingDataRow;                            // 0x05C0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StartTimeNormalized;                               // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Facility_EngineeringTable(int32 EntryPoint)	 // 0xae1e64;
	void InitPrintable(const struct FP2CraftingDataRow& InCraftingDataRow, class UStaticMeshComponent* SMC_Printable, const struct FTransform& RestTransformLS, TArray<class UPhysicalMaterial*>& MetalPhysMats, bool* bSuccess, TArray<class UMaterialInstanceDynamic*>* outMIDs, bool* outIsMetal)	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void OnSetPrintableMaterial(bool IsMetal)	 // 0xae1e64;
	void OnSetState(int32 NewState)	 // 0xae1e64;
	void OnStartWash()	 // 0xae1e64;
	void OpenCover(bool IsOpen)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void StopWashSound()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_EngineeringTable_C">();
	}
	static class ABP_Facility_EngineeringTable_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_EngineeringTable_C>();
	}
};
static_assert(alignof(ABP_Facility_EngineeringTable_C) == 0x000010, "Wrong alignment on ABP_Facility_EngineeringTable_C");
static_assert(sizeof(ABP_Facility_EngineeringTable_C) == 0x000690, "Wrong size on ABP_Facility_EngineeringTable_C");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, UberGraphFrame_BP_Facility_EngineeringTable_C) == 0x000450, "Member 'ABP_Facility_EngineeringTable_C::UberGraphFrame_BP_Facility_EngineeringTable_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_EngTable_Top_Stationary_2) == 0x000458, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_EngTable_Top_Stationary_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_8) == 0x000460, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_8' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_7) == 0x000468, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_6) == 0x000470, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_5) == 0x000478, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_4) == 0x000480, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_3) == 0x000488, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, StaticMesh_sidetable) == 0x000490, "Member 'ABP_Facility_EngineeringTable_C::StaticMesh_sidetable' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, Slot0_Camera) == 0x000498, "Member 'ABP_Facility_EngineeringTable_C::Slot0_Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SM_Facility_EngiTable_Cover_01) == 0x0004A0, "Member 'ABP_Facility_EngineeringTable_C::SM_Facility_EngiTable_Cover_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, NS_EngineeringTable_Screen) == 0x0004A8, "Member 'ABP_Facility_EngineeringTable_C::NS_EngineeringTable_Screen' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, NS_EngineeringTable_NozzleArc) == 0x0004B0, "Member 'ABP_Facility_EngineeringTable_C::NS_EngineeringTable_NozzleArc' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, NS_EngineeringTable_Wash) == 0x0004B8, "Member 'ABP_Facility_EngineeringTable_C::NS_EngineeringTable_Wash' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SK_Facility_EngiTable_Base_01_B) == 0x0004C0, "Member 'ABP_Facility_EngineeringTable_C::SK_Facility_EngiTable_Base_01_B' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SM_Printable) == 0x0004C8, "Member 'ABP_Facility_EngineeringTable_C::SM_Printable' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_2) == 0x0004D0, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_OFF_1) == 0x0004D8, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_OFF_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_OFF_2) == 0x0004E0, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_OFF_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_EngTable_ProgressBar_Stationary_1) == 0x0004E8, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_EngTable_ProgressBar_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, RectLight_EngTable_Stationary_NoShadow_1) == 0x0004F0, "Member 'ABP_Facility_EngineeringTable_C::RectLight_EngTable_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_EngTable_Top_Stationary_1) == 0x0004F8, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_EngTable_Top_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, SpotLight_EngTable_Inside_Stationary_1) == 0x000500, "Member 'ABP_Facility_EngineeringTable_C::SpotLight_EngTable_Inside_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, P2FacilityBoundary) == 0x000508, "Member 'ABP_Facility_EngineeringTable_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, Ak) == 0x000510, "Member 'ABP_Facility_EngineeringTable_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, StaticMeshes) == 0x000518, "Member 'ABP_Facility_EngineeringTable_C::StaticMeshes' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, PrintableRestTransformLS) == 0x000520, "Member 'ABP_Facility_EngineeringTable_C::PrintableRestTransformLS' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, PhysMat_Metal) == 0x000580, "Member 'ABP_Facility_EngineeringTable_C::PhysMat_Metal' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, PrintableMIDs) == 0x000590, "Member 'ABP_Facility_EngineeringTable_C::PrintableMIDs' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, PrintAge) == 0x0005A0, "Member 'ABP_Facility_EngineeringTable_C::PrintAge' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, PrintLifetime) == 0x0005A8, "Member 'ABP_Facility_EngineeringTable_C::PrintLifetime' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, BeginWashPercentage) == 0x0005B0, "Member 'ABP_Facility_EngineeringTable_C::BeginWashPercentage' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, WashTimer) == 0x0005B8, "Member 'ABP_Facility_EngineeringTable_C::WashTimer' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, CurrentCraftingDataRow) == 0x0005C0, "Member 'ABP_Facility_EngineeringTable_C::CurrentCraftingDataRow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_EngineeringTable_C, StartTimeNormalized) == 0x000680, "Member 'ABP_Facility_EngineeringTable_C::StartTimeNormalized' has a wrong offset!");

}

