#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_AmmoPlant

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_AmmoPlant.BP_Facility_AmmoPlant_C.EnsureCraftingStateIfQueueHasWork
// 0x0020 (0x0020 - 0x0000)
struct BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork final
{
public:
	int32                                         CallFunc_GetCurrentState_outState;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2ProductionEvent*>             CallFunc_GetOngoingProductionEvents_ReturnValue;   // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork) == 0x000008, "Wrong alignment on BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork");
static_assert(sizeof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork) == 0x000020, "Wrong size on BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork");
static_assert(offsetof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork, CallFunc_GetCurrentState_outState) == 0x000000, "Member 'BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork::CallFunc_GetCurrentState_outState' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork, CallFunc_GetOngoingProductionEvents_ReturnValue) == 0x000008, "Member 'BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork::CallFunc_GetOngoingProductionEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000019, "Member 'BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_Facility_AmmoPlant_C_EnsureCraftingStateIfQueueHasWork::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Facility_AmmoPlant.BP_Facility_AmmoPlant_C.ExecuteUbergraph_BP_Facility_AmmoPlant
// 0x0F50 (0x0F50 - 0x0000)
struct BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewState)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility* InFacility)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x0110(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6; // 0x0120(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0130(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7; // 0x0190(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_8; // 0x01A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_2;                  // 0x0210(0x00C0)(ConstParm)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_1;                  // 0x02D0(0x00C0)(ConstParm)
	float                                         K2Node_Event_InStartTimeNormalized;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility*                            K2Node_CustomEvent_InFacility;                     // 0x03A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow;                    // 0x03B8(0x00C0)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewState;                       // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Facility_AmmoPlant_Base_01_A_C*    K2Node_DynamicCast_AsABP_Facility_Ammo_Plant_Base_01_A; // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_AmmoPlant_Belt_01_C*               K2Node_DynamicCast_AsABP_Ammo_Plant_Belt_01;       // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_TransformRotation_ReturnValue;            // 0x04C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue_6;                // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_7;                // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_8;                // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_TransformRotation_ReturnValue_1;          // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStaticMeshByCraftingDataRow_bValidRD;  // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh; // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetStaticMeshByCraftingDataRow_Materials; // 0x0510(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetStaticMeshByCraftingDataRow_bValidRD_1; // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh_1; // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetStaticMeshByCraftingDataRow_Materials_1; // 0x0530(0x0010)(ReferenceParm)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0540(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UStaticMesh*                            K2Node_Select_Default_1;                           // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue_1;             // 0x0580(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X;                            // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x05D0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x0620(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_655[0x3];                                      // 0x0655(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0658(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x06A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x06E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0710(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue_1;                  // 0x0728(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0760(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin_1;            // 0x07C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent_1;         // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius_1;      // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0xC];                                      // 0x07F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default_2;                           // 0x0800(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0860(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0878(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_BreakVector_X_4;                          // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_5;                          // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0998(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_3;                       // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x09B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_1;          // 0x09D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x7];                                      // 0x09F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A18[0x8];                                      // 0x0A18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0A20(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A81[0xF];                                      // 0x0A81(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default_3;                           // 0x0A90(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x0AF0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class UP2ProductionEvent*>             CallFunc_GetOngoingProductionEvents_ReturnValue;   // 0x0BD8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0BE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0BEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BED[0x3];                                      // 0x0BED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue_2;             // 0x0BF0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue_2;                  // 0x0C28(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin_2;            // 0x0C60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent_2;         // 0x0C78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius_2;      // 0x0C90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C94[0x4];                                      // 0x0C94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_6;                          // 0x0C98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_6;                          // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_6;                          // 0x0CA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x0CB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_7;                          // 0x0CC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_7;                          // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_7;                          // 0x0CD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_8;                          // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_8;                          // 0x0CE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_8;                          // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0CF8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_4;                       // 0x0D10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x0D18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_5;                       // 0x0D30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0D38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0D39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3A[0x6];                                      // 0x0D3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_TransformRotation_ReturnValue_2;          // 0x0D40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue_2;          // 0x0D60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_2;                       // 0x0D78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0D80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D84[0x4];                                      // 0x0D84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0D88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x0DA0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_Select_Default_4;                           // 0x0E00(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_2; // 0x0E60(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant) == 0x000010, "Wrong alignment on BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant");
static_assert(sizeof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant) == 0x000F50, "Wrong size on BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, EntryPoint) == 0x000000, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_bool_Variable) == 0x000004, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_int_Variable) == 0x000018, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable) == 0x00001C, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable_1) == 0x000020, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable_2) == 0x000024, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable_3) == 0x000028, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable_4) == 0x00002C, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_real_Variable_5) == 0x000030, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable) == 0x000034, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_1) == 0x000054, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_2) == 0x000064, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_bool_Variable_1) == 0x000074, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_3) == 0x000078, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_4) == 0x000088, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_5) == 0x000110, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_6) == 0x000120, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_MakeTransform_ReturnValue_1) == 0x000130, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_7) == 0x000190, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_delegate_Variable_8) == 0x0001A0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_delegate_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_MakeTransform_ReturnValue_2) == 0x0001B0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Event_InCraftingDataRow_2) == 0x000210, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Event_InCraftingDataRow_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Event_InCraftingDataRow_1) == 0x0002D0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Event_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Event_InStartTimeNormalized) == 0x000390, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Event_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue) == 0x000394, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_1) == 0x000398, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_2) == 0x00039C, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_3) == 0x0003A0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_CustomEvent_InFacility) == 0x0003A8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_CustomEvent_InFacility' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_4) == 0x0003B0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Event_InCraftingDataRow) == 0x0003B8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Event_InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_5) == 0x000478, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_CustomEvent_NewState) == 0x00047C, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_SwitchInteger_CmpSuccess) == 0x000480, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Select_Default) == 0x000484, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_bool_Variable_2) == 0x000488, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetAnimInstance_ReturnValue) == 0x000490, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000498, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_DynamicCast_AsABP_Facility_Ammo_Plant_Base_01_A) == 0x0004A0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_DynamicCast_AsABP_Facility_Ammo_Plant_Base_01_A' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_DynamicCast_bSuccess) == 0x0004A8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_DynamicCast_AsABP_Ammo_Plant_Belt_01) == 0x0004B0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_DynamicCast_AsABP_Ammo_Plant_Belt_01' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_DynamicCast_bSuccess_1) == 0x0004B8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_TransformRotation_ReturnValue) == 0x0004C0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_TransformRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_6) == 0x0004D8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_7) == 0x0004DC, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_PostAkEvent_ReturnValue_8) == 0x0004E0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_PostAkEvent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_TransformRotation_ReturnValue_1) == 0x0004E8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_TransformRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, Temp_bool_Variable_3) == 0x000500, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_bValidRD) == 0x000501, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_bValidRD' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh) == 0x000508, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_Materials) == 0x000510, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_Materials' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_bValidRD_1) == 0x000520, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_bValidRD_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh_1) == 0x000528, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_StaticMesh_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetStaticMeshByCraftingDataRow_Materials_1) == 0x000530, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetStaticMeshByCraftingDataRow_Materials_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetBoundingBox_ReturnValue) == 0x000540, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Select_Default_1) == 0x000578, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetBoundingBox_ReturnValue_1) == 0x000580, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_X) == 0x0005B8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Y) == 0x0005C0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Z) == 0x0005C8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetBounds_ReturnValue) == 0x0005D0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_X_1) == 0x000608, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Y_1) == 0x000610, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Z_1) == 0x000618, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_Origin) == 0x000620, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x000638, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x000650, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_IsValid_ReturnValue) == 0x000654, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000658, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_X_2) == 0x000670, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Y_2) == 0x000678, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Z_2) == 0x000680, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_X_3) == 0x000688, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Y_3) == 0x000690, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Z_3) == 0x000698, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_FMax_ReturnValue) == 0x0006A0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_MakeVector_ReturnValue) == 0x0006A8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_FMax_ReturnValue_1) == 0x0006C0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0006C8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0006E0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_TransformLocation_ReturnValue) == 0x0006E8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_FMin_ReturnValue) == 0x000700, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_SetStaticMesh_ReturnValue) == 0x000708, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000710, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_GetBounds_ReturnValue_1) == 0x000728, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_GetBounds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_MakeTransform_ReturnValue_3) == 0x000760, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_Origin_1) == 0x0007C0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_BoxExtent_1) == 0x0007D8, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakBoxSphereBounds_SphereRadius_1) == 0x0007F0, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakBoxSphereBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, K2Node_Select_Default_2) == 0x000800, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000860, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000878, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_X_4) == 0x000960, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Y_4) == 0x000968, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant, CallFunc_BreakVector_Z_4) == 0x000970, "Member 'BP_Facility_AmmoPlant_C_ExecuteUbergraph_BP_Facility_AmmoPlant::CallFunc_BreakVector_Z_4' has a wrong offset!");
