#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Wage

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_Wage.BP_Facility_Wage_C.UpdateDNASequencerAnim
// 0x0040 (0x0040 - 0x0000)
struct BP_Facility_Wage_C_UpdateDNASequencerAnim final
{
public:
	bool                                          CallFunc_HasValidEventAndData_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWageTimeRemainingPercent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Wage_C_UpdateDNASequencerAnim) == 0x000008, "Wrong alignment on BP_Facility_Wage_C_UpdateDNASequencerAnim");
static_assert(sizeof(BP_Facility_Wage_C_UpdateDNASequencerAnim) == 0x000040, "Wrong size on BP_Facility_Wage_C_UpdateDNASequencerAnim");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_HasValidEventAndData_ReturnValue) == 0x000000, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_HasValidEventAndData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_GetWageTimeRemainingPercent_ReturnValue) == 0x000008, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_GetWageTimeRemainingPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, Temp_delegate_Variable) == 0x000014, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, Temp_delegate_Variable_1) == 0x000028, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_PostAkEvent_ReturnValue_1) == 0x000038, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_UpdateDNASequencerAnim, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'BP_Facility_Wage_C_UpdateDNASequencerAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Facility_Wage.BP_Facility_Wage_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Facility_Wage_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Wage_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Facility_Wage_C_ReceiveTick");
static_assert(sizeof(BP_Facility_Wage_C_ReceiveTick) == 0x000004, "Wrong size on BP_Facility_Wage_C_ReceiveTick");
static_assert(offsetof(BP_Facility_Wage_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Facility_Wage_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Facility_Wage.BP_Facility_Wage_C.GetDefaultCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_Facility_Wage_C_GetDefaultCameraComponent final
{
public:
	class UCameraComponent*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Wage_C_GetDefaultCameraComponent) == 0x000008, "Wrong alignment on BP_Facility_Wage_C_GetDefaultCameraComponent");
static_assert(sizeof(BP_Facility_Wage_C_GetDefaultCameraComponent) == 0x000008, "Wrong size on BP_Facility_Wage_C_GetDefaultCameraComponent");
static_assert(offsetof(BP_Facility_Wage_C_GetDefaultCameraComponent, ReturnValue) == 0x000000, "Member 'BP_Facility_Wage_C_GetDefaultCameraComponent::ReturnValue' has a wrong offset!");

// Function BP_Facility_Wage.BP_Facility_Wage_C.ExecuteUbergraph_BP_Facility_Wage
// 0x0048 (0x0048 - 0x0000)
struct BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetWageTimeRemainingPercent_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Facility_DNASequencer_C*           K2Node_DynamicCast_AsABP_Facility_DNASequencer;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ProgressScreen_C*                    K2Node_DynamicCast_AsW_Progress_Screen;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReceiveWage_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage) == 0x000008, "Wrong alignment on BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage");
static_assert(sizeof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage) == 0x000048, "Wrong size on BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, EntryPoint) == 0x000000, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, CallFunc_GetWageTimeRemainingPercent_ReturnValue) == 0x000008, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::CallFunc_GetWageTimeRemainingPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, K2Node_DynamicCast_AsABP_Facility_DNASequencer) == 0x000020, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::K2Node_DynamicCast_AsABP_Facility_DNASequencer' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, CallFunc_GetWidget_ReturnValue) == 0x000030, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, K2Node_DynamicCast_AsW_Progress_Screen) == 0x000038, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::K2Node_DynamicCast_AsW_Progress_Screen' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, CallFunc_CanReceiveWage_ReturnValue) == 0x000041, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::CallFunc_CanReceiveWage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000044, "Member 'BP_Facility_Wage_C_ExecuteUbergraph_BP_Facility_Wage::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

