#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Printer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Printer.BP_Facility_Printer_C
// 0x0120 (0x0570 - 0x0450)
class ABP_Facility_Printer_C : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_Printer_C;              // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary2;                               // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  StaticMotor;                                       // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight2;                                        // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ProximityTrigger;                                  // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight1;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facility_Printer_Anim_Level_01;                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder9;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder8;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder7;                                         // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder6;                                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder5;                                         // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder4;                                         // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder3;                                         // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cylinder2;                                         // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenCover_OpenCover_AA61D64C4C7C20DBE08204800800CBAC; // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenCover__Direction_AA61D64C4C7C20DBE08204800800CBAC; // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenCover;                                         // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Facility_Printer_Level_01_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)	 // 0xae1e64;
	void BndEvt__BP_Facility_Printer_Level_01_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Printer(int32 EntryPoint)	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void OpenCover__FinishedFunc()	 // 0xae1e64;
	void OpenCover__UpdateFunc()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Printer_C">();
	}
	static class ABP_Facility_Printer_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Printer_C>();
	}
};
static_assert(alignof(ABP_Facility_Printer_C) == 0x000008, "Wrong alignment on ABP_Facility_Printer_C");
static_assert(sizeof(ABP_Facility_Printer_C) == 0x000570, "Wrong size on ABP_Facility_Printer_C");
static_assert(offsetof(ABP_Facility_Printer_C, UberGraphFrame_BP_Facility_Printer_C) == 0x000450, "Member 'ABP_Facility_Printer_C::UberGraphFrame_BP_Facility_Printer_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, P2FacilityBoundary1) == 0x000458, "Member 'ABP_Facility_Printer_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, P2FacilityBoundary2) == 0x000460, "Member 'ABP_Facility_Printer_C::P2FacilityBoundary2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Ak) == 0x000468, "Member 'ABP_Facility_Printer_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMotor) == 0x000470, "Member 'ABP_Facility_Printer_C::StaticMotor' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, RectLight2) == 0x000478, "Member 'ABP_Facility_Printer_C::RectLight2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, ProximityTrigger) == 0x000480, "Member 'ABP_Facility_Printer_C::ProximityTrigger' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, RectLight1) == 0x000488, "Member 'ABP_Facility_Printer_C::RectLight1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, SK_Facility_Printer_Anim_Level_01) == 0x000490, "Member 'ABP_Facility_Printer_C::SK_Facility_Printer_Anim_Level_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh18) == 0x000498, "Member 'ABP_Facility_Printer_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh17) == 0x0004A0, "Member 'ABP_Facility_Printer_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh16) == 0x0004A8, "Member 'ABP_Facility_Printer_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh5) == 0x0004B0, "Member 'ABP_Facility_Printer_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh4) == 0x0004B8, "Member 'ABP_Facility_Printer_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh15) == 0x0004C0, "Member 'ABP_Facility_Printer_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh14) == 0x0004C8, "Member 'ABP_Facility_Printer_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh13) == 0x0004D0, "Member 'ABP_Facility_Printer_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh12) == 0x0004D8, "Member 'ABP_Facility_Printer_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh11) == 0x0004E0, "Member 'ABP_Facility_Printer_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh10) == 0x0004E8, "Member 'ABP_Facility_Printer_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh9) == 0x0004F0, "Member 'ABP_Facility_Printer_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh8) == 0x0004F8, "Member 'ABP_Facility_Printer_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh7) == 0x000500, "Member 'ABP_Facility_Printer_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh6) == 0x000508, "Member 'ABP_Facility_Printer_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder9) == 0x000510, "Member 'ABP_Facility_Printer_C::Cylinder9' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder8) == 0x000518, "Member 'ABP_Facility_Printer_C::Cylinder8' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder7) == 0x000520, "Member 'ABP_Facility_Printer_C::Cylinder7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder6) == 0x000528, "Member 'ABP_Facility_Printer_C::Cylinder6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder5) == 0x000530, "Member 'ABP_Facility_Printer_C::Cylinder5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder4) == 0x000538, "Member 'ABP_Facility_Printer_C::Cylinder4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder3) == 0x000540, "Member 'ABP_Facility_Printer_C::Cylinder3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, Cylinder2) == 0x000548, "Member 'ABP_Facility_Printer_C::Cylinder2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh3) == 0x000550, "Member 'ABP_Facility_Printer_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, StaticMesh) == 0x000558, "Member 'ABP_Facility_Printer_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, OpenCover_OpenCover_AA61D64C4C7C20DBE08204800800CBAC) == 0x000560, "Member 'ABP_Facility_Printer_C::OpenCover_OpenCover_AA61D64C4C7C20DBE08204800800CBAC' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, OpenCover__Direction_AA61D64C4C7C20DBE08204800800CBAC) == 0x000564, "Member 'ABP_Facility_Printer_C::OpenCover__Direction_AA61D64C4C7C20DBE08204800800CBAC' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Printer_C, OpenCover) == 0x000568, "Member 'ABP_Facility_Printer_C::OpenCover' has a wrong offset!");

}

