#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FakeBody_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FakeBody_Component.BP_FakeBody_Component_C
// 0x0020 (0x10A0 - 0x1080)
class UBP_FakeBody_Component_C final : public UP2SkeletalMeshComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1080(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Array_Index;                                       // 0x1088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108C[0x4];                                     // 0x108C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OriginalPLSDMat;                                   // 0x1090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PLSD_DMI;                                          // 0x1098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisablePLSD()	 // 0xae1e64;
	void EnablePLSD()	 // 0xae1e64;
	void ExecuteUbergraph_BP_FakeBody_Component(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_FakeBody_Component_C">();
	}
	static class UBP_FakeBody_Component_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_FakeBody_Component_C>();
	}
};
static_assert(alignof(UBP_FakeBody_Component_C) == 0x000010, "Wrong alignment on UBP_FakeBody_Component_C");
static_assert(sizeof(UBP_FakeBody_Component_C) == 0x0010A0, "Wrong size on UBP_FakeBody_Component_C");
static_assert(offsetof(UBP_FakeBody_Component_C, UberGraphFrame) == 0x001080, "Member 'UBP_FakeBody_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FakeBody_Component_C, Array_Index) == 0x001088, "Member 'UBP_FakeBody_Component_C::Array_Index' has a wrong offset!");
static_assert(offsetof(UBP_FakeBody_Component_C, OriginalPLSDMat) == 0x001090, "Member 'UBP_FakeBody_Component_C::OriginalPLSDMat' has a wrong offset!");
static_assert(offsetof(UBP_FakeBody_Component_C, PLSD_DMI) == 0x001098, "Member 'UBP_FakeBody_Component_C::PLSD_DMI' has a wrong offset!");

}

