#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Decorative_CeilingLight_Dfo_01

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Decorative_CeilingLight_Dfo_01.BP_Facility_Decorative_CeilingLight_Dfo_01_C
// 0x0038 (0x03C0 - 0x0388)
class ABP_Facility_Decorative_CeilingLight_Dfo_01_C final : public AP2Facility_InteractiveDecoration
{
public:
	class URectLightComponent*                    RectLight_NoShadow_Secondary;                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_OnlyFog;                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Secondary_OFF;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Decorative_CeilingLight_Dfo_01_C">();
	}
	static class ABP_Facility_Decorative_CeilingLight_Dfo_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Decorative_CeilingLight_Dfo_01_C>();
	}
};
static_assert(alignof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C) == 0x000008, "Wrong alignment on ABP_Facility_Decorative_CeilingLight_Dfo_01_C");
static_assert(sizeof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C) == 0x0003C0, "Wrong size on ABP_Facility_Decorative_CeilingLight_Dfo_01_C");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, RectLight_NoShadow_Secondary) == 0x000388, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::RectLight_NoShadow_Secondary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, RectLight_NoShadow_OnlyFog) == 0x000390, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::RectLight_NoShadow_OnlyFog' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, StaticMesh2) == 0x000398, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, Secondary_OFF) == 0x0003A0, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::Secondary_OFF' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, SpotLight) == 0x0003A8, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, P2FacilityBoundary1) == 0x0003B0, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_CeilingLight_Dfo_01_C, SharedRoot) == 0x0003B8, "Member 'ABP_Facility_Decorative_CeilingLight_Dfo_01_C::SharedRoot' has a wrong offset!");

}

