#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Wage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Wage.BP_Facility_Wage_C
// 0x0088 (0x0460 - 0x03D8)
class ABP_Facility_Wage_C final : public AP2Facility_Wage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_6;              // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_5;              // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_4;              // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_3;              // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Wage_Stationary_1;                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_2;              // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Wage_Stationary_NoShadow_1;              // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facility_DNASequencer_Base_01;                  // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Facility_DNASequencer_Base_01;                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       WidgetComponent_WageProgress;                      // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UABP_Facility_DNASequencer_C*           ABP_Facility_DNASequencer;                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          OnBeginActiveCheck;                                // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActiveAlready;                                   // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateDNASequencerAnim()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	class UCameraComponent* GetDefaultCameraComponent()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Wage(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Wage_C">();
	}
	static class ABP_Facility_Wage_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Wage_C>();
	}
};
static_assert(alignof(ABP_Facility_Wage_C) == 0x000008, "Wrong alignment on ABP_Facility_Wage_C");
static_assert(sizeof(ABP_Facility_Wage_C) == 0x000460, "Wrong size on ABP_Facility_Wage_C");
static_assert(offsetof(ABP_Facility_Wage_C, UberGraphFrame) == 0x0003D8, "Member 'ABP_Facility_Wage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_6) == 0x0003E0, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_5) == 0x0003E8, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_4) == 0x0003F0, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_3) == 0x0003F8, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, SpotLight_Wage_Stationary_1) == 0x000400, "Member 'ABP_Facility_Wage_C::SpotLight_Wage_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_2) == 0x000408, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, RectLight_Wage_Stationary_NoShadow_1) == 0x000410, "Member 'ABP_Facility_Wage_C::RectLight_Wage_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, Ak) == 0x000418, "Member 'ABP_Facility_Wage_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, SK_Facility_DNASequencer_Base_01) == 0x000420, "Member 'ABP_Facility_Wage_C::SK_Facility_DNASequencer_Base_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, SM_Facility_DNASequencer_Base_01) == 0x000428, "Member 'ABP_Facility_Wage_C::SM_Facility_DNASequencer_Base_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, WidgetComponent_WageProgress) == 0x000430, "Member 'ABP_Facility_Wage_C::WidgetComponent_WageProgress' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, Camera) == 0x000438, "Member 'ABP_Facility_Wage_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, P2FacilityBoundary1) == 0x000440, "Member 'ABP_Facility_Wage_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, SharedRoot) == 0x000448, "Member 'ABP_Facility_Wage_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, ABP_Facility_DNASequencer) == 0x000450, "Member 'ABP_Facility_Wage_C::ABP_Facility_DNASequencer' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, OnBeginActiveCheck) == 0x000458, "Member 'ABP_Facility_Wage_C::OnBeginActiveCheck' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Wage_C, IsActiveAlready) == 0x000459, "Member 'ABP_Facility_Wage_C::IsActiveAlready' has a wrong offset!");

}

