#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FacilitySpot_UGVConsole

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_FacilitySpot_UGVConsole.BP_FacilitySpot_UGVConsole_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FacilitySpot_UGVConsole_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FacilitySpot_UGVConsole_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FacilitySpot_UGVConsole_C_ReceiveTick");
static_assert(sizeof(BP_FacilitySpot_UGVConsole_C_ReceiveTick) == 0x000004, "Wrong size on BP_FacilitySpot_UGVConsole_C_ReceiveTick");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FacilitySpot_UGVConsole_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FacilitySpot_UGVConsole.BP_FacilitySpot_UGVConsole_C.OnSpotStatusChanged
// 0x0028 (0x0028 - 0x0000)
struct BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged final
{
public:
	class AP2FacilitySpot*                        InFacilitySpot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilitySpotStatusInfo              InOldStatus;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FP2FacilitySpotStatusInfo              InNewStatus;                                       // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged) == 0x000008, "Wrong alignment on BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged");
static_assert(sizeof(BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged) == 0x000028, "Wrong size on BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged, InFacilitySpot) == 0x000000, "Member 'BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged::InFacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged, InOldStatus) == 0x000008, "Member 'BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged::InOldStatus' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged, InNewStatus) == 0x000018, "Member 'BP_FacilitySpot_UGVConsole_C_OnSpotStatusChanged::InNewStatus' has a wrong offset!");

// Function BP_FacilitySpot_UGVConsole.BP_FacilitySpot_UGVConsole_C.ExecuteUbergraph_BP_FacilitySpot_UGVConsole
// 0x0050 (0x0050 - 0x0000)
struct BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_CustomEvent_InFacilitySpot;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilitySpotStatusInfo              K2Node_CustomEvent_InOldStatus;                    // 0x0028(0x0010)(ConstParm, NoDestructor)
	struct FP2FacilitySpotStatusInfo              K2Node_CustomEvent_InNewStatus;                    // 0x0038(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole) == 0x000008, "Wrong alignment on BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole");
static_assert(sizeof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole) == 0x000050, "Wrong size on BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, EntryPoint) == 0x000000, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, Temp_delegate_Variable) == 0x000004, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, CallFunc_PostAkEvent_ReturnValue) == 0x000018, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, K2Node_CustomEvent_InFacilitySpot) == 0x000020, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::K2Node_CustomEvent_InFacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, K2Node_CustomEvent_InOldStatus) == 0x000028, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::K2Node_CustomEvent_InOldStatus' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, K2Node_CustomEvent_InNewStatus) == 0x000038, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::K2Node_CustomEvent_InNewStatus' has a wrong offset!");
static_assert(offsetof(BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'BP_FacilitySpot_UGVConsole_C_ExecuteUbergraph_BP_FacilitySpot_UGVConsole::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

