#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_VerticalGarden_AR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_VerticalGarden_AR.BP_Facility_VerticalGarden_AR_C
// 0x0030 (0x0480 - 0x0450)
class ABP_Facility_VerticalGarden_AR_C final : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_VerticalGarden_AR_C;    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  Static;                                            // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StaticMeshes;                                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Facility_VerticalGarden_AR(int32 EntryPoint)	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_VerticalGarden_AR_C">();
	}
	static class ABP_Facility_VerticalGarden_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_VerticalGarden_AR_C>();
	}
};
static_assert(alignof(ABP_Facility_VerticalGarden_AR_C) == 0x000008, "Wrong alignment on ABP_Facility_VerticalGarden_AR_C");
static_assert(sizeof(ABP_Facility_VerticalGarden_AR_C) == 0x000480, "Wrong size on ABP_Facility_VerticalGarden_AR_C");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, UberGraphFrame_BP_Facility_VerticalGarden_AR_C) == 0x000450, "Member 'ABP_Facility_VerticalGarden_AR_C::UberGraphFrame_BP_Facility_VerticalGarden_AR_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, StaticMesh) == 0x000458, "Member 'ABP_Facility_VerticalGarden_AR_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, P2FacilityBoundary) == 0x000460, "Member 'ABP_Facility_VerticalGarden_AR_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, Ak) == 0x000468, "Member 'ABP_Facility_VerticalGarden_AR_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, Static) == 0x000470, "Member 'ABP_Facility_VerticalGarden_AR_C::Static' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_AR_C, StaticMeshes) == 0x000478, "Member 'ABP_Facility_VerticalGarden_AR_C::StaticMeshes' has a wrong offset!");

}

