#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Printer_Level_01_Working

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.CleanPrinter
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_CleanPrinter final
{
public:
	struct FP2CraftingDataRow                     K2Node_MakeStruct_P2CraftingDataRow;               // 0x0000(0x00C0)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_CleanPrinter) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_CleanPrinter");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_CleanPrinter) == 0x0000D8, "Wrong size on BP_Facility_Printer_Level_01_Working_C_CleanPrinter");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CleanPrinter, K2Node_MakeStruct_P2CraftingDataRow) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_CleanPrinter::K2Node_MakeStruct_P2CraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CleanPrinter, Temp_delegate_Variable) == 0x0000C0, "Member 'BP_Facility_Printer_Level_01_Working_C_CleanPrinter::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CleanPrinter, CallFunc_PostAkEvent_ReturnValue) == 0x0000D0, "Member 'BP_Facility_Printer_Level_01_Working_C_CleanPrinter::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.CompletePrinting
// 0x0028 (0x0028 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_CompletePrinting final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0010(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting) == 0x000004, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_CompletePrinting");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting) == 0x000028, "Wrong size on BP_Facility_Printer_Level_01_Working_C_CompletePrinting");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting, Temp_delegate_Variable) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_CompletePrinting::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting, Temp_delegate_Variable_1) == 0x000010, "Member 'BP_Facility_Printer_Level_01_Working_C_CompletePrinting::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting, CallFunc_PostAkEvent_ReturnValue) == 0x000020, "Member 'BP_Facility_Printer_Level_01_Working_C_CompletePrinting::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_CompletePrinting, CallFunc_PostAkEvent_ReturnValue_1) == 0x000024, "Member 'BP_Facility_Printer_Level_01_Working_C_CompletePrinting::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ExecuteUbergraph_BP_Facility_Printer_Level_01_Working
// 0x0320 (0x0320 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_3;                  // 0x0008(0x00C0)(ConstParm)
	float                                         K2Node_Event_InStartTimeNormalized;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_2;                  // 0x00D0(0x00C0)(ConstParm)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_1;                  // 0x0190(0x00C0)(ConstParm)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow;                    // 0x0250(0x00C0)(ConstParm)
	double                                        CallFunc_Printing_DeltaTime_ImplicitCast;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_StartPrinting_StartPrintProgress_ImplicitCast; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working) == 0x000320, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, EntryPoint) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_InCraftingDataRow_3) == 0x000008, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_InCraftingDataRow_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_InStartTimeNormalized) == 0x0000C8, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_InCraftingDataRow_2) == 0x0000D0, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_InCraftingDataRow_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_InCraftingDataRow_1) == 0x000190, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, K2Node_Event_InCraftingDataRow) == 0x000250, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::K2Node_Event_InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, CallFunc_Printing_DeltaTime_ImplicitCast) == 0x000310, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::CallFunc_Printing_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working, CallFunc_StartPrinting_StartPrintProgress_ImplicitCast) == 0x000318, "Member 'BP_Facility_Printer_Level_01_Working_C_ExecuteUbergraph_BP_Facility_Printer_Level_01_Working::CallFunc_StartPrinting_StartPrintProgress_ImplicitCast' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.Printing
// 0x04C0 (0x04C0 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_Printing final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x0048(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0080(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_2; // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue;                     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue_1;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Fraction_ReturnValue_2;                   // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x02B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_3;                       // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x0370(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0430(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0448(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_4;                          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_Printing) == 0x000010, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_Printing");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_Printing) == 0x0004C0, "Wrong size on BP_Facility_Printer_Level_01_Working_C_Printing");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, DeltaTime) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetBoundingBox_ReturnValue) == 0x000048, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetBounds_ReturnValue) == 0x000080, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakBoxSphereBounds_Origin) == 0x0000B8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakBoxSphereBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakBoxSphereBounds_BoxExtent) == 0x0000D0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakBoxSphereBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakBoxSphereBounds_SphereRadius) == 0x0000E8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakBoxSphereBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_X) == 0x0000F0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Y) == 0x0000F8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Z) == 0x000100, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_X_1) == 0x000108, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Y_1) == 0x000110, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Z_1) == 0x000118, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_MakeVector_ReturnValue) == 0x000120, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000138, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Array_Get_Item) == 0x000150, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000158, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_FFloor_ReturnValue) == 0x000178, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000180, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000188, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000190, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetLocalBounds_Min) == 0x000198, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetLocalBounds_Min' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetLocalBounds_Max) == 0x0001B0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetLocalBounds_Max' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_FFloor_ReturnValue_1) == 0x0001C8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x0001D0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0001E8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_X_2) == 0x0001F0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Y_2) == 0x0001F8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Z_2) == 0x000200, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Lerp_ReturnValue) == 0x000208, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GreaterGreater_VectorRotator_ReturnValue_2) == 0x000210, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GreaterGreater_VectorRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000228, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_X_3) == 0x000230, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Y_3) == 0x000238, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Z_3) == 0x000240, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Fraction_ReturnValue) == 0x000248, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Fraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Fraction_ReturnValue_1) == 0x000250, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Fraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_FMax_ReturnValue) == 0x000258, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000260, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000268, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Lerp_ReturnValue_1) == 0x000270, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Abs_ReturnValue) == 0x000278, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000280, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000288, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Fraction_ReturnValue_2) == 0x000290, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Fraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Lerp_ReturnValue_2) == 0x000298, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x0002A0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0002A8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetRelativeTransform_ReturnValue) == 0x0002B0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Abs_ReturnValue_1) == 0x000310, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Location) == 0x000318, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Rotation) == 0x000330, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Scale) == 0x000348, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000360, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Lerp_ReturnValue_3) == 0x000368, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_GetRelativeTransform_ReturnValue_1) == 0x000370, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_GetRelativeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_MakeVector_ReturnValue_1) == 0x0003D0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Location_1) == 0x0003E8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Rotation_1) == 0x000400, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakTransform_Scale_1) == 0x000418, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Add_VectorVector_ReturnValue) == 0x000430, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000448, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000460, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000478, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_X_4) == 0x000480, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Y_4) == 0x000488, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_BreakVector_Z_4) == 0x000490, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000498, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0004A0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0004A8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0004B0, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_Printing, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0004B8, "Member 'BP_Facility_Printer_Level_01_Working_C_Printing::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ReceiveCancelCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft) == 0x0000C0, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveCancelCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ReceiveCompleteCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft) == 0x0000C0, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveCompleteCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ReceiveEndCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft) == 0x0000C0, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveEndCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ReceiveStartCraft
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InStartTimeNormalized;                             // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft) == 0x000008, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft) == 0x0000C8, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft::InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft, InStartTimeNormalized) == 0x0000C0, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveStartCraft::InStartTimeNormalized' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Printer_Level_01_Working_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Facility_Printer_Level_01_Working_C_ReceiveTick");
static_assert(sizeof(BP_Facility_Printer_Level_01_Working_C_ReceiveTick) == 0x000004, "Wrong size on BP_Facility_Printer_Level_01_Working_C_ReceiveTick");
static_assert(offsetof(BP_Facility_Printer_Level_01_Working_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Facility_Printer_Level_01_Working_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Facility_Printer_Level_01_Working.BP_Facility_Printer_Level_01_Working_C.StartPrinting
// 0x08A0 (0x08A0 - 0x0000)
struct BP_Facility_Printer_Level_01_Working_C_StartPrinting final
{
public:
	struct FP2CraftingDataRow                     InCraftData;                                       // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        StartPrintProgress;                                // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00CC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x00E0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x02B8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBox                                   CallFunc_GetBoundingBox_ReturnValue;               // 0x02F0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakBoxSphereBounds_Origin;              // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakBoxSphereBounds_BoxExtent;           // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakBoxSphereBounds_SphereRadius;        // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0390(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x03A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x03C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      CallFunc_Array_Get_Item;                           // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocalBounds_Min;                       // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocalBounds_Max;                       // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0450(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x04B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x05C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Facility_Printer_Level_01_C*       K2Node_DynamicCast_AsABP_Facility_Printer_Level_01; // 0x05D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_2;                          // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
