#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Laptop_AR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Laptop_AR.BP_Facility_Laptop_AR_C
// 0x0040 (0x0450 - 0x0410)
class ABP_Facility_Laptop_AR_C final : public AP2FacilityLaptop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       WidgetComponent;                                   // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Table_Chair_Set_02a1;                           // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak_Laptop;                                         // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ClockRadio_01;                                  // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    E;                                                 // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay()	 // 0xae1e64;
	void OperateStart(class AP2Facility* InFacility)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Laptop_AR(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Laptop_AR_C">();
	}
	static class ABP_Facility_Laptop_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Laptop_AR_C>();
	}
};
static_assert(alignof(ABP_Facility_Laptop_AR_C) == 0x000008, "Wrong alignment on ABP_Facility_Laptop_AR_C");
static_assert(sizeof(ABP_Facility_Laptop_AR_C) == 0x000450, "Wrong size on ABP_Facility_Laptop_AR_C");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, UberGraphFrame) == 0x000410, "Member 'ABP_Facility_Laptop_AR_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, P2FacilityBoundary1) == 0x000418, "Member 'ABP_Facility_Laptop_AR_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, WidgetComponent) == 0x000420, "Member 'ABP_Facility_Laptop_AR_C::WidgetComponent' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, SM_Table_Chair_Set_02a1) == 0x000428, "Member 'ABP_Facility_Laptop_AR_C::SM_Table_Chair_Set_02a1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, Ak_Laptop) == 0x000430, "Member 'ABP_Facility_Laptop_AR_C::Ak_Laptop' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, SM_ClockRadio_01) == 0x000438, "Member 'ABP_Facility_Laptop_AR_C::SM_ClockRadio_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, E) == 0x000440, "Member 'ABP_Facility_Laptop_AR_C::E' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Laptop_AR_C, Ak) == 0x000448, "Member 'ABP_Facility_Laptop_AR_C::Ak' has a wrong offset!");

}

