#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Workbench_Drone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Workbench_Drone.BP_Facility_Workbench_Drone_C
// 0x0160 (0x0950 - 0x07F0)
class ABP_Facility_Workbench_Drone_C final : public AP2Facility_Drone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight_NoShadow_Decoration_5;                   // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Decoration_4;                   // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Decoration_3;                   // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Decoration_2;                   // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_NoShadow_Decoration_1;                   // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    StandLight;                                        // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal9;                                            // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal8;                                            // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal7;                                            // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal6;                                            // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal5;                                            // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal4;                                            // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow5;                                            // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow4;                                            // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight4;                                        // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight3;                                        // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight2;                                        // 0x08C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x08D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x08E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_auto_repair_03_container_025;                   // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  AkLight;                                           // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        EmissiveMultiply;                                  // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class ULightComponent*, double>          LightIntensityMap;                                 // 0x0900(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UpdateDeskLight(bool LightOn)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void EndOperate_ImplementableEvent()	 // 0xae1e64;
	void Operate_ImplementableEvent()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_Workbench_Drone(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Workbench_Drone_C">();
	}
	static class ABP_Facility_Workbench_Drone_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Workbench_Drone_C>();
	}
};
static_assert(alignof(ABP_Facility_Workbench_Drone_C) == 0x000008, "Wrong alignment on ABP_Facility_Workbench_Drone_C");
static_assert(sizeof(ABP_Facility_Workbench_Drone_C) == 0x000950, "Wrong size on ABP_Facility_Workbench_Drone_C");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, UberGraphFrame) == 0x0007F0, "Member 'ABP_Facility_Workbench_Drone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, RectLight_NoShadow_Decoration_5) == 0x0007F8, "Member 'ABP_Facility_Workbench_Drone_C::RectLight_NoShadow_Decoration_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, RectLight_NoShadow_Decoration_4) == 0x000800, "Member 'ABP_Facility_Workbench_Drone_C::RectLight_NoShadow_Decoration_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, RectLight_NoShadow_Decoration_3) == 0x000808, "Member 'ABP_Facility_Workbench_Drone_C::RectLight_NoShadow_Decoration_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, RectLight_NoShadow_Decoration_2) == 0x000810, "Member 'ABP_Facility_Workbench_Drone_C::RectLight_NoShadow_Decoration_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, RectLight_NoShadow_Decoration_1) == 0x000818, "Member 'ABP_Facility_Workbench_Drone_C::RectLight_NoShadow_Decoration_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, StandLight) == 0x000820, "Member 'ABP_Facility_Workbench_Drone_C::StandLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, StaticMesh) == 0x000828, "Member 'ABP_Facility_Workbench_Drone_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, P2FacilityBoundary) == 0x000830, "Member 'ABP_Facility_Workbench_Drone_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal9) == 0x000838, "Member 'ABP_Facility_Workbench_Drone_C::Decal9' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal8) == 0x000840, "Member 'ABP_Facility_Workbench_Drone_C::Decal8' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal7) == 0x000848, "Member 'ABP_Facility_Workbench_Drone_C::Decal7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal6) == 0x000850, "Member 'ABP_Facility_Workbench_Drone_C::Decal6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal5) == 0x000858, "Member 'ABP_Facility_Workbench_Drone_C::Decal5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal4) == 0x000860, "Member 'ABP_Facility_Workbench_Drone_C::Decal4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal3) == 0x000868, "Member 'ABP_Facility_Workbench_Drone_C::Decal3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal2) == 0x000870, "Member 'ABP_Facility_Workbench_Drone_C::Decal2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal1) == 0x000878, "Member 'ABP_Facility_Workbench_Drone_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Billboard) == 0x000880, "Member 'ABP_Facility_Workbench_Drone_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow5) == 0x000888, "Member 'ABP_Facility_Workbench_Drone_C::Arrow5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Decal) == 0x000890, "Member 'ABP_Facility_Workbench_Drone_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow4) == 0x000898, "Member 'ABP_Facility_Workbench_Drone_C::Arrow4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SpotLight4) == 0x0008A0, "Member 'ABP_Facility_Workbench_Drone_C::SpotLight4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow3) == 0x0008A8, "Member 'ABP_Facility_Workbench_Drone_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SpotLight3) == 0x0008B0, "Member 'ABP_Facility_Workbench_Drone_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow2) == 0x0008B8, "Member 'ABP_Facility_Workbench_Drone_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SpotLight2) == 0x0008C0, "Member 'ABP_Facility_Workbench_Drone_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow1) == 0x0008C8, "Member 'ABP_Facility_Workbench_Drone_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SpotLight1) == 0x0008D0, "Member 'ABP_Facility_Workbench_Drone_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, Arrow) == 0x0008D8, "Member 'ABP_Facility_Workbench_Drone_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SpotLight) == 0x0008E0, "Member 'ABP_Facility_Workbench_Drone_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, SM_auto_repair_03_container_025) == 0x0008E8, "Member 'ABP_Facility_Workbench_Drone_C::SM_auto_repair_03_container_025' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, AkLight) == 0x0008F0, "Member 'ABP_Facility_Workbench_Drone_C::AkLight' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, EmissiveMultiply) == 0x0008F8, "Member 'ABP_Facility_Workbench_Drone_C::EmissiveMultiply' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Workbench_Drone_C, LightIntensityMap) == 0x000900, "Member 'ABP_Facility_Workbench_Drone_C::LightIntensityMap' has a wrong offset!");

}

