#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Decorative_Capsule_Lab_01

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Decorative_Capsule_Lab_01.BP_Facility_Decorative_Capsule_Lab_01_C
// 0x0020 (0x0398 - 0x0378)
class ABP_Facility_Decorative_Capsule_Lab_01_C final : public AP2Facility_Decoration
{
public:
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Decorative_Capsule_Lab_01_C">();
	}
	static class ABP_Facility_Decorative_Capsule_Lab_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Decorative_Capsule_Lab_01_C>();
	}
};
static_assert(alignof(ABP_Facility_Decorative_Capsule_Lab_01_C) == 0x000008, "Wrong alignment on ABP_Facility_Decorative_Capsule_Lab_01_C");
static_assert(sizeof(ABP_Facility_Decorative_Capsule_Lab_01_C) == 0x000398, "Wrong size on ABP_Facility_Decorative_Capsule_Lab_01_C");
static_assert(offsetof(ABP_Facility_Decorative_Capsule_Lab_01_C, StaticMesh1) == 0x000378, "Member 'ABP_Facility_Decorative_Capsule_Lab_01_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Capsule_Lab_01_C, P2FacilityBoundary1) == 0x000380, "Member 'ABP_Facility_Decorative_Capsule_Lab_01_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Capsule_Lab_01_C, StaticMesh) == 0x000388, "Member 'ABP_Facility_Decorative_Capsule_Lab_01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Capsule_Lab_01_C, SharedRoot) == 0x000390, "Member 'ABP_Facility_Decorative_Capsule_Lab_01_C::SharedRoot' has a wrong offset!");

}

