#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_ChemLab

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.EnsureCraftingStateIfQueueHasWork
// 0x0020 (0x0020 - 0x0000)
struct BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork final
{
public:
	int32                                         CallFunc_GetCurrentState_outState;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2ProductionEvent*>             CallFunc_GetOngoingProductionEvents_ReturnValue;   // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork");
static_assert(sizeof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork) == 0x000020, "Wrong size on BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork");
static_assert(offsetof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork, CallFunc_GetCurrentState_outState) == 0x000000, "Member 'BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork::CallFunc_GetCurrentState_outState' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork, CallFunc_GetOngoingProductionEvents_ReturnValue) == 0x000008, "Member 'BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork::CallFunc_GetOngoingProductionEvents_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000019, "Member 'BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'BP_Facility_ChemLab_C_EnsureCraftingStateIfQueueHasWork::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.ExecuteUbergraph_BP_Facility_ChemLab
// 0x03A8 (0x03A8 - 0x0000)
struct BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0070(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewState)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0090(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility* InFacility)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x00D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewState;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsSK_Facilitiy_Chem_Lab_Base_01_A_Skeleton_Anim_Blueprint; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_2;                  // 0x0138(0x00C0)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility*                            K2Node_CustomEvent_InFacility;                     // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_1;                  // 0x0210(0x00C0)(ConstParm)
	float                                         K2Node_Event_InStartTimeNormalized;                // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow;                    // 0x02D8(0x00C0)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab");
static_assert(sizeof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab) == 0x0003A8, "Wrong size on BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, EntryPoint) == 0x000000, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable) == 0x000004, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable_1) == 0x000014, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable_2) == 0x000024, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable_3) == 0x000034, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable_4) == 0x000044, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_int_Variable) == 0x000054, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable) == 0x000058, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable_1) == 0x00005C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable_2) == 0x000060, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable_3) == 0x000064, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable_4) == 0x000068, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_real_Variable_5) == 0x00006C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable) == 0x000070, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable_1) == 0x000090, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable_2) == 0x0000A0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable_3) == 0x0000C0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable_4) == 0x0000D0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_delegate_Variable_5) == 0x0000E0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_struct_Variable_5) == 0x0000F0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, Temp_int_Variable_1) == 0x000100, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_CustomEvent_NewState) == 0x000104, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_GetAnimInstance_ReturnValue) == 0x000108, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_DynamicCast_AsSK_Facilitiy_Chem_Lab_Base_01_A_Skeleton_Anim_Blueprint) == 0x000110, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_DynamicCast_AsSK_Facilitiy_Chem_Lab_Base_01_A_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Select_Default) == 0x00011C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Select_Default_1) == 0x00012C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue) == 0x000130, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Event_InCraftingDataRow_2) == 0x000138, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Event_InCraftingDataRow_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001F8, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_CustomEvent_InFacility) == 0x000200, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_CustomEvent_InFacility' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue_2) == 0x000208, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue_3) == 0x00020C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Event_InCraftingDataRow_1) == 0x000210, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Event_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Event_InStartTimeNormalized) == 0x0002D0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Event_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Event_InCraftingDataRow) == 0x0002D8, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Event_InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue_4) == 0x000398, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, CallFunc_PostAkEvent_ReturnValue_5) == 0x00039C, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab, K2Node_Event_DeltaSeconds) == 0x0003A0, "Member 'BP_Facility_ChemLab_C_ExecuteUbergraph_BP_Facility_ChemLab::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.MuteCraftingSound
// 0x0008 (0x0008 - 0x0000)
struct BP_Facility_ChemLab_C_MuteCraftingSound final
{
public:
	class AP2Facility*                            InFacility;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_MuteCraftingSound) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_MuteCraftingSound");
static_assert(sizeof(BP_Facility_ChemLab_C_MuteCraftingSound) == 0x000008, "Wrong size on BP_Facility_ChemLab_C_MuteCraftingSound");
static_assert(offsetof(BP_Facility_ChemLab_C_MuteCraftingSound, InFacility) == 0x000000, "Member 'BP_Facility_ChemLab_C_MuteCraftingSound::InFacility' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.OnSetState
// 0x0004 (0x0004 - 0x0000)
struct BP_Facility_ChemLab_C_OnSetState final
{
public:
	int32                                         NewState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_OnSetState) == 0x000004, "Wrong alignment on BP_Facility_ChemLab_C_OnSetState");
static_assert(sizeof(BP_Facility_ChemLab_C_OnSetState) == 0x000004, "Wrong size on BP_Facility_ChemLab_C_OnSetState");
static_assert(offsetof(BP_Facility_ChemLab_C_OnSetState, NewState) == 0x000000, "Member 'BP_Facility_ChemLab_C_OnSetState::NewState' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Facility_ChemLab_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Facility_ChemLab_C_ReceiveTick");
static_assert(sizeof(BP_Facility_ChemLab_C_ReceiveTick) == 0x000004, "Wrong size on BP_Facility_ChemLab_C_ReceiveTick");
static_assert(offsetof(BP_Facility_ChemLab_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Facility_ChemLab_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.ReceiveCancelCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_ChemLab_C_ReceiveCancelCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_ChemLab_C_ReceiveCancelCraft) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_ReceiveCancelCraft");
static_assert(sizeof(BP_Facility_ChemLab_C_ReceiveCancelCraft) == 0x0000C0, "Wrong size on BP_Facility_ChemLab_C_ReceiveCancelCraft");
static_assert(offsetof(BP_Facility_ChemLab_C_ReceiveCancelCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_ChemLab_C_ReceiveCancelCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.ReceiveCompleteCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_ChemLab_C_ReceiveCompleteCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_ChemLab_C_ReceiveCompleteCraft) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_ReceiveCompleteCraft");
static_assert(sizeof(BP_Facility_ChemLab_C_ReceiveCompleteCraft) == 0x0000C0, "Wrong size on BP_Facility_ChemLab_C_ReceiveCompleteCraft");
static_assert(offsetof(BP_Facility_ChemLab_C_ReceiveCompleteCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_ChemLab_C_ReceiveCompleteCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_ChemLab.BP_Facility_ChemLab_C.ReceiveStartCraft
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Facility_ChemLab_C_ReceiveStartCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InStartTimeNormalized;                             // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_ChemLab_C_ReceiveStartCraft) == 0x000008, "Wrong alignment on BP_Facility_ChemLab_C_ReceiveStartCraft");
static_assert(sizeof(BP_Facility_ChemLab_C_ReceiveStartCraft) == 0x0000C8, "Wrong size on BP_Facility_ChemLab_C_ReceiveStartCraft");
static_assert(offsetof(BP_Facility_ChemLab_C_ReceiveStartCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_ChemLab_C_ReceiveStartCraft::InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_ChemLab_C_ReceiveStartCraft, InStartTimeNormalized) == 0x0000C0, "Member 'BP_Facility_ChemLab_C_ReceiveStartCraft::InStartTimeNormalized' has a wrong offset!");

}

