#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_VerticalGarden

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_VerticalGarden.BP_Facility_VerticalGarden_C
// 0x00A8 (0x04F8 - 0x0450)
class ABP_Facility_VerticalGarden_C final : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_VerticalGarden_C;       // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_7;                   // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_6;                   // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_5;                   // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_4;                   // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_3;                   // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_2;                   // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_1;                   // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Key_2;                               // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Key_1;                               // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Base_Key_2;                              // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Base_Key_OFF_1;                          // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Product;                                        // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facility_VertGarden_Base_01_A;                  // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  Static;                                            // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CoverMID;                                          // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           MistFXTimer;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LightBlend;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Facility_VerticalGarden(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_VerticalGarden_C">();
	}
	static class ABP_Facility_VerticalGarden_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_VerticalGarden_C>();
	}
};
static_assert(alignof(ABP_Facility_VerticalGarden_C) == 0x000008, "Wrong alignment on ABP_Facility_VerticalGarden_C");
static_assert(sizeof(ABP_Facility_VerticalGarden_C) == 0x0004F8, "Wrong size on ABP_Facility_VerticalGarden_C");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, UberGraphFrame_BP_Facility_VerticalGarden_C) == 0x000450, "Member 'ABP_Facility_VerticalGarden_C::UberGraphFrame_BP_Facility_VerticalGarden_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_7) == 0x000458, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_7' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_6) == 0x000460, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_6' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_5) == 0x000468, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_4) == 0x000470, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_3) == 0x000478, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_2) == 0x000480, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, RectLight_Stationary_NoShadow_1) == 0x000488, "Member 'ABP_Facility_VerticalGarden_C::RectLight_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SpotLight_Top_Key_2) == 0x000490, "Member 'ABP_Facility_VerticalGarden_C::SpotLight_Top_Key_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SpotLight_Top_Key_1) == 0x000498, "Member 'ABP_Facility_VerticalGarden_C::SpotLight_Top_Key_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SpotLight_Base_Key_2) == 0x0004A0, "Member 'ABP_Facility_VerticalGarden_C::SpotLight_Base_Key_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, StaticMesh) == 0x0004A8, "Member 'ABP_Facility_VerticalGarden_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SpotLight_Base_Key_OFF_1) == 0x0004B0, "Member 'ABP_Facility_VerticalGarden_C::SpotLight_Base_Key_OFF_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SM_Product) == 0x0004B8, "Member 'ABP_Facility_VerticalGarden_C::SM_Product' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, SK_Facility_VertGarden_Base_01_A) == 0x0004C0, "Member 'ABP_Facility_VerticalGarden_C::SK_Facility_VertGarden_Base_01_A' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, P2FacilityBoundary) == 0x0004C8, "Member 'ABP_Facility_VerticalGarden_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, Ak) == 0x0004D0, "Member 'ABP_Facility_VerticalGarden_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, Static) == 0x0004D8, "Member 'ABP_Facility_VerticalGarden_C::Static' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, CoverMID) == 0x0004E0, "Member 'ABP_Facility_VerticalGarden_C::CoverMID' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, MistFXTimer) == 0x0004E8, "Member 'ABP_Facility_VerticalGarden_C::MistFXTimer' has a wrong offset!");
static_assert(offsetof(ABP_Facility_VerticalGarden_C, LightBlend) == 0x0004F0, "Member 'ABP_Facility_VerticalGarden_C::LightBlend' has a wrong offset!");

}

