#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Laptop

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_Laptop.BP_Facility_Laptop_C.OperateStart
// 0x0008 (0x0008 - 0x0000)
struct BP_Facility_Laptop_C_OperateStart final
{
public:
	class AP2Facility*                            InFacility;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Laptop_C_OperateStart) == 0x000008, "Wrong alignment on BP_Facility_Laptop_C_OperateStart");
static_assert(sizeof(BP_Facility_Laptop_C_OperateStart) == 0x000008, "Wrong size on BP_Facility_Laptop_C_OperateStart");
static_assert(offsetof(BP_Facility_Laptop_C_OperateStart, InFacility) == 0x000000, "Member 'BP_Facility_Laptop_C_OperateStart::InFacility' has a wrong offset!");

// Function BP_Facility_Laptop.BP_Facility_Laptop_C.ExecuteUbergraph_BP_Facility_Laptop
// 0x0030 (0x0030 - 0x0000)
struct BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2Facility* InFacility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            K2Node_CustomEvent_InFacility;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop) == 0x000008, "Wrong alignment on BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop");
static_assert(sizeof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop) == 0x000030, "Wrong size on BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop");
static_assert(offsetof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop, EntryPoint) == 0x000000, "Member 'BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop, Temp_delegate_Variable) == 0x000004, "Member 'BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop, CallFunc_PostAkEvent_ReturnValue) == 0x000024, "Member 'BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop, K2Node_CustomEvent_InFacility) == 0x000028, "Member 'BP_Facility_Laptop_C_ExecuteUbergraph_BP_Facility_Laptop::K2Node_CustomEvent_InFacility' has a wrong offset!");

}

