#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_UGVConsole

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_UGVConsole.BP_Facility_UGVConsole_C
// 0x0050 (0x03D0 - 0x0380)
class ABP_Facility_UGVConsole_C final : public AP2Facility_UGV
{
public:
	class USpotLightComponent*                    SpotLight_Screen_NoShadow_Fog;                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Screen;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Decoration_NoShadow_Stationary_4;        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Decoration_NoShadow_Stationary_3;        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Decoration_NoShadow_Stationary_2;        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Decoration_NoShadow_Stationary_1;        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Key;                                     // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_UGVConsole_C">();
	}
	static class ABP_Facility_UGVConsole_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_UGVConsole_C>();
	}
};
static_assert(alignof(ABP_Facility_UGVConsole_C) == 0x000008, "Wrong alignment on ABP_Facility_UGVConsole_C");
static_assert(sizeof(ABP_Facility_UGVConsole_C) == 0x0003D0, "Wrong size on ABP_Facility_UGVConsole_C");
static_assert(offsetof(ABP_Facility_UGVConsole_C, SpotLight_Screen_NoShadow_Fog) == 0x000380, "Member 'ABP_Facility_UGVConsole_C::SpotLight_Screen_NoShadow_Fog' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, SpotLight_Screen) == 0x000388, "Member 'ABP_Facility_UGVConsole_C::SpotLight_Screen' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, RectLight_Decoration_NoShadow_Stationary_4) == 0x000390, "Member 'ABP_Facility_UGVConsole_C::RectLight_Decoration_NoShadow_Stationary_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, RectLight_Decoration_NoShadow_Stationary_3) == 0x000398, "Member 'ABP_Facility_UGVConsole_C::RectLight_Decoration_NoShadow_Stationary_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, RectLight_Decoration_NoShadow_Stationary_2) == 0x0003A0, "Member 'ABP_Facility_UGVConsole_C::RectLight_Decoration_NoShadow_Stationary_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, RectLight_Decoration_NoShadow_Stationary_1) == 0x0003A8, "Member 'ABP_Facility_UGVConsole_C::RectLight_Decoration_NoShadow_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, SpotLight_Key) == 0x0003B0, "Member 'ABP_Facility_UGVConsole_C::SpotLight_Key' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, P2FacilityBoundary1) == 0x0003B8, "Member 'ABP_Facility_UGVConsole_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, StaticMesh) == 0x0003C0, "Member 'ABP_Facility_UGVConsole_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_UGVConsole_C, SharedRoot) == 0x0003C8, "Member 'ABP_Facility_UGVConsole_C::SharedRoot' has a wrong offset!");

}

