#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Decorative_Ceiling_DFO_01

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Decorative_Ceiling_DFO_01.BP_Facility_Decorative_Ceiling_DFO_01_C
// 0x0038 (0x0408 - 0x03D0)
class ABP_Facility_Decorative_Ceiling_DFO_01_C final : public AP2Facility_GridSnapDecorative
{
public:
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2GridSnapFacilitySocket*              P2GridSnapFacilitySocket4;                         // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2GridSnapFacilitySocket*              P2GridSnapFacilitySocket3;                         // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2GridSnapFacilitySocket*              P2GridSnapFacilitySocket2;                         // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2GridSnapFacilitySocket*              P2GridSnapFacilitySocket1;                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Decorative_Ceiling_DFO_01_C">();
	}
	static class ABP_Facility_Decorative_Ceiling_DFO_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Decorative_Ceiling_DFO_01_C>();
	}
};
static_assert(alignof(ABP_Facility_Decorative_Ceiling_DFO_01_C) == 0x000008, "Wrong alignment on ABP_Facility_Decorative_Ceiling_DFO_01_C");
static_assert(sizeof(ABP_Facility_Decorative_Ceiling_DFO_01_C) == 0x000408, "Wrong size on ABP_Facility_Decorative_Ceiling_DFO_01_C");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, P2FacilityBoundary) == 0x0003D0, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, P2GridSnapFacilitySocket4) == 0x0003D8, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::P2GridSnapFacilitySocket4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, P2GridSnapFacilitySocket3) == 0x0003E0, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::P2GridSnapFacilitySocket3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, P2GridSnapFacilitySocket2) == 0x0003E8, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::P2GridSnapFacilitySocket2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, P2GridSnapFacilitySocket1) == 0x0003F0, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::P2GridSnapFacilitySocket1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, StaticMesh) == 0x0003F8, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Decorative_Ceiling_DFO_01_C, SharedRoot) == 0x000400, "Member 'ABP_Facility_Decorative_Ceiling_DFO_01_C::SharedRoot' has a wrong offset!");

}

