#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_VerticalGarden

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Facility_VerticalGarden.BP_Facility_VerticalGarden_C.ExecuteUbergraph_BP_Facility_VerticalGarden
// 0x02B0 (0x02B0 - 0x0000)
struct BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x0044(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_2;                  // 0x0058(0x00C0)(ConstParm)
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow_1;                  // 0x0118(0x00C0)(ConstParm)
	float                                         K2Node_Event_InStartTimeNormalized;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     K2Node_Event_InCraftingDataRow;                    // 0x01F0(0x00C0)(ConstParm)
};
static_assert(alignof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden");
static_assert(sizeof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden) == 0x0002B0, "Wrong size on BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, EntryPoint) == 0x000000, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, Temp_delegate_Variable) == 0x000004, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, Temp_delegate_Variable_2) == 0x000024, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, Temp_delegate_Variable_3) == 0x000034, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, Temp_delegate_Variable_4) == 0x000044, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, CallFunc_PostAkEvent_ReturnValue) == 0x000054, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, K2Node_Event_InCraftingDataRow_2) == 0x000058, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::K2Node_Event_InCraftingDataRow_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, K2Node_Event_InCraftingDataRow_1) == 0x000118, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::K2Node_Event_InCraftingDataRow_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, K2Node_Event_InStartTimeNormalized) == 0x0001D8, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::K2Node_Event_InStartTimeNormalized' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001DC, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, CallFunc_PostAkEvent_ReturnValue_2) == 0x0001E0, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, CallFunc_PostAkEvent_ReturnValue_3) == 0x0001E4, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, CallFunc_PostAkEvent_ReturnValue_4) == 0x0001E8, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden, K2Node_Event_InCraftingDataRow) == 0x0001F0, "Member 'BP_Facility_VerticalGarden_C_ExecuteUbergraph_BP_Facility_VerticalGarden::K2Node_Event_InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_VerticalGarden.BP_Facility_VerticalGarden_C.ReceiveCancelCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_VerticalGarden_C_ReceiveCancelCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_VerticalGarden_C_ReceiveCancelCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_C_ReceiveCancelCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_C_ReceiveCancelCraft) == 0x0000C0, "Wrong size on BP_Facility_VerticalGarden_C_ReceiveCancelCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ReceiveCancelCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_C_ReceiveCancelCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_VerticalGarden.BP_Facility_VerticalGarden_C.ReceiveCompleteCraft
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Facility_VerticalGarden_C_ReceiveCompleteCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_Facility_VerticalGarden_C_ReceiveCompleteCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_C_ReceiveCompleteCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_C_ReceiveCompleteCraft) == 0x0000C0, "Wrong size on BP_Facility_VerticalGarden_C_ReceiveCompleteCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ReceiveCompleteCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_C_ReceiveCompleteCraft::InCraftingDataRow' has a wrong offset!");

// Function BP_Facility_VerticalGarden.BP_Facility_VerticalGarden_C.ReceiveStartCraft
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Facility_VerticalGarden_C_ReceiveStartCraft final
{
public:
	struct FP2CraftingDataRow                     InCraftingDataRow;                                 // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InStartTimeNormalized;                             // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_VerticalGarden_C_ReceiveStartCraft) == 0x000008, "Wrong alignment on BP_Facility_VerticalGarden_C_ReceiveStartCraft");
static_assert(sizeof(BP_Facility_VerticalGarden_C_ReceiveStartCraft) == 0x0000C8, "Wrong size on BP_Facility_VerticalGarden_C_ReceiveStartCraft");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ReceiveStartCraft, InCraftingDataRow) == 0x000000, "Member 'BP_Facility_VerticalGarden_C_ReceiveStartCraft::InCraftingDataRow' has a wrong offset!");
static_assert(offsetof(BP_Facility_VerticalGarden_C_ReceiveStartCraft, InStartTimeNormalized) == 0x0000C0, "Member 'BP_Facility_VerticalGarden_C_ReceiveStartCraft::InStartTimeNormalized' has a wrong offset!");

}

