#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facilities_Stash

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facilities_Stash.BP_Facilities_Stash_C
// 0x0020 (0x03C0 - 0x03A0)
class ABP_Facilities_Stash_C final : public AP2FacilityStash
{
public:
	class USpotLightComponent*                    SpotLight_Stationary_1;                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Template_3;                                     // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facilities_Stash_C">();
	}
	static class ABP_Facilities_Stash_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facilities_Stash_C>();
	}
};
static_assert(alignof(ABP_Facilities_Stash_C) == 0x000008, "Wrong alignment on ABP_Facilities_Stash_C");
static_assert(sizeof(ABP_Facilities_Stash_C) == 0x0003C0, "Wrong size on ABP_Facilities_Stash_C");
static_assert(offsetof(ABP_Facilities_Stash_C, SpotLight_Stationary_1) == 0x0003A0, "Member 'ABP_Facilities_Stash_C::SpotLight_Stationary_1' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_C, P2FacilityBoundary1) == 0x0003A8, "Member 'ABP_Facilities_Stash_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_C, SM_Template_3) == 0x0003B0, "Member 'ABP_Facilities_Stash_C::SM_Template_3' has a wrong offset!");
static_assert(offsetof(ABP_Facilities_Stash_C, SharedRoot) == 0x0003B8, "Member 'ABP_Facilities_Stash_C::SharedRoot' has a wrong offset!");

}

