#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Workbench_Drone

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Facility_Workbench_Drone.BP_Facility_Workbench_Drone_C.UpdateDeskLight
// 0x0088 (0x0088 - 0x0000)
struct BP_Facility_Workbench_Drone_C_UpdateDeskLight final
{
public:
	bool                                          LightOn;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_Map_Keys_Keys;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_Map_Keys_Keys_1;                          // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULightComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetIntensity_NewIntensity_ImplicitCast;   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Workbench_Drone_C_UpdateDeskLight) == 0x000008, "Wrong alignment on BP_Facility_Workbench_Drone_C_UpdateDeskLight");
static_assert(sizeof(BP_Facility_Workbench_Drone_C_UpdateDeskLight) == 0x000088, "Wrong size on BP_Facility_Workbench_Drone_C_UpdateDeskLight");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, LightOn) == 0x000000, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::LightOn' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Map_Keys_Keys) == 0x000020, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue) == 0x000030, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1) == 0x000048, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Map_Keys_Keys_1) == 0x000050, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_IsValid_ReturnValue_1) == 0x00006C, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006D, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Map_Find_Value) == 0x000070, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_SetIntensity_NewIntensity_ImplicitCast) == 0x00007C, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_SetIntensity_NewIntensity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_UpdateDeskLight, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000080, "Member 'BP_Facility_Workbench_Drone_C_UpdateDeskLight::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");

// Function BP_Facility_Workbench_Drone.BP_Facility_Workbench_Drone_C.ExecuteUbergraph_BP_Facility_Workbench_Drone
// 0x0010 (0x0010 - 0x0000)
struct BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Add_Value_ImplicitCast;               // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone) == 0x000008, "Wrong alignment on BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone");
static_assert(sizeof(BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone) == 0x000010, "Wrong size on BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone, EntryPoint) == 0x000000, "Member 'BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue) == 0x000004, "Member 'BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone, CallFunc_Map_Add_Value_ImplicitCast) == 0x000008, "Member 'BP_Facility_Workbench_Drone_C_ExecuteUbergraph_BP_Facility_Workbench_Drone::CallFunc_Map_Add_Value_ImplicitCast' has a wrong offset!");

}

