#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_AmmoPlant

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "BP_Facility_Craft_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_AmmoPlant.BP_Facility_AmmoPlant_C
// 0x01E0 (0x0630 - 0x0450)
class ABP_Facility_AmmoPlant_C final : public ABP_Facility_Craft_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Facility_AmmoPlant_C;            // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_5;                   // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_4;                   // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Fill_2;                              // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_3;                   // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_2;                   // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Stationary_NoShadow_1;                   // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Box_Stationary_NoShadow_1;               // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Slot0_Camera;                                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_AmmoPlant_lamp;                                 // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Product;                                        // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_AmmoPlant_Belt_01;                              // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Facility_AmmoPlant_Base_01_A;                   // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Key_1;                               // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Top_Fill_1;                              // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  Static;                                            // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        StaticMeshes;                                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UABP_Facility_AmmoPlant_Base_01_A_C*    ABP_base;                                          // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UABP_AmmoPlant_Belt_01_C*               ABP_belt;                                          // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            DefaultProductMesh;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ProductRestTransformLS;                            // 0x0500(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChamberSize;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2CraftingDataRow                     LastCraftingDataRow;                               // 0x0568(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void EnsureCraftingStateIfQueueHasWork()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Facility_AmmoPlant(int32 EntryPoint)	 // 0xae1e64;
	void MuteCraftingSound(class AP2Facility* InFacility)	 // 0xae1e64;
	void OnBeginStandby()	 // 0xae1e64;
	void OnSetState(int32 NewState)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveCancelCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveCompleteCraft(const struct FP2CraftingDataRow& InCraftingDataRow)	 // 0xae1e64;
	void ReceiveStartCraft(const struct FP2CraftingDataRow& InCraftingDataRow, float InStartTimeNormalized)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_AmmoPlant_C">();
	}
	static class ABP_Facility_AmmoPlant_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_AmmoPlant_C>();
	}
};
static_assert(alignof(ABP_Facility_AmmoPlant_C) == 0x000010, "Wrong alignment on ABP_Facility_AmmoPlant_C");
static_assert(sizeof(ABP_Facility_AmmoPlant_C) == 0x000630, "Wrong size on ABP_Facility_AmmoPlant_C");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, UberGraphFrame_BP_Facility_AmmoPlant_C) == 0x000450, "Member 'ABP_Facility_AmmoPlant_C::UberGraphFrame_BP_Facility_AmmoPlant_C' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Stationary_NoShadow_5) == 0x000458, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Stationary_NoShadow_5' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Stationary_NoShadow_4) == 0x000460, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Stationary_NoShadow_4' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SpotLight_Top_Fill_2) == 0x000468, "Member 'ABP_Facility_AmmoPlant_C::SpotLight_Top_Fill_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Stationary_NoShadow_3) == 0x000470, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Stationary_NoShadow_3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Stationary_NoShadow_2) == 0x000478, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Stationary_NoShadow_2' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Stationary_NoShadow_1) == 0x000480, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, RectLight_Box_Stationary_NoShadow_1) == 0x000488, "Member 'ABP_Facility_AmmoPlant_C::RectLight_Box_Stationary_NoShadow_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, Slot0_Camera) == 0x000490, "Member 'ABP_Facility_AmmoPlant_C::Slot0_Camera' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SM_AmmoPlant_lamp) == 0x000498, "Member 'ABP_Facility_AmmoPlant_C::SM_AmmoPlant_lamp' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SM_Product) == 0x0004A0, "Member 'ABP_Facility_AmmoPlant_C::SM_Product' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SK_AmmoPlant_Belt_01) == 0x0004A8, "Member 'ABP_Facility_AmmoPlant_C::SK_AmmoPlant_Belt_01' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SK_Facility_AmmoPlant_Base_01_A) == 0x0004B0, "Member 'ABP_Facility_AmmoPlant_C::SK_Facility_AmmoPlant_Base_01_A' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, P2FacilityBoundary1) == 0x0004B8, "Member 'ABP_Facility_AmmoPlant_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SpotLight_Top_Key_1) == 0x0004C0, "Member 'ABP_Facility_AmmoPlant_C::SpotLight_Top_Key_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, SpotLight_Top_Fill_1) == 0x0004C8, "Member 'ABP_Facility_AmmoPlant_C::SpotLight_Top_Fill_1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, Ak) == 0x0004D0, "Member 'ABP_Facility_AmmoPlant_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, Static) == 0x0004D8, "Member 'ABP_Facility_AmmoPlant_C::Static' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, StaticMeshes) == 0x0004E0, "Member 'ABP_Facility_AmmoPlant_C::StaticMeshes' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, ABP_base) == 0x0004E8, "Member 'ABP_Facility_AmmoPlant_C::ABP_base' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, ABP_belt) == 0x0004F0, "Member 'ABP_Facility_AmmoPlant_C::ABP_belt' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, DefaultProductMesh) == 0x0004F8, "Member 'ABP_Facility_AmmoPlant_C::DefaultProductMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, ProductRestTransformLS) == 0x000500, "Member 'ABP_Facility_AmmoPlant_C::ProductRestTransformLS' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, ChamberSize) == 0x000560, "Member 'ABP_Facility_AmmoPlant_C::ChamberSize' has a wrong offset!");
static_assert(offsetof(ABP_Facility_AmmoPlant_C, LastCraftingDataRow) == 0x000568, "Member 'ABP_Facility_AmmoPlant_C::LastCraftingDataRow' has a wrong offset!");

}

