#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Facility_Salvage_AR

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Facility_Salvage_AR.BP_Facility_Salvage_AR_C
// 0x0020 (0x03D0 - 0x03B0)
class ABP_Facility_Salvage_AR_C final : public AP2Facility_Salvage
{
public:
	class UNiagaraComponent*                      NS_Blunt_Electric3;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary1;                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Facility_Salvage_AR_C">();
	}
	static class ABP_Facility_Salvage_AR_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Facility_Salvage_AR_C>();
	}
};
static_assert(alignof(ABP_Facility_Salvage_AR_C) == 0x000008, "Wrong alignment on ABP_Facility_Salvage_AR_C");
static_assert(sizeof(ABP_Facility_Salvage_AR_C) == 0x0003D0, "Wrong size on ABP_Facility_Salvage_AR_C");
static_assert(offsetof(ABP_Facility_Salvage_AR_C, NS_Blunt_Electric3) == 0x0003B0, "Member 'ABP_Facility_Salvage_AR_C::NS_Blunt_Electric3' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Salvage_AR_C, P2FacilityBoundary1) == 0x0003B8, "Member 'ABP_Facility_Salvage_AR_C::P2FacilityBoundary1' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Salvage_AR_C, StaticMesh) == 0x0003C0, "Member 'ABP_Facility_Salvage_AR_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Facility_Salvage_AR_C, SharedRoot) == 0x0003C8, "Member 'ABP_Facility_Salvage_AR_C::SharedRoot' has a wrong offset!");

}

