#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GE_AppReq_StatusEffect_Severity

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_GE_AppReq_StatusEffect_Severity.BP_GE_AppReq_StatusEffect_Severity_C.CanApplyGameplayEffect
// 0x02C8 (0x02C8 - 0x0000)
struct BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect final
{
public:
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UAbilitySystemComponent*                ASC;                                               // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x02A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue;         // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect) == 0x000008, "Wrong alignment on BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect");
static_assert(sizeof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect) == 0x0002C8, "Wrong size on BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, GameplayEffect) == 0x000000, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::GameplayEffect' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, Spec) == 0x000008, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::Spec' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, ASC) == 0x0002A0, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::ASC' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, ReturnValue) == 0x0002A8, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, CallFunc_GetOwner_ReturnValue) == 0x0002B0, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, CallFunc_GetStatusEffectLevel_ReturnValue) == 0x0002B8, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::CallFunc_GetStatusEffectLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0002BC, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0002C0, "Member 'BP_GE_AppReq_StatusEffect_Severity_C_CanApplyGameplayEffect::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

