#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GridOcclusion_Base

#include "Basic.hpp"

#include "P2GridOcclusion_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GridOcclusion_Base.BP_GridOcclusion_Base_C
// 0x0010 (0x0568 - 0x0558)
class ABP_GridOcclusion_Base_C final : public AP2GridOcclusionActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CaptureNearCameraRadius;                           // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tmp;                                               // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void StopCapture()	 // 0xae1e64;
	void Re_Stream_Tiles()	 // 0xae1e64;
	void ExecuteUbergraph_BP_GridOcclusion_Base(int32 EntryPoint)	 // 0xae1e64;
	void ConvertToTemp()	 // 0xae1e64;
	void ConvertToBulk()	 // 0xae1e64;
	void ClearAll()	 // 0xae1e64;
	void CaptureNearCamera()	 // 0xae1e64;
	void CaptureAllSync()	 // 0xae1e64;
	void CaptureAll()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_GridOcclusion_Base_C">();
	}
	static class ABP_GridOcclusion_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_GridOcclusion_Base_C>();
	}
};
static_assert(alignof(ABP_GridOcclusion_Base_C) == 0x000008, "Wrong alignment on ABP_GridOcclusion_Base_C");
static_assert(sizeof(ABP_GridOcclusion_Base_C) == 0x000568, "Wrong size on ABP_GridOcclusion_Base_C");
static_assert(offsetof(ABP_GridOcclusion_Base_C, UberGraphFrame) == 0x000558, "Member 'ABP_GridOcclusion_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GridOcclusion_Base_C, CaptureNearCameraRadius) == 0x000560, "Member 'ABP_GridOcclusion_Base_C::CaptureNearCameraRadius' has a wrong offset!");
static_assert(offsetof(ABP_GridOcclusion_Base_C, Tmp) == 0x000564, "Member 'ABP_GridOcclusion_Base_C::Tmp' has a wrong offset!");

}

