#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hideout_Wind

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Hideout_Wind.BP_Hideout_Wind_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Hideout_Wind_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hideout_Wind_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Hideout_Wind_C_ReceiveTick");
static_assert(sizeof(BP_Hideout_Wind_C_ReceiveTick) == 0x000004, "Wrong size on BP_Hideout_Wind_C_ReceiveTick");
static_assert(offsetof(BP_Hideout_Wind_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Hideout_Wind_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Hideout_Wind.BP_Hideout_Wind_C.ExecuteUbergraph_BP_Hideout_Wind
// 0x0018 (0x0018 - 0x0000)
struct BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind) == 0x000004, "Wrong alignment on BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind");
static_assert(sizeof(BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind) == 0x000018, "Wrong size on BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind");
static_assert(offsetof(BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind, EntryPoint) == 0x000000, "Member 'BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000008, "Member 'BP_Hideout_Wind_C_ExecuteUbergraph_BP_Hideout_Wind::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

}

