#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hero

#include "Basic.hpp"

#include "BP_CharacterDefault_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hero.BP_Hero_C
// 0x0030 (0x0BF0 - 0x0BC0)
class ABP_Hero_C : public ABP_CharacterDefault_C
{
public:
	class UP2WeaponObstructionComponent*          P2WeaponObstruction;                               // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MoveAction_Component_C*             BP_Vault_Component;                                // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2IVAudioComponent*                    P2IVAudio;                                         // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAdaptiveLeanComponent*                 AdaptiveLean;                                      // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                MotionWarping;                                     // 0x0BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponSimulatorComponent*              WeaponSimulator;                                   // 0x0BE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Hero_C">();
	}
	static class ABP_Hero_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Hero_C>();
	}
};
static_assert(alignof(ABP_Hero_C) == 0x000010, "Wrong alignment on ABP_Hero_C");
static_assert(sizeof(ABP_Hero_C) == 0x000BF0, "Wrong size on ABP_Hero_C");
static_assert(offsetof(ABP_Hero_C, P2WeaponObstruction) == 0x000BC0, "Member 'ABP_Hero_C::P2WeaponObstruction' has a wrong offset!");
static_assert(offsetof(ABP_Hero_C, BP_Vault_Component) == 0x000BC8, "Member 'ABP_Hero_C::BP_Vault_Component' has a wrong offset!");
static_assert(offsetof(ABP_Hero_C, P2IVAudio) == 0x000BD0, "Member 'ABP_Hero_C::P2IVAudio' has a wrong offset!");
static_assert(offsetof(ABP_Hero_C, AdaptiveLean) == 0x000BD8, "Member 'ABP_Hero_C::AdaptiveLean' has a wrong offset!");
static_assert(offsetof(ABP_Hero_C, MotionWarping) == 0x000BE0, "Member 'ABP_Hero_C::MotionWarping' has a wrong offset!");
static_assert(offsetof(ABP_Hero_C, WeaponSimulator) == 0x000BE8, "Member 'ABP_Hero_C::WeaponSimulator' has a wrong offset!");

}

