#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HideoutHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HideoutHUD.BP_HideoutHUD_C.OnInitializeWithPawn
// 0x0010 (0x0010 - 0x0000)
struct BP_HideoutHUD_C_OnInitializeWithPawn final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2PawnData*                      InPawnData;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HideoutHUD_C_OnInitializeWithPawn) == 0x000008, "Wrong alignment on BP_HideoutHUD_C_OnInitializeWithPawn");
static_assert(sizeof(BP_HideoutHUD_C_OnInitializeWithPawn) == 0x000010, "Wrong size on BP_HideoutHUD_C_OnInitializeWithPawn");
static_assert(offsetof(BP_HideoutHUD_C_OnInitializeWithPawn, Pawn) == 0x000000, "Member 'BP_HideoutHUD_C_OnInitializeWithPawn::Pawn' has a wrong offset!");
static_assert(offsetof(BP_HideoutHUD_C_OnInitializeWithPawn, InPawnData) == 0x000008, "Member 'BP_HideoutHUD_C_OnInitializeWithPawn::InPawnData' has a wrong offset!");

// Function BP_HideoutHUD.BP_HideoutHUD_C.ExecuteUbergraph_BP_HideoutHUD
// 0x0018 (0x0018 - 0x0000)
struct BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_Pawn;                                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2PawnData*                      K2Node_Event_InPawnData;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD) == 0x000008, "Wrong alignment on BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD");
static_assert(sizeof(BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD) == 0x000018, "Wrong size on BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD");
static_assert(offsetof(BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD, EntryPoint) == 0x000000, "Member 'BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD, K2Node_Event_Pawn) == 0x000008, "Member 'BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD::K2Node_Event_Pawn' has a wrong offset!");
static_assert(offsetof(BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD, K2Node_Event_InPawnData) == 0x000010, "Member 'BP_HideoutHUD_C_ExecuteUbergraph_BP_HideoutHUD::K2Node_Event_InPawnData' has a wrong offset!");

}

