#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HID_Custom_FixtureSpot_Ceiling_01

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HID_Custom_FixtureSpot_Ceiling_01.BP_HID_Custom_FixtureSpot_Ceiling_01_C
// 0x0030 (0x03A8 - 0x0378)
class ABP_HID_Custom_FixtureSpot_Ceiling_01_C final : public AP2Facility_Decoration
{
public:
	class UP2FacilityBoundaryComponent*           P2FacilityBoundary;                                // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fixture_Spots_01_Mount_02;                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fixture_Spots_01_Mount_01;                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fixture_Spots_01_Clip_01;                       // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Secondary1;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_HID_Custom_FixtureSpot_Ceiling_01_C">();
	}
	static class ABP_HID_Custom_FixtureSpot_Ceiling_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_HID_Custom_FixtureSpot_Ceiling_01_C>();
	}
};
static_assert(alignof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C) == 0x000008, "Wrong alignment on ABP_HID_Custom_FixtureSpot_Ceiling_01_C");
static_assert(sizeof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C) == 0x0003A8, "Wrong size on ABP_HID_Custom_FixtureSpot_Ceiling_01_C");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, P2FacilityBoundary) == 0x000378, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::P2FacilityBoundary' has a wrong offset!");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, SpotLight) == 0x000380, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, SM_Fixture_Spots_01_Mount_02) == 0x000388, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::SM_Fixture_Spots_01_Mount_02' has a wrong offset!");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, SM_Fixture_Spots_01_Mount_01) == 0x000390, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::SM_Fixture_Spots_01_Mount_01' has a wrong offset!");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, SM_Fixture_Spots_01_Clip_01) == 0x000398, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::SM_Fixture_Spots_01_Clip_01' has a wrong offset!");
static_assert(offsetof(ABP_HID_Custom_FixtureSpot_Ceiling_01_C, Secondary1) == 0x0003A0, "Member 'ABP_HID_Custom_FixtureSpot_Ceiling_01_C::Secondary1' has a wrong offset!");

}

