#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hideout_Wind

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hideout_Wind.BP_Hideout_Wind_C
// 0x0040 (0x02F0 - 0x02B0)
class ABP_Hideout_Wind_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TrunkSpeed;                                        // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BranchesSpeed;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BranchesNoise;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWind()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Hideout_Wind(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Hideout_Wind_C">();
	}
	static class ABP_Hideout_Wind_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Hideout_Wind_C>();
	}
};
static_assert(alignof(ABP_Hideout_Wind_C) == 0x000008, "Wrong alignment on ABP_Hideout_Wind_C");
static_assert(sizeof(ABP_Hideout_Wind_C) == 0x0002F0, "Wrong size on ABP_Hideout_Wind_C");
static_assert(offsetof(ABP_Hideout_Wind_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Hideout_Wind_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Hideout_Wind_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, Intensity) == 0x0002C0, "Member 'ABP_Hideout_Wind_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, TrunkSpeed) == 0x0002C4, "Member 'ABP_Hideout_Wind_C::TrunkSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, BranchesSpeed) == 0x0002C8, "Member 'ABP_Hideout_Wind_C::BranchesSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, Direction) == 0x0002D0, "Member 'ABP_Hideout_Wind_C::Direction' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_Wind_C, BranchesNoise) == 0x0002E8, "Member 'ABP_Hideout_Wind_C::BranchesNoise' has a wrong offset!");

}

