#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HID_Blocker_02

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HID_Blocker_02.BP_HID_Blocker_02_C
// 0x0128 (0x03F0 - 0x02C8)
class ABP_HID_Blocker_02_C final : public AP2HideoutActor
{
public:
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent6;        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_FloodLight_Fill;                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Fixture_Floodlight_02_Base_02;                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_FloodLight_Key;                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Soil_Pile_6_StaticMeshComponent3;       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Soil_Pile_6_StaticMeshComponent2;       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Soil_Pile_6_StaticMeshComponent1;       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Soil_Pile_6_StaticMeshComponent0;       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent5;        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent4;        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_82_StaticMeshComponent4;          // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent3;        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent2;        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent1;        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_82_StaticMeshComponent3;          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_82_StaticMeshComponent2;          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_82_StaticMeshComponent1;          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal5;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal4;                                            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal3;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal2;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight5_LightComponent0;                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MTD_Roots_06_StaticMeshComponent0;              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hideout_Pillar_110_StaticMeshComponent0;        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_83_StaticMeshComponent0;          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_82_StaticMeshComponent0;          // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Attach_Roots_Muta_03_StaticMeshComponent0;      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DAMJ_Tree_A_Stump_01_StaticMeshComponent0;      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DAMJ_Tree_A_03_B3_StaticMeshComponent0;         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DAMJ_Tree_A_03_B_StaticMeshComponent0;          // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Attach_Roots_Muta_6_StaticMeshComponent0;       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Attach_Roots_Muta_5_StaticMeshComponent0;       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Attach_Roots_Muta_4_StaticMeshComponent0;       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hid_Rock_Ramp_28_StaticMeshComponent0;          // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_HID_Blocker_02_C">();
	}
	static class ABP_HID_Blocker_02_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_HID_Blocker_02_C>();
	}
};
static_assert(alignof(ABP_HID_Blocker_02_C) == 0x000008, "Wrong alignment on ABP_HID_Blocker_02_C");
static_assert(sizeof(ABP_HID_Blocker_02_C) == 0x0003F0, "Wrong size on ABP_HID_Blocker_02_C");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent6) == 0x0002C8, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SpotLight_FloodLight_Fill) == 0x0002D0, "Member 'ABP_HID_Blocker_02_C::SpotLight_FloodLight_Fill' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Fixture_Floodlight_02_Base_02) == 0x0002D8, "Member 'ABP_HID_Blocker_02_C::SM_Fixture_Floodlight_02_Base_02' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SpotLight_FloodLight_Key) == 0x0002E0, "Member 'ABP_HID_Blocker_02_C::SpotLight_FloodLight_Key' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Soil_Pile_6_StaticMeshComponent3) == 0x0002E8, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Soil_Pile_6_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Soil_Pile_6_StaticMeshComponent2) == 0x0002F0, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Soil_Pile_6_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Soil_Pile_6_StaticMeshComponent1) == 0x0002F8, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Soil_Pile_6_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Soil_Pile_6_StaticMeshComponent0) == 0x000300, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Soil_Pile_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent5) == 0x000308, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent4) == 0x000310, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_82_StaticMeshComponent4) == 0x000318, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_82_StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent3) == 0x000320, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent2) == 0x000328, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent1) == 0x000330, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_82_StaticMeshComponent3) == 0x000338, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_82_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_82_StaticMeshComponent2) == 0x000340, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_82_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_82_StaticMeshComponent1) == 0x000348, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_82_StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal5) == 0x000350, "Member 'ABP_HID_Blocker_02_C::Decal5' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal4) == 0x000358, "Member 'ABP_HID_Blocker_02_C::Decal4' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal3) == 0x000360, "Member 'ABP_HID_Blocker_02_C::Decal3' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal2) == 0x000368, "Member 'ABP_HID_Blocker_02_C::Decal2' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal1) == 0x000370, "Member 'ABP_HID_Blocker_02_C::Decal1' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, Decal) == 0x000378, "Member 'ABP_HID_Blocker_02_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SpotLight5_LightComponent0) == 0x000380, "Member 'ABP_HID_Blocker_02_C::SpotLight5_LightComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_MTD_Roots_06_StaticMeshComponent0) == 0x000388, "Member 'ABP_HID_Blocker_02_C::SM_MTD_Roots_06_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hideout_Pillar_110_StaticMeshComponent0) == 0x000390, "Member 'ABP_HID_Blocker_02_C::SM_Hideout_Pillar_110_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_83_StaticMeshComponent0) == 0x000398, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_83_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_82_StaticMeshComponent0) == 0x0003A0, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_82_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Attach_Roots_Muta_03_StaticMeshComponent0) == 0x0003A8, "Member 'ABP_HID_Blocker_02_C::SM_Attach_Roots_Muta_03_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_DAMJ_Tree_A_Stump_01_StaticMeshComponent0) == 0x0003B0, "Member 'ABP_HID_Blocker_02_C::SM_DAMJ_Tree_A_Stump_01_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_DAMJ_Tree_A_03_B3_StaticMeshComponent0) == 0x0003B8, "Member 'ABP_HID_Blocker_02_C::SM_DAMJ_Tree_A_03_B3_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_DAMJ_Tree_A_03_B_StaticMeshComponent0) == 0x0003C0, "Member 'ABP_HID_Blocker_02_C::SM_DAMJ_Tree_A_03_B_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Attach_Roots_Muta_6_StaticMeshComponent0) == 0x0003C8, "Member 'ABP_HID_Blocker_02_C::SM_Attach_Roots_Muta_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Attach_Roots_Muta_5_StaticMeshComponent0) == 0x0003D0, "Member 'ABP_HID_Blocker_02_C::SM_Attach_Roots_Muta_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Attach_Roots_Muta_4_StaticMeshComponent0) == 0x0003D8, "Member 'ABP_HID_Blocker_02_C::SM_Attach_Roots_Muta_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SM_Hid_Rock_Ramp_28_StaticMeshComponent0) == 0x0003E0, "Member 'ABP_HID_Blocker_02_C::SM_Hid_Rock_Ramp_28_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_HID_Blocker_02_C, SharedRoot) == 0x0003E8, "Member 'ABP_HID_Blocker_02_C::SharedRoot' has a wrong offset!");

}

