#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hzd_PufferPlant_Poison

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Hzd_PufferPlant_Poison.BP_Hzd_PufferPlant_Poison_C.ExecuteUbergraph_BP_Hzd_PufferPlant_Poison
// 0x0120 (0x0120 - 0x0000)
struct BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameFrameworkComponentManager*         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2HitInfo                             K2Node_Event_Info;                                 // 0x0010(0x0108)(ConstParm, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison) == 0x000008, "Wrong alignment on BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison");
static_assert(sizeof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison) == 0x000120, "Wrong size on BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison, EntryPoint) == 0x000000, "Member 'BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison, K2Node_Event_Info) == 0x000010, "Member 'BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000118, "Member 'BP_Hzd_PufferPlant_Poison_C_ExecuteUbergraph_BP_Hzd_PufferPlant_Poison::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Hzd_PufferPlant_Poison.BP_Hzd_PufferPlant_Poison_C.OnHit
// 0x0108 (0x0108 - 0x0000)
struct BP_Hzd_PufferPlant_Poison_C_OnHit final
{
public:
	struct FP2HitInfo                             Info;                                              // 0x0000(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Hzd_PufferPlant_Poison_C_OnHit) == 0x000008, "Wrong alignment on BP_Hzd_PufferPlant_Poison_C_OnHit");
static_assert(sizeof(BP_Hzd_PufferPlant_Poison_C_OnHit) == 0x000108, "Wrong size on BP_Hzd_PufferPlant_Poison_C_OnHit");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_OnHit, Info) == 0x000000, "Member 'BP_Hzd_PufferPlant_Poison_C_OnHit::Info' has a wrong offset!");

// Function BP_Hzd_PufferPlant_Poison.BP_Hzd_PufferPlant_Poison_C.UpdateTimelineEffects
// 0x0020 (0x0020 - 0x0000)
struct BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects) == 0x000008, "Wrong alignment on BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects");
static_assert(sizeof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects) == 0x000020, "Wrong size on BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects, Value) == 0x000000, "Member 'BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects::Value' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects, CallFunc_FClamp_Value_ImplicitCast) == 0x000010, "Member 'BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000018, "Member 'BP_Hzd_PufferPlant_Poison_C_UpdateTimelineEffects::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

}

