#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hzd_PufferPlant_Poison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DestructibleHazard_Base_Proximity_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hzd_PufferPlant_Poison.BP_Hzd_PufferPlant_Poison_C
// 0x0030 (0x03A0 - 0x0370)
class ABP_Hzd_PufferPlant_Poison_C final : public ABP_DestructibleHazard_Base_Proximity_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Hzd_PufferPlant_Poison_C;        // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_PufferPlant_Idle;                               // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        SlimeDecal;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMID;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDestruction;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__BP_DestructibleHazard_Base_Proximity_P2Destructible_K2Node_ComponentBoundEvent_2_OnDestructibleDestroyed__DelegateSignature()	 // 0xae1e64;
	void EndFX()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Hzd_PufferPlant_Poison(int32 EntryPoint)	 // 0xae1e64;
	void OnHit(const struct FP2HitInfo& Info)	 // 0xae1e64;
	void OnTimelineFinished()	 // 0xae1e64;
	void PlayLocalCameraShakes()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ResetFX()	 // 0xae1e64;
	void UpdateTimelineEffects(float Value)	 // 0xae1e64;
	void UserConstructionScript()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Hzd_PufferPlant_Poison_C">();
	}
	static class ABP_Hzd_PufferPlant_Poison_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Hzd_PufferPlant_Poison_C>();
	}
};
static_assert(alignof(ABP_Hzd_PufferPlant_Poison_C) == 0x000008, "Wrong alignment on ABP_Hzd_PufferPlant_Poison_C");
static_assert(sizeof(ABP_Hzd_PufferPlant_Poison_C) == 0x0003A0, "Wrong size on ABP_Hzd_PufferPlant_Poison_C");
static_assert(offsetof(ABP_Hzd_PufferPlant_Poison_C, UberGraphFrame_BP_Hzd_PufferPlant_Poison_C) == 0x000370, "Member 'ABP_Hzd_PufferPlant_Poison_C::UberGraphFrame_BP_Hzd_PufferPlant_Poison_C' has a wrong offset!");
static_assert(offsetof(ABP_Hzd_PufferPlant_Poison_C, NS_PufferPlant_Idle) == 0x000378, "Member 'ABP_Hzd_PufferPlant_Poison_C::NS_PufferPlant_Idle' has a wrong offset!");
static_assert(offsetof(ABP_Hzd_PufferPlant_Poison_C, SlimeDecal) == 0x000380, "Member 'ABP_Hzd_PufferPlant_Poison_C::SlimeDecal' has a wrong offset!");
static_assert(offsetof(ABP_Hzd_PufferPlant_Poison_C, DecalMID) == 0x000388, "Member 'ABP_Hzd_PufferPlant_Poison_C::DecalMID' has a wrong offset!");
static_assert(offsetof(ABP_Hzd_PufferPlant_Poison_C, OnDestruction) == 0x000390, "Member 'ABP_Hzd_PufferPlant_Poison_C::OnDestruction' has a wrong offset!");

}

