#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hideout_wetness

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hideout_wetness.BP_Hideout_wetness_C
// 0x0028 (0x02D8 - 0x02B0)
class ABP_Hideout_wetness_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WetnessRoughnessMul;                               // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WetnessRoughnessAdd;                               // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WetnessRoughnessMin;                               // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WetnessGamma;                                      // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WetnessMin;                                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWetness()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ExecuteUbergraph_BP_Hideout_wetness(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Hideout_wetness_C">();
	}
	static class ABP_Hideout_wetness_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Hideout_wetness_C>();
	}
};
static_assert(alignof(ABP_Hideout_wetness_C) == 0x000008, "Wrong alignment on ABP_Hideout_wetness_C");
static_assert(sizeof(ABP_Hideout_wetness_C) == 0x0002D8, "Wrong size on ABP_Hideout_wetness_C");
static_assert(offsetof(ABP_Hideout_wetness_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Hideout_wetness_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Hideout_wetness_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, Intensity) == 0x0002C0, "Member 'ABP_Hideout_wetness_C::Intensity' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, WetnessRoughnessMul) == 0x0002C4, "Member 'ABP_Hideout_wetness_C::WetnessRoughnessMul' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, WetnessRoughnessAdd) == 0x0002C8, "Member 'ABP_Hideout_wetness_C::WetnessRoughnessAdd' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, WetnessRoughnessMin) == 0x0002CC, "Member 'ABP_Hideout_wetness_C::WetnessRoughnessMin' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, WetnessGamma) == 0x0002D0, "Member 'ABP_Hideout_wetness_C::WetnessGamma' has a wrong offset!");
static_assert(offsetof(ABP_Hideout_wetness_C, WetnessMin) == 0x0002D4, "Member 'ABP_Hideout_wetness_C::WetnessMin' has a wrong offset!");

}

