#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hero_Mannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hero_Mannequin.BP_Hero_Mannequin_C
// 0x0030 (0x06A0 - 0x0670)
class ABP_Hero_Mannequin_C final : public AP2MannequinCharacter
{
public:
	uint8                                         Pad_668[0x8];                                      // 0x0668(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_AK12;                                           // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara_AK12;                                      // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnChooseVisibility(bool bInShowMesh)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Hero_Mannequin(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Hero_Mannequin_C">();
	}
	static class ABP_Hero_Mannequin_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Hero_Mannequin_C>();
	}
};
static_assert(alignof(ABP_Hero_Mannequin_C) == 0x000010, "Wrong alignment on ABP_Hero_Mannequin_C");
static_assert(sizeof(ABP_Hero_Mannequin_C) == 0x0006A0, "Wrong size on ABP_Hero_Mannequin_C");
static_assert(offsetof(ABP_Hero_Mannequin_C, UberGraphFrame) == 0x000670, "Member 'ABP_Hero_Mannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Hero_Mannequin_C, SM_AK12) == 0x000678, "Member 'ABP_Hero_Mannequin_C::SM_AK12' has a wrong offset!");
static_assert(offsetof(ABP_Hero_Mannequin_C, Niagara_AK12) == 0x000680, "Member 'ABP_Hero_Mannequin_C::Niagara_AK12' has a wrong offset!");
static_assert(offsetof(ABP_Hero_Mannequin_C, Niagara) == 0x000688, "Member 'ABP_Hero_Mannequin_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Hero_Mannequin_C, SkeletalMesh) == 0x000690, "Member 'ABP_Hero_Mannequin_C::SkeletalMesh' has a wrong offset!");

}

