#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hero_Mannequin

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Hero_Mannequin.BP_Hero_Mannequin_C.BP_OnChooseVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_Hero_Mannequin_C_BP_OnChooseVisibility final
{
public:
	bool                                          bInShowMesh;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_Mannequin_C_BP_OnChooseVisibility) == 0x000001, "Wrong alignment on BP_Hero_Mannequin_C_BP_OnChooseVisibility");
static_assert(sizeof(BP_Hero_Mannequin_C_BP_OnChooseVisibility) == 0x000001, "Wrong size on BP_Hero_Mannequin_C_BP_OnChooseVisibility");
static_assert(offsetof(BP_Hero_Mannequin_C_BP_OnChooseVisibility, bInShowMesh) == 0x000000, "Member 'BP_Hero_Mannequin_C_BP_OnChooseVisibility::bInShowMesh' has a wrong offset!");

// Function BP_Hero_Mannequin.BP_Hero_Mannequin_C.ExecuteUbergraph_BP_Hero_Mannequin
// 0x0028 (0x0028 - 0x0000)
struct BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShowMesh;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_C*                       K2Node_DynamicCast_AsABP_Mannequin;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin) == 0x000008, "Wrong alignment on BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin");
static_assert(sizeof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin) == 0x000028, "Wrong size on BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, EntryPoint) == 0x000000, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, K2Node_Event_bInShowMesh) == 0x000010, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::K2Node_Event_bInShowMesh' has a wrong offset!");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, K2Node_DynamicCast_AsABP_Mannequin) == 0x000018, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::K2Node_DynamicCast_AsABP_Mannequin' has a wrong offset!");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_Hero_Mannequin_C_ExecuteUbergraph_BP_Hero_Mannequin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

