#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemExtension_FaceShield

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemExtension_FaceShield.BP_ItemExtension_FaceShield_C.ExecuteUbergraph_BP_ItemExtension_FaceShield
// 0x0078 (0x0078 - 0x0000)
struct BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2Item*                          K2Node_Event_InItem;                               // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDurabilityDelta;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                CallFunc_GenerateRandomList_RandomList;            // 0x0050(0x0010)(ReferenceParm)
	double                                        CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield) == 0x000008, "Wrong alignment on BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield");
static_assert(sizeof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield) == 0x000078, "Wrong size on BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, EntryPoint) == 0x000000, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Conv_StringToName_ReturnValue) == 0x000034, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, K2Node_Event_InItem) == 0x000040, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, K2Node_Event_InDurabilityDelta) == 0x000048, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::K2Node_Event_InDurabilityDelta' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_GenerateRandomList_RandomList) == 0x000050, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_GenerateRandomList_RandomList' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000070, "Member 'BP_ItemExtension_FaceShield_C_ExecuteUbergraph_BP_ItemExtension_FaceShield::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function BP_ItemExtension_FaceShield.BP_ItemExtension_FaceShield_C.GenerateRandomList
// 0x0050 (0x0050 - 0x0000)
struct BP_ItemExtension_FaceShield_C_GenerateRandomList final
{
public:
	int32                                         Size;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                RandomList;                                        // 0x0008(0x0010)(Parm, OutParm)
	double                                        Item;                                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                Result;                                            // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_FaceShield_C_GenerateRandomList) == 0x000008, "Wrong alignment on BP_ItemExtension_FaceShield_C_GenerateRandomList");
static_assert(sizeof(BP_ItemExtension_FaceShield_C_GenerateRandomList) == 0x000050, "Wrong size on BP_ItemExtension_FaceShield_C_GenerateRandomList");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, Size) == 0x000000, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::Size' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, RandomList) == 0x000008, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::RandomList' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, Item) == 0x000018, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::Item' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, Result) == 0x000020, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::Result' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, Temp_int_Variable) == 0x000034, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000040, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_GenerateRandomList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_ItemExtension_FaceShield_C_GenerateRandomList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ItemExtension_FaceShield.BP_ItemExtension_FaceShield_C.OnPostDurabilityChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged final
{
public:
	const class UP2Item*                          InItem;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         InDurabilityDelta;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged) == 0x000008, "Wrong alignment on BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged");
static_assert(sizeof(BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged) == 0x000010, "Wrong size on BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged, InItem) == 0x000000, "Member 'BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged::InItem' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged, InDurabilityDelta) == 0x000008, "Member 'BP_ItemExtension_FaceShield_C_OnPostDurabilityChanged::InDurabilityDelta' has a wrong offset!");

}

