#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactable_ActionUnlock_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactable_ActionUnlock_Base.BP_Interactable_ActionUnlock_Base_C
// 0x00F8 (0x03A8 - 0x02B0)
class ABP_Interactable_ActionUnlock_Base_C final : public AP2ContractInteractableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ContractItem;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     P2Action;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTimer;                                          // 0x02D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimerSeconds;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerOver;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerStopSuccess;                                  // 0x02E1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Action*>                      ActionArrayCopy;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                         ActionUnlockPhase;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBeforeUnlockSecs;                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoopingActions;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ActionsHaveRequiredContracts;                      // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerHasContractForAction;                        // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           In_Faction_Tag_Alpha;                              // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           In_Faction_Tag_Charlie;                            // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           In_Faction_Tag_Bravo;                              // 0x0328(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<EP2ContractState>                      In_States;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EP2ContractType>                       In_Types;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UP2ContractData*>                ContractsToCheck;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  FactionsToCheck;                                   // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               InteractableContractActiveMaterial;                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  HandleAsyncContractMessage;                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MessageChannelUnlock;                              // 0x0390(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           HighlightableMeshes;                               // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CalculatePlayerHasContractForAction(bool* bHas)	 // 0xae1e64;
	void ExecuteUbergraph_BP_Interactable_ActionUnlock_Base(int32 EntryPoint)	 // 0xae1e64;
	void GetHighlightableMeshes()	 // 0xae1e64;
	void Highlight_Contract_Interactable_Objects()	 // 0xae1e64;
	void K2_OnReset()	 // 0xae1e64;
	void OnFirstActionComplete(class UP2ActionBaseComponent* InActionComponent, class UP2Action* InAction, class APawn* InPawnInstigator)	 // 0xae1e64;
	void OnMessageReceived_9058A8B44A67CE271BB14AAF1653DB12(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnMessageReceived_B813AA1D4C00523C10089EA6F3009640(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnSecondActionComplete(class UP2ActionBaseComponent* InActionComponent, class UP2Action* InAction, class APawn* InPawnInstigator)	 // 0xae1e64;
	void OnSecondActionUnlock()	 // 0xae1e64;
	void OnServerMessageReceivedUnlock()	 // 0xae1e64;
	void PostInteraction()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void UserConstructionScript()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Interactable_ActionUnlock_Base_C">();
	}
	static class ABP_Interactable_ActionUnlock_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Interactable_ActionUnlock_Base_C>();
	}
};
static_assert(alignof(ABP_Interactable_ActionUnlock_Base_C) == 0x000008, "Wrong alignment on ABP_Interactable_ActionUnlock_Base_C");
static_assert(sizeof(ABP_Interactable_ActionUnlock_Base_C) == 0x0003A8, "Wrong size on ABP_Interactable_ActionUnlock_Base_C");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Interactable_ActionUnlock_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, ContractItem) == 0x0002B8, "Member 'ABP_Interactable_ActionUnlock_Base_C::ContractItem' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, P2Action) == 0x0002C0, "Member 'ABP_Interactable_ActionUnlock_Base_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, StaticMesh) == 0x0002C8, "Member 'ABP_Interactable_ActionUnlock_Base_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, HasTimer) == 0x0002D0, "Member 'ABP_Interactable_ActionUnlock_Base_C::HasTimer' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, TimerSeconds) == 0x0002D8, "Member 'ABP_Interactable_ActionUnlock_Base_C::TimerSeconds' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, TimerOver) == 0x0002E0, "Member 'ABP_Interactable_ActionUnlock_Base_C::TimerOver' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, TimerStopSuccess) == 0x0002E1, "Member 'ABP_Interactable_ActionUnlock_Base_C::TimerStopSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, ActionArrayCopy) == 0x0002E8, "Member 'ABP_Interactable_ActionUnlock_Base_C::ActionArrayCopy' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, ActionUnlockPhase) == 0x0002F8, "Member 'ABP_Interactable_ActionUnlock_Base_C::ActionUnlockPhase' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, DelayBeforeUnlockSecs) == 0x000300, "Member 'ABP_Interactable_ActionUnlock_Base_C::DelayBeforeUnlockSecs' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, LoopingActions) == 0x000308, "Member 'ABP_Interactable_ActionUnlock_Base_C::LoopingActions' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, ActionsHaveRequiredContracts) == 0x000309, "Member 'ABP_Interactable_ActionUnlock_Base_C::ActionsHaveRequiredContracts' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, PlayerHasContractForAction) == 0x00030A, "Member 'ABP_Interactable_ActionUnlock_Base_C::PlayerHasContractForAction' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, Async_Action) == 0x000310, "Member 'ABP_Interactable_ActionUnlock_Base_C::Async_Action' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, In_Faction_Tag_Alpha) == 0x000318, "Member 'ABP_Interactable_ActionUnlock_Base_C::In_Faction_Tag_Alpha' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, In_Faction_Tag_Charlie) == 0x000320, "Member 'ABP_Interactable_ActionUnlock_Base_C::In_Faction_Tag_Charlie' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, In_Faction_Tag_Bravo) == 0x000328, "Member 'ABP_Interactable_ActionUnlock_Base_C::In_Faction_Tag_Bravo' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, In_States) == 0x000330, "Member 'ABP_Interactable_ActionUnlock_Base_C::In_States' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, In_Types) == 0x000340, "Member 'ABP_Interactable_ActionUnlock_Base_C::In_Types' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, ContractsToCheck) == 0x000350, "Member 'ABP_Interactable_ActionUnlock_Base_C::ContractsToCheck' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, FactionsToCheck) == 0x000360, "Member 'ABP_Interactable_ActionUnlock_Base_C::FactionsToCheck' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, InteractableContractActiveMaterial) == 0x000380, "Member 'ABP_Interactable_ActionUnlock_Base_C::InteractableContractActiveMaterial' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, HandleAsyncContractMessage) == 0x000388, "Member 'ABP_Interactable_ActionUnlock_Base_C::HandleAsyncContractMessage' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, MessageChannelUnlock) == 0x000390, "Member 'ABP_Interactable_ActionUnlock_Base_C::MessageChannelUnlock' has a wrong offset!");
static_assert(offsetof(ABP_Interactable_ActionUnlock_Base_C, HighlightableMeshes) == 0x000398, "Member 'ABP_Interactable_ActionUnlock_Base_C::HighlightableMeshes' has a wrong offset!");

}

