#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser.BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C.BP_OnLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged final
{
public:
	int32                                         InNewLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged) == 0x000004, "Wrong alignment on BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged");
static_assert(sizeof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged) == 0x000004, "Wrong size on BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged, InNewLevel) == 0x000000, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_BP_OnLevelChanged::InNewLevel' has a wrong offset!");

// Function BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser.BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C.ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser
// 0x0028 (0x0028 - 0x0000)
struct BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetOuterByClass_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Laser*                               K2Node_DynamicCast_AsP2Laser;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InNewLevel;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser) == 0x000008, "Wrong alignment on BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser");
static_assert(sizeof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser) == 0x000028, "Wrong size on BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, EntryPoint) == 0x000000, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, CallFunc_BP_GetOuterByClass_ReturnValue) == 0x000008, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::CallFunc_BP_GetOuterByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, K2Node_DynamicCast_AsP2Laser) == 0x000010, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::K2Node_DynamicCast_AsP2Laser' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, K2Node_Event_InNewLevel) == 0x00001C, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::K2Node_Event_InNewLevel' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser, K2Node_SwitchInteger_CmpSuccess) == 0x000020, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable_Laser::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

