#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemExtension_StatusEffect_EMP_Toggleable

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ItemExtension_StatusEffect_EMP_Toggleable.BP_ItemExtension_StatusEffect_EMP_Toggleable_C.BP_OnLevelChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged final
{
public:
	int32                                         InNewLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged) == 0x000004, "Wrong alignment on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged");
static_assert(sizeof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged) == 0x000004, "Wrong size on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged, InNewLevel) == 0x000000, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_OnLevelChanged::InNewLevel' has a wrong offset!");

// Function BP_ItemExtension_StatusEffect_EMP_Toggleable.BP_ItemExtension_StatusEffect_EMP_Toggleable_C.BP_Tick
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick) == 0x000004, "Wrong alignment on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick");
static_assert(sizeof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick) == 0x000004, "Wrong size on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick, InDeltaTime) == 0x000000, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_BP_Tick::InDeltaTime' has a wrong offset!");

// Function BP_ItemExtension_StatusEffect_EMP_Toggleable.BP_ItemExtension_StatusEffect_EMP_Toggleable_C.ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable
// 0x0068 (0x0068 - 0x0000)
struct BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InNewLevel;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue_1;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable) == 0x000008, "Wrong alignment on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable");
static_assert(sizeof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable) == 0x000068, "Wrong size on BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, EntryPoint) == 0x000000, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000005, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_RandomFloat_ReturnValue) == 0x000008, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_IsServer_ReturnValue) == 0x000010, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, K2Node_SwitchInteger_CmpSuccess) == 0x000011, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000018, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000028, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, K2Node_Event_InNewLevel) == 0x00002C, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::K2Node_Event_InNewLevel' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, K2Node_SwitchInteger_CmpSuccess_1) == 0x000030, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, K2Node_Event_InDeltaTime) == 0x000034, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_IsGameplayTagValid_ReturnValue_1) == 0x000040, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_IsGameplayTagValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000048, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000058, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Not_PreBool_ReturnValue_1) == 0x000059, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00005A, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Less_DoubleDouble_ReturnValue) == 0x00005B, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'BP_ItemExtension_StatusEffect_EMP_Toggleable_C_ExecuteUbergraph_BP_ItemExtension_StatusEffect_EMP_Toggleable::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");

}

