#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalVolumeFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LocalVolumeFog.BP_LocalVolumeFog_C
// 0x00E0 (0x0390 - 0x02B0)
class ABP_LocalVolumeFog_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_Extinction;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseFog_Intensity;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseFog_Contrast;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseFog_Scale;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BaseFog_Panner;                                    // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetailFog_Intensity;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetailFog_Contrast;                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DetailFog_Scale;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DetailFog_Panner;                                  // 0x0318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Fog_Color;                                         // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Noise_Intensity;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Noise_Scale;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Noise_Panner;                                      // 0x0350(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Near_Camera_Cutoff_Distance;                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Near_Camera_Fade_Distance;                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Far_Camera_Cutoff_Distance;                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Far_Camera_Fade_Distance;                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Falloff_Scale;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript()	 // 0xae1e64;
	void Fog_Parameters()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_LocalVolumeFog_C">();
	}
	static class ABP_LocalVolumeFog_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_LocalVolumeFog_C>();
	}
};
static_assert(alignof(ABP_LocalVolumeFog_C) == 0x000008, "Wrong alignment on ABP_LocalVolumeFog_C");
static_assert(sizeof(ABP_LocalVolumeFog_C) == 0x000390, "Wrong size on ABP_LocalVolumeFog_C");
static_assert(offsetof(ABP_LocalVolumeFog_C, Billboard) == 0x0002B0, "Member 'ABP_LocalVolumeFog_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, StaticMesh) == 0x0002B8, "Member 'ABP_LocalVolumeFog_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_LocalVolumeFog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Fog_Extinction) == 0x0002C8, "Member 'ABP_LocalVolumeFog_C::Fog_Extinction' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, BaseFog_Intensity) == 0x0002D0, "Member 'ABP_LocalVolumeFog_C::BaseFog_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, BaseFog_Contrast) == 0x0002D8, "Member 'ABP_LocalVolumeFog_C::BaseFog_Contrast' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, BaseFog_Scale) == 0x0002E0, "Member 'ABP_LocalVolumeFog_C::BaseFog_Scale' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, BaseFog_Panner) == 0x0002E8, "Member 'ABP_LocalVolumeFog_C::BaseFog_Panner' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, DetailFog_Intensity) == 0x000300, "Member 'ABP_LocalVolumeFog_C::DetailFog_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, DetailFog_Contrast) == 0x000308, "Member 'ABP_LocalVolumeFog_C::DetailFog_Contrast' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, DetailFog_Scale) == 0x000310, "Member 'ABP_LocalVolumeFog_C::DetailFog_Scale' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, DetailFog_Panner) == 0x000318, "Member 'ABP_LocalVolumeFog_C::DetailFog_Panner' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Fog_Color) == 0x000330, "Member 'ABP_LocalVolumeFog_C::Fog_Color' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Noise_Intensity) == 0x000340, "Member 'ABP_LocalVolumeFog_C::Noise_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Noise_Scale) == 0x000348, "Member 'ABP_LocalVolumeFog_C::Noise_Scale' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Noise_Panner) == 0x000350, "Member 'ABP_LocalVolumeFog_C::Noise_Panner' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Near_Camera_Cutoff_Distance) == 0x000368, "Member 'ABP_LocalVolumeFog_C::Near_Camera_Cutoff_Distance' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Near_Camera_Fade_Distance) == 0x000370, "Member 'ABP_LocalVolumeFog_C::Near_Camera_Fade_Distance' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Far_Camera_Cutoff_Distance) == 0x000378, "Member 'ABP_LocalVolumeFog_C::Far_Camera_Cutoff_Distance' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Far_Camera_Fade_Distance) == 0x000380, "Member 'ABP_LocalVolumeFog_C::Far_Camera_Fade_Distance' has a wrong offset!");
static_assert(offsetof(ABP_LocalVolumeFog_C, Falloff_Scale) == 0x000388, "Member 'ABP_LocalVolumeFog_C::Falloff_Scale' has a wrong offset!");

}

