#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lightning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lightning.BP_Lightning_C
// 0x0048 (0x02F8 - 0x02B0)
class ABP_Lightning_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        timeSinceSpawn;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreRumbleNormalizedDistanceThreshold;              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAudioDelay;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          LightningAkEvent;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          LightningAkEvent_PreRumble;                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lightning(int32 EntryPoint)	 // 0xae1e64;
	void SpawnBolt(double NormalizedDistance)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Lightning_C">();
	}
	static class ABP_Lightning_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Lightning_C>();
	}
};
static_assert(alignof(ABP_Lightning_C) == 0x000008, "Wrong alignment on ABP_Lightning_C");
static_assert(sizeof(ABP_Lightning_C) == 0x0002F8, "Wrong size on ABP_Lightning_C");
static_assert(offsetof(ABP_Lightning_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_Lightning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, Decal) == 0x0002B8, "Member 'ABP_Lightning_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, Niagara) == 0x0002C0, "Member 'ABP_Lightning_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Lightning_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, timeSinceSpawn) == 0x0002D0, "Member 'ABP_Lightning_C::timeSinceSpawn' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, PreRumbleNormalizedDistanceThreshold) == 0x0002D8, "Member 'ABP_Lightning_C::PreRumbleNormalizedDistanceThreshold' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, MaxAudioDelay) == 0x0002E0, "Member 'ABP_Lightning_C::MaxAudioDelay' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, LightningAkEvent) == 0x0002E8, "Member 'ABP_Lightning_C::LightningAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_Lightning_C, LightningAkEvent_PreRumble) == 0x0002F0, "Member 'ABP_Lightning_C::LightningAkEvent_PreRumble' has a wrong offset!");

}

