#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lens_FX_BulletHit_v2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Lens_FX_BulletHit_v2.BP_Lens_FX_BulletHit_v2_C.ExecuteUbergraph_BP_Lens_FX_BulletHit_v2
// 0x0040 (0x0040 - 0x0000)
struct BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Event_NewSize;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2) == 0x000008, "Wrong alignment on BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2");
static_assert(sizeof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2) == 0x000040, "Wrong size on BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, EntryPoint) == 0x000000, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, K2Node_Event_NewSize) == 0x000008, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::K2Node_Event_NewSize' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, CallFunc_RandomFloatInRange_ReturnValue) == 0x000018, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000020, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, CallFunc_GetViewportSize_ReturnValue) == 0x000028, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000038, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x00003C, "Member 'BP_Lens_FX_BulletHit_v2_C_ExecuteUbergraph_BP_Lens_FX_BulletHit_v2::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BP_Lens_FX_BulletHit_v2.BP_Lens_FX_BulletHit_v2_C.OnViewportResized
// 0x0010 (0x0010 - 0x0000)
struct BP_Lens_FX_BulletHit_v2_C_OnViewportResized final
{
public:
	struct FVector2D                              NewSize;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lens_FX_BulletHit_v2_C_OnViewportResized) == 0x000008, "Wrong alignment on BP_Lens_FX_BulletHit_v2_C_OnViewportResized");
static_assert(sizeof(BP_Lens_FX_BulletHit_v2_C_OnViewportResized) == 0x000010, "Wrong size on BP_Lens_FX_BulletHit_v2_C_OnViewportResized");
static_assert(offsetof(BP_Lens_FX_BulletHit_v2_C_OnViewportResized, NewSize) == 0x000000, "Member 'BP_Lens_FX_BulletHit_v2_C_OnViewportResized::NewSize' has a wrong offset!");

}

