#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lightning

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Lightning.BP_Lightning_C.ExecuteUbergraph_BP_Lightning
// 0x0060 (0x0060 - 0x0000)
struct BP_Lightning_C_ExecuteUbergraph_BP_Lightning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue_1;     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NormalizedDistance;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning) == 0x000008, "Wrong alignment on BP_Lightning_C_ExecuteUbergraph_BP_Lightning");
static_assert(sizeof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning) == 0x000060, "Wrong size on BP_Lightning_C_ExecuteUbergraph_BP_Lightning");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, EntryPoint) == 0x000000, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_TryPostEventAtLocation_ReturnValue_1) == 0x000040, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_TryPostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, K2Node_CustomEvent_NormalizedDistance) == 0x000048, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::K2Node_CustomEvent_NormalizedDistance' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lightning_C_ExecuteUbergraph_BP_Lightning, CallFunc_Delay_Duration_ImplicitCast) == 0x00005C, "Member 'BP_Lightning_C_ExecuteUbergraph_BP_Lightning::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_Lightning.BP_Lightning_C.SpawnBolt
// 0x0008 (0x0008 - 0x0000)
struct BP_Lightning_C_SpawnBolt final
{
public:
	double                                        NormalizedDistance;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lightning_C_SpawnBolt) == 0x000008, "Wrong alignment on BP_Lightning_C_SpawnBolt");
static_assert(sizeof(BP_Lightning_C_SpawnBolt) == 0x000008, "Wrong size on BP_Lightning_C_SpawnBolt");
static_assert(offsetof(BP_Lightning_C_SpawnBolt, NormalizedDistance) == 0x000000, "Member 'BP_Lightning_C_SpawnBolt::NormalizedDistance' has a wrong offset!");

}

