#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LightRotator.BP_LightRotator_C
// 0x0020 (0x02D0 - 0x02B0)
class ABP_LightRotator_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        SyncPeriod;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ExecuteUbergraph_BP_LightRotator(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_LightRotator_C">();
	}
	static class ABP_LightRotator_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_LightRotator_C>();
	}
};
static_assert(alignof(ABP_LightRotator_C) == 0x000008, "Wrong alignment on ABP_LightRotator_C");
static_assert(sizeof(ABP_LightRotator_C) == 0x0002D0, "Wrong size on ABP_LightRotator_C");
static_assert(offsetof(ABP_LightRotator_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_LightRotator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LightRotator_C, Plane) == 0x0002B8, "Member 'ABP_LightRotator_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_LightRotator_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_LightRotator_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_LightRotator_C, SyncPeriod) == 0x0002C8, "Member 'ABP_LightRotator_C::SyncPeriod' has a wrong offset!");

}

