#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightF_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_LightF_Base.BP_LightF_Base_C.ExecuteUbergraph_BP_LightF_Base
// 0x02D0 (0x02D0 - 0x0000)
struct BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InTurnedOn;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightOperatingStateType                    K2Node_Event_InOperatingState;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         K2Node_Event_InLifeState;                          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_InTags;                               // 0x0018(0x0020)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2AbilityAsync_WaitStatusEffectLevelChange* CallFunc_WaitStatusEffectLevelChange_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         CallFunc_GetLifeState_ReturnValue;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         CallFunc_GetLifeState_ReturnValue_1;               // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0070(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisabled_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         K2Node_Event_InNewLifeState_1;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         K2Node_Event_InPreviousLifeState_1;                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         K2Node_Event_InNewLifeState;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         K2Node_Event_InPreviousLifeState;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_1;                // 0x0110(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULightComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue_1;    // 0x0148(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(int32 NewLevel, int32 NewStackCount)> K2Node_CreateDelegate_OutputDelegate;       // 0x0158(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULightComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue_1;     // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         Temp_byte_Variable;                                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x01C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AkAmbientComponent*                  CallFunc_AddComponentByClass_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightOperatingStateType                    CallFunc_GetOperatingState_ReturnValue;            // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue_2;                // 0x0240(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector4_X_ImplicitCast;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Y_ImplicitCast;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Z_ImplicitCast;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Indestructible_ImplicitCast;         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Working_ImplicitCast;                // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_X_ImplicitCast_1;             // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Y_ImplicitCast_1;             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Z_ImplicitCast_1;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_W_ImplicitCast;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_X_ImplicitCast_2;             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Y_ImplicitCast_2;             // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector4_Z_ImplicitCast_2;             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base) == 0x000010, "Wrong alignment on BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base");
static_assert(sizeof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base) == 0x0002D0, "Wrong size on BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, EntryPoint) == 0x000000, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_HasAuthority_ReturnValue_1) == 0x000009, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_real_Variable) == 0x00000C, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_real_Variable_1) == 0x000010, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InTurnedOn) == 0x000014, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InTurnedOn' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InOperatingState) == 0x000015, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InOperatingState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InLifeState) == 0x000016, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InTags) == 0x000018, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InTags' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000040, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_WaitStatusEffectLevelChange_ReturnValue) == 0x000048, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_WaitStatusEffectLevelChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Variable) == 0x000050, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchInteger_CmpSuccess) == 0x000054, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_IsValid_ReturnValue) == 0x000055, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Variable_1) == 0x000058, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_CustomEvent_NewLevel) == 0x00005C, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_CustomEvent_NewStackCount) == 0x000060, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_GetLifeState_ReturnValue) == 0x000064, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_GetLifeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_GetLifeState_ReturnValue_1) == 0x000065, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_GetLifeState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchEnum_CmpSuccess_1) == 0x000066, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Array_Index_Variable_1) == 0x000068, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_ReturnValue) == 0x000070, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_IsDisabled_ReturnValue) == 0x000090, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_IsDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InNewLifeState_1) == 0x000091, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InNewLifeState_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InPreviousLifeState_1) == 0x000092, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InPreviousLifeState_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchEnum_CmpSuccess_2) == 0x000093, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000098, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InNewLifeState) == 0x0000A0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InNewLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Event_InPreviousLifeState) == 0x0000A1, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Event_InPreviousLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000B0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000B8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x0000E8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_BreakColor_R) == 0x0000F8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_BreakColor_G) == 0x0000FC, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_BreakColor_B) == 0x000100, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_BreakColor_A) == 0x000104, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_ReturnValue_1) == 0x000110, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Array_Length_ReturnValue) == 0x000130, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_DynamicCast_AsMaterial_Instance_Dynamic) == 0x000138, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_DynamicCast_AsMaterial_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_K2_GetComponentsByClass_ReturnValue_1) == 0x000148, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_K2_GetComponentsByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000158, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000170, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Loop_Counter_Variable) == 0x000174, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000178, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00017C, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000180, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000198, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_TryPostEventAtLocation_ReturnValue_1) == 0x00019C, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_TryPostEventAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_int_Loop_Counter_Variable_1) == 0x0001A0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, Temp_byte_Variable) == 0x0001A4, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A5, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Select_Default) == 0x0001A8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001AC, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_GetRelativeTransform_ReturnValue) == 0x0001C0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_AddComponentByClass_ReturnValue) == 0x000228, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_IsValid_ReturnValue_2) == 0x000230, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_IsValid_ReturnValue_3) == 0x000231, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_GetOperatingState_ReturnValue) == 0x000232, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_GetOperatingState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_SwitchEnum_CmpSuccess_4) == 0x000233, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_ReturnValue_2) == 0x000240, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000260, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_X_ImplicitCast) == 0x000268, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Y_ImplicitCast) == 0x000270, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Z_ImplicitCast) == 0x000278, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Select_Indestructible_ImplicitCast) == 0x000280, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Select_Indestructible_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, K2Node_Select_Working_ImplicitCast) == 0x000284, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::K2Node_Select_Working_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_X_ImplicitCast_1) == 0x000288, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_X_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Y_ImplicitCast_1) == 0x000290, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Z_ImplicitCast_1) == 0x000298, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_W_ImplicitCast) == 0x0002A0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_W_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0002A8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_X_ImplicitCast_2) == 0x0002B0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_X_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Y_ImplicitCast_2) == 0x0002B8, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Y_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base, CallFunc_MakeVector4_Z_ImplicitCast_2) == 0x0002C0, "Member 'BP_LightF_Base_C_ExecuteUbergraph_BP_LightF_Base::CallFunc_MakeVector4_Z_ImplicitCast_2' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.LevelChange_3AFF30944E583D004A819CB83F7F80EB
// 0x0008 (0x0008 - 0x0000)
struct BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB) == 0x000004, "Wrong alignment on BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB");
static_assert(sizeof(BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB) == 0x000008, "Wrong size on BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB");
static_assert(offsetof(BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB, NewLevel) == 0x000000, "Member 'BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB::NewLevel' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB, NewStackCount) == 0x000004, "Member 'BP_LightF_Base_C_LevelChange_3AFF30944E583D004A819CB83F7F80EB::NewStackCount' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.MeshSelection
// 0x00D0 (0x00D0 - 0x0000)
struct BP_LightF_Base_C_MeshSelection final
{
public:
	TArray<class UStaticMesh*>                    Mesh_Array;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UStaticMeshComponent*             Temp_object_Variable;                              // 0x00C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_MeshSelection) == 0x000010, "Wrong alignment on BP_LightF_Base_C_MeshSelection");
static_assert(sizeof(BP_LightF_Base_C_MeshSelection) == 0x0000D0, "Wrong size on BP_LightF_Base_C_MeshSelection");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Mesh_Array) == 0x000000, "Member 'BP_LightF_Base_C_MeshSelection::Mesh_Array' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_LightF_Base_C_MeshSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_LightF_Base_C_MeshSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_LightF_Base_C_MeshSelection::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_struct_Variable) == 0x000030, "Member 'BP_LightF_Base_C_MeshSelection::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Array_Get_Item) == 0x000090, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_AddComponent_ReturnValue) == 0x0000A0, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_SetStaticMesh_ReturnValue) == 0x0000A8, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_SetStaticMesh_ReturnValue_1) == 0x0000A9, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_int_Loop_Counter_Variable_1) == 0x0000AC, "Member 'BP_LightF_Base_C_MeshSelection::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Array_Length_ReturnValue_1) == 0x0000BC, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, Temp_object_Variable) == 0x0000C0, "Member 'BP_LightF_Base_C_MeshSelection::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_MeshSelection, CallFunc_Array_Add_ReturnValue) == 0x0000CC, "Member 'BP_LightF_Base_C_MeshSelection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.OnLifeStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_LightF_Base_C_OnLifeStateChanged final
{
public:
	EP2LightLifeStateType                         InNewLifeState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         InPreviousLifeState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_OnLifeStateChanged) == 0x000001, "Wrong alignment on BP_LightF_Base_C_OnLifeStateChanged");
static_assert(sizeof(BP_LightF_Base_C_OnLifeStateChanged) == 0x000002, "Wrong size on BP_LightF_Base_C_OnLifeStateChanged");
static_assert(offsetof(BP_LightF_Base_C_OnLifeStateChanged, InNewLifeState) == 0x000000, "Member 'BP_LightF_Base_C_OnLifeStateChanged::InNewLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_OnLifeStateChanged, InPreviousLifeState) == 0x000001, "Member 'BP_LightF_Base_C_OnLifeStateChanged::InPreviousLifeState' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.OnLifeStateChangedBurstFx
// 0x0002 (0x0002 - 0x0000)
struct BP_LightF_Base_C_OnLifeStateChangedBurstFx final
{
public:
	EP2LightLifeStateType                         InNewLifeState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         InPreviousLifeState;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_OnLifeStateChangedBurstFx) == 0x000001, "Wrong alignment on BP_LightF_Base_C_OnLifeStateChangedBurstFx");
static_assert(sizeof(BP_LightF_Base_C_OnLifeStateChangedBurstFx) == 0x000002, "Wrong size on BP_LightF_Base_C_OnLifeStateChangedBurstFx");
static_assert(offsetof(BP_LightF_Base_C_OnLifeStateChangedBurstFx, InNewLifeState) == 0x000000, "Member 'BP_LightF_Base_C_OnLifeStateChangedBurstFx::InNewLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_OnLifeStateChangedBurstFx, InPreviousLifeState) == 0x000001, "Member 'BP_LightF_Base_C_OnLifeStateChangedBurstFx::InPreviousLifeState' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.UpdateState
// 0x0028 (0x0028 - 0x0000)
struct BP_LightF_Base_C_UpdateState final
{
public:
	bool                                          InTurnedOn;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightOperatingStateType                    InOperatingState;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LightLifeStateType                         InLifeState;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_LightF_Base_C_UpdateState) == 0x000008, "Wrong alignment on BP_LightF_Base_C_UpdateState");
static_assert(sizeof(BP_LightF_Base_C_UpdateState) == 0x000028, "Wrong size on BP_LightF_Base_C_UpdateState");
static_assert(offsetof(BP_LightF_Base_C_UpdateState, InTurnedOn) == 0x000000, "Member 'BP_LightF_Base_C_UpdateState::InTurnedOn' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_UpdateState, InOperatingState) == 0x000001, "Member 'BP_LightF_Base_C_UpdateState::InOperatingState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_UpdateState, InLifeState) == 0x000002, "Member 'BP_LightF_Base_C_UpdateState::InLifeState' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_UpdateState, InTags) == 0x000008, "Member 'BP_LightF_Base_C_UpdateState::InTags' has a wrong offset!");

// Function BP_LightF_Base.BP_LightF_Base_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_LightF_Base_C_UserConstructionScript final
{
public:
	EP2LightLifeStateType                         CallFunc_GetLifeState_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LightF_Base_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_LightF_Base_C_UserConstructionScript");
static_assert(sizeof(BP_LightF_Base_C_UserConstructionScript) == 0x000004, "Wrong size on BP_LightF_Base_C_UserConstructionScript");
static_assert(offsetof(BP_LightF_Base_C_UserConstructionScript, CallFunc_GetLifeState_ReturnValue) == 0x000000, "Member 'BP_LightF_Base_C_UserConstructionScript::CallFunc_GetLifeState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LightF_Base_C_UserConstructionScript, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'BP_LightF_Base_C_UserConstructionScript::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
