#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelingEventSenderVisitLocation

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelingEventSenderVisitLocation.BP_LevelingEventSenderVisitLocation_C
// 0x0038 (0x00A0 - 0x0068)
class UBP_LevelingEventSenderVisitLocation_C final : public UP2LevelingEventSender_WithExp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Locations;                                         // 0x0078(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsOneTimeRaidEvent;                                // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Activated()	 // 0xae1e64;
	void BP_Deactivated()	 // 0xae1e64;
	void ExecuteUbergraph_BP_LevelingEventSenderVisitLocation(int32 EntryPoint)	 // 0xae1e64;
	void OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_LevelingEventSenderVisitLocation_C">();
	}
	static class UBP_LevelingEventSenderVisitLocation_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_LevelingEventSenderVisitLocation_C>();
	}
};
static_assert(alignof(UBP_LevelingEventSenderVisitLocation_C) == 0x000008, "Wrong alignment on UBP_LevelingEventSenderVisitLocation_C");
static_assert(sizeof(UBP_LevelingEventSenderVisitLocation_C) == 0x0000A0, "Wrong size on UBP_LevelingEventSenderVisitLocation_C");
static_assert(offsetof(UBP_LevelingEventSenderVisitLocation_C, UberGraphFrame) == 0x000068, "Member 'UBP_LevelingEventSenderVisitLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LevelingEventSenderVisitLocation_C, Async_Action) == 0x000070, "Member 'UBP_LevelingEventSenderVisitLocation_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_LevelingEventSenderVisitLocation_C, Locations) == 0x000078, "Member 'UBP_LevelingEventSenderVisitLocation_C::Locations' has a wrong offset!");
static_assert(offsetof(UBP_LevelingEventSenderVisitLocation_C, IsOneTimeRaidEvent) == 0x000098, "Member 'UBP_LevelingEventSenderVisitLocation_C::IsOneTimeRaidEvent' has a wrong offset!");

}

