#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LAPS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_LAPS.BP_LAPS_C.ExecuteUbergraph_BP_LAPS
// 0x01D0 (0x01D0 - 0x0000)
struct BP_LAPS_C_ExecuteUbergraph_BP_LAPS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitStatusEffectLevelChange* CallFunc_WaitStatusEffectLevelChange_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2LapsData*                            K2Node_DynamicCast_AsP2Laps_Data;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewLevel, int32 NewStackCount)> K2Node_CreateDelegate_OutputDelegate;       // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0090(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EP2DeployableState                            CallFunc_GetDeployState_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue_1;                // 0x01B0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2LapsData*                            K2Node_DynamicCast_AsP2Laps_Data_1;                // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS) == 0x000008, "Wrong alignment on BP_LAPS_C_ExecuteUbergraph_BP_LAPS");
static_assert(sizeof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS) == 0x0001D0, "Wrong size on BP_LAPS_C_ExecuteUbergraph_BP_LAPS");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, EntryPoint) == 0x000000, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_CustomEvent_NewLevel) == 0x000004, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_CustomEvent_NewStackCount) == 0x000008, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, Temp_int_Variable) == 0x00000C, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, Temp_int_Variable_1) == 0x000010, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_WaitStatusEffectLevelChange_ReturnValue) == 0x000018, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_WaitStatusEffectLevelChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, Temp_delegate_Variable) == 0x000020, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, Temp_delegate_Variable_1) == 0x000034, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_GetItemData_ReturnValue) == 0x000048, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_DynamicCast_AsP2Laps_Data) == 0x000050, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_DynamicCast_AsP2Laps_Data' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000090, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_GetDeployState_ReturnValue) == 0x000178, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_GetDeployState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_IsValid_ReturnValue_1) == 0x000179, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_SwitchEnum_CmpSuccess) == 0x00017A, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_PostAkEvent_ReturnValue) == 0x00017C, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_PostAkEvent_ReturnValue_1) == 0x000180, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000184, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_CreateDelegate_OutputDelegate_2) == 0x000194, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_IsValid_ReturnValue_2) == 0x0001A4, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_IsValid_ReturnValue_3) == 0x0001A5, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0001A8, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_GetItemData_ReturnValue_1) == 0x0001B0, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_GetItemData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_DynamicCast_AsP2Laps_Data_1) == 0x0001B8, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_DynamicCast_AsP2Laps_Data_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_IsValid_ReturnValue_4) == 0x0001C1, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_HasAuthority_ReturnValue) == 0x0001C2, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_ExecuteUbergraph_BP_LAPS, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'BP_LAPS_C_ExecuteUbergraph_BP_LAPS::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_LAPS.BP_LAPS_C.LevelChange_DE48F3ED4000458CD550428A13065B33
// 0x0008 (0x0008 - 0x0000)
struct BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33 final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33) == 0x000004, "Wrong alignment on BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33");
static_assert(sizeof(BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33) == 0x000008, "Wrong size on BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33");
static_assert(offsetof(BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33, NewLevel) == 0x000000, "Member 'BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33::NewLevel' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33, NewStackCount) == 0x000004, "Member 'BP_LAPS_C_LevelChange_DE48F3ED4000458CD550428A13065B33::NewStackCount' has a wrong offset!");

// Function BP_LAPS.BP_LAPS_C.SetVfxRadiusParameters
// 0x0010 (0x0010 - 0x0000)
struct BP_LAPS_C_SetVfxRadiusParameters final
{
public:
	class UP2LapsData*                            InLapsData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      InNiagaraComponent;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LAPS_C_SetVfxRadiusParameters) == 0x000008, "Wrong alignment on BP_LAPS_C_SetVfxRadiusParameters");
static_assert(sizeof(BP_LAPS_C_SetVfxRadiusParameters) == 0x000010, "Wrong size on BP_LAPS_C_SetVfxRadiusParameters");
static_assert(offsetof(BP_LAPS_C_SetVfxRadiusParameters, InLapsData) == 0x000000, "Member 'BP_LAPS_C_SetVfxRadiusParameters::InLapsData' has a wrong offset!");
static_assert(offsetof(BP_LAPS_C_SetVfxRadiusParameters, InNiagaraComponent) == 0x000008, "Member 'BP_LAPS_C_SetVfxRadiusParameters::InNiagaraComponent' has a wrong offset!");

}

