#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelingEventSenderVisitLocation

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_LevelingEventSenderVisitLocation.BP_LevelingEventSenderVisitLocation_C.ExecuteUbergraph_BP_LevelingEventSenderVisitLocation
// 0x01A8 (0x01A8 - 0x0000)
struct BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         Temp_struct_Variable;                              // 0x0028(0x0098)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveGameplayTag_ReturnValue;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable_2;                            // 0x00F0(0x0098)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x018C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation) == 0x000008, "Wrong alignment on BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation");
static_assert(sizeof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation) == 0x0001A8, "Wrong size on BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, EntryPoint) == 0x000000, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, K2Node_CustomEvent_ProxyObject) == 0x000008, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, K2Node_CustomEvent_ActualChannel) == 0x000010, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, Temp_struct_Variable) == 0x000028, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, Temp_struct_Variable_1) == 0x0000C0, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000C8, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_RemoveGameplayTag_ReturnValue) == 0x0000C9, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_RemoveGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, Temp_object_Variable) == 0x0000D0, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_GetOwningPawn_ReturnValue) == 0x0000E0, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000E8, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, Temp_struct_Variable_2) == 0x0000F0, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_BooleanAND_ReturnValue) == 0x000188, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_GetPayload_ReturnValue) == 0x000189, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00018C, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000198, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_HasTag_ReturnValue) == 0x0001A0, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_BooleanAND_ReturnValue_1) == 0x0001A1, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation, CallFunc_IsValid_ReturnValue_1) == 0x0001A2, "Member 'BP_LevelingEventSenderVisitLocation_C_ExecuteUbergraph_BP_LevelingEventSenderVisitLocation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_LevelingEventSenderVisitLocation.BP_LevelingEventSenderVisitLocation_C.OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB
// 0x0010 (0x0010 - 0x0000)
struct BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB) == 0x000008, "Wrong alignment on BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB");
static_assert(sizeof(BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB) == 0x000010, "Wrong size on BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB, ProxyObject) == 0x000000, "Member 'BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB, ActualChannel) == 0x000008, "Member 'BP_LevelingEventSenderVisitLocation_C_OnMessageReceived_ABB4650B4B72C42D4B6B46831B9EFCEB::ActualChannel' has a wrong offset!");

}

