#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightF_Base

#include "Basic.hpp"

#include "S_LightFixture_MeshOverrides_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LightF_Base.BP_LightF_Base_C
// 0x00E0 (0x0460 - 0x0380)
class ABP_LightF_Base_C : public AP2LightBulb
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            Flare;                                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Fx;                                                // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FX_Root;                                           // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightMesh;                                         // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Meshes_Added;                                      // 0x03B0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	struct FS_LightFixture_MeshOverrides          MeshOverrides;                                     // 0x03C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           LightEmissiveColor;                                // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FlareTint;                                         // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EmpFlicker;                                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dust;                                              // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Insects;                                           // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlickerStateIndex;                                 // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepFX_On_Destruct;                                // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          DamagedAkEvent;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          FlickerAkEvent;                                    // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LFM_Flicker;                                       // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkAudioEvent*                          DestroyedAkEvent;                                  // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  AkAmbient;                                         // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LightF_Base(int32 EntryPoint)	 // 0xae1e64;
	void LevelChange_3AFF30944E583D004A819CB83F7F80EB(int32 NewLevel, int32 NewStackCount)	 // 0xae1e64;
	void MeshSelection(TArray<class UStaticMesh*>& Mesh_Array)	 // 0xae1e64;
	void OnLifeStateChanged(EP2LightLifeStateType InNewLifeState, EP2LightLifeStateType InPreviousLifeState)	 // 0xae1e64;
	void OnLifeStateChangedBurstFx(EP2LightLifeStateType InNewLifeState, EP2LightLifeStateType InPreviousLifeState)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void UpdateState(bool InTurnedOn, EP2LightOperatingStateType InOperatingState, EP2LightLifeStateType InLifeState, const struct FGameplayTagContainer& InTags)	 // 0xae1e64;
	void UserConstructionScript()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_LightF_Base_C">();
	}
	static class ABP_LightF_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_LightF_Base_C>();
	}
};
static_assert(alignof(ABP_LightF_Base_C) == 0x000008, "Wrong alignment on ABP_LightF_Base_C");
static_assert(sizeof(ABP_LightF_Base_C) == 0x000460, "Wrong size on ABP_LightF_Base_C");
static_assert(offsetof(ABP_LightF_Base_C, UberGraphFrame) == 0x000380, "Member 'ABP_LightF_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, Flare) == 0x000388, "Member 'ABP_LightF_Base_C::Flare' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, Fx) == 0x000390, "Member 'ABP_LightF_Base_C::Fx' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, FX_Root) == 0x000398, "Member 'ABP_LightF_Base_C::FX_Root' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, SpotLight) == 0x0003A0, "Member 'ABP_LightF_Base_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, LightMesh) == 0x0003A8, "Member 'ABP_LightF_Base_C::LightMesh' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, Meshes_Added) == 0x0003B0, "Member 'ABP_LightF_Base_C::Meshes_Added' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, MeshOverrides) == 0x0003C0, "Member 'ABP_LightF_Base_C::MeshOverrides' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, LightEmissiveColor) == 0x000400, "Member 'ABP_LightF_Base_C::LightEmissiveColor' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, FlareTint) == 0x000410, "Member 'ABP_LightF_Base_C::FlareTint' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, EmpFlicker) == 0x000420, "Member 'ABP_LightF_Base_C::EmpFlicker' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, Dust) == 0x000428, "Member 'ABP_LightF_Base_C::Dust' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, Insects) == 0x000429, "Member 'ABP_LightF_Base_C::Insects' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, FlickerStateIndex) == 0x00042C, "Member 'ABP_LightF_Base_C::FlickerStateIndex' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, KeepFX_On_Destruct) == 0x000430, "Member 'ABP_LightF_Base_C::KeepFX_On_Destruct' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, DamagedAkEvent) == 0x000438, "Member 'ABP_LightF_Base_C::DamagedAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, FlickerAkEvent) == 0x000440, "Member 'ABP_LightF_Base_C::FlickerAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, LFM_Flicker) == 0x000448, "Member 'ABP_LightF_Base_C::LFM_Flicker' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, DestroyedAkEvent) == 0x000450, "Member 'ABP_LightF_Base_C::DestroyedAkEvent' has a wrong offset!");
static_assert(offsetof(ABP_LightF_Base_C, AkAmbient) == 0x000458, "Member 'ABP_LightF_Base_C::AkAmbient' has a wrong offset!");

}

