#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MPCContext_ParallaxOffset

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C.ExecuteUbergraph_BP_MPCContext_ParallaxOffset
// 0x00C0 (0x00C0 - 0x0000)
struct BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Output)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTimeLine_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Output;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddTimeLine_ReturnValue_1;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Value;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_State;                          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Side;                           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSprinting_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetRotationAngle_Value_ImplicitCast;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRotateParamaterValue_value_ImplicitCast; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_YRotateOffset_ImplicitCast;     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset) == 0x000008, "Wrong alignment on BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset");
static_assert(sizeof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset) == 0x0000C0, "Wrong size on BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, EntryPoint) == 0x000000, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_AddTimeLine_ReturnValue) == 0x000024, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_AddTimeLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CustomEvent_Output) == 0x000028, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CustomEvent_Output' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_AddTimeLine_ReturnValue_1) == 0x00002C, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_AddTimeLine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, Temp_real_Variable) == 0x000030, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, Temp_real_Variable_1) == 0x000038, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CustomEvent_Value) == 0x000040, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, Temp_bool_Variable) == 0x000048, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_Select_Default) == 0x000058, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000068, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CustomEvent_State) == 0x000070, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CustomEvent_State' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_CustomEvent_Side) == 0x000080, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_CustomEvent_Side' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_NotEqual_StriStri_ReturnValue) == 0x000090, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_NotEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_GetViewTarget_ReturnValue) == 0x000098, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_DynamicCast_AsP2Hero_Character) == 0x0000A0, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_IsSprinting_ReturnValue) == 0x0000A9, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_IsSprinting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_SetRotationAngle_Value_ImplicitCast) == 0x0000B0, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_SetRotationAngle_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, CallFunc_SetRotateParamaterValue_value_ImplicitCast) == 0x0000B8, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::CallFunc_SetRotateParamaterValue_value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset, K2Node_VariableSet_YRotateOffset_ImplicitCast) == 0x0000BC, "Member 'BP_MPCContext_ParallaxOffset_C_ExecuteUbergraph_BP_MPCContext_ParallaxOffset::K2Node_VariableSet_YRotateOffset_ImplicitCast' has a wrong offset!");

// Function BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C.OnFootstepNotified
// 0x0020 (0x0020 - 0x0000)
struct BP_MPCContext_ParallaxOffset_C_OnFootstepNotified final
{
public:
	class FString                                 State;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Side;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MPCContext_ParallaxOffset_C_OnFootstepNotified) == 0x000008, "Wrong alignment on BP_MPCContext_ParallaxOffset_C_OnFootstepNotified");
static_assert(sizeof(BP_MPCContext_ParallaxOffset_C_OnFootstepNotified) == 0x000020, "Wrong size on BP_MPCContext_ParallaxOffset_C_OnFootstepNotified");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_OnFootstepNotified, State) == 0x000000, "Member 'BP_MPCContext_ParallaxOffset_C_OnFootstepNotified::State' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_OnFootstepNotified, Side) == 0x000010, "Member 'BP_MPCContext_ParallaxOffset_C_OnFootstepNotified::Side' has a wrong offset!");

// Function BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C.OnUpdated
// 0x0004 (0x0004 - 0x0000)
struct BP_MPCContext_ParallaxOffset_C_OnUpdated final
{
public:
	float                                         Output;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MPCContext_ParallaxOffset_C_OnUpdated) == 0x000004, "Wrong alignment on BP_MPCContext_ParallaxOffset_C_OnUpdated");
static_assert(sizeof(BP_MPCContext_ParallaxOffset_C_OnUpdated) == 0x000004, "Wrong size on BP_MPCContext_ParallaxOffset_C_OnUpdated");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_OnUpdated, Output) == 0x000000, "Member 'BP_MPCContext_ParallaxOffset_C_OnUpdated::Output' has a wrong offset!");

// Function BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C.SetRotateParam
// 0x0078 (0x0078 - 0x0000)
struct BP_MPCContext_ParallaxOffset_C_SetRotateParam final
{
public:
	bool                                          Is_Right__0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSpeed_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayTimeLine_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayTimeLine_PlayRate_ImplicitCast;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MPCContext_ParallaxOffset_C_SetRotateParam) == 0x000008, "Wrong alignment on BP_MPCContext_ParallaxOffset_C_SetRotateParam");
static_assert(sizeof(BP_MPCContext_ParallaxOffset_C_SetRotateParam) == 0x000078, "Wrong size on BP_MPCContext_ParallaxOffset_C_SetRotateParam");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, Is_Right__0) == 0x000000, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::Is_Right__0' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_BreakVector2D_X) == 0x000008, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, K2Node_DynamicCast_AsP2Hero_Character) == 0x000030, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_GetMaxSpeed_ReturnValue) == 0x00003C, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_GetMaxSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000048, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000050, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_PlayTimeLine_ReturnValue) == 0x000051, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_PlayTimeLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_Lerp_ReturnValue) == 0x000058, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_Lerp_ReturnValue_1) == 0x000060, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000068, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotateParam, CallFunc_PlayTimeLine_PlayRate_ImplicitCast) == 0x000070, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotateParam::CallFunc_PlayTimeLine_PlayRate_ImplicitCast' has a wrong offset!");

// Function BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C.SetRotationAngle
// 0x0008 (0x0008 - 0x0000)
struct BP_MPCContext_ParallaxOffset_C_SetRotationAngle final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MPCContext_ParallaxOffset_C_SetRotationAngle) == 0x000008, "Wrong alignment on BP_MPCContext_ParallaxOffset_C_SetRotationAngle");
static_assert(sizeof(BP_MPCContext_ParallaxOffset_C_SetRotationAngle) == 0x000008, "Wrong size on BP_MPCContext_ParallaxOffset_C_SetRotationAngle");
static_assert(offsetof(BP_MPCContext_ParallaxOffset_C_SetRotationAngle, Value) == 0x000000, "Member 'BP_MPCContext_ParallaxOffset_C_SetRotationAngle::Value' has a wrong offset!");

}

