#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MotionAlarm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MotionAlarm.BP_MotionAlarm_C
// 0x0020 (0x0368 - 0x0348)
class ABP_MotionAlarm_C final : public AP2DeployableActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AlarmSphere;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   AlarmMesh;                                         // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)	 // 0xae1e64;
	void BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)	 // 0xae1e64;
	void CreateAlarmPing()	 // 0xae1e64;
	void ExecuteUbergraph_BP_MotionAlarm(int32 EntryPoint)	 // 0xae1e64;
	void OnDeployableDestoryedEvent()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void SetActive()	 // 0xae1e64;
	void StopAlarm()	 // 0xae1e64;
	void TransferedToActor()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_MotionAlarm_C">();
	}
	static class ABP_MotionAlarm_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_MotionAlarm_C>();
	}
};
static_assert(alignof(ABP_MotionAlarm_C) == 0x000008, "Wrong alignment on ABP_MotionAlarm_C");
static_assert(sizeof(ABP_MotionAlarm_C) == 0x000368, "Wrong size on ABP_MotionAlarm_C");
static_assert(offsetof(ABP_MotionAlarm_C, UberGraphFrame) == 0x000348, "Member 'ABP_MotionAlarm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MotionAlarm_C, Ak) == 0x000350, "Member 'ABP_MotionAlarm_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_MotionAlarm_C, AlarmSphere) == 0x000358, "Member 'ABP_MotionAlarm_C::AlarmSphere' has a wrong offset!");
static_assert(offsetof(ABP_MotionAlarm_C, AlarmMesh) == 0x000360, "Member 'ABP_MotionAlarm_C::AlarmMesh' has a wrong offset!");

}

