#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MotionAlarm

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_MotionAlarm.BP_MotionAlarm_C.BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_MotionAlarm.BP_MotionAlarm_C.BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_MotionAlarm_C_BndEvt__BP_Alarm_AlarmSphere_K2Node_ComponentBoundEvent_6_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_MotionAlarm.BP_MotionAlarm_C.CreateAlarmPing
// 0x0048 (0x0048 - 0x0000)
struct BP_MotionAlarm_C_CreateAlarmPing final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AlarmData*                           K2Node_DynamicCast_AsP2Alarm_Data;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2TeamStatePrivate*                    CallFunc_GetPrivateTeamState_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MotionAlarm_C_CreateAlarmPing) == 0x000008, "Wrong alignment on BP_MotionAlarm_C_CreateAlarmPing");
static_assert(sizeof(BP_MotionAlarm_C_CreateAlarmPing) == 0x000048, "Wrong size on BP_MotionAlarm_C_CreateAlarmPing");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_MotionAlarm_C_CreateAlarmPing::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, CallFunc_GetItemData_ReturnValue) == 0x000008, "Member 'BP_MotionAlarm_C_CreateAlarmPing::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, K2Node_DynamicCast_AsP2Alarm_Data) == 0x000010, "Member 'BP_MotionAlarm_C_CreateAlarmPing::K2Node_DynamicCast_AsP2Alarm_Data' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_MotionAlarm_C_CreateAlarmPing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'BP_MotionAlarm_C_CreateAlarmPing::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, CallFunc_GetTeamId_ReturnValue) == 0x000038, "Member 'BP_MotionAlarm_C_CreateAlarmPing::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_CreateAlarmPing, CallFunc_GetPrivateTeamState_ReturnValue) == 0x000040, "Member 'BP_MotionAlarm_C_CreateAlarmPing::CallFunc_GetPrivateTeamState_ReturnValue' has a wrong offset!");

// Function BP_MotionAlarm.BP_MotionAlarm_C.ExecuteUbergraph_BP_MotionAlarm
// 0x04F8 (0x04F8 - 0x0000)
struct BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0054(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0064(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0080(0x0010)(ReferenceParm)
	EP2DeployableState                            CallFunc_GetDeployState_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00C0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindTeamFromObject_bIsPartOfTeam;         // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTeamFromObject_TeamId;                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x01D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Alarm*                               K2Node_DynamicCast_AsP2Alarm;                      // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x01F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AlarmData*                           K2Node_DynamicCast_AsP2Alarm_Data;                 // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2DeployableState                            CallFunc_GetDeployState_ReturnValue_1;             // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Alarm*                               K2Node_DynamicCast_AsP2Alarm_1;                    // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTrippedState_ReturnValue;              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x5];                                      // 0x0213(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_1; // 0x0238(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindTeamFromObject_bIsPartOfTeam_1;       // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTeamFromObject_TeamId_1;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0278(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0288(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_2;                // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0420(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_3;                // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_4;                // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0478(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue;                    // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamId_ReturnValue_1;                  // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x2];                                      // 0x048A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x048C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue_1;                // 0x04A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AlarmData*                           K2Node_DynamicCast_AsP2Alarm_Data_1;               // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors_2; // 0x04B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x04D0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_5;                // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Alarm*                               K2Node_DynamicCast_AsP2Alarm_2;                    // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm) == 0x000008, "Wrong alignment on BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm");
static_assert(sizeof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm) == 0x0004F8, "Wrong size on BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, EntryPoint) == 0x000000, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable) == 0x000004, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable_1) == 0x000024, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable_2) == 0x000054, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable_3) == 0x000064, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue) == 0x000074, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_Event_DeltaSeconds) == 0x000078, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000080, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetDeployState_ReturnValue) == 0x000090, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetDeployState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000A0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000A8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000B0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000B8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000BC, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_SweepResult) == 0x0000C0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001A8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_FindTeamFromObject_bIsPartOfTeam) == 0x0001B1, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_FindTeamFromObject_bIsPartOfTeam' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_FindTeamFromObject_TeamId) == 0x0001B4, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_FindTeamFromObject_TeamId' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable_4) == 0x0001D0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Alarm) == 0x0001E0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Alarm' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue_1) == 0x0001EC, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetItemData_ReturnValue) == 0x0001F0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Alarm_Data) == 0x0001F8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Alarm_Data' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetDeployState_ReturnValue_1) == 0x000201, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetDeployState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_SwitchEnum_CmpSuccess_1) == 0x000202, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Alarm_1) == 0x000208, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Alarm_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess_3) == 0x000210, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_IsValid_ReturnValue_1) == 0x000211, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetTrippedState_ReturnValue) == 0x000212, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetTrippedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000218, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherActor) == 0x000220, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherComp) == 0x000228, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000230, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetOverlappingActors_OverlappingActors_1) == 0x000238, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetOverlappingActors_OverlappingActors_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_int_Array_Index_Variable) == 0x000248, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Array_Length_ReturnValue_1) == 0x00024C, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Array_Get_Item) == 0x000250, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000258, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_FindTeamFromObject_bIsPartOfTeam_1) == 0x000259, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_FindTeamFromObject_bIsPartOfTeam_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_FindTeamFromObject_TeamId_1) == 0x00025C, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_FindTeamFromObject_TeamId_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000260, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_object_Variable) == 0x000278, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_LineTraceSingle_OutHit) == 0x000288, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_LineTraceSingle_ReturnValue) == 0x000370, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue_2) == 0x000374, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_bBlockingHit) == 0x000378, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_bInitialOverlap) == 0x000379, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_Time) == 0x00037C, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_Distance) == 0x000380, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_Location) == 0x000388, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_ImpactPoint) == 0x0003A0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_Normal) == 0x0003B8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_ImpactNormal) == 0x0003D0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_PhysMat) == 0x0003E8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_HitActor) == 0x0003F0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_HitComponent) == 0x0003F8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_HitBoneName) == 0x000400, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_BoneName) == 0x000408, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_HitItem) == 0x000410, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_ElementIndex) == 0x000414, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_FaceIndex) == 0x000418, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_TraceStart) == 0x000420, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_BreakHitResult_TraceEnd) == 0x000438, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000450, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue_3) == 0x000454, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue_4) == 0x000458, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000460, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000478, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetTeamId_ReturnValue) == 0x000480, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetTeamId_ReturnValue_1) == 0x000484, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetTeamId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000488, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000489, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_CreateDelegate_OutputDelegate_3) == 0x00048C, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_int_Loop_Counter_Variable) == 0x00049C, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetItemData_ReturnValue_1) == 0x0004A0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetItemData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Alarm_Data_1) == 0x0004A8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Alarm_Data_1' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess_4) == 0x0004B0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Less_IntInt_ReturnValue) == 0x0004B1, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Add_IntInt_ReturnValue) == 0x0004B4, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_GetOverlappingActors_OverlappingActors_2) == 0x0004B8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_GetOverlappingActors_OverlappingActors_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Array_Length_ReturnValue_2) == 0x0004C8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_Greater_IntInt_ReturnValue) == 0x0004CC, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, Temp_delegate_Variable_5) == 0x0004D0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, CallFunc_PostAkEvent_ReturnValue_5) == 0x0004E0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::CallFunc_PostAkEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_AsP2Alarm_2) == 0x0004E8, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_AsP2Alarm_2' has a wrong offset!");
static_assert(offsetof(BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm, K2Node_DynamicCast_bSuccess_5) == 0x0004F0, "Member 'BP_MotionAlarm_C_ExecuteUbergraph_BP_MotionAlarm::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

// Function BP_MotionAlarm.BP_MotionAlarm_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_MotionAlarm_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MotionAlarm_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_MotionAlarm_C_ReceiveTick");
static_assert(sizeof(BP_MotionAlarm_C_ReceiveTick) == 0x000004, "Wrong size on BP_MotionAlarm_C_ReceiveTick");
static_assert(offsetof(BP_MotionAlarm_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_MotionAlarm_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

