#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MPCContext_ParallaxOffset

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MPCContext_ParallaxOffset.BP_MPCContext_ParallaxOffset_C
// 0x0068 (0x0178 - 0x0110)
class UBP_MPCContext_ParallaxOffset_C final : public UP2MPCContext_ParallaxOffset
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCurveFloat*                            RotateCurve;                                       // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayingRight;                                      // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MinMaxAngle;                                       // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinMaxYRotateOffset;                               // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTimelineComponent*                     Out_Time_Line_Componrnt;                           // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotateEffectActive;                              // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Right_;                                         // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MinSpeedPlayRate;                                  // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AngleWeightBySpeed;                                // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        YOffsetWeightBySpeed;                              // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFirstStep_;                                       // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasSprinting;                                      // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_BP_MPCContext_ParallaxOffset(int32 EntryPoint)	 // 0xae1e64;
	void OnFinished()	 // 0xae1e64;
	void OnFootstepNotified(const class FString& State, const class FString& Side)	 // 0xae1e64;
	void OnUpdated(float Output)	 // 0xae1e64;
	void SetRotateParam(bool Is_Right__0)	 // 0xae1e64;
	void SetRotationAngle(double Value)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_MPCContext_ParallaxOffset_C">();
	}
	static class UBP_MPCContext_ParallaxOffset_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_MPCContext_ParallaxOffset_C>();
	}
};
static_assert(alignof(UBP_MPCContext_ParallaxOffset_C) == 0x000008, "Wrong alignment on UBP_MPCContext_ParallaxOffset_C");
static_assert(sizeof(UBP_MPCContext_ParallaxOffset_C) == 0x000178, "Wrong size on UBP_MPCContext_ParallaxOffset_C");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, UberGraphFrame) == 0x000110, "Member 'UBP_MPCContext_ParallaxOffset_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, RotateCurve) == 0x000118, "Member 'UBP_MPCContext_ParallaxOffset_C::RotateCurve' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, PlayingRight) == 0x000120, "Member 'UBP_MPCContext_ParallaxOffset_C::PlayingRight' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, MinMaxAngle) == 0x000128, "Member 'UBP_MPCContext_ParallaxOffset_C::MinMaxAngle' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, MinMaxYRotateOffset) == 0x000138, "Member 'UBP_MPCContext_ParallaxOffset_C::MinMaxYRotateOffset' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, Out_Time_Line_Componrnt) == 0x000148, "Member 'UBP_MPCContext_ParallaxOffset_C::Out_Time_Line_Componrnt' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, IsRotateEffectActive) == 0x000150, "Member 'UBP_MPCContext_ParallaxOffset_C::IsRotateEffectActive' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, Is_Right_) == 0x000151, "Member 'UBP_MPCContext_ParallaxOffset_C::Is_Right_' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, MinSpeedPlayRate) == 0x000158, "Member 'UBP_MPCContext_ParallaxOffset_C::MinSpeedPlayRate' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, AngleWeightBySpeed) == 0x000160, "Member 'UBP_MPCContext_ParallaxOffset_C::AngleWeightBySpeed' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, YOffsetWeightBySpeed) == 0x000168, "Member 'UBP_MPCContext_ParallaxOffset_C::YOffsetWeightBySpeed' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, bFirstStep_) == 0x000170, "Member 'UBP_MPCContext_ParallaxOffset_C::bFirstStep_' has a wrong offset!");
static_assert(offsetof(UBP_MPCContext_ParallaxOffset_C, WasSprinting) == 0x000171, "Member 'UBP_MPCContext_ParallaxOffset_C::WasSprinting' has a wrong offset!");

}

