#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Muntjac

#include "Basic.hpp"

#include "BP_NpcCharacter_Default_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Muntjac.BP_Muntjac_C
// 0x0010 (0x0B90 - 0x0B80)
class ABP_Muntjac_C final : public ABP_NpcCharacter_Default_C
{
public:
	class UP2MoveActionRepComponent*              P2MoveActionRep;                                   // 0x0B78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2IVAudioComponent*                    P2IVAudio;                                         // 0x0B80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2NpcThreatProjectionComponent*        P2NpcThreatProjection;                             // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Muntjac_C">();
	}
	static class ABP_Muntjac_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Muntjac_C>();
	}
};
static_assert(alignof(ABP_Muntjac_C) == 0x000010, "Wrong alignment on ABP_Muntjac_C");
static_assert(sizeof(ABP_Muntjac_C) == 0x000B90, "Wrong size on ABP_Muntjac_C");
static_assert(offsetof(ABP_Muntjac_C, P2MoveActionRep) == 0x000B78, "Member 'ABP_Muntjac_C::P2MoveActionRep' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C, P2IVAudio) == 0x000B80, "Member 'ABP_Muntjac_C::P2IVAudio' has a wrong offset!");
static_assert(offsetof(ABP_Muntjac_C, P2NpcThreatProjection) == 0x000B88, "Member 'ABP_Muntjac_C::P2NpcThreatProjection' has a wrong offset!");

}

