#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NpcCharacter_Default

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_NpcCharacter_Default.BP_NpcCharacter_Default_C.ExecuteUbergraph_BP_NpcCharacter_Default
// 0x0228 (0x0228 - 0x0000)
struct BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_OldStance;                            // 0x0004(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetStance_ReturnValue;                    // 0x000C(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_ShouldOrientToTarget;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_OrientAngle;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_OrientDuration;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0130(0x00F0)(ContainsInstancedReference)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default) == 0x000008, "Wrong alignment on BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default");
static_assert(sizeof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default) == 0x000228, "Wrong size on BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, EntryPoint) == 0x000000, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, K2Node_Event_OldStance) == 0x000004, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::K2Node_Event_OldStance' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_GetStance_ReturnValue) == 0x00000C, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_GetStance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000014, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000015, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, Temp_struct_Variable) == 0x000018, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_BooleanAND_ReturnValue) == 0x000108, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, K2Node_Event_Damage) == 0x00010C, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, K2Node_Event_ShouldOrientToTarget) == 0x000110, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::K2Node_Event_ShouldOrientToTarget' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, K2Node_Event_OrientAngle) == 0x000118, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::K2Node_Event_OrientAngle' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, K2Node_Event_OrientDuration) == 0x000120, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::K2Node_Event_OrientDuration' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000128, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000130, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000220, "Member 'BP_NpcCharacter_Default_C_ExecuteUbergraph_BP_NpcCharacter_Default::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_NpcCharacter_Default.BP_NpcCharacter_Default_C.GetTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcCharacter_Default_C_GetTarget final
{
public:
	class AActor*                                 PrimaryTarget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcCharacter_Default_C_GetTarget) == 0x000008, "Wrong alignment on BP_NpcCharacter_Default_C_GetTarget");
static_assert(sizeof(BP_NpcCharacter_Default_C_GetTarget) == 0x000008, "Wrong size on BP_NpcCharacter_Default_C_GetTarget");
static_assert(offsetof(BP_NpcCharacter_Default_C_GetTarget, PrimaryTarget) == 0x000000, "Member 'BP_NpcCharacter_Default_C_GetTarget::PrimaryTarget' has a wrong offset!");

// Function BP_NpcCharacter_Default.BP_NpcCharacter_Default_C.OnReceivedDamage
// 0x0004 (0x0004 - 0x0000)
struct BP_NpcCharacter_Default_C_OnReceivedDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcCharacter_Default_C_OnReceivedDamage) == 0x000004, "Wrong alignment on BP_NpcCharacter_Default_C_OnReceivedDamage");
static_assert(sizeof(BP_NpcCharacter_Default_C_OnReceivedDamage) == 0x000004, "Wrong size on BP_NpcCharacter_Default_C_OnReceivedDamage");
static_assert(offsetof(BP_NpcCharacter_Default_C_OnReceivedDamage, Damage) == 0x000000, "Member 'BP_NpcCharacter_Default_C_OnReceivedDamage::Damage' has a wrong offset!");

// Function BP_NpcCharacter_Default.BP_NpcCharacter_Default_C.OnStanceChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_NpcCharacter_Default_C_OnStanceChanged final
{
public:
	struct FGameplayTag                           OldStance;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcCharacter_Default_C_OnStanceChanged) == 0x000004, "Wrong alignment on BP_NpcCharacter_Default_C_OnStanceChanged");
static_assert(sizeof(BP_NpcCharacter_Default_C_OnStanceChanged) == 0x000008, "Wrong size on BP_NpcCharacter_Default_C_OnStanceChanged");
static_assert(offsetof(BP_NpcCharacter_Default_C_OnStanceChanged, OldStance) == 0x000000, "Member 'BP_NpcCharacter_Default_C_OnStanceChanged::OldStance' has a wrong offset!");

// Function BP_NpcCharacter_Default.BP_NpcCharacter_Default_C.UpdateAnimOrientData
// 0x0018 (0x0018 - 0x0000)
struct BP_NpcCharacter_Default_C_UpdateAnimOrientData final
{
public:
	bool                                          ShouldOrientToTarget_0;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OrientAngle_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OrientDuration_0;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NpcCharacter_Default_C_UpdateAnimOrientData) == 0x000008, "Wrong alignment on BP_NpcCharacter_Default_C_UpdateAnimOrientData");
static_assert(sizeof(BP_NpcCharacter_Default_C_UpdateAnimOrientData) == 0x000018, "Wrong size on BP_NpcCharacter_Default_C_UpdateAnimOrientData");
static_assert(offsetof(BP_NpcCharacter_Default_C_UpdateAnimOrientData, ShouldOrientToTarget_0) == 0x000000, "Member 'BP_NpcCharacter_Default_C_UpdateAnimOrientData::ShouldOrientToTarget_0' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_UpdateAnimOrientData, OrientAngle_0) == 0x000008, "Member 'BP_NpcCharacter_Default_C_UpdateAnimOrientData::OrientAngle_0' has a wrong offset!");
static_assert(offsetof(BP_NpcCharacter_Default_C_UpdateAnimOrientData, OrientDuration_0) == 0x000010, "Member 'BP_NpcCharacter_Default_C_UpdateAnimOrientData::OrientDuration_0' has a wrong offset!");

}

