#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTRequirement_Exfiltrate

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.On Exfiltrated
// 0x0008 (0x0008 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_On_Exfiltrated final
{
public:
	struct FGameplayTag                           ExfilTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_On_Exfiltrated) == 0x000004, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_On_Exfiltrated");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_On_Exfiltrated) == 0x000008, "Wrong size on BP_OTRequirement_Exfiltrate_C_On_Exfiltrated");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_On_Exfiltrated, ExfilTag) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_On_Exfiltrated::ExfilTag' has a wrong offset!");

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.ExecuteUbergraph_BP_OTRequirement_Exfiltrate
// 0x0058 (0x0058 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& ExfilTag)> K2Node_CreateDelegate_OutputDelegate;       // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ExfilTag;                       // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate) == 0x000008, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate) == 0x000058, "Wrong size on BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, EntryPoint) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_Event_InFirstInitialization) == 0x000014, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, CallFunc_GetOwningPawn_ReturnValue) == 0x000018, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_CustomEvent_ExfilTag) == 0x000020, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_CustomEvent_ExfilTag' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_DynamicCast_AsP2Hero_Character) == 0x000028, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000031, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000038, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, CallFunc_MatchesTag_ReturnValue) == 0x000040, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x000048, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_OTRequirement_Exfiltrate_C_ExecuteUbergraph_BP_OTRequirement_Exfiltrate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_BP_Initialize");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_BP_Initialize) == 0x000001, "Wrong size on BP_OTRequirement_Exfiltrate_C_BP_Initialize");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.AddExfil
// 0x0010 (0x0010 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_AddExfil final
{
public:
	EP2OperationalTaskStageRequirementState       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageRequirementState       Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageRequirementState       K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_AddExfil) == 0x000004, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_AddExfil");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_AddExfil) == 0x000010, "Wrong size on BP_OTRequirement_Exfiltrate_C_AddExfil");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, Temp_byte_Variable) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, Temp_byte_Variable_1) == 0x000001, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, Temp_bool_Variable) == 0x000002, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000003, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, CallFunc_Clamp_ReturnValue) == 0x000008, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_AddExfil, K2Node_Select_Default) == 0x00000C, "Member 'BP_OTRequirement_Exfiltrate_C_AddExfil::K2Node_Select_Default' has a wrong offset!");

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.GetRequiredCompletionCount
// 0x0004 (0x0004 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount) == 0x000004, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount) == 0x000004, "Wrong size on BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount, ReturnValue) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_GetRequiredCompletionCount::ReturnValue' has a wrong offset!");

// Function BP_OTRequirement_Exfiltrate.BP_OTRequirement_Exfiltrate_C.GetCurrentCompletionCount
// 0x0004 (0x0004 - 0x0000)
struct BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount) == 0x000004, "Wrong alignment on BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount");
static_assert(sizeof(BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount) == 0x000004, "Wrong size on BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount");
static_assert(offsetof(BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount, ReturnValue) == 0x000000, "Member 'BP_OTRequirement_Exfiltrate_C_GetCurrentCompletionCount::ReturnValue' has a wrong offset!");

}

