#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTReward_SkinCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OTReward_SkinCustomization.BP_OTReward_SkinCustomization_C
// 0x0028 (0x0088 - 0x0060)
class UBP_OTReward_SkinCustomization_C final : public UP2OperationalTaskStageRewardBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UP2ItemSkinContainer*>           ItemSkinContainers;                                // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UP2SkinSlotPreset*>              SkinSlotPresets;                                   // 0x0078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool GetSkinSlotPresets(TArray<class UP2SkinSlotPreset*>* OutSkinSlotPresets)	 // 0xae1e64;
	bool GetItemSkinContainers(TArray<class UP2ItemSkinContainer*>* OutItemSkinContainers)	 // 0xae1e64;
	void ExecuteUbergraph_BP_OTReward_SkinCustomization(int32 EntryPoint)	 // 0xae1e64;
	void BP_AddReward(class APlayerController* InPlayerController)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_OTReward_SkinCustomization_C">();
	}
	static class UBP_OTReward_SkinCustomization_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_OTReward_SkinCustomization_C>();
	}
};
static_assert(alignof(UBP_OTReward_SkinCustomization_C) == 0x000008, "Wrong alignment on UBP_OTReward_SkinCustomization_C");
static_assert(sizeof(UBP_OTReward_SkinCustomization_C) == 0x000088, "Wrong size on UBP_OTReward_SkinCustomization_C");
static_assert(offsetof(UBP_OTReward_SkinCustomization_C, UberGraphFrame) == 0x000060, "Member 'UBP_OTReward_SkinCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_OTReward_SkinCustomization_C, ItemSkinContainers) == 0x000068, "Member 'UBP_OTReward_SkinCustomization_C::ItemSkinContainers' has a wrong offset!");
static_assert(offsetof(UBP_OTReward_SkinCustomization_C, SkinSlotPresets) == 0x000078, "Member 'UBP_OTReward_SkinCustomization_C::SkinSlotPresets' has a wrong offset!");

}

