#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTReward_Items

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_OTReward_Items.BP_OTReward_Items_C.GetRewardExchangeInfo
// 0x0050 (0x0050 - 0x0000)
struct BP_OTReward_Items_C_GetRewardExchangeInfo final
{
public:
	struct FP2ExchangeInfo                        ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_OTReward_Items_C_GetRewardExchangeInfo) == 0x000008, "Wrong alignment on BP_OTReward_Items_C_GetRewardExchangeInfo");
static_assert(sizeof(BP_OTReward_Items_C_GetRewardExchangeInfo) == 0x000050, "Wrong size on BP_OTReward_Items_C_GetRewardExchangeInfo");
static_assert(offsetof(BP_OTReward_Items_C_GetRewardExchangeInfo, ReturnValue) == 0x000000, "Member 'BP_OTReward_Items_C_GetRewardExchangeInfo::ReturnValue' has a wrong offset!");

// Function BP_OTReward_Items.BP_OTReward_Items_C.ExecuteUbergraph_BP_OTReward_Items
// 0x0020 (0x0020 - 0x0000)
struct BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2ExchangeInfo>                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      K2Node_Event_InPlayerController;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items) == 0x000008, "Wrong alignment on BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items");
static_assert(sizeof(BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items) == 0x000020, "Wrong size on BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items");
static_assert(offsetof(BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items, EntryPoint) == 0x000000, "Member 'BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items, K2Node_Event_InPlayerController) == 0x000018, "Member 'BP_OTReward_Items_C_ExecuteUbergraph_BP_OTReward_Items::K2Node_Event_InPlayerController' has a wrong offset!");

// Function BP_OTReward_Items.BP_OTReward_Items_C.BP_AddReward
// 0x0008 (0x0008 - 0x0000)
struct BP_OTReward_Items_C_BP_AddReward final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTReward_Items_C_BP_AddReward) == 0x000008, "Wrong alignment on BP_OTReward_Items_C_BP_AddReward");
static_assert(sizeof(BP_OTReward_Items_C_BP_AddReward) == 0x000008, "Wrong size on BP_OTReward_Items_C_BP_AddReward");
static_assert(offsetof(BP_OTReward_Items_C_BP_AddReward, InPlayerController) == 0x000000, "Member 'BP_OTReward_Items_C_BP_AddReward::InPlayerController' has a wrong offset!");

}

