#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTRequirement_Extract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.On Exfiltrated
// 0x0008 (0x0008 - 0x0000)
struct BP_OTRequirement_Extract_C_On_Exfiltrated final
{
public:
	struct FGameplayTag                           ExfilTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_On_Exfiltrated) == 0x000004, "Wrong alignment on BP_OTRequirement_Extract_C_On_Exfiltrated");
static_assert(sizeof(BP_OTRequirement_Extract_C_On_Exfiltrated) == 0x000008, "Wrong size on BP_OTRequirement_Extract_C_On_Exfiltrated");
static_assert(offsetof(BP_OTRequirement_Extract_C_On_Exfiltrated, ExfilTag) == 0x000000, "Member 'BP_OTRequirement_Extract_C_On_Exfiltrated::ExfilTag' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.Get Items WithTag
// 0x0048 (0x0048 - 0x0000)
struct BP_OTRequirement_Extract_C_Get_Items_WithTag final
{
public:
	class AP2HeroCharacter*                       P2Character;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Item*>                        OutItems;                                          // 0x0008(0x0010)(Parm, OutParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0018(0x0020)()
	TArray<class UP2Item*>                        CallFunc_GetItemsWithTags_OutItems;                // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_OTRequirement_Extract_C_Get_Items_WithTag) == 0x000008, "Wrong alignment on BP_OTRequirement_Extract_C_Get_Items_WithTag");
static_assert(sizeof(BP_OTRequirement_Extract_C_Get_Items_WithTag) == 0x000048, "Wrong size on BP_OTRequirement_Extract_C_Get_Items_WithTag");
static_assert(offsetof(BP_OTRequirement_Extract_C_Get_Items_WithTag, P2Character) == 0x000000, "Member 'BP_OTRequirement_Extract_C_Get_Items_WithTag::P2Character' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Get_Items_WithTag, OutItems) == 0x000008, "Member 'BP_OTRequirement_Extract_C_Get_Items_WithTag::OutItems' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Get_Items_WithTag, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000018, "Member 'BP_OTRequirement_Extract_C_Get_Items_WithTag::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Get_Items_WithTag, CallFunc_GetItemsWithTags_OutItems) == 0x000038, "Member 'BP_OTRequirement_Extract_C_Get_Items_WithTag::CallFunc_GetItemsWithTags_OutItems' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.ExecuteUbergraph_BP_OTRequirement_Extract
// 0x00B8 (0x00B8 - 0x0000)
struct BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Item*>                        CallFunc_Get_Items_WithTag_OutItems;               // 0x0020(0x0010)(ReferenceParm)
	class UP2Item*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemStackAmount_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ExfilTag;                       // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_2;           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& ExfilTag)> K2Node_CreateDelegate_OutputDelegate;       // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract) == 0x000008, "Wrong alignment on BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract");
static_assert(sizeof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract) == 0x0000B8, "Wrong size on BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, EntryPoint) == 0x000000, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_GetOwningPawn_ReturnValue) == 0x000008, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_AsP2Hero_Character) == 0x000010, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_Get_Items_WithTag_OutItems) == 0x000020, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_Get_Items_WithTag_OutItems' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_IsItemPureStackable_ReturnValue) == 0x00003C, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_GetItemStackAmount_ReturnValue) == 0x000040, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_GetItemStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000048, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000058, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_Event_InFirstInitialization) == 0x000068, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_GetOwningPawn_ReturnValue_1) == 0x000070, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_GetOwningPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_CustomEvent_ExfilTag) == 0x000078, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_CustomEvent_ExfilTag' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x000080, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, CallFunc_GetOwningPawn_ReturnValue_2) == 0x000090, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::CallFunc_GetOwningPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_AsP2Hero_Character_2) == 0x000098, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_AsP2Hero_Character_2' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'BP_OTRequirement_Extract_C_ExecuteUbergraph_BP_OTRequirement_Extract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_OTRequirement_Extract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_OTRequirement_Extract_C_BP_Initialize");
static_assert(sizeof(BP_OTRequirement_Extract_C_BP_Initialize) == 0x000001, "Wrong size on BP_OTRequirement_Extract_C_BP_Initialize");
static_assert(offsetof(BP_OTRequirement_Extract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_OTRequirement_Extract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.Add Extract
// 0x0014 (0x0014 - 0x0000)
struct BP_OTRequirement_Extract_C_Add_Extract final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageRequirementState       Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageRequirementState       Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageRequirementState       K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_Add_Extract) == 0x000004, "Wrong alignment on BP_OTRequirement_Extract_C_Add_Extract");
static_assert(sizeof(BP_OTRequirement_Extract_C_Add_Extract) == 0x000014, "Wrong size on BP_OTRequirement_Extract_C_Add_Extract");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, Num) == 0x000000, "Member 'BP_OTRequirement_Extract_C_Add_Extract::Num' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, Temp_byte_Variable) == 0x000004, "Member 'BP_OTRequirement_Extract_C_Add_Extract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, Temp_byte_Variable_1) == 0x000005, "Member 'BP_OTRequirement_Extract_C_Add_Extract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, Temp_bool_Variable) == 0x000006, "Member 'BP_OTRequirement_Extract_C_Add_Extract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000007, "Member 'BP_OTRequirement_Extract_C_Add_Extract::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_OTRequirement_Extract_C_Add_Extract::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'BP_OTRequirement_Extract_C_Add_Extract::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OTRequirement_Extract_C_Add_Extract, K2Node_Select_Default) == 0x000010, "Member 'BP_OTRequirement_Extract_C_Add_Extract::K2Node_Select_Default' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.GetRequiredCompletionCount
// 0x0004 (0x0004 - 0x0000)
struct BP_OTRequirement_Extract_C_GetRequiredCompletionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_GetRequiredCompletionCount) == 0x000004, "Wrong alignment on BP_OTRequirement_Extract_C_GetRequiredCompletionCount");
static_assert(sizeof(BP_OTRequirement_Extract_C_GetRequiredCompletionCount) == 0x000004, "Wrong size on BP_OTRequirement_Extract_C_GetRequiredCompletionCount");
static_assert(offsetof(BP_OTRequirement_Extract_C_GetRequiredCompletionCount, ReturnValue) == 0x000000, "Member 'BP_OTRequirement_Extract_C_GetRequiredCompletionCount::ReturnValue' has a wrong offset!");

// Function BP_OTRequirement_Extract.BP_OTRequirement_Extract_C.GetCurrentCompletionCount
// 0x0004 (0x0004 - 0x0000)
struct BP_OTRequirement_Extract_C_GetCurrentCompletionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_OTRequirement_Extract_C_GetCurrentCompletionCount) == 0x000004, "Wrong alignment on BP_OTRequirement_Extract_C_GetCurrentCompletionCount");
static_assert(sizeof(BP_OTRequirement_Extract_C_GetCurrentCompletionCount) == 0x000004, "Wrong size on BP_OTRequirement_Extract_C_GetCurrentCompletionCount");
static_assert(offsetof(BP_OTRequirement_Extract_C_GetCurrentCompletionCount, ReturnValue) == 0x000000, "Member 'BP_OTRequirement_Extract_C_GetCurrentCompletionCount::ReturnValue' has a wrong offset!");

}

