#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTRequirement_Extract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OTRequirement_Extract.BP_OTRequirement_Extract_C
// 0x0018 (0x0080 - 0x0068)
class UBP_OTRequirement_Extract_C final : public UP2OperationalTaskStageRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           RequiredObjectTag;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentNum;                                        // 0x0078(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetNum;                                         // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void On_Exfiltrated(const struct FGameplayTag& ExfilTag)	 // 0xae1e64;
	void Get_Items_WithTag(class AP2HeroCharacter* P2Character, TArray<class UP2Item*>* OutItems)	 // 0xae1e64;
	void ExecuteUbergraph_BP_OTRequirement_Extract(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void Add_Extract(int32 Num)	 // 0xae1e64;

	int32 GetRequiredCompletionCount() const	 // 0xae1e64;
	int32 GetCurrentCompletionCount() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_OTRequirement_Extract_C">();
	}
	static class UBP_OTRequirement_Extract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_OTRequirement_Extract_C>();
	}
};
static_assert(alignof(UBP_OTRequirement_Extract_C) == 0x000008, "Wrong alignment on UBP_OTRequirement_Extract_C");
static_assert(sizeof(UBP_OTRequirement_Extract_C) == 0x000080, "Wrong size on UBP_OTRequirement_Extract_C");
static_assert(offsetof(UBP_OTRequirement_Extract_C, UberGraphFrame) == 0x000068, "Member 'UBP_OTRequirement_Extract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_OTRequirement_Extract_C, RequiredObjectTag) == 0x000070, "Member 'UBP_OTRequirement_Extract_C::RequiredObjectTag' has a wrong offset!");
static_assert(offsetof(UBP_OTRequirement_Extract_C, CurrentNum) == 0x000078, "Member 'UBP_OTRequirement_Extract_C::CurrentNum' has a wrong offset!");
static_assert(offsetof(UBP_OTRequirement_Extract_C, TargetNum) == 0x00007C, "Member 'UBP_OTRequirement_Extract_C::TargetNum' has a wrong offset!");

}

