#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OTRequirement_ResearchNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OTRequirement_ResearchNode.BP_OTRequirement_ResearchNode_C
// 0x0010 (0x0078 - 0x0068)
class UBP_OTRequirement_ResearchNode_C final : public UP2OperationalTaskStageRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         TargetNum;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentNum;                                        // 0x0074(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnResearchNodeStateChangedDelegate_Event(const class UP2Research* InResearch, class UP2ResearchNode* InResearchNode, EP2ResearchNodeState InNewState, EP2ResearchNodeState InOldState)	 // 0xae1e64;
	void ExecuteUbergraph_BP_OTRequirement_ResearchNode(int32 EntryPoint)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void BP_Reset()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void AddResearch()	 // 0xae1e64;

	int32 GetRequiredCompletionCount() const	 // 0xae1e64;
	int32 GetCurrentCompletionCount() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_OTRequirement_ResearchNode_C">();
	}
	static class UBP_OTRequirement_ResearchNode_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_OTRequirement_ResearchNode_C>();
	}
};
static_assert(alignof(UBP_OTRequirement_ResearchNode_C) == 0x000008, "Wrong alignment on UBP_OTRequirement_ResearchNode_C");
static_assert(sizeof(UBP_OTRequirement_ResearchNode_C) == 0x000078, "Wrong size on UBP_OTRequirement_ResearchNode_C");
static_assert(offsetof(UBP_OTRequirement_ResearchNode_C, UberGraphFrame) == 0x000068, "Member 'UBP_OTRequirement_ResearchNode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_OTRequirement_ResearchNode_C, TargetNum) == 0x000070, "Member 'UBP_OTRequirement_ResearchNode_C::TargetNum' has a wrong offset!");
static_assert(offsetof(UBP_OTRequirement_ResearchNode_C, CurrentNum) == 0x000074, "Member 'UBP_OTRequirement_ResearchNode_C::CurrentNum' has a wrong offset!");

}

