#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P2FaunaSnapToFoliage_Component

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C.CreateUniqueFoliageIdentifier
// 0x0058 (0x0058 - 0x0000)
struct BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier final
{
public:
	class FString                                 InternalIdentifier;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         HeightIndex;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier) == 0x000008, "Wrong alignment on BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier");
static_assert(sizeof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier) == 0x000058, "Wrong size on BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, InternalIdentifier) == 0x000000, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::InternalIdentifier' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, HeightIndex) == 0x000010, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::HeightIndex' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, ReturnValue) == 0x000018, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'BP_P2FaunaSnapToFoliage_Component_C_CreateUniqueFoliageIdentifier::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C.DebugDrawOnTick
// 0x0180 (0x0180 - 0x0000)
struct BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetListenerLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2AmbientFaunaSoundActor*              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDrawDebug_ReturnValue;                 // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00D8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AP2AmbientFaunaSoundActor*              CallFunc_Map_Find_Value;                           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick) == 0x000008, "Wrong alignment on BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick");
static_assert(sizeof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick) == 0x000180, "Wrong size on BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_GetListenerLocation_ReturnValue) == 0x000010, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_GetListenerLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_GetObjectName_ReturnValue) == 0x000040, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000050, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Array_Length_ReturnValue_1) == 0x000094, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Greater_IntInt_ReturnValue) == 0x000098, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Conv_IntToString_ReturnValue) == 0x0000A0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, Temp_int_Loop_Counter_Variable_1) == 0x0000C0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Less_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_GetDrawDebug_ReturnValue) == 0x0000CC, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_GetDrawDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Map_Length_ReturnValue) == 0x0000D0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Map_Keys_Keys) == 0x0000D8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000E8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000108, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Map_Find_Value) == 0x000118, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Map_Find_ReturnValue) == 0x000120, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Array_Length_ReturnValue_2) == 0x000124, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Less_IntInt_ReturnValue_1) == 0x000129, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000130, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_GetObjectName_ReturnValue_1) == 0x000148, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000158, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000170, "Member 'BP_P2FaunaSnapToFoliage_Component_C_DebugDrawOnTick::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

// Function BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C.EnableOrDissableSystem
// 0x0001 (0x0001 - 0x0000)
struct BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem final
{
public:
	bool                                          CallFunc_GetEnableSystem_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem) == 0x000001, "Wrong alignment on BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem");
static_assert(sizeof(BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem) == 0x000001, "Wrong size on BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem, CallFunc_GetEnableSystem_ReturnValue) == 0x000000, "Member 'BP_P2FaunaSnapToFoliage_Component_C_EnableOrDissableSystem::CallFunc_GetEnableSystem_ReturnValue' has a wrong offset!");

// Function BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C.ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component
// 0x0400 (0x0400 - 0x0000)
struct BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2SoundColorMapAmbSystem*              CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2AmbientFaunaSoundActor*              CallFunc_Map_Find_Value;                           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UP2ColorMapSnapToFoliageChannelDataAsset* CallFunc_GetSnapToFoliageSettings_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2SoundColorMapAmbSystem*              CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAudioEvent*>                  K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GetDrawDebug_ReturnValue;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDrawDebug_ReturnValue_1;               // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDrawDebug_ReturnValue_2;               // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CreateUniqueFoliageIdentifier_ReturnValue; // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2SoundColorMapAmbSystem*              CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2RegionColor                                CallFunc_GetColorMapValueAtLocation_ReturnValue;   // 0x01A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FP2ColorMapFaunaSnapToFoliageChannelConfig CallFunc_GetColorSpecificSettings_OutColorSpecificSettings; // 0x01B8(0x0068)()
	bool                                          CallFunc_GetColorSpecificSettings_bOutSettingsFound; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0xF];                                      // 0x0221(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SnapToFoliageData                   K2Node_Event_DataToPass_1;                         // 0x0230(0x0080)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0xC];                                      // 0x02B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SnapToFoliageData                   K2Node_Event_DataToPass;                           // 0x02C0(0x0080)(ContainsInstancedReference)
	class FString                                 CallFunc_GetDebugStringFromGameplayTag_ReturnValue; // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutEvent; // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2SnapToFoliageSpeciesSettings        CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutSettings; // 0x0368(0x0020)(NoDestructor)
	bool                                          CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_ReturnValue; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetLocationOffsetVectors_ReturnValue;     // 0x0390(0x0010)(ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x03E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component) == 0x000010, "Wrong alignment on BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component");
static_assert(sizeof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component) == 0x000400, "Wrong size on BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, EntryPoint) == 0x000000, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, Temp_int_Variable) == 0x000004, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Location) == 0x000008, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Rotation) == 0x000020, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Scale) == 0x000038, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, Temp_int_Variable_1) == 0x000068, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Add_IntInt_ReturnValue_1) == 0x000084, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000088, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Map_Find_Value) == 0x000090, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000A0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000A8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Conv_VectorToString_ReturnValue) == 0x0000C0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetObjectName_ReturnValue) == 0x0000D0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000E0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000F0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetSnapToFoliageSettings_ReturnValue) == 0x000100, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetSnapToFoliageSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue_2) == 0x000109, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000110, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Map_Remove_ReturnValue) == 0x000118, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue_3) == 0x000119, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue_4) == 0x00011A, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, K2Node_MakeArray_Array) == 0x000120, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetDrawDebug_ReturnValue) == 0x000130, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetDrawDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetDrawDebug_ReturnValue_1) == 0x000131, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetDrawDebug_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetDrawDebug_ReturnValue_2) == 0x000132, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetDrawDebug_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, K2Node_Event_DeltaSeconds) == 0x000134, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_CreateUniqueFoliageIdentifier_ReturnValue) == 0x000138, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_CreateUniqueFoliageIdentifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Location_1) == 0x000150, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Rotation_1) == 0x000168, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Scale_1) == 0x000180, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x000198, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetColorMapValueAtLocation_ReturnValue) == 0x0001A0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetColorMapValueAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_IsValid_ReturnValue_5) == 0x0001A1, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0001A8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetColorSpecificSettings_OutColorSpecificSettings) == 0x0001B8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetColorSpecificSettings_OutColorSpecificSettings' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetColorSpecificSettings_bOutSettingsFound) == 0x000220, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetColorSpecificSettings_bOutSettingsFound' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, K2Node_Event_DataToPass_1) == 0x000230, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::K2Node_Event_DataToPass_1' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Array_Add_ReturnValue) == 0x0002B0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, K2Node_Event_DataToPass) == 0x0002C0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::K2Node_Event_DataToPass' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetDebugStringFromGameplayTag_ReturnValue) == 0x000340, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetDebugStringFromGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000350, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutEvent) == 0x000360, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutEvent' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutSettings) == 0x000368, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_OutSettings' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_ReturnValue) == 0x000388, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetRandomSpeciesFromHeightIndexColorAndFoliageType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_GetLocationOffsetVectors_ReturnValue) == 0x000390, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_GetLocationOffsetVectors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Map_Length_ReturnValue) == 0x0003A0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003A4, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Greater_IntInt_ReturnValue) == 0x0003A8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Location_2) == 0x0003B0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Rotation_2) == 0x0003C8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_BreakTransform_Scale_2) == 0x0003E0, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0003F8, "Member 'BP_P2FaunaSnapToFoliage_Component_C_ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C.GetAmbientSoundFromPoolAndRegister
// 0x0168 (0x0168 - 0x0000)
struct BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister final
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2AmbientFaunaSoundActor*              AvailableSoundActor;                               // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0048(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0154(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAssociatedAkEvent_ReturnValue;        // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister) == 0x000008, "Wrong alignment on BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister");
static_assert(sizeof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister) == 0x000168, "Wrong size on BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, AkAudioEvent) == 0x000000, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, NewLocation) == 0x000008, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::NewLocation' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, DrawDebug) == 0x000020, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::DrawDebug' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, AvailableSoundActor) == 0x000028, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::AvailableSoundActor' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000048, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000130, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000138, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, CallFunc_Array_RemoveItem_ReturnValue) == 0x000150, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister, Temp_delegate_Variable) == 0x000154, "Member 'BP_P2FaunaSnapToFoliage_Component_C_GetAmbientSoundFromPoolAndRegister::Temp_delegate_Variable' has a wrong offset!");
