#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P2WeatherZones

#include "Basic.hpp"

#include "S_WeatherZone_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P2WeatherZones.BP_P2WeatherZones_C
// 0x0040 (0x0070 - 0x0030)
class UBP_P2WeatherZones_C final : public UPrimaryDataAsset
{
public:
	class FString                                 Description;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash)
	TArray<struct FS_WeatherZone>                 Green_Zone_Weather_Types;                          // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_WeatherZone>                 Yellow_Zone_Weather_Types;                         // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<struct FS_WeatherZone>                 Red_Zone_Weather_Types;                            // 0x0060(0x0010)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_P2WeatherZones_C">();
	}
	static class UBP_P2WeatherZones_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_P2WeatherZones_C>();
	}
};
static_assert(alignof(UBP_P2WeatherZones_C) == 0x000008, "Wrong alignment on UBP_P2WeatherZones_C");
static_assert(sizeof(UBP_P2WeatherZones_C) == 0x000070, "Wrong size on UBP_P2WeatherZones_C");
static_assert(offsetof(UBP_P2WeatherZones_C, Description) == 0x000030, "Member 'UBP_P2WeatherZones_C::Description' has a wrong offset!");
static_assert(offsetof(UBP_P2WeatherZones_C, Green_Zone_Weather_Types) == 0x000040, "Member 'UBP_P2WeatherZones_C::Green_Zone_Weather_Types' has a wrong offset!");
static_assert(offsetof(UBP_P2WeatherZones_C, Yellow_Zone_Weather_Types) == 0x000050, "Member 'UBP_P2WeatherZones_C::Yellow_Zone_Weather_Types' has a wrong offset!");
static_assert(offsetof(UBP_P2WeatherZones_C, Red_Zone_Weather_Types) == 0x000060, "Member 'UBP_P2WeatherZones_C::Red_Zone_Weather_Types' has a wrong offset!");

}

