#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_P2FaunaSnapToFoliage_Component

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_P2FaunaSnapToFoliage_Component.BP_P2FaunaSnapToFoliage_Component_C
// 0x0200 (0x03D0 - 0x01D0)
class UBP_P2FaunaSnapToFoliage_Component_C final : public UP2AudioOnFoliageComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2ColorMapSnapToFoliageChannelDataAsset* Snap_to_Foliage_Settings;                        // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Initialized;                                       // 0x01E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Unique_Foliage_Identifier;                         // 0x01E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class FString, class AP2AmbientFaunaSoundActor*> ActiveAmbientSoundMap;                     // 0x01F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Location;                                          // 0x0248(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Internal_ID;                                       // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        DistanceTraveled_UEU;                              // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Seconds;                                     // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastLocation;                                      // 0x0280(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Height_entries_found;                              // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentAssetUserData;                              // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2AmbientFaunaSoundActor*>      InactiveAmbientSounds;                             // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class UAkAudioEvent*, struct FP2SnapToFoliageSpeciesSettings> SoundsWithSettings;           // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FP2ColorMapFaunaSnapToFoliageChannelConfig Color_Specific_Settings;                       // 0x0308(0x0068)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTransform                             Transform;                                         // 0x0370(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString CreateUniqueFoliageIdentifier(const class FString& InternalIdentifier, int32 HeightIndex)	 // 0xae1e64;
	void DebugDrawOnTick()	 // 0xae1e64;
	void EnableOrDissableSystem()	 // 0xae1e64;
	void ExecuteUbergraph_BP_P2FaunaSnapToFoliage_Component(int32 EntryPoint)	 // 0xae1e64;
	void GetAmbientSoundFromPoolAndRegister(class UAkAudioEvent* AkAudioEvent, const struct FVector& NewLocation, bool DrawDebug, class AP2AmbientFaunaSoundActor* AvailableSoundActor)	 // 0xae1e64;
	void IsSoundActorAvailable(class AP2AmbientFaunaSoundActor* AmbientActor, bool* bIsValid)	 // 0xae1e64;
	void OnEndOverlap(const struct FP2SnapToFoliageData& DataToPass)	 // 0xae1e64;
	void OnOverlap(const struct FP2SnapToFoliageData& DataToPass)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void SpawnAmbientSoundAndRegister(class UAkAudioEvent* AkAudioEvent, const struct FVector& InLocation, bool DrawDebug)	 // 0xae1e64;
	void SpawnCreatureSound(bool DrawDebug, TArray<struct FVector>& Location_0, const struct FTransform& OgTransform, const class FString& RegionColor, const class FString& TreeType)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_P2FaunaSnapToFoliage_Component_C">();
	}
	static class UBP_P2FaunaSnapToFoliage_Component_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_P2FaunaSnapToFoliage_Component_C>();
	}
};
static_assert(alignof(UBP_P2FaunaSnapToFoliage_Component_C) == 0x000010, "Wrong alignment on UBP_P2FaunaSnapToFoliage_Component_C");
static_assert(sizeof(UBP_P2FaunaSnapToFoliage_Component_C) == 0x0003D0, "Wrong size on UBP_P2FaunaSnapToFoliage_Component_C");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, UberGraphFrame) == 0x0001D0, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Snap_to_Foliage_Settings) == 0x0001D8, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Snap_to_Foliage_Settings' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Initialized) == 0x0001E0, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Initialized' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Unique_Foliage_Identifier) == 0x0001E8, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Unique_Foliage_Identifier' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, ActiveAmbientSoundMap) == 0x0001F8, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::ActiveAmbientSoundMap' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Location) == 0x000248, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Location' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Internal_ID) == 0x000260, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Internal_ID' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, DistanceTraveled_UEU) == 0x000270, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::DistanceTraveled_UEU' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Delta_Seconds) == 0x000278, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, LastLocation) == 0x000280, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::LastLocation' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Root) == 0x000298, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Root' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Height_entries_found) == 0x0002A0, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Height_entries_found' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, CurrentAssetUserData) == 0x0002A4, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::CurrentAssetUserData' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, InactiveAmbientSounds) == 0x0002A8, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::InactiveAmbientSounds' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, SoundsWithSettings) == 0x0002B8, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::SoundsWithSettings' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Color_Specific_Settings) == 0x000308, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Color_Specific_Settings' has a wrong offset!");
static_assert(offsetof(UBP_P2FaunaSnapToFoliage_Component_C, Transform) == 0x000370, "Member 'UBP_P2FaunaSnapToFoliage_Component_C::Transform' has a wrong offset!");

}

