#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerStart_HideoutFirstTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerStart_HideoutFirstTime.BP_PlayerStart_HideoutFirstTime_C
// 0x0160 (0x0460 - 0x0300)
class ABP_PlayerStart_HideoutFirstTime_C final : public AP2PlayerStartBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Hero_Preview;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStartComponent_LevelSequence*  P2PlayerStartComponent_LevelSequence;              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Intensity_321C3FFB4AF0BAF4329AC88C2666F8FF; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_321C3FFB4AF0BAF4329AC88C2666F8FF; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Intensity_5CDD3C2640B2E0D071A7F2B48E1C4DE4; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_5CDD3C2640B2E0D071A7F2B48E1C4DE4; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CenterLightTimeline_Intensity_CE8357F14CC73E7F881CF0B4AD060F1F; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CenterLightTimeline__Direction_CE8357F14CC73E7F881CF0B4AD060F1F; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CenterLightTimeline;                               // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Hideout_Hatch_C*                    Hatch;                                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_FacilitySpot_UGVConsole_C*          FacilitySpot_UGVConsole;                           // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         FTUE_EventLighting_InitialyOff_Array;              // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         FTUE_EventLighting_InitialyOn_Array;               // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class UActorComponent*, double>          InitialyOffDefaultValueMap;                        // 0x0378(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UActorComponent*, double>          InitialyOnDefaultValueMap;                         // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_Fixture_Spots_01_C*                 EntranceLight;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         NS_InsectArray;                                    // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ALevelSequenceActor*                    LS_Active_UGV_FTUE;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     PP_HighExposure;                                   // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Facility_Decorative_CeilingLight_Dfo_01_C*> CeilingLightArray;                  // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class APostProcessVolume*                     PP_Dark;                                           // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline__UpdateFunc()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline_0__UpdateFunc()	 // 0xae1e64;
	void Timeline_0__FinishedFunc()	 // 0xae1e64;
	void SetBunkerLight(class ABp_Fixture_Bunkerlight_01_C* BunkerLight, bool IsTurnOn)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void OnPlayerSpawned_BP(class AP2PlayerController* InController)	 // 0xae1e64;
	void OnEnd_LS_Active_UGV_FTUE()	 // 0xae1e64;
	void LightOnEventOnInstalled(class AP2FacilitySpot* InFacilitySpot, const struct FP2FacilitySpotStatusInfo& InOldStatus, const struct FP2FacilitySpotStatusInfo& InNewStatus)	 // 0xae1e64;
	void LightingOn()	 // 0xae1e64;
	void Init_All_FTUE_Lighting_Event_Actors()	 // 0xae1e64;
	void ExecuteUbergraph_BP_PlayerStart_HideoutFirstTime(int32 EntryPoint)	 // 0xae1e64;
	void EntranceLightControl(float Intensity)	 // 0xae1e64;
	void CenterLightTimeline__UpdateFunc()	 // 0xae1e64;
	void CenterLightTimeline__FinishedFunc()	 // 0xae1e64;
	void CeilingLightControl(double Intensity)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerStart_HideoutFirstTime_C">();
	}
	static class ABP_PlayerStart_HideoutFirstTime_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_PlayerStart_HideoutFirstTime_C>();
	}
};
static_assert(alignof(ABP_PlayerStart_HideoutFirstTime_C) == 0x000008, "Wrong alignment on ABP_PlayerStart_HideoutFirstTime_C");
static_assert(sizeof(ABP_PlayerStart_HideoutFirstTime_C) == 0x000460, "Wrong size on ABP_PlayerStart_HideoutFirstTime_C");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, UberGraphFrame) == 0x000300, "Member 'ABP_PlayerStart_HideoutFirstTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Hero_Preview) == 0x000308, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Hero_Preview' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, P2PlayerStartComponent_LevelSequence) == 0x000310, "Member 'ABP_PlayerStart_HideoutFirstTime_C::P2PlayerStartComponent_LevelSequence' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline_0_Intensity_321C3FFB4AF0BAF4329AC88C2666F8FF) == 0x000318, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline_0_Intensity_321C3FFB4AF0BAF4329AC88C2666F8FF' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline_0__Direction_321C3FFB4AF0BAF4329AC88C2666F8FF) == 0x00031C, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline_0__Direction_321C3FFB4AF0BAF4329AC88C2666F8FF' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline_0) == 0x000320, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline_Intensity_5CDD3C2640B2E0D071A7F2B48E1C4DE4) == 0x000328, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline_Intensity_5CDD3C2640B2E0D071A7F2B48E1C4DE4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline__Direction_5CDD3C2640B2E0D071A7F2B48E1C4DE4) == 0x00032C, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline__Direction_5CDD3C2640B2E0D071A7F2B48E1C4DE4' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Timeline) == 0x000330, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, CenterLightTimeline_Intensity_CE8357F14CC73E7F881CF0B4AD060F1F) == 0x000338, "Member 'ABP_PlayerStart_HideoutFirstTime_C::CenterLightTimeline_Intensity_CE8357F14CC73E7F881CF0B4AD060F1F' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, CenterLightTimeline__Direction_CE8357F14CC73E7F881CF0B4AD060F1F) == 0x00033C, "Member 'ABP_PlayerStart_HideoutFirstTime_C::CenterLightTimeline__Direction_CE8357F14CC73E7F881CF0B4AD060F1F' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, CenterLightTimeline) == 0x000340, "Member 'ABP_PlayerStart_HideoutFirstTime_C::CenterLightTimeline' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, Hatch) == 0x000348, "Member 'ABP_PlayerStart_HideoutFirstTime_C::Hatch' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, FacilitySpot_UGVConsole) == 0x000350, "Member 'ABP_PlayerStart_HideoutFirstTime_C::FacilitySpot_UGVConsole' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, FTUE_EventLighting_InitialyOff_Array) == 0x000358, "Member 'ABP_PlayerStart_HideoutFirstTime_C::FTUE_EventLighting_InitialyOff_Array' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, FTUE_EventLighting_InitialyOn_Array) == 0x000368, "Member 'ABP_PlayerStart_HideoutFirstTime_C::FTUE_EventLighting_InitialyOn_Array' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, InitialyOffDefaultValueMap) == 0x000378, "Member 'ABP_PlayerStart_HideoutFirstTime_C::InitialyOffDefaultValueMap' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, InitialyOnDefaultValueMap) == 0x0003C8, "Member 'ABP_PlayerStart_HideoutFirstTime_C::InitialyOnDefaultValueMap' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, EntranceLight) == 0x000418, "Member 'ABP_PlayerStart_HideoutFirstTime_C::EntranceLight' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, NS_InsectArray) == 0x000420, "Member 'ABP_PlayerStart_HideoutFirstTime_C::NS_InsectArray' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, LS_Active_UGV_FTUE) == 0x000430, "Member 'ABP_PlayerStart_HideoutFirstTime_C::LS_Active_UGV_FTUE' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, PP_HighExposure) == 0x000438, "Member 'ABP_PlayerStart_HideoutFirstTime_C::PP_HighExposure' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, AnimInstance) == 0x000440, "Member 'ABP_PlayerStart_HideoutFirstTime_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, CeilingLightArray) == 0x000448, "Member 'ABP_PlayerStart_HideoutFirstTime_C::CeilingLightArray' has a wrong offset!");
static_assert(offsetof(ABP_PlayerStart_HideoutFirstTime_C, PP_Dark) == 0x000458, "Member 'ABP_PlayerStart_HideoutFirstTime_C::PP_Dark' has a wrong offset!");

}

