#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PoisonCloud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PoisonCloud.BP_PoisonCloud_C.ExecuteUbergraph_BP_PoisonCloud
// 0x0148 (0x0148 - 0x0000)
struct BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMutationStage_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetShapeScale_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NewTargetLocation;                    // 0x0048(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledSphereRadius_ReturnValue;      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud) == 0x000008, "Wrong alignment on BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud");
static_assert(sizeof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud) == 0x000148, "Wrong size on BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, EntryPoint) == 0x000000, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, K2Node_DynamicCast_AsP2NPCharacter) == 0x000008, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_GetMutationStage_ReturnValue) == 0x000014, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_GetMutationStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_GetShapeScale_ReturnValue) == 0x000018, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_GetShapeScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_IsDedicatedServer_ReturnValue) == 0x00001C, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000029, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, K2Node_Event_NewTargetLocation) == 0x000048, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::K2Node_Event_NewTargetLocation' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000078, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_GetUnscaledSphereRadius_ReturnValue) == 0x000090, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_GetUnscaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Normal_ReturnValue) == 0x000098, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_VSize_ReturnValue) == 0x0000B0, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000D0, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000E0, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000F8, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Add_VectorVector_ReturnValue) == 0x000110, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000130, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000138, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x000140, "Member 'BP_PoisonCloud_C_ExecuteUbergraph_BP_PoisonCloud::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_PoisonCloud.BP_PoisonCloud_C.SetTargetLocation
// 0x0018 (0x0018 - 0x0000)
struct BP_PoisonCloud_C_SetTargetLocation final
{
public:
	struct FVector                                NewTargetLocation;                                 // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PoisonCloud_C_SetTargetLocation) == 0x000008, "Wrong alignment on BP_PoisonCloud_C_SetTargetLocation");
static_assert(sizeof(BP_PoisonCloud_C_SetTargetLocation) == 0x000018, "Wrong size on BP_PoisonCloud_C_SetTargetLocation");
static_assert(offsetof(BP_PoisonCloud_C_SetTargetLocation, NewTargetLocation) == 0x000000, "Member 'BP_PoisonCloud_C_SetTargetLocation::NewTargetLocation' has a wrong offset!");

}

