#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PoisonCloud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PoisonCloud.BP_PoisonCloud_C
// 0x0040 (0x0480 - 0x0440)
class ABP_PoisonCloud_C : public AAP2AoeZoneMovingLinear
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Collision;                                         // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        VFX_Scale_Multiplier;                              // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VFX_Scale_ParamName;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VFX_Lifetime_ParamName;                            // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PoisonCloud(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveReturnedToPool()	 // 0xae1e64;
	void ReceiveTakenFromPool()	 // 0xae1e64;
	void ResizeEffect()	 // 0xae1e64;
	void SetTargetLocation(const struct FVector& NewTargetLocation)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_PoisonCloud_C">();
	}
	static class ABP_PoisonCloud_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_PoisonCloud_C>();
	}
};
static_assert(alignof(ABP_PoisonCloud_C) == 0x000010, "Wrong alignment on ABP_PoisonCloud_C");
static_assert(sizeof(ABP_PoisonCloud_C) == 0x000480, "Wrong size on ABP_PoisonCloud_C");
static_assert(offsetof(ABP_PoisonCloud_C, UberGraphFrame) == 0x000440, "Member 'ABP_PoisonCloud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, Niagara) == 0x000448, "Member 'ABP_PoisonCloud_C::Niagara' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, Collision) == 0x000450, "Member 'ABP_PoisonCloud_C::Collision' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, Sphere) == 0x000458, "Member 'ABP_PoisonCloud_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, DefaultSceneRoot) == 0x000460, "Member 'ABP_PoisonCloud_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, VFX_Scale_Multiplier) == 0x000468, "Member 'ABP_PoisonCloud_C::VFX_Scale_Multiplier' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, VFX_Scale_ParamName) == 0x000470, "Member 'ABP_PoisonCloud_C::VFX_Scale_ParamName' has a wrong offset!");
static_assert(offsetof(ABP_PoisonCloud_C, VFX_Lifetime_ParamName) == 0x000478, "Member 'ABP_PoisonCloud_C::VFX_Lifetime_ParamName' has a wrong offset!");

}

