#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerStateExtensionFactions_Component

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerStateExtensionFactions_Component.BP_PlayerStateExtensionFactions_Component_C.AfterCodeValidation
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation final
{
public:
	class UP2Action*                              Action;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CodeValid;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation) == 0x000008, "Wrong alignment on BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation");
static_assert(sizeof(BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation) == 0x000010, "Wrong size on BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation, Action) == 0x000000, "Member 'BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation::Action' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation, CodeValid) == 0x000008, "Member 'BP_PlayerStateExtensionFactions_Component_C_AfterCodeValidation::CodeValid' has a wrong offset!");

// Function BP_PlayerStateExtensionFactions_Component.BP_PlayerStateExtensionFactions_Component_C.ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component
// 0x0068 (0x0068 - 0x0000)
struct BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Action*                              K2Node_CustomEvent_Action;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_CodeValid;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_Player_Controller;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Action*                              K2Node_CustomEvent_Action_1;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Keycode;                        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_KeypadCodeInterface_C> K2Node_DynamicCast_AsBP_Keypad_Code_Interface; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBP_KeypadCodeInterface_C> K2Node_DynamicCast_AsBP_Keypad_Code_Interface_1; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component) == 0x000008, "Wrong alignment on BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component");
static_assert(sizeof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component) == 0x000068, "Wrong size on BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, EntryPoint) == 0x000000, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_CustomEvent_Action) == 0x000008, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_CustomEvent_Action' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_CustomEvent_CodeValid) == 0x000010, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_CustomEvent_CodeValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_CustomEvent_Player_Controller) == 0x000018, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_CustomEvent_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_CustomEvent_Action_1) == 0x000020, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_CustomEvent_Action_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_CustomEvent_Keycode) == 0x000028, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_CustomEvent_Keycode' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_DynamicCast_AsBP_Keypad_Code_Interface) == 0x000038, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_DynamicCast_AsBP_Keypad_Code_Interface' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_DynamicCast_AsBP_Keypad_Code_Interface_1) == 0x000050, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_DynamicCast_AsBP_Keypad_Code_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_PlayerStateExtensionFactions_Component_C_ExecuteUbergraph_BP_PlayerStateExtensionFactions_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_PlayerStateExtensionFactions_Component.BP_PlayerStateExtensionFactions_Component_C.ValidateKeypadCode
// 0x0020 (0x0020 - 0x0000)
struct BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode final
{
public:
	class APlayerController*                      Player_Controller;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Action*                              Action;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 Keycode;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode) == 0x000008, "Wrong alignment on BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode");
static_assert(sizeof(BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode) == 0x000020, "Wrong size on BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode, Player_Controller) == 0x000000, "Member 'BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode::Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode, Action) == 0x000008, "Member 'BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode::Action' has a wrong offset!");
static_assert(offsetof(BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode, Keycode) == 0x000010, "Member 'BP_PlayerStateExtensionFactions_Component_C_ValidateKeypadCode::Keycode' has a wrong offset!");

}

