#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RaidNotification_Component

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "S_RaidNotification_Message_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RaidNotification_Component.BP_RaidNotification_Component_C.ExecuteUbergraph_BP_RaidNotification_Component
// 0x02D0 (0x02D0 - 0x0000)
struct BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSessionDifficultyWorld_ReturnValue;    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_GetRaidElapsedTime_ReturnValue;           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_RaidNotification_Message            K2Node_MakeStruct_S_RaidNotification_Message;      // 0x0118(0x0018)(NoDestructor, HasGetValueTypeHash)
	class AP2GameMode_Raid*                       K2Node_DynamicCast_AsP2Game_Mode_Raid;             // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_RaidNotification_Message            CallFunc_Array_Get_Item;                           // 0x0148(0x0018)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRaidRemainingTime_ReturnValue;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_RaidNotification_Message            K2Node_MakeStruct_S_RaidNotification_Message_1;    // 0x0170(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchStarted_ReturnValue;              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_RaidNotification_Message            CallFunc_Array_Get_Item_1;                         // 0x0190(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable_1;                            // 0x01B0(0x00F0)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_GetSessionDifficultyWorld_ReturnValue_1;  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component) == 0x000008, "Wrong alignment on BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component");
static_assert(sizeof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component) == 0x0002D0, "Wrong size on BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, EntryPoint) == 0x000000, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GetSessionDifficultyWorld_ReturnValue) == 0x000008, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GetSessionDifficultyWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_struct_Variable) == 0x000018, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GetRaidElapsedTime_ReturnValue) == 0x000108, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GetRaidElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, K2Node_MakeStruct_S_RaidNotification_Message) == 0x000118, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::K2Node_MakeStruct_S_RaidNotification_Message' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, K2Node_DynamicCast_AsP2Game_Mode_Raid) == 0x000130, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::K2Node_DynamicCast_AsP2Game_Mode_Raid' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_int_Loop_Counter_Variable_1) == 0x00013C, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Add_IntInt_ReturnValue_1) == 0x000140, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GetRaidRemainingTime_ReturnValue) == 0x000160, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GetRaidRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Array_Length_ReturnValue) == 0x000164, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000169, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, K2Node_MakeStruct_S_RaidNotification_Message_1) == 0x000170, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::K2Node_MakeStruct_S_RaidNotification_Message_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_HasMatchStarted_ReturnValue) == 0x000188, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_HasMatchStarted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Array_Get_Item_1) == 0x000190, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Array_Length_ReturnValue_1) == 0x0001A8, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001AC, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001AD, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001AE, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, Temp_struct_Variable_1) == 0x0001B0, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GetSessionDifficultyWorld_ReturnValue_1) == 0x0002A0, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GetSessionDifficultyWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0002A4, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, K2Node_CreateDelegate_OutputDelegate) == 0x0002A8, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0002C0, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002C8, "Member 'BP_RaidNotification_Component_C_ExecuteUbergraph_BP_RaidNotification_Component::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

