#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Enter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ResearchRequirement_Enter_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ResearchRequirement_Enter_C_BP_Initialize");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_BP_Initialize) == 0x000001, "Wrong size on BP_ResearchRequirement_Enter_C_BP_Initialize");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.ClearListensEvents
// 0x0030 (0x0030 - 0x0000)
struct BP_ResearchRequirement_Enter_C_ClearListensEvents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAsyncAction_ListenForGameplayMessage*> CallFunc_Map_Values_Values;                 // 0x0010(0x0010)(ReferenceParm)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_ClearListensEvents) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Enter_C_ClearListensEvents");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_ClearListensEvents) == 0x000030, "Wrong size on BP_ResearchRequirement_Enter_C_ClearListensEvents");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, CallFunc_Map_Values_Values) == 0x000010, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ClearListensEvents, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_ResearchRequirement_Enter_C_ClearListensEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.ExecuteUbergraph_BP_ResearchRequirement_Enter
// 0x01F0 (0x01F0 - 0x0000)
struct BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable;                              // 0x0030(0x0098)()
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Temp_struct_Variable_2;                            // 0x00E8(0x0098)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0180(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidInstigator_Valid;                  // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeRequirementState               CallFunc_GetState_ReturnValue;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter) == 0x0001F0, "Wrong size on BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, EntryPoint) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000004, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_int_Variable) == 0x000018, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_struct_Variable) == 0x000030, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_object_Variable) == 0x0000C8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_struct_Variable_1) == 0x0000D0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_GetPayload_ReturnValue) == 0x0000D8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_int_Variable_1) == 0x0000DC, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, K2Node_Event_InFirstInitialization) == 0x0000E0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, Temp_struct_Variable_2) == 0x0000E8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000180, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Array_Get_Item) == 0x000190, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x0001A0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_IsValid_ReturnValue) == 0x0001A9, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_IsValidInstigator_Valid) == 0x0001AA, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_IsValidInstigator_Valid' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_MatchesTag_ReturnValue) == 0x0001AB, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_MatchesTag_ReturnValue_1) == 0x0001AC, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, K2Node_CustomEvent_ProxyObject) == 0x0001B0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, K2Node_CustomEvent_ActualChannel) == 0x0001B8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_GetState_ReturnValue) == 0x0001C8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001C9, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001CC, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001DC, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001E0, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001E4, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0001E8, "Member 'BP_ResearchRequirement_Enter_C_ExecuteUbergraph_BP_ResearchRequirement_Enter::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.IsValidInstigator
// 0x0020 (0x0020 - 0x0000)
struct BP_ResearchRequirement_Enter_C_IsValidInstigator final
{
public:
	class UObject*                                Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_IsValidInstigator) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Enter_C_IsValidInstigator");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_IsValidInstigator) == 0x000020, "Wrong size on BP_ResearchRequirement_Enter_C_IsValidInstigator");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_IsValidInstigator, Actor) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_IsValidInstigator::Actor' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_IsValidInstigator, Valid) == 0x000008, "Member 'BP_ResearchRequirement_Enter_C_IsValidInstigator::Valid' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_IsValidInstigator, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_Enter_C_IsValidInstigator::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_IsValidInstigator, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_ResearchRequirement_Enter_C_IsValidInstigator::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4
// 0x0010 (0x0010 - 0x0000)
struct BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4) == 0x000010, "Wrong size on BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4, ProxyObject) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4, ActualChannel) == 0x000008, "Member 'BP_ResearchRequirement_Enter_C_OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4::ActualChannel' has a wrong offset!");

// Function BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C.ShouldInitializeOnlyHideout
// 0x0001 (0x0001 - 0x0000)
struct BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout) == 0x000001, "Wrong alignment on BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout");
static_assert(sizeof(BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout) == 0x000001, "Wrong size on BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout");
static_assert(offsetof(BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout, ReturnValue) == 0x000000, "Member 'BP_ResearchRequirement_Enter_C_ShouldInitializeOnlyHideout::ReturnValue' has a wrong offset!");

}

