#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_ResearchNode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchRequirement_ResearchNode.BP_ResearchRequirement_ResearchNode_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ResearchRequirement_ResearchNode_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_ResearchNode_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ResearchRequirement_ResearchNode_C_BP_Initialize");
static_assert(sizeof(BP_ResearchRequirement_ResearchNode_C_BP_Initialize) == 0x000001, "Wrong size on BP_ResearchRequirement_ResearchNode_C_BP_Initialize");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ResearchRequirement_ResearchNode_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ResearchRequirement_ResearchNode.BP_ResearchRequirement_ResearchNode_C.CustomEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_ResearchRequirement_ResearchNode_C_CustomEvent final
{
public:
	const class UP2Research*                      InResearch;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchNode*                        InResearchNode;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeState                          InNewState;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeState                          InOldState;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_ResearchNode_C_CustomEvent) == 0x000008, "Wrong alignment on BP_ResearchRequirement_ResearchNode_C_CustomEvent");
static_assert(sizeof(BP_ResearchRequirement_ResearchNode_C_CustomEvent) == 0x000018, "Wrong size on BP_ResearchRequirement_ResearchNode_C_CustomEvent");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_CustomEvent, InResearch) == 0x000000, "Member 'BP_ResearchRequirement_ResearchNode_C_CustomEvent::InResearch' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_CustomEvent, InResearchNode) == 0x000008, "Member 'BP_ResearchRequirement_ResearchNode_C_CustomEvent::InResearchNode' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_CustomEvent, InNewState) == 0x000010, "Member 'BP_ResearchRequirement_ResearchNode_C_CustomEvent::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_CustomEvent, InOldState) == 0x000011, "Member 'BP_ResearchRequirement_ResearchNode_C_CustomEvent::InOldState' has a wrong offset!");

// Function BP_ResearchRequirement_ResearchNode.BP_ResearchRequirement_ResearchNode_C.ExecuteUbergraph_BP_ResearchRequirement_ResearchNode
// 0x0050 (0x0050 - 0x0000)
struct BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ResearchNode*                        CallFunc_GetOwningResearchNode_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PlayerStateExtensionResearch*        CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchNode*                        CallFunc_GetResearchNodeWithData_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeState                          CallFunc_GetState_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class UP2Research* InResearch, class UP2ResearchNode* InResearchNode, EP2ResearchNodeState InNewState, EP2ResearchNodeState InOldState)> K2Node_CreateDelegate_OutputDelegate; // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2Research*                      K2Node_CustomEvent_InResearch;                     // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ResearchNode*                        K2Node_CustomEvent_InResearchNode;                 // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeState                          K2Node_CustomEvent_InNewState;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeState                          K2Node_CustomEvent_InOldState;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode) == 0x000008, "Wrong alignment on BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode");
static_assert(sizeof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode) == 0x000050, "Wrong size on BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, EntryPoint) == 0x000000, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_Event_InFirstInitialization) == 0x000004, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_GetOwningResearchNode_ReturnValue) == 0x000008, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_GetOwningResearchNode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_GetOwningPlayerStateExtensionResearch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_GetResearchNodeWithData_ReturnValue) == 0x000018, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_GetResearchNodeWithData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_GetState_ReturnValue) == 0x000020, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000034, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_CustomEvent_InResearch) == 0x000038, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_CustomEvent_InResearch' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_CustomEvent_InResearchNode) == 0x000040, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_CustomEvent_InResearchNode' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_CustomEvent_InNewState) == 0x000048, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_CustomEvent_InNewState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, K2Node_CustomEvent_InOldState) == 0x000049, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::K2Node_CustomEvent_InOldState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004A, "Member 'BP_ResearchRequirement_ResearchNode_C_ExecuteUbergraph_BP_ResearchRequirement_ResearchNode::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchRequirement_ResearchNode.BP_ResearchRequirement_ResearchNode_C.GetObjectiveTitle
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_GetObjectiveTitle_ReturnValue;            // 0x0018(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle) == 0x000008, "Wrong alignment on BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle");
static_assert(sizeof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle) == 0x0000B0, "Wrong size on BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, ReturnValue) == 0x000000, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, CallFunc_GetObjectiveTitle_ReturnValue) == 0x000018, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::CallFunc_GetObjectiveTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BP_ResearchRequirement_ResearchNode_C_GetObjectiveTitle::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ResearchRequirement_ResearchNode.BP_ResearchRequirement_ResearchNode_C.GetResearchNodeData
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData final
{
public:
	const class UP2ResearchNodeData*              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData) == 0x000008, "Wrong alignment on BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData");
static_assert(sizeof(BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData) == 0x000008, "Wrong size on BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData");
static_assert(offsetof(BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData, ReturnValue) == 0x000000, "Member 'BP_ResearchRequirement_ResearchNode_C_GetResearchNodeData::ReturnValue' has a wrong offset!");

}

