#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Kill

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResearchRequirement_Kill.BP_ResearchRequirement_Kill_C
// 0x0050 (0x00B8 - 0x0068)
class UBP_ResearchRequirement_Kill_C final : public UP2ResearchNodeRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         TargetNum;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EnemyTag;                                          // 0x0074(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentNum;                                        // 0x007C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InstigatorTag;                                     // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  AdditionalInstigatorTags;                          // 0x0088(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           TargetTag;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AcceptAssistAsKill;                                // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddKill()	 // 0xae1e64;
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Reset()	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FP2VerbMessage& Message)	 // 0xae1e64;
	void CREATEDELEGATE_PROXYFUNCTION_1(const struct FP2VerbMessage& Message)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ResearchRequirement_Kill(int32 EntryPoint)	 // 0xae1e64;
	void OnKillMessageReceived(const struct FP2VerbMessage& P2VerbMessage)	 // 0xae1e64;

	EP2ContractRequirementCompleteCondition GetCompleteCondition() const	 // 0xae1e64;
	class FText GetCount() const	 // 0xae1e64;
	int32 GetCurrentCompletionCount() const	 // 0xae1e64;
	int32 GetRequiredCompletionCount() const	 // 0xae1e64;
	void IsValidKill(class UObject* InKilled, const struct FGameplayTagContainer& InInstigatorTags, const struct FGameplayTagContainer& InTargetTags, bool* Valid) const	 // 0xae1e64;
	void IsValidKiller(class UObject* InInstigator, bool* Valid) const	 // 0xae1e64;
	bool ShouldInitializeOnlyHideout() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ResearchRequirement_Kill_C">();
	}
	static class UBP_ResearchRequirement_Kill_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ResearchRequirement_Kill_C>();
	}
};
static_assert(alignof(UBP_ResearchRequirement_Kill_C) == 0x000008, "Wrong alignment on UBP_ResearchRequirement_Kill_C");
static_assert(sizeof(UBP_ResearchRequirement_Kill_C) == 0x0000B8, "Wrong size on UBP_ResearchRequirement_Kill_C");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, UberGraphFrame) == 0x000068, "Member 'UBP_ResearchRequirement_Kill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, TargetNum) == 0x000070, "Member 'UBP_ResearchRequirement_Kill_C::TargetNum' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, EnemyTag) == 0x000074, "Member 'UBP_ResearchRequirement_Kill_C::EnemyTag' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, CurrentNum) == 0x00007C, "Member 'UBP_ResearchRequirement_Kill_C::CurrentNum' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, InstigatorTag) == 0x000080, "Member 'UBP_ResearchRequirement_Kill_C::InstigatorTag' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, AdditionalInstigatorTags) == 0x000088, "Member 'UBP_ResearchRequirement_Kill_C::AdditionalInstigatorTags' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, TargetTag) == 0x0000A8, "Member 'UBP_ResearchRequirement_Kill_C::TargetTag' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Kill_C, AcceptAssistAsKill) == 0x0000B0, "Member 'UBP_ResearchRequirement_Kill_C::AcceptAssistAsKill' has a wrong offset!");

}

