#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RadarDish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RadarDish.BP_RadarDish_C
// 0x0080 (0x0330 - 0x02B0)
class ABP_RadarDish_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Light_Plane;                                    // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Plane1;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01c;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b7;                                 // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b6;                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b5;                                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b4;                                 // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b3;                                 // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b2;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b1;                                 // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01b;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2AkAmbientComponent*                  P2AkAmbient;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01;                                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_RadarDish_01_Base_01;                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ExecuteUbergraph_BP_RadarDish(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_RadarDish_C">();
	}
	static class ABP_RadarDish_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_RadarDish_C>();
	}
};
static_assert(alignof(ABP_RadarDish_C) == 0x000008, "Wrong alignment on ABP_RadarDish_C");
static_assert(sizeof(ABP_RadarDish_C) == 0x000330, "Wrong size on ABP_RadarDish_C");
static_assert(offsetof(ABP_RadarDish_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_RadarDish_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_Light_Plane) == 0x0002B8, "Member 'ABP_RadarDish_C::SM_Light_Plane' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_Light_Plane1) == 0x0002C0, "Member 'ABP_RadarDish_C::SM_Light_Plane1' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01c) == 0x0002C8, "Member 'ABP_RadarDish_C::SM_RadarDish_01c' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b7) == 0x0002D0, "Member 'ABP_RadarDish_C::SM_RadarDish_01b7' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b6) == 0x0002D8, "Member 'ABP_RadarDish_C::SM_RadarDish_01b6' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b5) == 0x0002E0, "Member 'ABP_RadarDish_C::SM_RadarDish_01b5' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b4) == 0x0002E8, "Member 'ABP_RadarDish_C::SM_RadarDish_01b4' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b3) == 0x0002F0, "Member 'ABP_RadarDish_C::SM_RadarDish_01b3' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b2) == 0x0002F8, "Member 'ABP_RadarDish_C::SM_RadarDish_01b2' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b1) == 0x000300, "Member 'ABP_RadarDish_C::SM_RadarDish_01b1' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01b) == 0x000308, "Member 'ABP_RadarDish_C::SM_RadarDish_01b' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, P2AkAmbient) == 0x000310, "Member 'ABP_RadarDish_C::P2AkAmbient' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01) == 0x000318, "Member 'ABP_RadarDish_C::SM_RadarDish_01' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, SM_RadarDish_01_Base_01) == 0x000320, "Member 'ABP_RadarDish_C::SM_RadarDish_01_Base_01' has a wrong offset!");
static_assert(offsetof(ABP_RadarDish_C, DefaultSceneRoot) == 0x000328, "Member 'ABP_RadarDish_C::DefaultSceneRoot' has a wrong offset!");

}

