#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rock_Prefab_Large_03a

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rock_Prefab_Large_03a.BP_Rock_Prefab_Large_03a_C
// 0x0030 (0x0378 - 0x0348)
class ABP_Rock_Prefab_Large_03a_C final : public APackedLevelActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh2;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh1;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh2;               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh1;               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Rock_Prefab_Large_03a_C">();
	}
	static class ABP_Rock_Prefab_Large_03a_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Rock_Prefab_Large_03a_C>();
	}
};
static_assert(alignof(ABP_Rock_Prefab_Large_03a_C) == 0x000008, "Wrong alignment on ABP_Rock_Prefab_Large_03a_C");
static_assert(sizeof(ABP_Rock_Prefab_Large_03a_C) == 0x000378, "Wrong size on ABP_Rock_Prefab_Large_03a_C");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, InstancedStaticMesh2) == 0x000348, "Member 'ABP_Rock_Prefab_Large_03a_C::InstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, InstancedStaticMesh1) == 0x000350, "Member 'ABP_Rock_Prefab_Large_03a_C::InstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, InstancedStaticMesh) == 0x000358, "Member 'ABP_Rock_Prefab_Large_03a_C::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, HierarchicalInstancedStaticMesh2) == 0x000360, "Member 'ABP_Rock_Prefab_Large_03a_C::HierarchicalInstancedStaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, HierarchicalInstancedStaticMesh1) == 0x000368, "Member 'ABP_Rock_Prefab_Large_03a_C::HierarchicalInstancedStaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Prefab_Large_03a_C, HierarchicalInstancedStaticMesh) == 0x000370, "Member 'ABP_Rock_Prefab_Large_03a_C::HierarchicalInstancedStaticMesh' has a wrong offset!");

}

