#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Contract

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ResearchRequirement_Contract_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ResearchRequirement_Contract_C_BP_Initialize");
static_assert(sizeof(BP_ResearchRequirement_Contract_C_BP_Initialize) == 0x000001, "Wrong size on BP_ResearchRequirement_Contract_C_BP_Initialize");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ResearchRequirement_Contract_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C.ContractStateChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_ResearchRequirement_Contract_C_ContractStateChanged final
{
public:
	class UP2Faction*                             InFaction;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            InContract;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InNewState;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InOldState;                                        // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Contract_C_ContractStateChanged) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Contract_C_ContractStateChanged");
static_assert(sizeof(BP_ResearchRequirement_Contract_C_ContractStateChanged) == 0x000018, "Wrong size on BP_ResearchRequirement_Contract_C_ContractStateChanged");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ContractStateChanged, InFaction) == 0x000000, "Member 'BP_ResearchRequirement_Contract_C_ContractStateChanged::InFaction' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ContractStateChanged, InContract) == 0x000008, "Member 'BP_ResearchRequirement_Contract_C_ContractStateChanged::InContract' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ContractStateChanged, InNewState) == 0x000010, "Member 'BP_ResearchRequirement_Contract_C_ContractStateChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ContractStateChanged, InOldState) == 0x000011, "Member 'BP_ResearchRequirement_Contract_C_ContractStateChanged::InOldState' has a wrong offset!");

// Function BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C.ExecuteUbergraph_BP_ResearchRequirement_Contract
// 0x00C0 (0x00C0 - 0x0000)
struct BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            K2Node_CustomEvent_InContract_1;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InNewState_1;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InOldState_1;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionFactions*        CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeRequirementState               Temp_byte_Variable;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Faction*                             K2Node_CustomEvent_InFaction;                      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            K2Node_CustomEvent_InContract;                     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InNewState;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_CustomEvent_InOldState;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)> K2Node_CreateDelegate_OutputDelegate; // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class AP2PlayerState*                   K2Node_CustomEvent_InPlayerState;                  // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Contract*                            CallFunc_GetFactionContractFromAll_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              CallFunc_GetState_ReturnValue;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionFactions*        CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue_1; // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeRequirementState               Temp_byte_Variable_1;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ResearchNodeRequirementState               K2Node_Select_Default;                             // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract");
static_assert(sizeof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract) == 0x0000C0, "Wrong size on BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, EntryPoint) == 0x000000, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_Event_InFirstInitialization) == 0x000005, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_Event_InFirstInitialization' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InContract_1) == 0x000008, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InContract_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InNewState_1) == 0x000010, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InNewState_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InOldState_1) == 0x000011, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InOldState_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000018, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_DynamicCast_AsP2Player_State) == 0x000028, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue) == 0x000038, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_3) == 0x000041, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, Temp_byte_Variable) == 0x000043, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_4) == 0x000044, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InFaction) == 0x000048, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InFaction' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InContract) == 0x000050, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InContract' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InNewState) == 0x000058, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InNewState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InOldState) == 0x000059, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InOldState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, Temp_bool_Variable) == 0x00006C, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CustomEvent_InPlayerState) == 0x000080, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CustomEvent_InPlayerState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000098, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetFactionContractFromAll_ReturnValue) == 0x0000A0, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetFactionContractFromAll_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000A8, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetState_ReturnValue) == 0x0000A9, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x0000AA, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000AB, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue_1) == 0x0000B0, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_GetOwningPlayerStateExtensionFactions_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_5) == 0x0000B8, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, CallFunc_IsValid_ReturnValue_6) == 0x0000B9, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, Temp_byte_Variable_1) == 0x0000BA, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract, K2Node_Select_Default) == 0x0000BB, "Member 'BP_ResearchRequirement_Contract_C_ExecuteUbergraph_BP_ResearchRequirement_Contract::K2Node_Select_Default' has a wrong offset!");

// Function BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C.OnContractStateChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_ResearchRequirement_Contract_C_OnContractStateChanged final
{
public:
	class UP2Contract*                            InContract;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InNewState;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              InOldState;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Contract_C_OnContractStateChanged) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Contract_C_OnContractStateChanged");
static_assert(sizeof(BP_ResearchRequirement_Contract_C_OnContractStateChanged) == 0x000010, "Wrong size on BP_ResearchRequirement_Contract_C_OnContractStateChanged");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_OnContractStateChanged, InContract) == 0x000000, "Member 'BP_ResearchRequirement_Contract_C_OnContractStateChanged::InContract' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_OnContractStateChanged, InNewState) == 0x000008, "Member 'BP_ResearchRequirement_Contract_C_OnContractStateChanged::InNewState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_OnContractStateChanged, InOldState) == 0x000009, "Member 'BP_ResearchRequirement_Contract_C_OnContractStateChanged::InOldState' has a wrong offset!");

// Function BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C.OnHideoutExtensionLodaded
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded");
static_assert(sizeof(BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded) == 0x000008, "Wrong size on BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded");
static_assert(offsetof(BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded, InPlayerState) == 0x000000, "Member 'BP_ResearchRequirement_Contract_C_OnHideoutExtensionLodaded::InPlayerState' has a wrong offset!");

}

