#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RockBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ERockType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RockBase.BP_RockBase_C
// 0x0060 (0x0320 - 0x02C0)
class ABP_RockBase_C : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          UseCustomPrimitiveData;                            // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Approved_rocks;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ERockType                                     Rock_Type;                                         // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MossAmount;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                ChildrenComponents;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              RockBP_MattReset;                                  // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UseRVT;                                            // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOverrideMaterials;                              // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MossyCheck;                                        // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_313[0x5];                                      // 0x0313(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StrataFallof;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript()	 // 0xae1e64;
	void SetRockVisuals(TArray<class USceneComponent*>& SceneComponentArray, float TilingRockGradientIndex, float MacroBaseColorGradientIndex, float MacroGrungeGradientIndex, double Use_Strata, double Use_Leaks, double Strata_Gradient_Index, double Leaks_Gradient_Index)	 // 0xae1e64;
	void SetCustomPrimitiveData()	 // 0xae1e64;
	void SearchAndSetMaterial(class UMeshComponent* StaticMeshComponent_0, ERockType Rock_Type_To_Set, const class FString& SearchString)	 // 0xae1e64;
	void RunAllRockFunctions()	 // 0xae1e64;
	void ExecuteUbergraph_BP_RockBase(int32 EntryPoint)	 // 0xae1e64;
	void ClearOverridesAndSetRVT()	 // 0xae1e64;
	void Assign_Proper_Materials()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_RockBase_C">();
	}
	static class ABP_RockBase_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_RockBase_C>();
	}
};
static_assert(alignof(ABP_RockBase_C) == 0x000008, "Wrong alignment on ABP_RockBase_C");
static_assert(sizeof(ABP_RockBase_C) == 0x000320, "Wrong size on ABP_RockBase_C");
static_assert(offsetof(ABP_RockBase_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_RockBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, UseCustomPrimitiveData) == 0x0002C8, "Member 'ABP_RockBase_C::UseCustomPrimitiveData' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, Approved_rocks) == 0x0002D0, "Member 'ABP_RockBase_C::Approved_rocks' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, Rock_Type) == 0x0002E0, "Member 'ABP_RockBase_C::Rock_Type' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, MossAmount) == 0x0002E8, "Member 'ABP_RockBase_C::MossAmount' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, ChildrenComponents) == 0x0002F0, "Member 'ABP_RockBase_C::ChildrenComponents' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, RockBP_MattReset) == 0x000300, "Member 'ABP_RockBase_C::RockBP_MattReset' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, UseRVT) == 0x000310, "Member 'ABP_RockBase_C::UseRVT' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, UseOverrideMaterials) == 0x000311, "Member 'ABP_RockBase_C::UseOverrideMaterials' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, MossyCheck) == 0x000312, "Member 'ABP_RockBase_C::MossyCheck' has a wrong offset!");
static_assert(offsetof(ABP_RockBase_C, StrataFallof) == 0x000318, "Member 'ABP_RockBase_C::StrataFallof' has a wrong offset!");

}

