#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchReward_SkinCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchReward_SkinCustomization.BP_ResearchReward_SkinCustomization_C.BP_AddReward
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchReward_SkinCustomization_C_BP_AddReward final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_SkinCustomization_C_BP_AddReward) == 0x000008, "Wrong alignment on BP_ResearchReward_SkinCustomization_C_BP_AddReward");
static_assert(sizeof(BP_ResearchReward_SkinCustomization_C_BP_AddReward) == 0x000008, "Wrong size on BP_ResearchReward_SkinCustomization_C_BP_AddReward");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_BP_AddReward, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SkinCustomization_C_BP_AddReward::InPlayerController' has a wrong offset!");

// Function BP_ResearchReward_SkinCustomization.BP_ResearchReward_SkinCustomization_C.ExecuteUbergraph_BP_ResearchReward_SkinCustomization
// 0x0060 (0x0060 - 0x0000)
struct BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Reward_Asset_by_Type_bSuccess;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_InPlayerController;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2SkinSlotPreset*>              K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2ItemSkinContainer*>           K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ConstParm, ReferenceParm)
};
static_assert(alignof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization) == 0x000008, "Wrong alignment on BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization");
static_assert(sizeof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization) == 0x000060, "Wrong size on BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, EntryPoint) == 0x000000, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, CallFunc_Get_Reward_Asset_by_Type_bSuccess) == 0x000004, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::CallFunc_Get_Reward_Asset_by_Type_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset) == 0x000008, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset) == 0x000010, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, K2Node_Event_InPlayerController) == 0x000018, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::K2Node_Event_InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, K2Node_DynamicCast_AsP2Player_Controller) == 0x000028, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, K2Node_MakeArray_Array) == 0x000038, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization, K2Node_MakeArray_Array_1) == 0x000050, "Member 'BP_ResearchReward_SkinCustomization_C_ExecuteUbergraph_BP_ResearchReward_SkinCustomization::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function BP_ResearchReward_SkinCustomization.BP_ResearchReward_SkinCustomization_C.GetDisplayIcon
// 0x0088 (0x0088 - 0x0000)
struct BP_ResearchReward_SkinCustomization_C_GetDisplayIcon final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetDisplayIcon_ReturnValue;               // 0x0038(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Reward_Asset_by_Type_bSuccess;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon) == 0x000008, "Wrong alignment on BP_ResearchReward_SkinCustomization_C_GetDisplayIcon");
static_assert(sizeof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon) == 0x000088, "Wrong size on BP_ResearchReward_SkinCustomization_C_GetDisplayIcon");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_GetDisplayIcon_ReturnValue) == 0x000038, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_GetDisplayIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_Get_Reward_Asset_by_Type_bSuccess) == 0x000068, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_Get_Reward_Asset_by_Type_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset) == 0x000070, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset) == 0x000078, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetDisplayIcon, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'BP_ResearchReward_SkinCustomization_C_GetDisplayIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchReward_SkinCustomization.BP_ResearchReward_SkinCustomization_C.GetFormattedText
// 0x0138 (0x0138 - 0x0000)
struct BP_ResearchReward_SkinCustomization_C_GetFormattedText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_Get_Reward_Asset_by_Type_bSuccess;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0120(0x0018)()
};
static_assert(alignof(BP_ResearchReward_SkinCustomization_C_GetFormattedText) == 0x000008, "Wrong alignment on BP_ResearchReward_SkinCustomization_C_GetFormattedText");
static_assert(sizeof(BP_ResearchReward_SkinCustomization_C_GetFormattedText) == 0x000138, "Wrong size on BP_ResearchReward_SkinCustomization_C_GetFormattedText");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_Get_Reward_Asset_by_Type_bSuccess) == 0x000020, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_Get_Reward_Asset_by_Type_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset) == 0x000028, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_Get_Reward_Asset_by_Type_OutSkinDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset) == 0x000030, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_Get_Reward_Asset_by_Type_OutColorDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, K2Node_MakeArray_Array) == 0x000098, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, K2Node_MakeArray_Array_1) == 0x000110, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_GetFormattedText, CallFunc_Format_ReturnValue_1) == 0x000120, "Member 'BP_ResearchReward_SkinCustomization_C_GetFormattedText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchReward_SkinCustomization.BP_ResearchReward_SkinCustomization_C.Get Reward Asset by Type
// 0x0040 (0x0040 - 0x0000)
struct BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type final
{
public:
	class UPrimaryDataAsset*                      InRewardAsset;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   OutSkinDataAsset;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      OutColorDataAsset;                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      K2Node_DynamicCast_AsP2Skin_Slot_Preset;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   K2Node_DynamicCast_AsP2Item_Skin_Container;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type) == 0x000008, "Wrong alignment on BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type");
static_assert(sizeof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type) == 0x000040, "Wrong size on BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, InRewardAsset) == 0x000000, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::InRewardAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, bSuccess) == 0x000008, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, OutSkinDataAsset) == 0x000010, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::OutSkinDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, OutColorDataAsset) == 0x000018, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::OutColorDataAsset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, K2Node_DynamicCast_AsP2Skin_Slot_Preset) == 0x000020, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::K2Node_DynamicCast_AsP2Skin_Slot_Preset' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, K2Node_DynamicCast_AsP2Item_Skin_Container) == 0x000030, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::K2Node_DynamicCast_AsP2Item_Skin_Container' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_ResearchReward_SkinCustomization_C_Get_Reward_Asset_by_Type::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

