#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Contract

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResearchRequirement_Contract.BP_ResearchRequirement_Contract_C
// 0x0098 (0x0100 - 0x0068)
class UBP_ResearchRequirement_Contract_C final : public UP2ResearchNodeRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnerInsideLocation;                             // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeSpent;                                         // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AP2HeroCharacter*>               InstigatorsInsideLocation;                         // 0x0088(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<struct FGameplayTag, class UAsyncAction_ListenForGameplayMessage*> AsyncActions;            // 0x0098(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UP2ContractData*                        Contract_Data;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              WantedContractState;                               // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Contract*                            Required_Cached_Contract;                          // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ContractStateChanged(class UP2Faction* InFaction, class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ResearchRequirement_Contract(int32 EntryPoint)	 // 0xae1e64;
	void OnContractStateChanged(class UP2Contract* InContract, EP2ContractState InNewState, EP2ContractState InOldState)	 // 0xae1e64;
	void OnHideoutExtensionLodaded(const class AP2PlayerState* InPlayerState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ResearchRequirement_Contract_C">();
	}
	static class UBP_ResearchRequirement_Contract_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ResearchRequirement_Contract_C>();
	}
};
static_assert(alignof(UBP_ResearchRequirement_Contract_C) == 0x000008, "Wrong alignment on UBP_ResearchRequirement_Contract_C");
static_assert(sizeof(UBP_ResearchRequirement_Contract_C) == 0x000100, "Wrong size on UBP_ResearchRequirement_Contract_C");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, UberGraphFrame) == 0x000068, "Member 'UBP_ResearchRequirement_Contract_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, Async_Action) == 0x000070, "Member 'UBP_ResearchRequirement_Contract_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, IsOwnerInsideLocation) == 0x000078, "Member 'UBP_ResearchRequirement_Contract_C::IsOwnerInsideLocation' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, TimeSpent) == 0x000080, "Member 'UBP_ResearchRequirement_Contract_C::TimeSpent' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, InstigatorsInsideLocation) == 0x000088, "Member 'UBP_ResearchRequirement_Contract_C::InstigatorsInsideLocation' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, AsyncActions) == 0x000098, "Member 'UBP_ResearchRequirement_Contract_C::AsyncActions' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, Contract_Data) == 0x0000E8, "Member 'UBP_ResearchRequirement_Contract_C::Contract_Data' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, WantedContractState) == 0x0000F0, "Member 'UBP_ResearchRequirement_Contract_C::WantedContractState' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Contract_C, Required_Cached_Contract) == 0x0000F8, "Member 'UBP_ResearchRequirement_Contract_C::Required_Cached_Contract' has a wrong offset!");

}

