#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RadarDish

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RadarDish.BP_RadarDish_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RadarDish_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RadarDish_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RadarDish_C_ReceiveTick");
static_assert(sizeof(BP_RadarDish_C_ReceiveTick) == 0x000004, "Wrong size on BP_RadarDish_C_ReceiveTick");
static_assert(offsetof(BP_RadarDish_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RadarDish_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_RadarDish.BP_RadarDish_C.ExecuteUbergraph_BP_RadarDish
// 0x0140 (0x0140 - 0x0000)
struct BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sin_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0050(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish) == 0x000008, "Wrong alignment on BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish");
static_assert(sizeof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish) == 0x000140, "Wrong size on BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, EntryPoint) == 0x000000, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_GetTimeSeconds_ReturnValue) == 0x000008, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_Sin_ReturnValue) == 0x000018, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000050, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000138, "Member 'BP_RadarDish_C_ExecuteUbergraph_BP_RadarDish::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

}

