#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchReward_DroneMod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.BP_AddReward
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchReward_DroneMod_C_BP_AddReward final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_BP_AddReward) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_BP_AddReward");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_BP_AddReward) == 0x000008, "Wrong size on BP_ResearchReward_DroneMod_C_BP_AddReward");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_BP_AddReward, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_BP_AddReward::InPlayerController' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.ExecuteUbergraph_BP_ResearchReward_DroneMod
// 0x0020 (0x0020 - 0x0000)
struct BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_InPlayerController;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod) == 0x000020, "Wrong size on BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod, EntryPoint) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod, K2Node_Event_InPlayerController) == 0x000008, "Member 'BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod::K2Node_Event_InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000010, "Member 'BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ResearchReward_DroneMod_C_ExecuteUbergraph_BP_ResearchReward_DroneMod::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.GetAccessFacilityText
// 0x0020 (0x0020 - 0x0000)
struct BP_ResearchReward_DroneMod_C_GetAccessFacilityText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_GetAccessFacilityText) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_GetAccessFacilityText");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_GetAccessFacilityText) == 0x000020, "Wrong size on BP_ResearchReward_DroneMod_C_GetAccessFacilityText");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetAccessFacilityText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_GetAccessFacilityText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetAccessFacilityText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_DroneMod_C_GetAccessFacilityText::ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.GetDisplayIcon
// 0x0078 (0x0078 - 0x0000)
struct BP_ResearchReward_DroneMod_C_GetDisplayIcon final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetDisplayIcon_ReturnValue;               // 0x0038(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UP2ItemData*                            CallFunc_GetDroneModItemDataByTag_OutItemData;     // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_GetDisplayIcon) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_GetDisplayIcon");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_GetDisplayIcon) == 0x000078, "Wrong size on BP_ResearchReward_DroneMod_C_GetDisplayIcon");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDisplayIcon, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_GetDisplayIcon::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDisplayIcon, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_DroneMod_C_GetDisplayIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDisplayIcon, CallFunc_GetDisplayIcon_ReturnValue) == 0x000038, "Member 'BP_ResearchReward_DroneMod_C_GetDisplayIcon::CallFunc_GetDisplayIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDisplayIcon, CallFunc_GetDroneModItemDataByTag_OutItemData) == 0x000068, "Member 'BP_ResearchReward_DroneMod_C_GetDisplayIcon::CallFunc_GetDroneModItemDataByTag_OutItemData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDisplayIcon, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_ResearchReward_DroneMod_C_GetDisplayIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.GetFormattedText
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ResearchReward_DroneMod_C_GetFormattedText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class UP2ItemData*                            CallFunc_GetDroneModItemDataByTag_OutItemData;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_GetFormattedText) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_GetFormattedText");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_GetFormattedText) == 0x0000A8, "Wrong size on BP_ResearchReward_DroneMod_C_GetFormattedText");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, CallFunc_GetDroneModItemDataByTag_OutItemData) == 0x000020, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::CallFunc_GetDroneModItemDataByTag_OutItemData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, K2Node_MakeArray_Array) == 0x000080, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetFormattedText, CallFunc_Format_ReturnValue) == 0x000090, "Member 'BP_ResearchReward_DroneMod_C_GetFormattedText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.GetRewardContextTag
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchReward_DroneMod_C_GetRewardContextTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_GetRewardContextTag) == 0x000004, "Wrong alignment on BP_ResearchReward_DroneMod_C_GetRewardContextTag");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_GetRewardContextTag) == 0x000008, "Wrong size on BP_ResearchReward_DroneMod_C_GetRewardContextTag");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetRewardContextTag, ReturnValue) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_GetRewardContextTag::ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_DroneMod.BP_ResearchReward_DroneMod_C.GetDroneModItemDataByTag
// 0x0050 (0x0050 - 0x0000)
struct BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InDroneModTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UP2ItemData*                            OutItemData;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            CallFunc_FindFacilityActorWorld_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility_Drone*                      K2Node_DynamicCast_AsP2Facility_Drone;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2DroneModUnlockedStatus              CallFunc_FindDroneMod_OutDroneModUnlockedStatus;   // 0x0034(0x000C)(NoDestructor)
	bool                                          CallFunc_FindDroneMod_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemData*                            CallFunc_FindItemDataByTag_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag) == 0x000008, "Wrong alignment on BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag");
static_assert(sizeof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag) == 0x000050, "Wrong size on BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, InDroneModTag) == 0x000008, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::InDroneModTag' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, OutItemData) == 0x000010, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::OutItemData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000018, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, CallFunc_FindFacilityActorWorld_ReturnValue) == 0x000020, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::CallFunc_FindFacilityActorWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, K2Node_DynamicCast_AsP2Facility_Drone) == 0x000028, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::K2Node_DynamicCast_AsP2Facility_Drone' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, CallFunc_FindDroneMod_OutDroneModUnlockedStatus) == 0x000034, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::CallFunc_FindDroneMod_OutDroneModUnlockedStatus' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, CallFunc_FindDroneMod_ReturnValue) == 0x000040, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::CallFunc_FindDroneMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag, CallFunc_FindItemDataByTag_ReturnValue) == 0x000048, "Member 'BP_ResearchReward_DroneMod_C_GetDroneModItemDataByTag::CallFunc_FindItemDataByTag_ReturnValue' has a wrong offset!");

}

