#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchReward_StoreUnlock

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.BP_AddReward
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_BP_AddReward final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_BP_AddReward) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_BP_AddReward");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_BP_AddReward) == 0x000008, "Wrong size on BP_ResearchReward_StoreUnlock_C_BP_AddReward");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_BP_AddReward, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_BP_AddReward::InPlayerController' has a wrong offset!");

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.ExecuteUbergraph_BP_ResearchReward_StoreUnlock
// 0x0028 (0x0028 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ResearchNodeData*                    CallFunc_GetResearchNodeData_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_InPlayerController;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidDataRegistryId_ReturnValue;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock) == 0x000028, "Wrong size on BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, EntryPoint) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, CallFunc_GetResearchNodeData_ReturnValue) == 0x000008, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::CallFunc_GetResearchNodeData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, K2Node_Event_InPlayerController) == 0x000010, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::K2Node_Event_InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000018, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock, CallFunc_IsValidDataRegistryId_ReturnValue) == 0x000021, "Member 'BP_ResearchReward_StoreUnlock_C_ExecuteUbergraph_BP_ResearchReward_StoreUnlock::CallFunc_IsValidDataRegistryId_ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.GetAccessFacilityText
// 0x0318 (0x0318 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	struct FP2FactionStoreDataRow                 FactionStoreRow;                                   // 0x0020(0x00E0)(Edit, BlueprintVisible)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0110(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0190(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0018)()
	const class UP2FactionData*                   CallFunc_GetFactionData_ReturnValue;               // 0x0208(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0218(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0268(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0278(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0290(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x02E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x02F8(0x0018)()
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue;  // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue_1; // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText) == 0x000318, "Wrong size on BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, FactionStoreRow) == 0x000020, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::FactionStoreRow' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeArray_Array) == 0x000100, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_MakeLiteralText_ReturnValue) == 0x000110, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_Format_ReturnValue) == 0x000128, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeStruct_FormatArgumentData) == 0x000140, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000190, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_Format_ReturnValue_1) == 0x0001F0, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_GetFactionData_ReturnValue) == 0x000208, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_GetFactionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000218, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeArray_Array_2) == 0x000268, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_Format_ReturnValue_2) == 0x000278, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000290, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_GetCachedItemBP_ReturnValue) == 0x0002E0, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_GetCachedItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, K2Node_MakeArray_Array_3) == 0x0002E8, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_Format_ReturnValue_3) == 0x0002F8, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_EqualEqual_DataRegistryType_ReturnValue) == 0x000310, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_EqualEqual_DataRegistryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText, CallFunc_EqualEqual_DataRegistryType_ReturnValue_1) == 0x000311, "Member 'BP_ResearchReward_StoreUnlock_C_GetAccessFacilityText::CallFunc_EqualEqual_DataRegistryType_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.GetDisplayIcon
// 0x01F8 (0x01F8 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_GetDisplayIcon final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash)
	struct FP2FactionStoreDataRow                 FactionStoreDataRow;                               // 0x0038(0x00E0)(Edit, BlueprintVisible)
	struct FP2GeneralStoreDataRow                 GeneralStoreDataRow;                               // 0x0118(0x00D8)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue;  // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue_1; // 0x01F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue_1;            // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidDataRegistryId_ReturnValue;        // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_GetDisplayIcon");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon) == 0x0001F8, "Wrong size on BP_ResearchReward_StoreUnlock_C_GetDisplayIcon");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, FactionStoreDataRow) == 0x000038, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::FactionStoreDataRow' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, GeneralStoreDataRow) == 0x000118, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::GeneralStoreDataRow' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_GetCachedItemBP_ReturnValue) == 0x0001F0, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_GetCachedItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_IsValid_ReturnValue) == 0x0001F1, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_EqualEqual_DataRegistryType_ReturnValue) == 0x0001F2, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_EqualEqual_DataRegistryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_EqualEqual_DataRegistryType_ReturnValue_1) == 0x0001F3, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_EqualEqual_DataRegistryType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_GetCachedItemBP_ReturnValue_1) == 0x0001F4, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_GetCachedItemBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_IsValid_ReturnValue_1) == 0x0001F5, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetDisplayIcon, CallFunc_IsValidDataRegistryId_ReturnValue) == 0x0001F6, "Member 'BP_ResearchReward_StoreUnlock_C_GetDisplayIcon::CallFunc_IsValidDataRegistryId_ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.GetFormattedText
// 0x0350 (0x0350 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_GetFormattedText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	struct FP2FactionStoreDataRow                 FactionStoreRow;                                   // 0x0020(0x00E0)(Edit, BlueprintVisible)
	struct FP2GeneralStoreDataRow                 GeneralStoreRow;                                   // 0x0100(0x00D8)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x01E0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0200(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0228(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0240(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0290(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02A8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x02B8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0308(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0320(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0330(0x0018)()
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue;  // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue_1; // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidDataRegistryId_ReturnValue;        // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue_1;            // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_GetFormattedText) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_GetFormattedText");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_GetFormattedText) == 0x000350, "Wrong size on BP_ResearchReward_StoreUnlock_C_GetFormattedText");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, FactionStoreRow) == 0x000020, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::FactionStoreRow' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, GeneralStoreRow) == 0x000100, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::GeneralStoreRow' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, Temp_bool_Variable) == 0x0001D8, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, Temp_text_Variable) == 0x0001E0, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, Temp_bool_Variable_1) == 0x0001F8, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, Temp_text_Variable_1) == 0x000200, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Greater_IntInt_ReturnValue) == 0x00021C, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Array_Length_ReturnValue_1) == 0x000220, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000224, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_Select_Default) == 0x000228, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData) == 0x000240, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_Select_Default_1) == 0x000290, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_MakeArray_Array) == 0x0002A8, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0002B8, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Format_ReturnValue) == 0x000308, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, K2Node_MakeArray_Array_1) == 0x000320, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_Format_ReturnValue_1) == 0x000330, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_GetCachedItemBP_ReturnValue) == 0x000348, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_GetCachedItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_EqualEqual_DataRegistryType_ReturnValue) == 0x000349, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_EqualEqual_DataRegistryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_EqualEqual_DataRegistryType_ReturnValue_1) == 0x00034A, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_EqualEqual_DataRegistryType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_IsValidDataRegistryId_ReturnValue) == 0x00034B, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_IsValidDataRegistryId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetFormattedText, CallFunc_GetCachedItemBP_ReturnValue_1) == 0x00034C, "Member 'BP_ResearchReward_StoreUnlock_C_GetFormattedText::CallFunc_GetCachedItemBP_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C.GetRequiredLevelText
// 0x0450 (0x0450 - 0x0000)
struct BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	struct FP2FactionStoreDataRow                 FactionStoreRow;                                   // 0x0020(0x00E0)(Edit, BlueprintVisible)
	struct FP2GeneralStoreDataRow                 GeneralStoreRow;                                   // 0x0100(0x00D8)(Edit, BlueprintVisible)
	struct FP2FactionLevelData                    CallFunc_GetFactionLevelForTag_OutFactionLevel;    // 0x01D8(0x00F8)()
	bool                                          CallFunc_GetFactionLevelForTag_ReturnValue;        // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0340(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0390(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03A8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x03B8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0408(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0420(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0430(0x0018)()
	bool                                          CallFunc_GetCachedItemBP_ReturnValue;              // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue;  // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DataRegistryType_ReturnValue_1; // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCachedItemBP_ReturnValue_1;            // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidDataRegistryId_ReturnValue;        // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText) == 0x000008, "Wrong alignment on BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText");
static_assert(sizeof(BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText) == 0x000450, "Wrong size on BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_StoreUnlock_C_GetRequiredLevelText::ReturnValue' has a wrong offset!");
