#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Enter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResearchRequirement_Enter.BP_ResearchRequirement_Enter_C
// 0x0090 (0x00F8 - 0x0068)
class UBP_ResearchRequirement_Enter_C final : public UP2ResearchNodeRequirement
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  LocationTargetTag;                                 // 0x0070(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeSpentRequirement;                              // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CompletedTimerHandle;                              // 0x0098(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class UAsyncAction_ListenForGameplayMessage*> AsyncActions;            // 0x00A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NumInsideLocations;                                // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_Initialize(bool InFirstInitialization)	 // 0xae1e64;
	void BP_Uninitialize()	 // 0xae1e64;
	void ClearListensEvents()	 // 0xae1e64;
	void ExecuteUbergraph_BP_ResearchRequirement_Enter(int32 EntryPoint)	 // 0xae1e64;
	void IsValidInstigator(class UObject* Actor, bool* Valid)	 // 0xae1e64;
	void OnMessageReceived_2B59B5BE47D6153516E1C2A9E8F867E4(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnTimeCompleted()	 // 0xae1e64;

	bool ShouldInitializeOnlyHideout() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ResearchRequirement_Enter_C">();
	}
	static class UBP_ResearchRequirement_Enter_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ResearchRequirement_Enter_C>();
	}
};
static_assert(alignof(UBP_ResearchRequirement_Enter_C) == 0x000008, "Wrong alignment on UBP_ResearchRequirement_Enter_C");
static_assert(sizeof(UBP_ResearchRequirement_Enter_C) == 0x0000F8, "Wrong size on UBP_ResearchRequirement_Enter_C");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, UberGraphFrame) == 0x000068, "Member 'UBP_ResearchRequirement_Enter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, LocationTargetTag) == 0x000070, "Member 'UBP_ResearchRequirement_Enter_C::LocationTargetTag' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, TimeSpentRequirement) == 0x000090, "Member 'UBP_ResearchRequirement_Enter_C::TimeSpentRequirement' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, CompletedTimerHandle) == 0x000098, "Member 'UBP_ResearchRequirement_Enter_C::CompletedTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, AsyncActions) == 0x0000A0, "Member 'UBP_ResearchRequirement_Enter_C::AsyncActions' has a wrong offset!");
static_assert(offsetof(UBP_ResearchRequirement_Enter_C, NumInsideLocations) == 0x0000F0, "Member 'UBP_ResearchRequirement_Enter_C::NumInsideLocations' has a wrong offset!");

}

