#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchReward_SalvageRecipies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchReward_SalvageRecipies.BP_ResearchReward_SalvageRecipies_C.GetAccessFacilityText
// 0x0020 (0x0020 - 0x0000)
struct BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText) == 0x000008, "Wrong alignment on BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText");
static_assert(sizeof(BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText) == 0x000020, "Wrong size on BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SalvageRecipies_C_GetAccessFacilityText::ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_SalvageRecipies.BP_ResearchReward_SalvageRecipies_C.GetFormattedText
// 0x0188 (0x0188 - 0x0000)
struct BP_ResearchReward_SalvageRecipies_C_GetFormattedText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes; // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingDataRow                     CallFunc_GetCraftingDataRow_ReturnValue;           // 0x0048(0x00C0)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0110(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
};
static_assert(alignof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText) == 0x000008, "Wrong alignment on BP_ResearchReward_SalvageRecipies_C_GetFormattedText");
static_assert(sizeof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText) == 0x000188, "Wrong size on BP_ResearchReward_SalvageRecipies_C_GetFormattedText");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000020, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_GetProductionRecipesById_OutProductionRecipes) == 0x000030, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_GetProductionRecipesById_OutProductionRecipes' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000044, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_Greater_IntInt_ReturnValue) == 0x000045, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_GetCraftingDataRow_ReturnValue) == 0x000048, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_GetCraftingDataRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000108, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, K2Node_MakeStruct_FormatArgumentData) == 0x000110, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, K2Node_MakeArray_Array) == 0x000160, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetFormattedText, CallFunc_Format_ReturnValue) == 0x000170, "Member 'BP_ResearchReward_SalvageRecipies_C_GetFormattedText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_ResearchReward_SalvageRecipies.BP_ResearchReward_SalvageRecipies_C.GetRequiredLevelText
// 0x0280 (0x0280 - 0x0000)
struct BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	class AP2PlayerController_Hideout*            K2Node_DynamicCast_AsP2Player_Controller_Hideout;  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2ExchangeDataInfo>            CallFunc_GetProductionRecipesById_OutProductionRecipes; // 0x0030(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2CraftingRecipeRow                   CallFunc_GetCraftingRecipeRow_ReturnValue;         // 0x0048(0x0138)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0208(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0268(0x0018)()
};
static_assert(alignof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText) == 0x000008, "Wrong alignment on BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText");
static_assert(sizeof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText) == 0x000280, "Wrong size on BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, InPlayerController) == 0x000000, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_DynamicCast_AsP2Player_Controller_Hideout) == 0x000020, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_DynamicCast_AsP2Player_Controller_Hideout' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_GetProductionRecipesById_OutProductionRecipes) == 0x000030, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_GetProductionRecipesById_OutProductionRecipes' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_GetCraftingRecipeRow_ReturnValue) == 0x000048, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_GetCraftingRecipeRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_Greater_IntInt_ReturnValue) == 0x000180, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000188, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_MakeArray_Array) == 0x0001E0, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000208, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, K2Node_MakeArray_Array_1) == 0x000258, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText, CallFunc_Format_ReturnValue_1) == 0x000268, "Member 'BP_ResearchReward_SalvageRecipies_C_GetRequiredLevelText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function BP_ResearchReward_SalvageRecipies.BP_ResearchReward_SalvageRecipies_C.IsGroupRecipies
// 0x000C (0x000C - 0x0000)
struct BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies final
{
public:
	bool                                          IsGroupRecipies_0;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies) == 0x000004, "Wrong alignment on BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies");
static_assert(sizeof(BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies) == 0x00000C, "Wrong size on BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies, IsGroupRecipies_0) == 0x000000, "Member 'BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies::IsGroupRecipies_0' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResearchReward_SalvageRecipies_C_IsGroupRecipies::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

