#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rock_Pile_Large_01

#include "Basic.hpp"

#include "BP_RockBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rock_Pile_Large_01.BP_Rock_Pile_Large_01_C
// 0x00F0 (0x0410 - 0x0320)
class ABP_Rock_Pile_Large_01_C final : public ABP_RockBase_C
{
public:
	class UStaticMeshComponent*                   SM_Rock_Large_192_StaticMeshComponent0;            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_191_StaticMeshComponent0;            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_190_StaticMeshComponent0;            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_193_StaticMeshComponent0;            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_189_StaticMeshComponent0;            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_188_StaticMeshComponent0;            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_187_StaticMeshComponent0;            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_186_StaticMeshComponent0;            // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Medium_129_StaticMeshComponent0;           // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Medium_128_StaticMeshComponent0;           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_194_StaticMeshComponent0;            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_197_StaticMeshComponent0;            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_196_StaticMeshComponent0;            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_195_StaticMeshComponent0;            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_178_StaticMeshComponent0;            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_176_StaticMeshComponent0;            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_175_StaticMeshComponent0;            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_174_StaticMeshComponent0;            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_173_StaticMeshComponent0;            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_172_StaticMeshComponent0;            // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_171_StaticMeshComponent0;            // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_170_StaticMeshComponent0;            // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_177_StaticMeshComponent0;            // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_184_StaticMeshComponent0;            // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_183_StaticMeshComponent0;            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_182_StaticMeshComponent0;            // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_181_StaticMeshComponent0;            // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_180_StaticMeshComponent0;            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_179_StaticMeshComponent0;            // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rock_Large_185_StaticMeshComponent0;            // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Rock_Pile_Large_01_C">();
	}
	static class ABP_Rock_Pile_Large_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Rock_Pile_Large_01_C>();
	}
};
static_assert(alignof(ABP_Rock_Pile_Large_01_C) == 0x000008, "Wrong alignment on ABP_Rock_Pile_Large_01_C");
static_assert(sizeof(ABP_Rock_Pile_Large_01_C) == 0x000410, "Wrong size on ABP_Rock_Pile_Large_01_C");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_192_StaticMeshComponent0) == 0x000320, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_192_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_191_StaticMeshComponent0) == 0x000328, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_191_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_190_StaticMeshComponent0) == 0x000330, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_190_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_193_StaticMeshComponent0) == 0x000338, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_193_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_189_StaticMeshComponent0) == 0x000340, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_189_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_188_StaticMeshComponent0) == 0x000348, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_188_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_187_StaticMeshComponent0) == 0x000350, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_187_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_186_StaticMeshComponent0) == 0x000358, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_186_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Medium_129_StaticMeshComponent0) == 0x000360, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Medium_129_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Medium_128_StaticMeshComponent0) == 0x000368, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Medium_128_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_194_StaticMeshComponent0) == 0x000370, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_194_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_197_StaticMeshComponent0) == 0x000378, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_197_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_196_StaticMeshComponent0) == 0x000380, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_196_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_195_StaticMeshComponent0) == 0x000388, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_195_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_178_StaticMeshComponent0) == 0x000390, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_178_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_176_StaticMeshComponent0) == 0x000398, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_176_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_175_StaticMeshComponent0) == 0x0003A0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_175_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_174_StaticMeshComponent0) == 0x0003A8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_174_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_173_StaticMeshComponent0) == 0x0003B0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_173_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_172_StaticMeshComponent0) == 0x0003B8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_172_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_171_StaticMeshComponent0) == 0x0003C0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_171_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_170_StaticMeshComponent0) == 0x0003C8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_170_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_177_StaticMeshComponent0) == 0x0003D0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_177_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_184_StaticMeshComponent0) == 0x0003D8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_184_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_183_StaticMeshComponent0) == 0x0003E0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_183_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_182_StaticMeshComponent0) == 0x0003E8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_182_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_181_StaticMeshComponent0) == 0x0003F0, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_181_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_180_StaticMeshComponent0) == 0x0003F8, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_180_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_179_StaticMeshComponent0) == 0x000400, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_179_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_Rock_Pile_Large_01_C, SM_Rock_Large_185_StaticMeshComponent0) == 0x000408, "Member 'ABP_Rock_Pile_Large_01_C::SM_Rock_Large_185_StaticMeshComponent0' has a wrong offset!");

}

