#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchRequirement_Collect

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.BindEventsPlayerEquipment
// 0x0028 (0x0028 - 0x0000)
struct BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment final
{
public:
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment) == 0x000028, "Wrong size on BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment, K2Node_DynamicCast_AsP2Hero_Character) == 0x000018, "Member 'BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_BindEventsPlayerEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.BindEventsStash
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ResearchRequirement_Collect_C_BindEventsStash final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate_1; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_2; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetStashActors_ReturnValue;               // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_BindEventsStash) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_BindEventsStash");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_BindEventsStash) == 0x0000A8, "Wrong size on BP_ResearchRequirement_Collect_C_BindEventsStash");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000040, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_AsP2Player_Controller) == 0x000048, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_GetPlayerStateExtensionHideout_ReturnValue) == 0x000058, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_GetPlayerStateExtensionHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_GetStashActors_ReturnValue) == 0x000060, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_GetStashActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_AsP2Facility_Stash) == 0x000080, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_AsP2Facility_Stash' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_Array_Length_ReturnValue) == 0x00008C, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_AsP2Player_State) == 0x000098, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BindEventsStash, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_ResearchRequirement_Collect_C_BindEventsStash::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.BP_Initialize
// 0x0001 (0x0001 - 0x0000)
struct BP_ResearchRequirement_Collect_C_BP_Initialize final
{
public:
	bool                                          InFirstInitialization;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_BP_Initialize) == 0x000001, "Wrong alignment on BP_ResearchRequirement_Collect_C_BP_Initialize");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_BP_Initialize) == 0x000001, "Wrong size on BP_ResearchRequirement_Collect_C_BP_Initialize");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_BP_Initialize, InFirstInitialization) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_BP_Initialize::InFirstInitialization' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.ExecuteUbergraph_BP_ResearchRequirement_Collect
// 0x0008 (0x0008 - 0x0000)
struct BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InFirstInitialization;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect) == 0x000004, "Wrong alignment on BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect) == 0x000008, "Wrong size on BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect, EntryPoint) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect, K2Node_Event_InFirstInitialization) == 0x000004, "Member 'BP_ResearchRequirement_Collect_C_ExecuteUbergraph_BP_ResearchRequirement_Collect::K2Node_Event_InFirstInitialization' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.OnFinishActivateInitialExtentions
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetStashActors_ReturnValue;               // 0x0068(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions) == 0x0000A8, "Wrong size on BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, InPlayerState) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::InPlayerState' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000048, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_AsP2Player_Controller) == 0x000050, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_GetPlayerStateExtensionHideout_ReturnValue) == 0x000060, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_GetPlayerStateExtensionHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_GetStashActors_ReturnValue) == 0x000068, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_GetStashActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_AsP2Facility_Stash) == 0x000088, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_AsP2Facility_Stash' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_Less_IntInt_ReturnValue) == 0x000091, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, CallFunc_IsValid_ReturnValue) == 0x000092, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_AsP2Player_State) == 0x000098, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_ResearchRequirement_Collect_C_OnFinishActivateInitialExtentions::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.OnItemChanged
// 0x0030 (0x0030 - 0x0000)
struct BP_ResearchRequirement_Collect_C_OnItemChanged final
{
public:
	const class UP2Item*                          InItemInstigator;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInAdded;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InStackDelta;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_OnItemChanged) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_OnItemChanged");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_OnItemChanged) == 0x000030, "Wrong size on BP_ResearchRequirement_Collect_C_OnItemChanged");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, InItemInstigator) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::InItemInstigator' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, bInAdded) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::bInAdded' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, InStackDelta) == 0x00000C, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::InStackDelta' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_SelectInt_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_IsItemPureStackable_ReturnValue) == 0x000014, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_GetItemData_ReturnValue) == 0x000018, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, Temp_bool_Variable) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, K2Node_Select_Default) == 0x000024, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnItemChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_ResearchRequirement_Collect_C_OnItemChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.OnStashActorsChanged
// 0x0020 (0x0020 - 0x0000)
struct BP_ResearchRequirement_Collect_C_OnStashActorsChanged final
{
public:
	class AP2FacilitySpot*                        FacilitySpot;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            Facility;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_OnStashActorsChanged");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged) == 0x000020, "Wrong size on BP_ResearchRequirement_Collect_C_OnStashActorsChanged");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged, FacilitySpot) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_OnStashActorsChanged::FacilitySpot' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged, Facility) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_OnStashActorsChanged::Facility' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged, K2Node_DynamicCast_AsP2Facility_Stash) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_OnStashActorsChanged::K2Node_DynamicCast_AsP2Facility_Stash' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_OnStashActorsChanged, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ResearchRequirement_Collect_C_OnStashActorsChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.UnbindEventsPlayerEquipment
// 0x0028 (0x0028 - 0x0000)
struct BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment final
{
public:
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment) == 0x000028, "Wrong size on BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment, CallFunc_GetOwningPawn_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment, K2Node_DynamicCast_AsP2Hero_Character) == 0x000018, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsPlayerEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.UnbindEventsStash
// 0x00A8 (0x00A8 - 0x0000)
struct BP_ResearchRequirement_Collect_C_UnbindEventsStash final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetStashActors_ReturnValue;               // 0x0010(0x0010)(ReferenceParm)
	TDelegate<void(const class AP2PlayerState* InPlayerState)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* FacilitySpot, class AP2Facility* Facility)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UP2Item* InItemInstigator, bool bInAdded, int32 InStackDelta)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PlayerStateExtensionHideout*         CallFunc_GetPlayerStateExtensionHideout_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         K2Node_DynamicCast_AsP2Player_State;               // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_UnbindEventsStash) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_UnbindEventsStash");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_UnbindEventsStash) == 0x0000A8, "Wrong size on BP_ResearchRequirement_Collect_C_UnbindEventsStash");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_GetStashActors_ReturnValue) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_GetStashActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_AsP2Facility_Stash) == 0x000040, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_AsP2Facility_Stash' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x000078, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_AsP2Player_Controller) == 0x000080, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_GetPlayerStateExtensionHideout_ReturnValue) == 0x000090, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_GetPlayerStateExtensionHideout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_AsP2Player_State) == 0x000098, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_AsP2Player_State' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UnbindEventsStash, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'BP_ResearchRequirement_Collect_C_UnbindEventsStash::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ResearchRequirement_Collect.BP_ResearchRequirement_Collect_C.UpdateNumItems
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ResearchRequirement_Collect_C_UpdateNumItems final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetStashActors_ReturnValue;               // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilityStash*                       K2Node_DynamicCast_AsP2Facility_Stash;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Container*                           CallFunc_GetContainer_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Item*>                        CallFunc_GetItemsOfType_OutItems;                  // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetItemsOfType_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Item*                                CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemStackAmount_ReturnValue;           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPawn_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Item*>                        CallFunc_GetItemsWithData_OutItems;                // 0x00B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Item*                                CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemStackAmount_ReturnValue_1;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsItemPureStackable_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ResearchRequirement_Collect_C_UpdateNumItems) == 0x000008, "Wrong alignment on BP_ResearchRequirement_Collect_C_UpdateNumItems");
static_assert(sizeof(BP_ResearchRequirement_Collect_C_UpdateNumItems) == 0x0000F0, "Wrong size on BP_ResearchRequirement_Collect_C_UpdateNumItems");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Array_Index_Variable_1) == 0x00000C, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Array_Index_Variable_2) == 0x000018, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000020, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetStashActors_ReturnValue) == 0x000028, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetStashActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, K2Node_DynamicCast_AsP2Facility_Stash) == 0x000048, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::K2Node_DynamicCast_AsP2Facility_Stash' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetContainer_ReturnValue) == 0x000058, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetItemsOfType_OutItems) == 0x000060, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetItemsOfType_OutItems' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetItemsOfType_ReturnValue) == 0x000070, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetItemsOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetItemStackAmount_ReturnValue) == 0x000084, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetItemStackAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_IsItemPureStackable_ReturnValue) == 0x000088, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_IsItemPureStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, Temp_int_Loop_Counter_Variable_2) == 0x00008C, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_SelectInt_ReturnValue) == 0x000090, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Add_IntInt_ReturnValue_2) == 0x000094, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x000098, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_Add_IntInt_ReturnValue_3) == 0x00009C, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, CallFunc_GetOwningPawn_ReturnValue) == 0x0000A0, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::CallFunc_GetOwningPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ResearchRequirement_Collect_C_UpdateNumItems, K2Node_DynamicCast_AsP2Hero_Character) == 0x0000A8, "Member 'BP_ResearchRequirement_Collect_C_UpdateNumItems::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
