#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ResearchReward_StoreUnlock

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ResearchReward_StoreUnlock.BP_ResearchReward_StoreUnlock_C
// 0x0030 (0x0090 - 0x0060)
class UBP_ResearchReward_StoreUnlock_C final : public UP2ResearchNodeRewardBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FDataRegistryId                        StoreRowUnlock;                                    // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   FormatText;                                        // 0x0078(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_AddReward(class APlayerController* InPlayerController)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ResearchReward_StoreUnlock(int32 EntryPoint)	 // 0xae1e64;
	class FText GetAccessFacilityText(class APlayerController* InPlayerController)	 // 0xae1e64;
	TSoftObjectPtr<class UTexture2D> GetDisplayIcon(class APlayerController* InPlayerController)	 // 0xae1e64;
	class FText GetFormattedText(class APlayerController* InPlayerController)	 // 0xae1e64;
	class FText GetRequiredLevelText(class APlayerController* InPlayerController)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ResearchReward_StoreUnlock_C">();
	}
	static class UBP_ResearchReward_StoreUnlock_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_ResearchReward_StoreUnlock_C>();
	}
};
static_assert(alignof(UBP_ResearchReward_StoreUnlock_C) == 0x000008, "Wrong alignment on UBP_ResearchReward_StoreUnlock_C");
static_assert(sizeof(UBP_ResearchReward_StoreUnlock_C) == 0x000090, "Wrong size on UBP_ResearchReward_StoreUnlock_C");
static_assert(offsetof(UBP_ResearchReward_StoreUnlock_C, UberGraphFrame) == 0x000060, "Member 'UBP_ResearchReward_StoreUnlock_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ResearchReward_StoreUnlock_C, StoreRowUnlock) == 0x000068, "Member 'UBP_ResearchReward_StoreUnlock_C::StoreRowUnlock' has a wrong offset!");
static_assert(offsetof(UBP_ResearchReward_StoreUnlock_C, FormatText) == 0x000078, "Member 'UBP_ResearchReward_StoreUnlock_C::FormatText' has a wrong offset!");

}

