#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RenderActor_Item

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_RenderActor_Item.BP_RenderActor_Item_C.ExecuteUbergraph_BP_RenderActor_Item
// 0x0210 (0x0210 - 0x0000)
struct BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTargetRotation_ReturnValue;            // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item) == 0x000008, "Wrong alignment on BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item");
static_assert(sizeof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item) == 0x000210, "Wrong size on BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, EntryPoint) == 0x000000, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_GetTargetRotation_ReturnValue) == 0x000008, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_GetTargetRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_GetForwardVector_ReturnValue) == 0x000038, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000050, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000068, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000080, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000098, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Normal_ReturnValue) == 0x0000F8, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000110, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000128, "Member 'BP_RenderActor_Item_C_ExecuteUbergraph_BP_RenderActor_Item::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function BP_RenderActor_Item.BP_RenderActor_Item_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RenderActor_Item_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RenderActor_Item_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RenderActor_Item_C_ReceiveTick");
static_assert(sizeof(BP_RenderActor_Item_C_ReceiveTick) == 0x000004, "Wrong size on BP_RenderActor_Item_C_ReceiveTick");
static_assert(offsetof(BP_RenderActor_Item_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RenderActor_Item_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

