#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmokeGrenade_VFX_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SmokeGrenade_VFX_Base.BP_SmokeGrenade_VFX_Base_C
// 0x0038 (0x0080 - 0x0048)
class UBP_SmokeGrenade_VFX_Base_C : public UP2ThrowableEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystem*                         Leak_FX;                                           // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Trail_FX;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   Socket_Name;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeactivationDelay;                                 // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      LeakComponent;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TrailComponent;                                    // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SmokeGrenade_VFX_Base(int32 EntryPoint)	 // 0xae1e64;
	void HandleCustomEvent(class FName Type)	 // 0xae1e64;
	void HandleCustomEventWithFloat(class FName Type, float Value)	 // 0xae1e64;
	void HandleGenericEvent(EP2ThrowableVisualEventType Type)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_SmokeGrenade_VFX_Base_C">();
	}
	static class UBP_SmokeGrenade_VFX_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_SmokeGrenade_VFX_Base_C>();
	}
};
static_assert(alignof(UBP_SmokeGrenade_VFX_Base_C) == 0x000008, "Wrong alignment on UBP_SmokeGrenade_VFX_Base_C");
static_assert(sizeof(UBP_SmokeGrenade_VFX_Base_C) == 0x000080, "Wrong size on UBP_SmokeGrenade_VFX_Base_C");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, UberGraphFrame) == 0x000048, "Member 'UBP_SmokeGrenade_VFX_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, Leak_FX) == 0x000050, "Member 'UBP_SmokeGrenade_VFX_Base_C::Leak_FX' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, Trail_FX) == 0x000058, "Member 'UBP_SmokeGrenade_VFX_Base_C::Trail_FX' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, Socket_Name) == 0x000060, "Member 'UBP_SmokeGrenade_VFX_Base_C::Socket_Name' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, DeactivationDelay) == 0x000068, "Member 'UBP_SmokeGrenade_VFX_Base_C::DeactivationDelay' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, LeakComponent) == 0x000070, "Member 'UBP_SmokeGrenade_VFX_Base_C::LeakComponent' has a wrong offset!");
static_assert(offsetof(UBP_SmokeGrenade_VFX_Base_C, TrailComponent) == 0x000078, "Member 'UBP_SmokeGrenade_VFX_Base_C::TrailComponent' has a wrong offset!");

}

