#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMoveActor_Ladder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_SplineMoveActor_Ladder_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMoveActor_Ladder_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_SplineMoveActor_Ladder_C_UserConstructionScript");
static_assert(sizeof(BP_SplineMoveActor_Ladder_C_UserConstructionScript) == 0x000002, "Wrong size on BP_SplineMoveActor_Ladder_C_UserConstructionScript");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_SplineMoveActor_Ladder_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000001, "Member 'BP_SplineMoveActor_Ladder_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C.HandleActionComp
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SplineMoveActor_Ladder_C_HandleActionComp final
{
public:
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0010(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SplineMoveActor_Ladder_C_HandleActionComp) == 0x000010, "Wrong alignment on BP_SplineMoveActor_Ladder_C_HandleActionComp");
static_assert(sizeof(BP_SplineMoveActor_Ladder_C_HandleActionComp) == 0x0001D0, "Wrong size on BP_SplineMoveActor_Ladder_C_HandleActionComp");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_GetSplineLength_ReturnValue) == 0x000000, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000010, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000B8, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_HandleActionComp, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000E8, "Member 'BP_SplineMoveActor_Ladder_C_HandleActionComp::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C.CreateStepElements
// 0x06A0 (0x06A0 - 0x0000)
struct BP_SplineMoveActor_Ladder_C_CreateStepElements final
{
public:
	int32                                         CurrentIndex;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastIndex;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CurrentTransform;                                  // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StepCurrent;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReversed_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default_1;                           // 0x00B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0180(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_1;            // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMod_Remainder;                           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0390(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x03F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x0450(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0510(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0530(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0xF];                                      // 0x0591(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_SelectTransform_ReturnValue_1;            // 0x05A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0600(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x0668(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x067B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMoveActor_Ladder_C_CreateStepElements) == 0x000010, "Wrong alignment on BP_SplineMoveActor_Ladder_C_CreateStepElements");
static_assert(sizeof(BP_SplineMoveActor_Ladder_C_CreateStepElements) == 0x0006A0, "Wrong size on BP_SplineMoveActor_Ladder_C_CreateStepElements");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CurrentIndex) == 0x000000, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CurrentIndex' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, LastIndex) == 0x000004, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::LastIndex' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CurrentTransform) == 0x000010, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CurrentTransform' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, StepCurrent) == 0x000070, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::StepCurrent' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, Temp_int_Variable) == 0x000078, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_IsReversed_ReturnValue) == 0x000080, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_IsReversed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_AddInstance_ReturnValue) == 0x000084, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_AddInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, Temp_bool_Variable) == 0x000088, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000089, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000090, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, Temp_bool_Variable_1) == 0x000098, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000099, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, K2Node_Select_Default) == 0x0000A0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, K2Node_Select_Default_1) == 0x0000B0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SetStaticMesh_ReturnValue) == 0x000110, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_ComposeTransforms_ReturnValue) == 0x000120, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000180, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000268, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_GetSplineLength_ReturnValue) == 0x00026C, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000270, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SelectFloat_ReturnValue) == 0x000278, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_GetSplineLength_ReturnValue_1) == 0x000280, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_GetSplineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000288, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000290, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SelectFloat_ReturnValue_1) == 0x000298, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x0002A0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000300, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Location) == 0x000308, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Rotation) == 0x000320, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Scale) == 0x000338, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_FMod_Remainder) == 0x000350, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_FMod_ReturnValue) == 0x000358, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Roll) == 0x00035C, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Pitch) == 0x000360, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Yaw) == 0x000364, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_IntInt_ReturnValue) == 0x000368, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_MakeRotator_ReturnValue) == 0x000370, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_MakeTransform_ReturnValue) == 0x000390, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, Temp_struct_Variable) == 0x0003F0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SelectTransform_ReturnValue) == 0x000450, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SelectTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Location_1) == 0x0004B0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Rotation_1) == 0x0004C8, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakTransform_Scale_1) == 0x0004E0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_AddComponent_ReturnValue) == 0x0004F8, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Roll_1) == 0x000500, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Pitch_1) == 0x000504, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_BreakRotator_Yaw_1) == 0x000508, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_MakeRotator_ReturnValue_1) == 0x000510, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_MakeTransform_ReturnValue_1) == 0x000530, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000590, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_SelectTransform_ReturnValue_1) == 0x0005A0, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_SelectTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, Temp_struct_Variable_1) == 0x000600, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000660, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_AddComponent_ReturnValue_1) == 0x000668, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000670, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_IsValid_ReturnValue) == 0x000678, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000679, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00067A, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_IsValid_ReturnValue_1) == 0x00067B, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00067C, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000680, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000688, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000690, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateStepElements, CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast) == 0x000698, "Member 'BP_SplineMoveActor_Ladder_C_CreateStepElements::CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast' has a wrong offset!");

// Function BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C.CreateSideElements
// 0x0070 (0x0070 - 0x0000)
struct BP_SplineMoveActor_Ladder_C_CreateSideElements final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMoveActor_Ladder_C_CreateSideElements) == 0x000010, "Wrong alignment on BP_SplineMoveActor_Ladder_C_CreateSideElements");
static_assert(sizeof(BP_SplineMoveActor_Ladder_C_CreateSideElements) == 0x000070, "Wrong size on BP_SplineMoveActor_Ladder_C_CreateSideElements");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSideElements, Temp_struct_Variable) == 0x000000, "Member 'BP_SplineMoveActor_Ladder_C_CreateSideElements::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSideElements, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'BP_SplineMoveActor_Ladder_C_CreateSideElements::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSideElements, CallFunc_SetStaticMesh_ReturnValue) == 0x000068, "Member 'BP_SplineMoveActor_Ladder_C_CreateSideElements::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSideElements, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000069, "Member 'BP_SplineMoveActor_Ladder_C_CreateSideElements::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C.CreateSide
// 0x0380 (0x0380 - 0x0000)
struct BP_SplineMoveActor_Ladder_C_CreateSide final
{
public:
	struct FTransform                             OffsetTM;                                          // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             NewMeshTM;                                         // 0x0060(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StepCurrent;                                       // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplineLength;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue_1; // 0x01B0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02A0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x0300(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddInstance_ReturnValue;                  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast; // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTransformAtDistanceAlongSpline_Distance_ImplicitCast_1; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SplineMoveActor_Ladder_C_CreateSide) == 0x000010, "Wrong alignment on BP_SplineMoveActor_Ladder_C_CreateSide");
static_assert(sizeof(BP_SplineMoveActor_Ladder_C_CreateSide) == 0x000380, "Wrong size on BP_SplineMoveActor_Ladder_C_CreateSide");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSide, OffsetTM) == 0x000000, "Member 'BP_SplineMoveActor_Ladder_C_CreateSide::OffsetTM' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSide, NewMeshTM) == 0x000060, "Member 'BP_SplineMoveActor_Ladder_C_CreateSide::NewMeshTM' has a wrong offset!");
static_assert(offsetof(BP_SplineMoveActor_Ladder_C_CreateSide, StepCurrent) == 0x0000C0, "Member 'BP_SplineMoveActor_Ladder_C_CreateSide::StepCurrent' has a wrong offset!");
