#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmokeGrenade_VFX_Base

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_SmokeGrenade_VFX_Base.BP_SmokeGrenade_VFX_Base_C.ExecuteUbergraph_BP_SmokeGrenade_VFX_Base
// 0x0070 (0x0070 - 0x0000)
struct BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetParent_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EP2ThrowableVisualEventType                   K2Node_Event_Type_2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_Type_1;                               // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_Type;                                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base) == 0x000008, "Wrong alignment on BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base");
static_assert(sizeof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base) == 0x000070, "Wrong size on BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, EntryPoint) == 0x000000, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_GetParent_ReturnValue) == 0x000008, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_Event_Type_2) == 0x000010, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_Event_Type_2' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_Event_Type_1) == 0x000014, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_Event_Type_1' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_SwitchName_CmpSuccess) == 0x00001D, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_Event_Type) == 0x000020, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_Event_Value) == 0x000028, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000030, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_SafeDivide_ReturnValue) == 0x000040, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, K2Node_SwitchName_CmpSuccess_1) == 0x000048, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000050, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_IsValid_ReturnValue_2) == 0x000059, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_IsValid_ReturnValue_3) == 0x00005A, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000068, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base, CallFunc_Delay_Duration_ImplicitCast) == 0x00006C, "Member 'BP_SmokeGrenade_VFX_Base_C_ExecuteUbergraph_BP_SmokeGrenade_VFX_Base::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_SmokeGrenade_VFX_Base.BP_SmokeGrenade_VFX_Base_C.HandleCustomEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent final
{
public:
	class FName                                   Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent) == 0x000004, "Wrong alignment on BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent");
static_assert(sizeof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent) == 0x000008, "Wrong size on BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent, Type) == 0x000000, "Member 'BP_SmokeGrenade_VFX_Base_C_HandleCustomEvent::Type' has a wrong offset!");

// Function BP_SmokeGrenade_VFX_Base.BP_SmokeGrenade_VFX_Base_C.HandleCustomEventWithFloat
// 0x000C (0x000C - 0x0000)
struct BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat final
{
public:
	class FName                                   Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat) == 0x000004, "Wrong alignment on BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat");
static_assert(sizeof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat) == 0x00000C, "Wrong size on BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat, Type) == 0x000000, "Member 'BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat::Type' has a wrong offset!");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat, Value) == 0x000008, "Member 'BP_SmokeGrenade_VFX_Base_C_HandleCustomEventWithFloat::Value' has a wrong offset!");

// Function BP_SmokeGrenade_VFX_Base.BP_SmokeGrenade_VFX_Base_C.HandleGenericEvent
// 0x0001 (0x0001 - 0x0000)
struct BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent final
{
public:
	EP2ThrowableVisualEventType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent) == 0x000001, "Wrong alignment on BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent");
static_assert(sizeof(BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent) == 0x000001, "Wrong size on BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent");
static_assert(offsetof(BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent, Type) == 0x000000, "Member 'BP_SmokeGrenade_VFX_Base_C_HandleGenericEvent::Type' has a wrong offset!");

}

