#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMoveActor_Ladder_Spectre

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SplineMoveActor_Ladder_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineMoveActor_Ladder_Spectre.BP_SplineMoveActor_Ladder_Spectre_C
// 0x0040 (0x06F0 - 0x06B0)
class ABP_SplineMoveActor_Ladder_Spectre_C final : public ABP_SplineMoveActor_Ladder_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Animate_to_ground_Ladder_3DB95E7B40B9F1ECD7F8399F3D3D56CF; // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Animate_to_ground__Direction_3DB95E7B40B9F1ECD7F8399F3D3D56CF; // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BD[0x3];                                      // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Animate_to_ground;                                 // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUp;                                              // 0x06C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopMove;                                          // 0x06C9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA[0x6];                                      // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StartZ;                                            // 0x06D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndZ;                                              // 0x06D8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZDestination;                                      // 0x06E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Animate_to_ground__FinishedFunc()	 // 0xae1e64;
	void Animate_to_ground__UpdateFunc()	 // 0xae1e64;
	void ExecuteUbergraph_BP_SplineMoveActor_Ladder_Spectre(int32 EntryPoint)	 // 0xae1e64;
	void OnDeath_Spectre()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_SplineMoveActor_Ladder_Spectre_C">();
	}
	static class ABP_SplineMoveActor_Ladder_Spectre_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_SplineMoveActor_Ladder_Spectre_C>();
	}
};
static_assert(alignof(ABP_SplineMoveActor_Ladder_Spectre_C) == 0x000010, "Wrong alignment on ABP_SplineMoveActor_Ladder_Spectre_C");
static_assert(sizeof(ABP_SplineMoveActor_Ladder_Spectre_C) == 0x0006F0, "Wrong size on ABP_SplineMoveActor_Ladder_Spectre_C");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, UberGraphFrame) == 0x0006B0, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, Animate_to_ground_Ladder_3DB95E7B40B9F1ECD7F8399F3D3D56CF) == 0x0006B8, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::Animate_to_ground_Ladder_3DB95E7B40B9F1ECD7F8399F3D3D56CF' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, Animate_to_ground__Direction_3DB95E7B40B9F1ECD7F8399F3D3D56CF) == 0x0006BC, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::Animate_to_ground__Direction_3DB95E7B40B9F1ECD7F8399F3D3D56CF' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, Animate_to_ground) == 0x0006C0, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::Animate_to_ground' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, IsUp) == 0x0006C8, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::IsUp' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, StopMove) == 0x0006C9, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::StopMove' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, StartZ) == 0x0006D0, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::StartZ' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, EndZ) == 0x0006D8, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::EndZ' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_Spectre_C, ZDestination) == 0x0006E0, "Member 'ABP_SplineMoveActor_Ladder_Spectre_C::ZDestination' has a wrong offset!");

}

