#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sentry_APS

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_Sentry_APS.BP_Sentry_APS_C.ExecuteUbergraph_BP_Sentry_APS
// 0x0054 (0x0054 - 0x0000)
struct BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2DeployableState                            CallFunc_GetDeployState_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS) == 0x000004, "Wrong alignment on BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS");
static_assert(sizeof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS) == 0x000054, "Wrong size on BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, EntryPoint) == 0x000000, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, Temp_delegate_Variable) == 0x000004, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, Temp_delegate_Variable_1) == 0x000014, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, CallFunc_HasAuthority_ReturnValue) == 0x000034, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, CallFunc_PostAkEvent_ReturnValue) == 0x000038, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, CallFunc_PostAkEvent_ReturnValue_1) == 0x00003C, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, CallFunc_GetDeployState_ReturnValue) == 0x000040, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::CallFunc_GetDeployState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'BP_Sentry_APS_C_ExecuteUbergraph_BP_Sentry_APS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

