#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sentry_APS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AICommon_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sentry_APS.BP_Sentry_APS_C
// 0x0020 (0x0D50 - 0x0D30)
class ABP_Sentry_APS_C final : public AP2SentryActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0D38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OperatingLoopedSFX_Start;                          // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          OperatingLoopedSFX_Stop;                           // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Sentry_APS(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void StartOperatingSFX()	 // 0xae1e64;
	void StopOperatingSFX()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_Sentry_APS_C">();
	}
	static class ABP_Sentry_APS_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_Sentry_APS_C>();
	}
};
static_assert(alignof(ABP_Sentry_APS_C) == 0x000010, "Wrong alignment on ABP_Sentry_APS_C");
static_assert(sizeof(ABP_Sentry_APS_C) == 0x000D50, "Wrong size on ABP_Sentry_APS_C");
static_assert(offsetof(ABP_Sentry_APS_C, UberGraphFrame) == 0x000D30, "Member 'ABP_Sentry_APS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Sentry_APS_C, Ak) == 0x000D38, "Member 'ABP_Sentry_APS_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Sentry_APS_C, OperatingLoopedSFX_Start) == 0x000D40, "Member 'ABP_Sentry_APS_C::OperatingLoopedSFX_Start' has a wrong offset!");
static_assert(offsetof(ABP_Sentry_APS_C, OperatingLoopedSFX_Stop) == 0x000D48, "Member 'ABP_Sentry_APS_C::OperatingLoopedSFX_Stop' has a wrong offset!");

}

