#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShootingRangeButton_01

#include "Basic.hpp"

#include "E_TargetState_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C
// 0x0110 (0x03C0 - 0x02B0)
class ABP_ShootingRangeButton_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Two0mText;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Three0mText;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   One0mText;                                         // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   FivemText;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Target;                                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UP2ActionComponent*                     P2Action;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Button;                                            // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_TargetState                                 TargetState;                                       // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Origin;                                            // 0x0378(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Destination;                                       // 0x0390(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetMoveSpeed;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HitMarkers;                                        // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void UpdateText()	 // 0xae1e64;
	void UpdateInteractionText()	 // 0xae1e64;
	void SetText()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void OnHit(const struct FP2HitInfo& Info)	 // 0xae1e64;
	void HandleInteract(const struct FP2InteractionParameters& InParameters)	 // 0xae1e64;
	void ExecuteUbergraph_BP_ShootingRangeButton_01(int32 EntryPoint)	 // 0xae1e64;

	bool IsAvailableForInteractionForPawn(const class APawn* InPawn) const	 // 0xae1e64;
	bool IsAvailableForInteraction() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ShootingRangeButton_01_C">();
	}
	static class ABP_ShootingRangeButton_01_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_ShootingRangeButton_01_C>();
	}
};
static_assert(alignof(ABP_ShootingRangeButton_01_C) == 0x000008, "Wrong alignment on ABP_ShootingRangeButton_01_C");
static_assert(sizeof(ABP_ShootingRangeButton_01_C) == 0x0003C0, "Wrong size on ABP_ShootingRangeButton_01_C");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_ShootingRangeButton_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Decal) == 0x0002B8, "Member 'ABP_ShootingRangeButton_01_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh13) == 0x0002C0, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh12) == 0x0002C8, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh11) == 0x0002D0, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh10) == 0x0002D8, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh9) == 0x0002E0, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh8) == 0x0002E8, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh7) == 0x0002F0, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh2) == 0x0002F8, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh6) == 0x000300, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh5) == 0x000308, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh4) == 0x000310, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh3) == 0x000318, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, StaticMesh1) == 0x000320, "Member 'ABP_ShootingRangeButton_01_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Two0mText) == 0x000328, "Member 'ABP_ShootingRangeButton_01_C::Two0mText' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Three0mText) == 0x000330, "Member 'ABP_ShootingRangeButton_01_C::Three0mText' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, One0mText) == 0x000338, "Member 'ABP_ShootingRangeButton_01_C::One0mText' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, FivemText) == 0x000340, "Member 'ABP_ShootingRangeButton_01_C::FivemText' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, SpotLight) == 0x000348, "Member 'ABP_ShootingRangeButton_01_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Target) == 0x000350, "Member 'ABP_ShootingRangeButton_01_C::Target' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, P2Action) == 0x000358, "Member 'ABP_ShootingRangeButton_01_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Button) == 0x000360, "Member 'ABP_ShootingRangeButton_01_C::Button' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, DefaultSceneRoot) == 0x000368, "Member 'ABP_ShootingRangeButton_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, TargetState) == 0x000370, "Member 'ABP_ShootingRangeButton_01_C::TargetState' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Origin) == 0x000378, "Member 'ABP_ShootingRangeButton_01_C::Origin' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, Destination) == 0x000390, "Member 'ABP_ShootingRangeButton_01_C::Destination' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, TargetMoveSpeed) == 0x0003A8, "Member 'ABP_ShootingRangeButton_01_C::TargetMoveSpeed' has a wrong offset!");
static_assert(offsetof(ABP_ShootingRangeButton_01_C, HitMarkers) == 0x0003B0, "Member 'ABP_ShootingRangeButton_01_C::HitMarkers' has a wrong offset!");

}

