#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpaceTimeRipper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SpaceTimeRipper.BP_SpaceTimeRipper_C.ExecuteUbergraph_BP_SpaceTimeRipper
// 0x0210 (0x0210 - 0x0000)
struct BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2TunnelGeneratorData*                 K2Node_DynamicCast_AsP2Tunnel_Generator_Data;      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue;    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_1;  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_2;  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_3;  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2ExtractionTunnel*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_Max_ImplicitCast;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_Min_ImplicitCast;      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper) == 0x000010, "Wrong alignment on BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper");
static_assert(sizeof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper) == 0x000210, "Wrong size on BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, EntryPoint) == 0x000000, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000018, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_IsServer_ReturnValue) == 0x000030, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000060, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_GetItemData_ReturnValue) == 0x000098, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_DynamicCast_AsP2Tunnel_Generator_Data) == 0x0000A0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_DynamicCast_AsP2Tunnel_Generator_Data' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_TryPostEventOnAkComponent_ReturnValue) == 0x0000AC, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_TryPostEventOnAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_TryPostEventOnAkComponent_ReturnValue_1) == 0x0000C8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_TryPostEventOnAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_TryPostEventOnAkComponent_ReturnValue_2) == 0x0000CC, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_TryPostEventOnAkComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_TryPostEventOnAkComponent_ReturnValue_3) == 0x0000D0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_TryPostEventOnAkComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000D8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x0000F0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_IsServer_ReturnValue_1) == 0x0000F4, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_GetComponentBounds_Origin) == 0x0000F8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_GetComponentBounds_BoxExtent) == 0x000110, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_GetComponentBounds_SphereRadius) == 0x000128, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_BreakVector_X) == 0x000130, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_BreakVector_Y) == 0x000138, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_BreakVector_Z) == 0x000140, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_MakeVector_ReturnValue) == 0x000150, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001D0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001D8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0001E0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Delay_Duration_ImplicitCast) == 0x0001E8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_RandomFloatInRange_Max_ImplicitCast) == 0x0001F0, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_RandomFloatInRange_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_RandomFloatInRange_Min_ImplicitCast) == 0x0001F8, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_RandomFloatInRange_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000200, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000208, "Member 'BP_SpaceTimeRipper_C_ExecuteUbergraph_BP_SpaceTimeRipper::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_SpaceTimeRipper.BP_SpaceTimeRipper_C.HandleExplosion
// 0x0028 (0x0028 - 0x0000)
struct BP_SpaceTimeRipper_C_HandleExplosion final
{
public:
	struct FVector                                HazardLocation;                                    // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              CallFunc_AddComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpaceTimeRipper_C_HandleExplosion) == 0x000008, "Wrong alignment on BP_SpaceTimeRipper_C_HandleExplosion");
static_assert(sizeof(BP_SpaceTimeRipper_C_HandleExplosion) == 0x000028, "Wrong size on BP_SpaceTimeRipper_C_HandleExplosion");
static_assert(offsetof(BP_SpaceTimeRipper_C_HandleExplosion, HazardLocation) == 0x000000, "Member 'BP_SpaceTimeRipper_C_HandleExplosion::HazardLocation' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_HandleExplosion, CallFunc_AddComponentByClass_ReturnValue) == 0x000018, "Member 'BP_SpaceTimeRipper_C_HandleExplosion::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpaceTimeRipper_C_HandleExplosion, CallFunc_IsValidClass_ReturnValue) == 0x000020, "Member 'BP_SpaceTimeRipper_C_HandleExplosion::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

}

