#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScanVolume

#include "Basic.hpp"

#include "F_ScanStructure_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScanVolume.BP_ScanVolume_C
// 0x0060 (0x0378 - 0x0318)
class ABP_ScanVolume_C final : public AP2ScanVolume
{
public:
	class USphereComponent*                       Sphere;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FF_ScanStructure                       ScanStructure;                                     // 0x0328(0x0048)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 OriginActor;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_ScanVolume_C">();
	}
	static class ABP_ScanVolume_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_ScanVolume_C>();
	}
};
static_assert(alignof(ABP_ScanVolume_C) == 0x000008, "Wrong alignment on ABP_ScanVolume_C");
static_assert(sizeof(ABP_ScanVolume_C) == 0x000378, "Wrong size on ABP_ScanVolume_C");
static_assert(offsetof(ABP_ScanVolume_C, Sphere) == 0x000318, "Member 'ABP_ScanVolume_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_ScanVolume_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_ScanVolume_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ScanVolume_C, ScanStructure) == 0x000328, "Member 'ABP_ScanVolume_C::ScanStructure' has a wrong offset!");
static_assert(offsetof(ABP_ScanVolume_C, OriginActor) == 0x000370, "Member 'ABP_ScanVolume_C::OriginActor' has a wrong offset!");

}

