#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpaceTimeRipper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpaceTimeRipper.BP_SpaceTimeRipper_C
// 0x0078 (0x03C0 - 0x0348)
class ABP_SpaceTimeRipper_C final : public AP2TunnelGeneratorDeployable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Explosion;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_TimerCountdown;                                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_SpaceTimeRipper;                                // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        ExtractionSpawnTimer;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Post_Process_Material;                             // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Ripper_PostProcess;                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   PostProcessProgress;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            _Effect_Class;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Effect_Radius;                                     // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Effect_Penetration;                                // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_SpaceTimeRipper_Active;                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_SpaceTimeRipper_Rise;                      // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_SpaceTimeRipper_Explosion;                 // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkEvent_SpaceTimeRipper_Destroy;                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivationTimerStart()	 // 0xae1e64;
	void ExecuteUbergraph_BP_SpaceTimeRipper(int32 EntryPoint)	 // 0xae1e64;
	void HandleExplosion(const struct FVector& HazardLocation)	 // 0xae1e64;
	void MakePostProcess()	 // 0xae1e64;
	void OnDeployableDestroyedEvent()	 // 0xae1e64;
	void PostDisableSFX()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void SetActive()	 // 0xae1e64;
	void TransferedToActor()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_SpaceTimeRipper_C">();
	}
	static class ABP_SpaceTimeRipper_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_SpaceTimeRipper_C>();
	}
};
static_assert(alignof(ABP_SpaceTimeRipper_C) == 0x000008, "Wrong alignment on ABP_SpaceTimeRipper_C");
static_assert(sizeof(ABP_SpaceTimeRipper_C) == 0x0003C0, "Wrong size on ABP_SpaceTimeRipper_C");
static_assert(offsetof(ABP_SpaceTimeRipper_C, UberGraphFrame) == 0x000348, "Member 'ABP_SpaceTimeRipper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, Ak) == 0x000350, "Member 'ABP_SpaceTimeRipper_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, NS_Explosion) == 0x000358, "Member 'ABP_SpaceTimeRipper_C::NS_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, NS_TimerCountdown) == 0x000360, "Member 'ABP_SpaceTimeRipper_C::NS_TimerCountdown' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, SK_SpaceTimeRipper) == 0x000368, "Member 'ABP_SpaceTimeRipper_C::SK_SpaceTimeRipper' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, ExtractionSpawnTimer) == 0x000370, "Member 'ABP_SpaceTimeRipper_C::ExtractionSpawnTimer' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, Post_Process_Material) == 0x000378, "Member 'ABP_SpaceTimeRipper_C::Post_Process_Material' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, Ripper_PostProcess) == 0x000380, "Member 'ABP_SpaceTimeRipper_C::Ripper_PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, PostProcessProgress) == 0x000388, "Member 'ABP_SpaceTimeRipper_C::PostProcessProgress' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, _Effect_Class) == 0x000390, "Member 'ABP_SpaceTimeRipper_C::_Effect_Class' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, Effect_Radius) == 0x000398, "Member 'ABP_SpaceTimeRipper_C::Effect_Radius' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, Effect_Penetration) == 0x00039C, "Member 'ABP_SpaceTimeRipper_C::Effect_Penetration' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, AkEvent_SpaceTimeRipper_Active) == 0x0003A0, "Member 'ABP_SpaceTimeRipper_C::AkEvent_SpaceTimeRipper_Active' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, AkEvent_SpaceTimeRipper_Rise) == 0x0003A8, "Member 'ABP_SpaceTimeRipper_C::AkEvent_SpaceTimeRipper_Rise' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, AkEvent_SpaceTimeRipper_Explosion) == 0x0003B0, "Member 'ABP_SpaceTimeRipper_C::AkEvent_SpaceTimeRipper_Explosion' has a wrong offset!");
static_assert(offsetof(ABP_SpaceTimeRipper_C, AkEvent_SpaceTimeRipper_Destroy) == 0x0003B8, "Member 'ABP_SpaceTimeRipper_C::AkEvent_SpaceTimeRipper_Destroy' has a wrong offset!");

}

