#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spectre_Boss

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Spectre_Boss.BP_Spectre_Boss_C.Assign Variables
// 0x0008 (0x0008 - 0x0000)
struct BP_Spectre_Boss_C_Assign_Variables final
{
public:
	class ABP_SplineMoveActor_Ladder_Spectre_C*   LadderActor_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spectre_Boss_C_Assign_Variables) == 0x000008, "Wrong alignment on BP_Spectre_Boss_C_Assign_Variables");
static_assert(sizeof(BP_Spectre_Boss_C_Assign_Variables) == 0x000008, "Wrong size on BP_Spectre_Boss_C_Assign_Variables");
static_assert(offsetof(BP_Spectre_Boss_C_Assign_Variables, LadderActor_0) == 0x000000, "Member 'BP_Spectre_Boss_C_Assign_Variables::LadderActor_0' has a wrong offset!");

// Function BP_Spectre_Boss.BP_Spectre_Boss_C.BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature final
{
public:
	class UP2HealthComponent*                     HealthComponent_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FP2FinalBlowImpulseData                Impulse;                                           // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature");
static_assert(sizeof(BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature) == 0x000030, "Wrong size on BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature");
static_assert(offsetof(BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature, HealthComponent_0) == 0x000000, "Member 'BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature::HealthComponent_0' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature, Impulse) == 0x000008, "Member 'BP_Spectre_Boss_C_BndEvt__BP_Spectre_Boss_HealthComponent_K2Node_ComponentBoundEvent_0_P2Health_DeathEventWithImpulse__DelegateSignature::Impulse' has a wrong offset!");

// Function BP_Spectre_Boss.BP_Spectre_Boss_C.ExecuteUbergraph_BP_Spectre_Boss
// 0x0208 (0x0208 - 0x0000)
struct BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SplineMoveActor_Ladder_Spectre_C*   K2Node_CustomEvent_LadderActor;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2HealthComponent*                     K2Node_ComponentBoundEvent_HealthComponent;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FP2FinalBlowImpulseData                K2Node_ComponentBoundEvent_Impulse;                // 0x0020(0x0028)(ConstParm, NoDestructor)
	int32                                         CallFunc_GetMaterialIndex_ReturnValue_1;           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2SpectreAttributeSet*           CallFunc_BP_GetSpectreAttributes_ReturnValue;      // 0x0058(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsMainSpectre_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x00D8(0x00F0)(ContainsInstancedReference)
	class UP2AudioManagerSpawnerSubsystem*        CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveBossStage_ReturnValue;           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast_1;        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss) == 0x000008, "Wrong alignment on BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss");
static_assert(sizeof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss) == 0x000208, "Wrong size on BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, EntryPoint) == 0x000000, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, K2Node_CustomEvent_LadderActor) == 0x000008, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::K2Node_CustomEvent_LadderActor' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetMaterialIndex_ReturnValue) == 0x000010, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetMaterialIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, K2Node_ComponentBoundEvent_HealthComponent) == 0x000018, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::K2Node_ComponentBoundEvent_HealthComponent' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, K2Node_ComponentBoundEvent_Impulse) == 0x000020, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::K2Node_ComponentBoundEvent_Impulse' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetMaterialIndex_ReturnValue_1) == 0x000048, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetMaterialIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_BP_GetSpectreAttributes_ReturnValue) == 0x000058, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_BP_GetSpectreAttributes_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue) == 0x000060, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000080, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetIsMainSpectre_ReturnValue) == 0x000088, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetIsMainSpectre_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000090, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000098, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetDistanceTo_ReturnValue) == 0x0000B0, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x0000D8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0001C8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_GetActiveBossStage_ReturnValue) == 0x0001D0, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_GetActiveBossStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001D8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_IsServer_ReturnValue) == 0x0001E0, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0001E8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x0001F0, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0001F8, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000200, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss, CallFunc_SetRTPCValue_Value_ImplicitCast_1) == 0x000204, "Member 'BP_Spectre_Boss_C_ExecuteUbergraph_BP_Spectre_Boss::CallFunc_SetRTPCValue_Value_ImplicitCast_1' has a wrong offset!");

// Function BP_Spectre_Boss.BP_Spectre_Boss_C.GetTarget
// 0x0030 (0x0030 - 0x0000)
struct BP_Spectre_Boss_C_GetTarget final
{
public:
	class AActor*                                 PrimaryTarget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spectre_Boss_C_GetTarget) == 0x000008, "Wrong alignment on BP_Spectre_Boss_C_GetTarget");
static_assert(sizeof(BP_Spectre_Boss_C_GetTarget) == 0x000030, "Wrong size on BP_Spectre_Boss_C_GetTarget");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, PrimaryTarget) == 0x000000, "Member 'BP_Spectre_Boss_C_GetTarget::PrimaryTarget' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, CallFunc_GetAIController_ReturnValue) == 0x000008, "Member 'BP_Spectre_Boss_C_GetTarget::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, CallFunc_GetBlackboard_ReturnValue) == 0x000010, "Member 'BP_Spectre_Boss_C_GetTarget::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, CallFunc_GetValueAsObject_ReturnValue) == 0x000018, "Member 'BP_Spectre_Boss_C_GetTarget::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, K2Node_DynamicCast_AsActor) == 0x000020, "Member 'BP_Spectre_Boss_C_GetTarget::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BP_Spectre_Boss_C_GetTarget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Spectre_Boss_C_GetTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Spectre_Boss.BP_Spectre_Boss_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Spectre_Boss_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spectre_Boss_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Spectre_Boss_C_ReceiveTick");
static_assert(sizeof(BP_Spectre_Boss_C_ReceiveTick) == 0x000004, "Wrong size on BP_Spectre_Boss_C_ReceiveTick");
static_assert(offsetof(BP_Spectre_Boss_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Spectre_Boss_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

