#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineMoveActor_Ladder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_SplineMoveActor_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SplineMoveActor_Ladder.BP_SplineMoveActor_Ladder_C
// 0x0248 (0x06B0 - 0x0468)
class ABP_SplineMoveActor_Ladder_C : public ABP_SplineMoveActor_Base_C
{
public:
	class UBP_ActionComponent_Ladder_Top_C*       BP_ActionComponent_Ladder_Top;                     // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_Steps_Component;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        StartDistanceOffset;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EndDistanceOffset;                                 // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StepDistance;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableStepMeshCollision;                          // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StepMesh;                                          // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInstancedStaticMeshComponent*          ISM_Sides_Component;                               // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bCreateSides;                                      // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            SideElementMesh;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SideStepDistance;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SideElementScale;                                  // 0x04C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SideTM_Left;                                       // 0x04E0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SideTM_Right;                                      // 0x0540(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StartMesh;                                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StartMeshOffset;                                   // 0x05B0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            EndMesh;                                           // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_618[0x8];                                      // 0x0618(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EndMeshOffset;                                     // 0x0620(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseWorldAlignPitch;                               // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGlobalRotate;                                     // 0x0681(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_682[0x6];                                      // 0x0682(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotateSegment;                                     // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Steps_Component;                                // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActionComponentLocalOffset;                        // 0x0698(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript()	 // 0xae1e64;
	void HandleActionComp()	 // 0xae1e64;
	void CreateStepElements()	 // 0xae1e64;
	void CreateSideElements()	 // 0xae1e64;
	void CreateSide(const struct FTransform& OffsetTM)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_SplineMoveActor_Ladder_C">();
	}
	static class ABP_SplineMoveActor_Ladder_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_SplineMoveActor_Ladder_C>();
	}
};
static_assert(alignof(ABP_SplineMoveActor_Ladder_C) == 0x000010, "Wrong alignment on ABP_SplineMoveActor_Ladder_C");
static_assert(sizeof(ABP_SplineMoveActor_Ladder_C) == 0x0006B0, "Wrong size on ABP_SplineMoveActor_Ladder_C");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, BP_ActionComponent_Ladder_Top) == 0x000468, "Member 'ABP_SplineMoveActor_Ladder_C::BP_ActionComponent_Ladder_Top' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, ISM_Steps_Component) == 0x000470, "Member 'ABP_SplineMoveActor_Ladder_C::ISM_Steps_Component' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, StartDistanceOffset) == 0x000478, "Member 'ABP_SplineMoveActor_Ladder_C::StartDistanceOffset' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, EndDistanceOffset) == 0x000480, "Member 'ABP_SplineMoveActor_Ladder_C::EndDistanceOffset' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, StepDistance) == 0x000488, "Member 'ABP_SplineMoveActor_Ladder_C::StepDistance' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, bEnableStepMeshCollision) == 0x000490, "Member 'ABP_SplineMoveActor_Ladder_C::bEnableStepMeshCollision' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, StepMesh) == 0x000498, "Member 'ABP_SplineMoveActor_Ladder_C::StepMesh' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, ISM_Sides_Component) == 0x0004A0, "Member 'ABP_SplineMoveActor_Ladder_C::ISM_Sides_Component' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, bCreateSides) == 0x0004A8, "Member 'ABP_SplineMoveActor_Ladder_C::bCreateSides' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SideElementMesh) == 0x0004B0, "Member 'ABP_SplineMoveActor_Ladder_C::SideElementMesh' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SideStepDistance) == 0x0004B8, "Member 'ABP_SplineMoveActor_Ladder_C::SideStepDistance' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SideElementScale) == 0x0004C0, "Member 'ABP_SplineMoveActor_Ladder_C::SideElementScale' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SideTM_Left) == 0x0004E0, "Member 'ABP_SplineMoveActor_Ladder_C::SideTM_Left' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SideTM_Right) == 0x000540, "Member 'ABP_SplineMoveActor_Ladder_C::SideTM_Right' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, StartMesh) == 0x0005A0, "Member 'ABP_SplineMoveActor_Ladder_C::StartMesh' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, StartMeshOffset) == 0x0005B0, "Member 'ABP_SplineMoveActor_Ladder_C::StartMeshOffset' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, EndMesh) == 0x000610, "Member 'ABP_SplineMoveActor_Ladder_C::EndMesh' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, EndMeshOffset) == 0x000620, "Member 'ABP_SplineMoveActor_Ladder_C::EndMeshOffset' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, bUseWorldAlignPitch) == 0x000680, "Member 'ABP_SplineMoveActor_Ladder_C::bUseWorldAlignPitch' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, bGlobalRotate) == 0x000681, "Member 'ABP_SplineMoveActor_Ladder_C::bGlobalRotate' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, RotateSegment) == 0x000688, "Member 'ABP_SplineMoveActor_Ladder_C::RotateSegment' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, SM_Steps_Component) == 0x000690, "Member 'ABP_SplineMoveActor_Ladder_C::SM_Steps_Component' has a wrong offset!");
static_assert(offsetof(ABP_SplineMoveActor_Ladder_C, ActionComponentLocalOffset) == 0x000698, "Member 'ABP_SplineMoveActor_Ladder_C::ActionComponentLocalOffset' has a wrong offset!");

}

