#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShootingRangeButton_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_TargetState_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.UpdateText
// 0x0001 (0x0001 - 0x0000)
struct BP_ShootingRangeButton_01_C_UpdateText final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_UpdateText) == 0x000001, "Wrong alignment on BP_ShootingRangeButton_01_C_UpdateText");
static_assert(sizeof(BP_ShootingRangeButton_01_C_UpdateText) == 0x000001, "Wrong size on BP_ShootingRangeButton_01_C_UpdateText");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateText, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_UpdateText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.UpdateInteractionText
// 0x0080 (0x0080 - 0x0000)
struct BP_ShootingRangeButton_01_C_UpdateInteractionText final
{
public:
	E_TargetState                                 Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0018)()
};
static_assert(alignof(BP_ShootingRangeButton_01_C_UpdateInteractionText) == 0x000008, "Wrong alignment on BP_ShootingRangeButton_01_C_UpdateInteractionText");
static_assert(sizeof(BP_ShootingRangeButton_01_C_UpdateInteractionText) == 0x000080, "Wrong size on BP_ShootingRangeButton_01_C_UpdateInteractionText");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, Temp_byte_Variable) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, Temp_text_Variable) == 0x000008, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, Temp_text_Variable_1) == 0x000020, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, Temp_text_Variable_2) == 0x000038, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, Temp_text_Variable_3) == 0x000050, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_UpdateInteractionText, K2Node_Select_Default) == 0x000068, "Member 'BP_ShootingRangeButton_01_C_UpdateInteractionText::K2Node_Select_Default' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.SetText
// 0x0400 (0x0400 - 0x0000)
struct BP_ShootingRangeButton_01_C_SetText final
{
public:
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0030(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0118(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0230(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0318(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_SetText) == 0x000008, "Wrong alignment on BP_ShootingRangeButton_01_C_SetText");
static_assert(sizeof(BP_ShootingRangeButton_01_C_SetText) == 0x000400, "Wrong size on BP_ShootingRangeButton_01_C_SetText");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_Add_VectorVector_ReturnValue) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000018, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000030, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000118, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000200, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000218, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000230, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_SetText, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000318, "Member 'BP_ShootingRangeButton_01_C_SetText::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ShootingRangeButton_01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ShootingRangeButton_01_C_ReceiveTick");
static_assert(sizeof(BP_ShootingRangeButton_01_C_ReceiveTick) == 0x000004, "Wrong size on BP_ShootingRangeButton_01_C_ReceiveTick");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.OnHit
// 0x0108 (0x0108 - 0x0000)
struct BP_ShootingRangeButton_01_C_OnHit final
{
public:
	struct FP2HitInfo                             Info;                                              // 0x0000(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_OnHit) == 0x000008, "Wrong alignment on BP_ShootingRangeButton_01_C_OnHit");
static_assert(sizeof(BP_ShootingRangeButton_01_C_OnHit) == 0x000108, "Wrong size on BP_ShootingRangeButton_01_C_OnHit");
static_assert(offsetof(BP_ShootingRangeButton_01_C_OnHit, Info) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_OnHit::Info' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.HandleInteract
// 0x0020 (0x0020 - 0x0000)
struct BP_ShootingRangeButton_01_C_HandleInteract final
{
public:
	struct FP2InteractionParameters               InParameters;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_HandleInteract) == 0x000008, "Wrong alignment on BP_ShootingRangeButton_01_C_HandleInteract");
static_assert(sizeof(BP_ShootingRangeButton_01_C_HandleInteract) == 0x000020, "Wrong size on BP_ShootingRangeButton_01_C_HandleInteract");
static_assert(offsetof(BP_ShootingRangeButton_01_C_HandleInteract, InParameters) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_HandleInteract::InParameters' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.ExecuteUbergraph_BP_ShootingRangeButton_01
// 0x0560 (0x0560 - 0x0000)
struct BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2InteractionParameters               K2Node_Event_InParameters;                         // 0x0018(0x0020)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector3f_X;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_1;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_1;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_1;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_2;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_2;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_2;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_3;                        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_3;                        // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_3;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2HitInfo                             K2Node_Event_Info;                                 // 0x0140(0x0108)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24B[0x1];                                      // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0320(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x03A0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_Hitmarker_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_1;       // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Y_ImplicitCast_1;              // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_1;              // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_2;       // 0x0510(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Y_ImplicitCast_2;              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_2;              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_3;       // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Y_ImplicitCast_3;              // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast_3;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VInterpTo_InterpSpeed_ImplicitCast;       // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01) == 0x000010, "Wrong alignment on BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01");
static_assert(sizeof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01) == 0x000560, "Wrong size on BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, EntryPoint) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, K2Node_Event_InParameters) == 0x000018, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::K2Node_Event_InParameters' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_X) == 0x00003C, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Y) == 0x000040, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Z) == 0x000044, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_X_1) == 0x000060, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_X_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Y_1) == 0x000064, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Y_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Z_1) == 0x000068, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Z_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_VectorVector_ReturnValue) == 0x000070, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_ReturnValue_1) == 0x000088, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000A0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_X_2) == 0x0000B8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_X_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Y_2) == 0x0000BC, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Y_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Z_2) == 0x0000C0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Z_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_ReturnValue_2) == 0x0000C8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_X_3) == 0x0000E0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_X_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Y_3) == 0x0000E4, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Y_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_Z_3) == 0x0000E8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_Z_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0000F0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_ReturnValue_3) == 0x000108, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000120, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, K2Node_Event_DeltaSeconds) == 0x000138, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, K2Node_Event_Info) == 0x000140, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x000248, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_bBlockingHit) == 0x000249, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_bInitialOverlap) == 0x00024A, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_Time) == 0x00024C, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_Distance) == 0x000250, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_Location) == 0x000258, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_ImpactPoint) == 0x000270, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_Normal) == 0x000288, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_ImpactNormal) == 0x0002A0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_PhysMat) == 0x0002B8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_HitActor) == 0x0002C0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_HitComponent) == 0x0002C8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_HitBoneName) == 0x0002D0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_BoneName) == 0x0002D8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_HitItem) == 0x0002E0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_ElementIndex) == 0x0002E4, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_FaceIndex) == 0x0002E8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_TraceStart) == 0x0002F0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakHitResult_TraceEnd) == 0x000308, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeTransform_ReturnValue) == 0x000320, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_VInterpTo_ReturnValue) == 0x000380, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000398, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0003A0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_FinishSpawningActor_ReturnValue) == 0x000488, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000490, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Get_Item) == 0x000498, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Length_ReturnValue) == 0x0004A0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Add_ReturnValue) == 0x0004A4, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Length_ReturnValue_1) == 0x0004A8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Greater_IntInt_ReturnValue) == 0x0004AC, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Get_Item_1) == 0x0004B0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Array_Length_ReturnValue_2) == 0x0004B8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Less_IntInt_ReturnValue) == 0x0004BC, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, Temp_int_Loop_Counter_Variable_1) == 0x0004C0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004C4, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_Add_IntInt_ReturnValue_1) == 0x0004C8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BooleanAND_ReturnValue) == 0x0004CC, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x0004D0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Y_ImplicitCast) == 0x0004E0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Z_ImplicitCast) == 0x0004E8, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_InVec_ImplicitCast_1) == 0x0004F0, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_InVec_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Y_ImplicitCast_1) == 0x000500, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Y_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Z_ImplicitCast_1) == 0x000508, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Z_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_InVec_ImplicitCast_2) == 0x000510, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_InVec_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Y_ImplicitCast_2) == 0x000520, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Y_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Z_ImplicitCast_2) == 0x000528, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Z_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_BreakVector3f_InVec_ImplicitCast_3) == 0x000530, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_BreakVector3f_InVec_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Y_ImplicitCast_3) == 0x000540, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Y_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_MakeVector_Z_ImplicitCast_3) == 0x000548, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_MakeVector_Z_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01, CallFunc_VInterpTo_InterpSpeed_ImplicitCast) == 0x000550, "Member 'BP_ShootingRangeButton_01_C_ExecuteUbergraph_BP_ShootingRangeButton_01::CallFunc_VInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.IsAvailableForInteractionForPawn
// 0x0010 (0x0010 - 0x0000)
struct BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn final
{
public:
	const class APawn*                            InPawn;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn) == 0x000008, "Wrong alignment on BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn");
static_assert(sizeof(BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn) == 0x000010, "Wrong size on BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn");
static_assert(offsetof(BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn, InPawn) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn::InPawn' has a wrong offset!");
static_assert(offsetof(BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn, ReturnValue) == 0x000008, "Member 'BP_ShootingRangeButton_01_C_IsAvailableForInteractionForPawn::ReturnValue' has a wrong offset!");

// Function BP_ShootingRangeButton_01.BP_ShootingRangeButton_01_C.IsAvailableForInteraction
// 0x0001 (0x0001 - 0x0000)
struct BP_ShootingRangeButton_01_C_IsAvailableForInteraction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ShootingRangeButton_01_C_IsAvailableForInteraction) == 0x000001, "Wrong alignment on BP_ShootingRangeButton_01_C_IsAvailableForInteraction");
static_assert(sizeof(BP_ShootingRangeButton_01_C_IsAvailableForInteraction) == 0x000001, "Wrong size on BP_ShootingRangeButton_01_C_IsAvailableForInteraction");
static_assert(offsetof(BP_ShootingRangeButton_01_C_IsAvailableForInteraction, ReturnValue) == 0x000000, "Member 'BP_ShootingRangeButton_01_C_IsAvailableForInteraction::ReturnValue' has a wrong offset!");

}

