#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerEvent_HideoutExpanding_01_Pile03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TriggerEvent_HideoutExpanding_01_Pile03.BP_TriggerEvent_HideoutExpanding_01_Pile03_C
// 0x0020 (0x0378 - 0x0358)
class ABP_TriggerEvent_HideoutExpanding_01_Pile03_C final : public AP2HideoutExpandingEventActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CleanupRockActor;                                  // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Pile03(int32 EntryPoint)	 // 0xae1e64;
	void OnEventCompleteBP()	 // 0xae1e64;
	void OnEventOngoingBeginBP()	 // 0xae1e64;
	void OnEventOngoingTickBP()	 // 0xae1e64;
	void OnFadeoutCompletedBP()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_TriggerEvent_HideoutExpanding_01_Pile03_C">();
	}
	static class ABP_TriggerEvent_HideoutExpanding_01_Pile03_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_TriggerEvent_HideoutExpanding_01_Pile03_C>();
	}
};
static_assert(alignof(ABP_TriggerEvent_HideoutExpanding_01_Pile03_C) == 0x000008, "Wrong alignment on ABP_TriggerEvent_HideoutExpanding_01_Pile03_C");
static_assert(sizeof(ABP_TriggerEvent_HideoutExpanding_01_Pile03_C) == 0x000378, "Wrong size on ABP_TriggerEvent_HideoutExpanding_01_Pile03_C");
static_assert(offsetof(ABP_TriggerEvent_HideoutExpanding_01_Pile03_C, UberGraphFrame) == 0x000358, "Member 'ABP_TriggerEvent_HideoutExpanding_01_Pile03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_HideoutExpanding_01_Pile03_C, Arrow) == 0x000360, "Member 'ABP_TriggerEvent_HideoutExpanding_01_Pile03_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_HideoutExpanding_01_Pile03_C, CleanupRockActor) == 0x000368, "Member 'ABP_TriggerEvent_HideoutExpanding_01_Pile03_C::CleanupRockActor' has a wrong offset!");

}

