#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamMemberIndicatorManager_Component

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.AddWidget
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_AddWidget final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       CallFunc_AddComponentByClass_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_AddWidget) == 0x000010, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_AddWidget");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_AddWidget) == 0x0000A0, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_AddWidget");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, Pawn) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::Pawn' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, K2Node_DynamicCast_AsP2Hero_Character) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, CallFunc_MakeTransform_ReturnValue) == 0x000020, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, CallFunc_AddComponentByClass_ReturnValue) == 0x000080, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, CallFunc_GetComponentByClass_ReturnValue) == 0x000088, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_AddWidget, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_TeamMemberIndicatorManager_Component_C_AddWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.CreateIndicatorWidgets
// 0x0050 (0x0050 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2PlayerState*>                 CallFunc_GetTeamPlayerStatesById_ReturnValue;      // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets) == 0x000008, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets) == 0x000050, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, TeamId) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_GetTeamPlayerStatesById_ReturnValue) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_GetTeamPlayerStatesById_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_GetPawn_ReturnValue) == 0x000028, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_TeamMemberIndicatorManager_Component_C_CreateIndicatorWidgets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.DestroyIndicatorWidgets
// 0x0050 (0x0050 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2PlayerState*>                 CallFunc_GetTeamPlayerStatesById_ReturnValue;      // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerState*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPawn_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets) == 0x000008, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets) == 0x000050, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, TeamId) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_GetTeamPlayerStatesById_ReturnValue) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_GetTeamPlayerStatesById_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_GetPawn_ReturnValue) == 0x000028, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_TeamMemberIndicatorManager_Component_C_DestroyIndicatorWidgets::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component
// 0x00D8 (0x00D8 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindTeamFromObject_bIsPartOfTeam;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTeamFromObject_TeamId;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FP2TeamChangedMessage                  Temp_struct_Variable;                              // 0x0038(0x0030)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2TeamChangedMessage                  Temp_struct_Variable_2;                            // 0x0088(0x0030)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindTeamFromObject_bIsPartOfTeam_1;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindTeamFromObject_TeamId_1;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component) == 0x000008, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component) == 0x0000D8, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, EntryPoint) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_FindTeamFromObject_bIsPartOfTeam) == 0x000010, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_FindTeamFromObject_bIsPartOfTeam' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_FindTeamFromObject_TeamId) == 0x000014, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_FindTeamFromObject_TeamId' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, K2Node_CustomEvent_ProxyObject) == 0x000028, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, K2Node_CustomEvent_ActualChannel) == 0x000030, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, Temp_struct_Variable) == 0x000038, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, Temp_struct_Variable_1) == 0x000068, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, Temp_object_Variable) == 0x000070, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000078, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, K2Node_Event_EndPlayReason) == 0x000081, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, Temp_struct_Variable_2) == 0x000088, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_GetPayload_ReturnValue) == 0x0000B9, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_GetOwner_ReturnValue_1) == 0x0000C0, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_FindTeamFromObject_bIsPartOfTeam_1) == 0x0000C8, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_FindTeamFromObject_bIsPartOfTeam_1' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_FindTeamFromObject_TeamId_1) == 0x0000CC, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_FindTeamFromObject_TeamId_1' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'BP_TeamMemberIndicatorManager_Component_C_ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.OnMessageReceived_E393F6614B8E4DC4697D1C950962842C
// 0x0010 (0x0010 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C) == 0x000008, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C) == 0x000010, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C, ProxyObject) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C::ProxyObject' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C, ActualChannel) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnMessageReceived_E393F6614B8E4DC4697D1C950962842C::ActualChannel' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.OnPawnSet
// 0x0028 (0x0028 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_OnPawnSet final
{
public:
	class APlayerState*                           Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  NewPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OldPawn;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet) == 0x000008, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_OnPawnSet");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet) == 0x000028, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_OnPawnSet");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet, Player) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnPawnSet::Player' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet, NewPawn) == 0x000008, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnPawnSet::NewPawn' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet, OldPawn) == 0x000010, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnPawnSet::OldPawn' has a wrong offset!");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_OnPawnSet, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'BP_TeamMemberIndicatorManager_Component_C_OnPawnSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay");
static_assert(sizeof(BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay");
static_assert(offsetof(BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TeamMemberIndicatorManager_Component_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

