#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowableActor_Toxic

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ThrowableActor_Toxic.BP_ThrowableActor_Toxic_C.ExecuteUbergraph_BP_ThrowableActor_Toxic
// 0x0040 (0x0040 - 0x0000)
struct BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TryPostEventOnAkComponent_ReturnValue_1;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic) == 0x000008, "Wrong alignment on BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic");
static_assert(sizeof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic) == 0x000040, "Wrong size on BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, EntryPoint) == 0x000000, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_TryPostEventOnAkComponent_ReturnValue) == 0x00000C, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_TryPostEventOnAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_TryPostEventOnAkComponent_ReturnValue_1) == 0x000014, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_TryPostEventOnAkComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_HasAuthority_ReturnValue_1) == 0x000018, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000019, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x00001A, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x000020, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1) == 0x000030, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000038, "Member 'BP_ThrowableActor_Toxic_C_ExecuteUbergraph_BP_ThrowableActor_Toxic::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function BP_ThrowableActor_Toxic.BP_ThrowableActor_Toxic_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ThrowableActor_Toxic_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowableActor_Toxic_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ThrowableActor_Toxic_C_ReceiveTick");
static_assert(sizeof(BP_ThrowableActor_Toxic_C_ReceiveTick) == 0x000004, "Wrong size on BP_ThrowableActor_Toxic_C_ReceiveTick");
static_assert(offsetof(BP_ThrowableActor_Toxic_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ThrowableActor_Toxic_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

