#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerEvent_HideoutExpanding_FloodRoom_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TriggerEvent_HideoutExpanding_FloodRoom_2.BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick");
static_assert(sizeof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick) == 0x000004, "Wrong size on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TriggerEvent_HideoutExpanding_FloodRoom_2.BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_TriggerEvent_HideoutExpanding_FloodRoom_2.BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C.ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2
// 0x0538 (0x0538 - 0x0000)
struct BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASkeletalMeshActor*>             CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAkCallbackType                               K2Node_CustomEvent_CallbackType;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        K2Node_CustomEvent_CallbackInfo;                   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWaterBodyCustom*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterBodyCustom*                       K2Node_DynamicCast_AsWater_Body_Custom;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0150(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0240(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_2;     // 0x0330(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_2;        // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x1];                                      // 0x041B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWaterBodyCustom*                       CallFunc_Array_Get_Item_1;                         // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0428(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_3;     // 0x0448(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_3;        // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2) == 0x000008, "Wrong alignment on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2");
static_assert(sizeof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2) == 0x000538, "Wrong size on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, EntryPoint) == 0x000000, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, Temp_bool_True_if_break_was_hit_Variable) == 0x000005, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, Temp_bool_Has_Been_Initd_Variable) == 0x000007, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_Event_OtherActor) == 0x000018, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000028, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000048, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000070, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_CustomEvent_CallbackType) == 0x000079, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_CustomEvent_CallbackType' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_CustomEvent_CallbackInfo) == 0x000080, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_CustomEvent_CallbackInfo' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_PostAkEvent_ReturnValue) == 0x000088, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_3) == 0x00008C, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_GetAllActorsOfClass_OutActors) == 0x000090, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Array_IsNotEmpty_ReturnValue_1) == 0x0000A4, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Array_IsNotEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, Temp_int_Loop_Counter_Variable) == 0x0000A8, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_BooleanAND_ReturnValue) == 0x0000B4, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000B8, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_4) == 0x0000D0, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_GetActorUpVector_ReturnValue) == 0x0000D8, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_NegateVector_ReturnValue) == 0x0000F0, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_DynamicCast_AsWater_Body_Custom) == 0x000108, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_DynamicCast_AsWater_Body_Custom' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000118, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_5) == 0x000130, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_VLerp_ReturnValue) == 0x000138, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000150, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000238, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000240, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000328, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_6) == 0x000329, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_SweepHitResult_2) == 0x000330, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_ReturnValue_2) == 0x000418, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_7) == 0x000419, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsPlaying_ReturnValue) == 0x00041A, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, Temp_int_Array_Index_Variable) == 0x00041C, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Array_Get_Item_1) == 0x000420, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_Add_VectorVector_ReturnValue) == 0x000428, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_ComponentHasTag_ReturnValue) == 0x000440, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_IsValid_ReturnValue_8) == 0x000441, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_SweepHitResult_3) == 0x000448, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2, CallFunc_K2_SetActorLocation_ReturnValue_3) == 0x000530, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_FloodRoom_2::CallFunc_K2_SetActorLocation_ReturnValue_3' has a wrong offset!");

// Function BP_TriggerEvent_HideoutExpanding_FloodRoom_2.BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C.EndOfAkEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent) == 0x000008, "Wrong alignment on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent");
static_assert(sizeof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent) == 0x000010, "Wrong size on BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent, CallbackType) == 0x000000, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent::CallbackType' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent, CallbackInfo) == 0x000008, "Member 'BP_TriggerEvent_HideoutExpanding_FloodRoom_2_C_EndOfAkEvent::CallbackInfo' has a wrong offset!");

}

