#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TeamMemberIndicatorManager_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TeamMemberIndicatorManager_Component.BP_TeamMemberIndicatorManager_Component_C
// 0x0018 (0x00E0 - 0x00C8)
class UBP_TeamMemberIndicatorManager_Component_C final : public UP2PawnComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAsyncAction_ListenForGameplayMessage*  Async_Action;                                      // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 IndicatorComponentClass;                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddWidget(class APawn* Pawn)	 // 0xae1e64;
	void CreateIndicatorWidgets(int32 TeamId)	 // 0xae1e64;
	void DestroyIndicatorWidgets(int32 TeamId)	 // 0xae1e64;
	void ExecuteUbergraph_BP_TeamMemberIndicatorManager_Component(int32 EntryPoint)	 // 0xae1e64;
	void OnMessageReceived_E393F6614B8E4DC4697D1C950962842C(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void OnPawnSet(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveEndPlay(EEndPlayReason EndPlayReason)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_TeamMemberIndicatorManager_Component_C">();
	}
	static class UBP_TeamMemberIndicatorManager_Component_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_TeamMemberIndicatorManager_Component_C>();
	}
};
static_assert(alignof(UBP_TeamMemberIndicatorManager_Component_C) == 0x000008, "Wrong alignment on UBP_TeamMemberIndicatorManager_Component_C");
static_assert(sizeof(UBP_TeamMemberIndicatorManager_Component_C) == 0x0000E0, "Wrong size on UBP_TeamMemberIndicatorManager_Component_C");
static_assert(offsetof(UBP_TeamMemberIndicatorManager_Component_C, UberGraphFrame) == 0x0000C8, "Member 'UBP_TeamMemberIndicatorManager_Component_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TeamMemberIndicatorManager_Component_C, Async_Action) == 0x0000D0, "Member 'UBP_TeamMemberIndicatorManager_Component_C::Async_Action' has a wrong offset!");
static_assert(offsetof(UBP_TeamMemberIndicatorManager_Component_C, IndicatorComponentClass) == 0x0000D8, "Member 'UBP_TeamMemberIndicatorManager_Component_C::IndicatorComponentClass' has a wrong offset!");

}

