#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerEvent_FirstEnter_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TriggerEvent_FirstEnter_1.BP_TriggerEvent_FirstEnter_1_C
// 0x0050 (0x0360 - 0x0310)
class ABP_TriggerEvent_FirstEnter_1_C final : public AP2TriggerEventActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box03;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box02;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box01;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FActorDataLayer                        DataLayer04;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActorDataLayer                        DataLayer03;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActorDataLayer                        DataLayer02;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActorDataLayer                        DataLayer01;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         LightObjectList;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_TriggerEvent_FirstEnter_1(int32 EntryPoint)	 // 0xae1e64;
	void GetRelatedActors(class UPrimitiveComponent* OverlappedComponent, TArray<class AActor*>* RelatedActors)	 // 0xae1e64;
	void GetTargetDataLayer(class UPrimitiveComponent* OverlappedComponent, struct FActorDataLayer* DataLayer)	 // 0xae1e64;
	void OnEventCompleteBP()	 // 0xae1e64;
	void OnEventOngoingBeginBP()	 // 0xae1e64;
	void OnEventOngoingTickBP()	 // 0xae1e64;
	void OnEventReadyBP()	 // 0xae1e64;
	void OnInitializeBP()	 // 0xae1e64;
	void OnOvelap01(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_TriggerEvent_FirstEnter_1_C">();
	}
	static class ABP_TriggerEvent_FirstEnter_1_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_TriggerEvent_FirstEnter_1_C>();
	}
};
static_assert(alignof(ABP_TriggerEvent_FirstEnter_1_C) == 0x000008, "Wrong alignment on ABP_TriggerEvent_FirstEnter_1_C");
static_assert(sizeof(ABP_TriggerEvent_FirstEnter_1_C) == 0x000360, "Wrong size on ABP_TriggerEvent_FirstEnter_1_C");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, UberGraphFrame) == 0x000310, "Member 'ABP_TriggerEvent_FirstEnter_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, Box03) == 0x000318, "Member 'ABP_TriggerEvent_FirstEnter_1_C::Box03' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, Box02) == 0x000320, "Member 'ABP_TriggerEvent_FirstEnter_1_C::Box02' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, Box01) == 0x000328, "Member 'ABP_TriggerEvent_FirstEnter_1_C::Box01' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, DataLayer04) == 0x000330, "Member 'ABP_TriggerEvent_FirstEnter_1_C::DataLayer04' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, DataLayer03) == 0x000338, "Member 'ABP_TriggerEvent_FirstEnter_1_C::DataLayer03' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, DataLayer02) == 0x000340, "Member 'ABP_TriggerEvent_FirstEnter_1_C::DataLayer02' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, DataLayer01) == 0x000348, "Member 'ABP_TriggerEvent_FirstEnter_1_C::DataLayer01' has a wrong offset!");
static_assert(offsetof(ABP_TriggerEvent_FirstEnter_1_C, LightObjectList) == 0x000350, "Member 'ABP_TriggerEvent_FirstEnter_1_C::LightObjectList' has a wrong offset!");

}

