#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerEvent_HideoutExpanding_01_Wall03

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TriggerEvent_HideoutExpanding_01_Wall03.BP_TriggerEvent_HideoutExpanding_01_Wall03_C.ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03
// 0x0078 (0x0078 - 0x0000)
struct BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2GameMode_Hideout*                    K2Node_DynamicCast_AsP2Game_Mode_Hideout;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHideoutInstancingEnabled_ReturnValue;  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AP2HideoutActor*>                CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03) == 0x000008, "Wrong alignment on BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03");
static_assert(sizeof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03) == 0x000078, "Wrong size on BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, EntryPoint) == 0x000000, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_GetGameMode_ReturnValue) == 0x000008, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, K2Node_DynamicCast_AsP2Game_Mode_Hideout) == 0x000018, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::K2Node_DynamicCast_AsP2Game_Mode_Hideout' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_GetHideoutInstancingEnabled_ReturnValue) == 0x000021, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_GetHideoutInstancingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000060, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03, CallFunc_BooleanOR_ReturnValue) == 0x000071, "Member 'BP_TriggerEvent_HideoutExpanding_01_Wall03_C_ExecuteUbergraph_BP_TriggerEvent_HideoutExpanding_01_Wall03::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

