#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnlockContentReward_SkinCustomization

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UnlockContentReward_SkinCustomization.BP_UnlockContentReward_SkinCustomization_C.ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization
// 0x0020 (0x0020 - 0x0000)
struct BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_InPlayerController;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization) == 0x000008, "Wrong alignment on BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization");
static_assert(sizeof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization) == 0x000020, "Wrong size on BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization");
static_assert(offsetof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization, EntryPoint) == 0x000000, "Member 'BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization, K2Node_Event_InPlayerController) == 0x000008, "Member 'BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization::K2Node_Event_InPlayerController' has a wrong offset!");
static_assert(offsetof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization, K2Node_DynamicCast_AsP2Player_Controller) == 0x000010, "Member 'BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_UnlockContentReward_SkinCustomization_C_ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UnlockContentReward_SkinCustomization.BP_UnlockContentReward_SkinCustomization_C.BP_AddReward
// 0x0008 (0x0008 - 0x0000)
struct BP_UnlockContentReward_SkinCustomization_C_BP_AddReward final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UnlockContentReward_SkinCustomization_C_BP_AddReward) == 0x000008, "Wrong alignment on BP_UnlockContentReward_SkinCustomization_C_BP_AddReward");
static_assert(sizeof(BP_UnlockContentReward_SkinCustomization_C_BP_AddReward) == 0x000008, "Wrong size on BP_UnlockContentReward_SkinCustomization_C_BP_AddReward");
static_assert(offsetof(BP_UnlockContentReward_SkinCustomization_C_BP_AddReward, InPlayerController) == 0x000000, "Member 'BP_UnlockContentReward_SkinCustomization_C_BP_AddReward::InPlayerController' has a wrong offset!");

}

