#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnlockContentReward_SkinCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnlockContentReward_SkinCustomization.BP_UnlockContentReward_SkinCustomization_C
// 0x0028 (0x0058 - 0x0030)
class UBP_UnlockContentReward_SkinCustomization_C final : public UP2UnlockContentRewardBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UP2ItemSkinContainer*>           ItemSkinContainers;                                // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UP2SkinSlotPreset*>              SkinSlotPresets;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_UnlockContentReward_SkinCustomization(int32 EntryPoint)	 // 0xae1e64;
	void BP_AddReward(class APlayerController* InPlayerController)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_UnlockContentReward_SkinCustomization_C">();
	}
	static class UBP_UnlockContentReward_SkinCustomization_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBP_UnlockContentReward_SkinCustomization_C>();
	}
};
static_assert(alignof(UBP_UnlockContentReward_SkinCustomization_C) == 0x000008, "Wrong alignment on UBP_UnlockContentReward_SkinCustomization_C");
static_assert(sizeof(UBP_UnlockContentReward_SkinCustomization_C) == 0x000058, "Wrong size on UBP_UnlockContentReward_SkinCustomization_C");
static_assert(offsetof(UBP_UnlockContentReward_SkinCustomization_C, UberGraphFrame) == 0x000030, "Member 'UBP_UnlockContentReward_SkinCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UnlockContentReward_SkinCustomization_C, ItemSkinContainers) == 0x000038, "Member 'UBP_UnlockContentReward_SkinCustomization_C::ItemSkinContainers' has a wrong offset!");
static_assert(offsetof(UBP_UnlockContentReward_SkinCustomization_C, SkinSlotPresets) == 0x000048, "Member 'UBP_UnlockContentReward_SkinCustomization_C::SkinSlotPresets' has a wrong offset!");

}

