#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VRStationScriptActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VRStationScriptActor.BP_VRStationScriptActor_C.OnSimulationStarted
// 0x0008 (0x0008 - 0x0000)
struct BP_VRStationScriptActor_C_OnSimulationStarted final
{
public:
	class AP2HeroCharacter*                       InSimulationHero;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VRStationScriptActor_C_OnSimulationStarted) == 0x000008, "Wrong alignment on BP_VRStationScriptActor_C_OnSimulationStarted");
static_assert(sizeof(BP_VRStationScriptActor_C_OnSimulationStarted) == 0x000008, "Wrong size on BP_VRStationScriptActor_C_OnSimulationStarted");
static_assert(offsetof(BP_VRStationScriptActor_C_OnSimulationStarted, InSimulationHero) == 0x000000, "Member 'BP_VRStationScriptActor_C_OnSimulationStarted::InSimulationHero' has a wrong offset!");

// Function BP_VRStationScriptActor.BP_VRStationScriptActor_C.OnSimulationRestarted
// 0x0010 (0x0010 - 0x0000)
struct BP_VRStationScriptActor_C_OnSimulationRestarted final
{
public:
	class AP2HeroCharacter*                       InSimulationHero;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       InPreviousSimulationHero;                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VRStationScriptActor_C_OnSimulationRestarted) == 0x000008, "Wrong alignment on BP_VRStationScriptActor_C_OnSimulationRestarted");
static_assert(sizeof(BP_VRStationScriptActor_C_OnSimulationRestarted) == 0x000010, "Wrong size on BP_VRStationScriptActor_C_OnSimulationRestarted");
static_assert(offsetof(BP_VRStationScriptActor_C_OnSimulationRestarted, InSimulationHero) == 0x000000, "Member 'BP_VRStationScriptActor_C_OnSimulationRestarted::InSimulationHero' has a wrong offset!");
static_assert(offsetof(BP_VRStationScriptActor_C_OnSimulationRestarted, InPreviousSimulationHero) == 0x000008, "Member 'BP_VRStationScriptActor_C_OnSimulationRestarted::InPreviousSimulationHero' has a wrong offset!");

// Function BP_VRStationScriptActor.BP_VRStationScriptActor_C.OnSimulationEnded
// 0x0008 (0x0008 - 0x0000)
struct BP_VRStationScriptActor_C_OnSimulationEnded final
{
public:
	class AP2HeroCharacter*                       InSimulationHero;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VRStationScriptActor_C_OnSimulationEnded) == 0x000008, "Wrong alignment on BP_VRStationScriptActor_C_OnSimulationEnded");
static_assert(sizeof(BP_VRStationScriptActor_C_OnSimulationEnded) == 0x000008, "Wrong size on BP_VRStationScriptActor_C_OnSimulationEnded");
static_assert(offsetof(BP_VRStationScriptActor_C_OnSimulationEnded, InSimulationHero) == 0x000000, "Member 'BP_VRStationScriptActor_C_OnSimulationEnded::InSimulationHero' has a wrong offset!");

// Function BP_VRStationScriptActor.BP_VRStationScriptActor_C.ExecuteUbergraph_BP_VRStationScriptActor
// 0x0028 (0x0028 - 0x0000)
struct BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_Event_InSimulationHero;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_Event_InPreviousSimulationHero;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_Event_InSimulationHero_2;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_Event_InSimulationHero_1;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor) == 0x000008, "Wrong alignment on BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor");
static_assert(sizeof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor) == 0x000028, "Wrong size on BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor");
static_assert(offsetof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor, EntryPoint) == 0x000000, "Member 'BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor, K2Node_Event_InSimulationHero) == 0x000008, "Member 'BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor::K2Node_Event_InSimulationHero' has a wrong offset!");
static_assert(offsetof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor, K2Node_Event_InPreviousSimulationHero) == 0x000010, "Member 'BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor::K2Node_Event_InPreviousSimulationHero' has a wrong offset!");
static_assert(offsetof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor, K2Node_Event_InSimulationHero_2) == 0x000018, "Member 'BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor::K2Node_Event_InSimulationHero_2' has a wrong offset!");
static_assert(offsetof(BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor, K2Node_Event_InSimulationHero_1) == 0x000020, "Member 'BP_VRStationScriptActor_C_ExecuteUbergraph_BP_VRStationScriptActor::K2Node_Event_InSimulationHero_1' has a wrong offset!");

}

