#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VRStationExit

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VRStationExit.BP_VRStationExit_C
// 0x0018 (0x02C8 - 0x02B0)
class ABP_VRStationExit_C final : public AActor
{
public:
	class UP2ActionComponent*                     P2Action;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_VRStationExit_C">();
	}
	static class ABP_VRStationExit_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_VRStationExit_C>();
	}
};
static_assert(alignof(ABP_VRStationExit_C) == 0x000008, "Wrong alignment on ABP_VRStationExit_C");
static_assert(sizeof(ABP_VRStationExit_C) == 0x0002C8, "Wrong size on ABP_VRStationExit_C");
static_assert(offsetof(ABP_VRStationExit_C, P2Action) == 0x0002B0, "Member 'ABP_VRStationExit_C::P2Action' has a wrong offset!");
static_assert(offsetof(ABP_VRStationExit_C, Cube) == 0x0002B8, "Member 'ABP_VRStationExit_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_VRStationExit_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_VRStationExit_C::DefaultSceneRoot' has a wrong offset!");

}

