#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterIllusion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_SpectreAudioEmitterGroups_structs.hpp"
#include "SpectreBossRuntime_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterIllusion.BP_WaterIllusion_C
// 0x0830 (0x0B00 - 0x02D0)
class ABP_WaterIllusion_C final : public AP2SpectreWaterIllusion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak6;                                               // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak5;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak4;                                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak3;                                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak2;                                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak1;                                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Particles;                                         // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeometryCacheComponent*                Surface;                                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AudioSingleDrips_Scene;                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Remove_37503C164FD42E1A1674BB8A52FF32B3; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_37503C164FD42E1A1674BB8A52FF32B3; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Animate_89AD8B904EBD90935790FD88455D9226; // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_89AD8B904EBD90935790FD88455D9226; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DripsProgress_Progress_251562B041B813D47D3BBDAD4219F1A3; // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DripsProgress__Direction_251562B041B813D47D3BBDAD4219F1A3; // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DripsProgress;                                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLooping;                                         // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentFrame;                                      // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopingFrame;                                      // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalFrames;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpectreAudioEmitterGroups                   Quad_Emitter_Reg_Key;                              // 0x036C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpectreAudioEmitterGroups                   Electrocute_Voume_Ref;                             // 0x036D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SpectreAudioEmitterGroups                   CeilingAudioRef;                                   // 0x036E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F[0x1];                                      // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               PostProcess;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   OriginalPostProcessSettings;                       // 0x0380(0x0740)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         WaterbodyRiseOffset;                               // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AnimationStartOffset;                              // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpectreAnimStartDurationOffset;                    // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationTime;                                     // 0x0AD0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ServerTime;                                        // 0x0AD8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseStarted;                                   // 0x0AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              Splashes;                                          // 0x0AE8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CancelCollapse()	 // 0xae1e64;
	void Collapse()	 // 0xae1e64;
	void DripsProgress__FinishedFunc()	 // 0xae1e64;
	void DripsProgress__UpdateFunc()	 // 0xae1e64;
	void EndWaterIllusion()	 // 0xae1e64;
	void ExecuteUbergraph_BP_WaterIllusion(int32 EntryPoint)	 // 0xae1e64;
	void GetGeoCacheProgress(class UGeometryCacheComponent* GeometryCache, int32* CurrentFrame_0, double* CurrentTime, double* Progress)	 // 0xae1e64;
	void GetPlayerSubmersionFrame(int32* SubmersionFrame, int32* FramesUntilSubmersion)	 // 0xae1e64;
	void K2_OnReset()	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveEndPlay(EEndPlayReason EndPlayReason)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void Reset_Geo_Cache_State_Switch()	 // 0xae1e64;
	void Reset_Particle_Spawn()	 // 0xae1e64;
	void Reset_Submersion_State_Switch()	 // 0xae1e64;
	void ResetWaterIllusion()	 // 0xae1e64;
	void Start_Water_Illusion_animation(double Server_Time)	 // 0xae1e64;
	void Timeline_0__FinishedFunc()	 // 0xae1e64;
	void Timeline_0__UpdateFunc()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BP_WaterIllusion_C">();
	}
	static class ABP_WaterIllusion_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ABP_WaterIllusion_C>();
	}
};
static_assert(alignof(ABP_WaterIllusion_C) == 0x000010, "Wrong alignment on ABP_WaterIllusion_C");
static_assert(sizeof(ABP_WaterIllusion_C) == 0x000B00, "Wrong size on ABP_WaterIllusion_C");
static_assert(offsetof(ABP_WaterIllusion_C, UberGraphFrame) == 0x0002D0, "Member 'ABP_WaterIllusion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak6) == 0x0002D8, "Member 'ABP_WaterIllusion_C::Ak6' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak5) == 0x0002E0, "Member 'ABP_WaterIllusion_C::Ak5' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak4) == 0x0002E8, "Member 'ABP_WaterIllusion_C::Ak4' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak3) == 0x0002F0, "Member 'ABP_WaterIllusion_C::Ak3' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak2) == 0x0002F8, "Member 'ABP_WaterIllusion_C::Ak2' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Ak1) == 0x000300, "Member 'ABP_WaterIllusion_C::Ak1' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Particles) == 0x000308, "Member 'ABP_WaterIllusion_C::Particles' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Surface) == 0x000310, "Member 'ABP_WaterIllusion_C::Surface' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, AudioSingleDrips_Scene) == 0x000318, "Member 'ABP_WaterIllusion_C::AudioSingleDrips_Scene' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, DefaultSceneRoot) == 0x000320, "Member 'ABP_WaterIllusion_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline_0_Remove_37503C164FD42E1A1674BB8A52FF32B3) == 0x000328, "Member 'ABP_WaterIllusion_C::Timeline_0_Remove_37503C164FD42E1A1674BB8A52FF32B3' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline_0__Direction_37503C164FD42E1A1674BB8A52FF32B3) == 0x00032C, "Member 'ABP_WaterIllusion_C::Timeline_0__Direction_37503C164FD42E1A1674BB8A52FF32B3' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline_0) == 0x000330, "Member 'ABP_WaterIllusion_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline_Animate_89AD8B904EBD90935790FD88455D9226) == 0x000338, "Member 'ABP_WaterIllusion_C::Timeline_Animate_89AD8B904EBD90935790FD88455D9226' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline__Direction_89AD8B904EBD90935790FD88455D9226) == 0x00033C, "Member 'ABP_WaterIllusion_C::Timeline__Direction_89AD8B904EBD90935790FD88455D9226' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Timeline) == 0x000340, "Member 'ABP_WaterIllusion_C::Timeline' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, DripsProgress_Progress_251562B041B813D47D3BBDAD4219F1A3) == 0x000348, "Member 'ABP_WaterIllusion_C::DripsProgress_Progress_251562B041B813D47D3BBDAD4219F1A3' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, DripsProgress__Direction_251562B041B813D47D3BBDAD4219F1A3) == 0x00034C, "Member 'ABP_WaterIllusion_C::DripsProgress__Direction_251562B041B813D47D3BBDAD4219F1A3' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, DripsProgress) == 0x000350, "Member 'ABP_WaterIllusion_C::DripsProgress' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, IsActive) == 0x000358, "Member 'ABP_WaterIllusion_C::IsActive' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, IsLooping) == 0x000359, "Member 'ABP_WaterIllusion_C::IsLooping' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Speed) == 0x00035C, "Member 'ABP_WaterIllusion_C::Speed' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, CurrentFrame) == 0x000360, "Member 'ABP_WaterIllusion_C::CurrentFrame' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, LoopingFrame) == 0x000364, "Member 'ABP_WaterIllusion_C::LoopingFrame' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, TotalFrames) == 0x000368, "Member 'ABP_WaterIllusion_C::TotalFrames' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Quad_Emitter_Reg_Key) == 0x00036C, "Member 'ABP_WaterIllusion_C::Quad_Emitter_Reg_Key' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Electrocute_Voume_Ref) == 0x00036D, "Member 'ABP_WaterIllusion_C::Electrocute_Voume_Ref' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, CeilingAudioRef) == 0x00036E, "Member 'ABP_WaterIllusion_C::CeilingAudioRef' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, PostProcess) == 0x000370, "Member 'ABP_WaterIllusion_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, OriginalPostProcessSettings) == 0x000380, "Member 'ABP_WaterIllusion_C::OriginalPostProcessSettings' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, WaterbodyRiseOffset) == 0x000AC0, "Member 'ABP_WaterIllusion_C::WaterbodyRiseOffset' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, AnimationStartOffset) == 0x000AC4, "Member 'ABP_WaterIllusion_C::AnimationStartOffset' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, SpectreAnimStartDurationOffset) == 0x000AC8, "Member 'ABP_WaterIllusion_C::SpectreAnimStartDurationOffset' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, AnimationTime) == 0x000AD0, "Member 'ABP_WaterIllusion_C::AnimationTime' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, ServerTime) == 0x000AD8, "Member 'ABP_WaterIllusion_C::ServerTime' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, CollapseStarted) == 0x000AE0, "Member 'ABP_WaterIllusion_C::CollapseStarted' has a wrong offset!");
static_assert(offsetof(ABP_WaterIllusion_C, Splashes) == 0x000AE8, "Member 'ABP_WaterIllusion_C::Splashes' has a wrong offset!");

}

