#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaveGrenade_Default_DamageActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WaveGrenade_Default_DamageActor.BP_WaveGrenade_Default_DamageActor_C.ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor
// 0x07E0 (0x07E0 - 0x0000)
struct BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0048(0x0010)(NoDestructor)
	TArray<struct FWeightedBlendable>             K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0068(0x0010)()
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0080(0x0740)()
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetWaveSoundLocation_PhysicalWaveRadius_ImplicitCast; // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_InRangeB_ImplicitCast;    // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor) == 0x000010, "Wrong alignment on BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor");
static_assert(sizeof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor) == 0x0007E0, "Wrong size on BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, EntryPoint) == 0x000000, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_GetPlaybackPosition_ReturnValue) == 0x000014, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_GetTimelineLength_ReturnValue) == 0x000020, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, Temp_bool_IsClosed_Variable) == 0x000024, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_MapRangeClamped_ReturnValue) == 0x000030, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_Round_ReturnValue) == 0x000038, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000040, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, K2Node_MakeStruct_WeightedBlendable) == 0x000048, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::K2Node_MakeStruct_WeightedBlendable' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, K2Node_MakeArray_Array) == 0x000058, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, K2Node_MakeStruct_WeightedBlendables) == 0x000068, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, K2Node_MakeStruct_PostProcessSettings) == 0x000080, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::K2Node_MakeStruct_PostProcessSettings' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0007C0, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_SetWaveSoundLocation_PhysicalWaveRadius_ImplicitCast) == 0x0007C8, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_SetWaveSoundLocation_PhysicalWaveRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0007D0, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor, CallFunc_MapRangeClamped_InRangeB_ImplicitCast) == 0x0007D8, "Member 'BP_WaveGrenade_Default_DamageActor_C_ExecuteUbergraph_BP_WaveGrenade_Default_DamageActor::CallFunc_MapRangeClamped_InRangeB_ImplicitCast' has a wrong offset!");

// Function BP_WaveGrenade_Default_DamageActor.BP_WaveGrenade_Default_DamageActor_C.SetWaveSoundLocation
// 0x01D0 (0x01D0 - 0x0000)
struct BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation final
{
public:
	double                                        PhysicalWaveRadius;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x00E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation) == 0x000008, "Wrong alignment on BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation");
static_assert(sizeof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation) == 0x0001D0, "Wrong size on BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, PhysicalWaveRadius) == 0x000000, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::PhysicalWaveRadius' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_IsServer_ReturnValue) == 0x000008, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_GetLocalViewActor_ReturnValue) == 0x000060, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_GetLocalViewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000068, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Normal_ReturnValue) == 0x0000A0, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x0000E8, "Member 'BP_WaveGrenade_Default_DamageActor_C_SetWaveSoundLocation::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

}

