#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterIllusion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_WaterIllusion.BP_WaterIllusion_C.ExecuteUbergraph_BP_WaterIllusion
// 0x1280 (0x1280 - 0x0000)
struct BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_2; // 0x0034(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_3; // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAudioEmitterObjects_ReturnValue;       // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerSubmersionFrame_SubmersionFrame; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion; // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_4; // 0x00B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_6;                     // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_1;         // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_2;         // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_2;        // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_Copy_ReturnValue;                           // 0x0110(0x0740)()
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_3;         // 0x0850(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_3;        // 0x0858(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0860(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfFrames_ReturnValue;            // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0874(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x0875(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_876[0x2];                                      // 0x0876(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue_2;                   // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_889[0x3];                                      // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x3];                                      // 0x0891(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0894(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0898(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x08A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_5; // 0x08A8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_6; // 0x08B8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_4;                  // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_5;                  // 0x08CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Server_Time;                    // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_3;          // 0x08E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         CallFunc_GetBossCharacter_ReturnValue;             // 0x08E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDuration_ReturnValue;                  // 0x08F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfFrames_ReturnValue_1;          // 0x08F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_6;               // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Percent_FloatFloat_ReturnValue;           // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_4;          // 0x0920(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         CallFunc_GetBossCharacter_ReturnValue_1;           // 0x0928(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_931[0x3];                                      // 0x0931(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGeoCacheProgress_CurrentFrame;         // 0x0934(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGeoCacheProgress_CurrentTime;          // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGeoCacheProgress_Progress;             // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0948(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_969[0x7];                                      // 0x0969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0970(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDuration_ReturnValue_1;                // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98C[0x4];                                      // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0990(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfFrames_ReturnValue_2;          // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_7;               // 0x099C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99D[0x3];                                      // 0x099D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BD[0x3];                                      // 0x09BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_7; // 0x09C4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_6;                  // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_8; // 0x09D8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_7;                  // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9EC[0x4];                                      // 0x09EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_4;         // 0x09F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_9; // 0x09F8(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0A08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A11[0x3];                                      // 0x0A11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_8;                  // 0x0A14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterInBossRoom_ReturnValue;        // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_7;                     // 0x0A19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1A[0x6];                                      // 0x0A1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkComponent*>                   K2Node_MakeArray_Array;                            // 0x0A20(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAkComponent*                           CallFunc_Array_Get_Item_1;                         // 0x0A30(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0A3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A41[0x3];                                      // 0x0A41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_10; // 0x0A44(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_11; // 0x0A54(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_9;                  // 0x0A64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_10;                 // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6C[0x4];                                      // 0x0A6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0A70(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0A90(0x0740)()
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x11D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_12; // 0x11E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_11;                 // 0x11F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_13; // 0x11F4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_12;                 // 0x1204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x1208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x1210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x1218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x1220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x1228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_14; // 0x122C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123C[0x4];                                     // 0x123C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x1240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_13;                 // 0x1248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124C[0x4];                                     // 0x124C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x1250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x1258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x125C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x1260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartTimeOffset_NewStartTimeOffset_ImplicitCast; // 0x1268(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126C[0x4];                                     // 0x126C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x1270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartTimeOffset_NewStartTimeOffset_ImplicitCast_1; // 0x1278(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion) == 0x000010, "Wrong alignment on BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion");
static_assert(sizeof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion) == 0x001280, "Wrong size on BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, EntryPoint) == 0x000000, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable) == 0x000004, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable) == 0x000014, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable) == 0x000015, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_1) == 0x000016, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_1) == 0x000018, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_1) == 0x000028, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_2) == 0x000030, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_2) == 0x000034, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_2) == 0x000044, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_1) == 0x000048, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_3) == 0x00004C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_3) == 0x000050, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_3) == 0x000060, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_2) == 0x000064, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_4) == 0x000068, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_4) == 0x000069, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_Event_DeltaSeconds) == 0x00006C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_Event_EndPlayReason) == 0x000070, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000078, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_5) == 0x000080, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetAudioEmitterObjects_ReturnValue) == 0x000088, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetAudioEmitterObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00009D, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x00009E, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x00009F, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_5) == 0x0000A0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetPlayerSubmersionFrame_SubmersionFrame) == 0x0000A4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetPlayerSubmersionFrame_SubmersionFrame' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion) == 0x0000A8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000AD, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000AE, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x0000AF, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_4) == 0x0000B0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_3) == 0x0000C0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_6) == 0x0000C4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000C8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x0000D0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_FindCameraComponent_ReturnValue) == 0x0000D8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x0000E0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetWorldSubsystem_ReturnValue_2) == 0x0000E8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetWorldSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetLocalPlayerPawn_ReturnValue_1) == 0x0000F0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetLocalPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetLocalPlayerPawn_ReturnValue_2) == 0x0000F8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetLocalPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_FindCameraComponent_ReturnValue_1) == 0x000100, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_FindCameraComponent_ReturnValue_2) == 0x000108, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_FindCameraComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_Copy_ReturnValue) == 0x000110, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetLocalPlayerPawn_ReturnValue_3) == 0x000850, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetLocalPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_FindCameraComponent_ReturnValue_3) == 0x000858, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_FindCameraComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000860, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetNumberOfFrames_ReturnValue) == 0x000870, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetNumberOfFrames_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsServer_ReturnValue) == 0x000874, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsServer_ReturnValue_1) == 0x000875, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_int_Array_Index_Variable) == 0x000878, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000880, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsServer_ReturnValue_2) == 0x000888, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Add_IntInt_ReturnValue) == 0x00088C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GreaterEqual_IntInt_ReturnValue_4) == 0x000890, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GreaterEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_int_Array_Index_Variable_1) == 0x000894, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Array_Get_Item) == 0x000898, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_int_Loop_Counter_Variable) == 0x0008A0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Add_IntInt_ReturnValue_1) == 0x0008A4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_5) == 0x0008A8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_6) == 0x0008B8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_4) == 0x0008C8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_5) == 0x0008CC, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_CustomEvent_Server_Time) == 0x0008D0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_CustomEvent_Server_Time' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0008D8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetWorldSubsystem_ReturnValue_3) == 0x0008E0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetWorldSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetBossCharacter_ReturnValue) == 0x0008E8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetBossCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetDuration_ReturnValue) == 0x0008F0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetNumberOfFrames_ReturnValue_1) == 0x0008F4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetNumberOfFrames_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_6) == 0x0008F8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000900, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000908, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000910, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Percent_FloatFloat_ReturnValue) == 0x000918, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetWorldSubsystem_ReturnValue_4) == 0x000920, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetWorldSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetBossCharacter_ReturnValue_1) == 0x000928, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetBossCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsValid_ReturnValue) == 0x000930, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetGeoCacheProgress_CurrentFrame) == 0x000934, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetGeoCacheProgress_CurrentFrame' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetGeoCacheProgress_CurrentTime) == 0x000938, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetGeoCacheProgress_CurrentTime' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetGeoCacheProgress_Progress) == 0x000940, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetGeoCacheProgress_Progress' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetGameState_ReturnValue) == 0x000948, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000950, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsValid_ReturnValue_1) == 0x000958, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000960, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsValid_ReturnValue_2) == 0x000968, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000970, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetDuration_ReturnValue_1) == 0x000988, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetDuration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000990, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetNumberOfFrames_ReturnValue_2) == 0x000998, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetNumberOfFrames_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_Has_Been_Initd_Variable_7) == 0x00099C, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_Has_Been_Initd_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0009A0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x0009A8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0009B0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_int_Loop_Counter_Variable_1) == 0x0009B8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Less_IntInt_ReturnValue) == 0x0009BC, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Add_IntInt_ReturnValue_2) == 0x0009C0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_7) == 0x0009C4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_6) == 0x0009D4, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_8) == 0x0009D8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_7) == 0x0009E8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_GetLocalPlayerPawn_ReturnValue_4) == 0x0009F0, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_GetLocalPlayerPawn_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_delegate_Variable_9) == 0x0009F8, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_delegate_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_DynamicCast_AsP2Hero_Character) == 0x000A08, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_DynamicCast_bSuccess) == 0x000A10, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_PostEvent_ReturnValue_8) == 0x000A14, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_PostEvent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_IsCharacterInBossRoom_ReturnValue) == 0x000A18, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_IsCharacterInBossRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, Temp_bool_IsClosed_Variable_7) == 0x000A19, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::Temp_bool_IsClosed_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, K2Node_MakeArray_Array) == 0x000A20, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Array_Get_Item_1) == 0x000A30, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion, CallFunc_Array_Length_ReturnValue_1) == 0x000A38, "Member 'BP_WaterIllusion_C_ExecuteUbergraph_BP_WaterIllusion::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
