#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_AudioFunctions

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BPFL_AudioFunctions.BPFL_AudioFunctions_C.Execute Cue from Widget
// 0x0130 (0x0130 - 0x0000)
struct BPFL_AudioFunctions_C_Execute_Cue_from_Widget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0030(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_Select_Default;                             // 0x0128(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget) == 0x000008, "Wrong alignment on BPFL_AudioFunctions_C_Execute_Cue_from_Widget");
static_assert(sizeof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget) == 0x000130, "Wrong size on BPFL_AudioFunctions_C_Execute_Cue_from_Widget");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, Widget) == 0x000000, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::Widget' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, GameplayCueTag) == 0x000008, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::GameplayCueTag' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, __WorldContext) == 0x000010, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, Temp_bool_Variable) == 0x000018, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000019, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, CallFunc_K2_GetPawn_ReturnValue) == 0x000028, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, Temp_struct_Variable) == 0x000030, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_Execute_Cue_from_Widget, K2Node_Select_Default) == 0x000128, "Member 'BPFL_AudioFunctions_C_Execute_Cue_from_Widget::K2Node_Select_Default' has a wrong offset!");

// Function BPFL_AudioFunctions.BPFL_AudioFunctions_C.PostEventFromConfig
// 0x0088 (0x0088 - 0x0000)
struct BPFL_AudioFunctions_C_PostEventFromConfig final
{
public:
	class AActor*                                 Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAkEventSlotConfig                     Config;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayingID;                                         // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_GetAudioEventFromConfigNetRole_InInterface_CastInput; // 0x0058(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAkAudioEvent*                          CallFunc_GetAudioEventFromConfigNetRole_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_PostAkEvent_self_CastInput;               // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AudioFunctions_C_PostEventFromConfig) == 0x000008, "Wrong alignment on BPFL_AudioFunctions_C_PostEventFromConfig");
static_assert(sizeof(BPFL_AudioFunctions_C_PostEventFromConfig) == 0x000088, "Wrong size on BPFL_AudioFunctions_C_PostEventFromConfig");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, Character) == 0x000000, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::Character' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, Config) == 0x000008, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::Config' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, __WorldContext) == 0x000038, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, PlayingID) == 0x000040, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::PlayingID' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, K2Node_DynamicCast_AsP2Base_Character) == 0x000048, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, CallFunc_GetAudioEventFromConfigNetRole_InInterface_CastInput) == 0x000058, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::CallFunc_GetAudioEventFromConfigNetRole_InInterface_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, CallFunc_GetAudioEventFromConfigNetRole_ReturnValue) == 0x000068, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::CallFunc_GetAudioEventFromConfigNetRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, CallFunc_PostAkEvent_self_CastInput) == 0x000070, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::CallFunc_PostAkEvent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostEventFromConfig, CallFunc_PostAkEvent_ReturnValue) == 0x000080, "Member 'BPFL_AudioFunctions_C_PostEventFromConfig::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BPFL_AudioFunctions.BPFL_AudioFunctions_C.PostLocalOnlyEvent
// 0x0048 (0x0048 - 0x0000)
struct BPFL_AudioFunctions_C_PostLocalOnlyEvent final
{
public:
	class UObject*                                My_Target;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Event;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayingID;                                         // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_PostAkEvent_self_CastInput;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AudioFunctions_C_PostLocalOnlyEvent) == 0x000008, "Wrong alignment on BPFL_AudioFunctions_C_PostLocalOnlyEvent");
static_assert(sizeof(BPFL_AudioFunctions_C_PostLocalOnlyEvent) == 0x000048, "Wrong size on BPFL_AudioFunctions_C_PostLocalOnlyEvent");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, My_Target) == 0x000000, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::My_Target' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, Event) == 0x000008, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::Event' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, __WorldContext) == 0x000010, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, PlayingID) == 0x000018, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::PlayingID' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, K2Node_DynamicCast_AsP2Base_Character) == 0x000020, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, CallFunc_IsLocallyViewed_ReturnValue) == 0x000029, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, CallFunc_PostAkEvent_self_CastInput) == 0x000030, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::CallFunc_PostAkEvent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalOnlyEvent, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BPFL_AudioFunctions_C_PostLocalOnlyEvent::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function BPFL_AudioFunctions.BPFL_AudioFunctions_C.PostLocalRemoteEvents
// 0x0078 (0x0078 - 0x0000)
struct BPFL_AudioFunctions_C_PostLocalRemoteEvents final
{
public:
	class UObject*                                Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Local_Event;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Allied_Event;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Enemy_Event;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayingID;                                         // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_GetWwiseTeamStatus_self_CastInput;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2WwiseTeamStatus                            CallFunc_GetWwiseTeamStatus_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_PostAkEvent_self_CastInput;               // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_AudioFunctions_C_PostLocalRemoteEvents) == 0x000008, "Wrong alignment on BPFL_AudioFunctions_C_PostLocalRemoteEvents");
static_assert(sizeof(BPFL_AudioFunctions_C_PostLocalRemoteEvents) == 0x000078, "Wrong size on BPFL_AudioFunctions_C_PostLocalRemoteEvents");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, Character) == 0x000000, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::Character' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, Local_Event) == 0x000008, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::Local_Event' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, Remote_Allied_Event) == 0x000010, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::Remote_Allied_Event' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, Remote_Enemy_Event) == 0x000018, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::Remote_Enemy_Event' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, __WorldContext) == 0x000020, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, PlayingID) == 0x000028, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::PlayingID' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, Temp_byte_Variable) == 0x00002C, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, K2Node_DynamicCast_AsP2Base_Character) == 0x000030, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, CallFunc_GetWwiseTeamStatus_self_CastInput) == 0x000040, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::CallFunc_GetWwiseTeamStatus_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, CallFunc_GetWwiseTeamStatus_ReturnValue) == 0x000050, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::CallFunc_GetWwiseTeamStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, K2Node_Select_Default) == 0x000058, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, CallFunc_PostAkEvent_self_CastInput) == 0x000060, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::CallFunc_PostAkEvent_self_CastInput' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, CallFunc_PostAkEvent_ReturnValue) == 0x000070, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_AudioFunctions_C_PostLocalRemoteEvents, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'BPFL_AudioFunctions_C_PostLocalRemoteEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

