#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_IsInsideAnomaly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTDecorator_IsInsideAnomaly.BTDecorator_IsInsideAnomaly_C.PerformConditionCheckAI
// 0x0058 (0x0058 - 0x0000)
struct BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_IsInsideAnomaly_OutDistance;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsInsideAnomaly_OutClosestPoint;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInsideAnomaly_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI) == 0x000058, "Wrong size on BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, CallFunc_IsInsideAnomaly_OutDistance) == 0x000030, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::CallFunc_IsInsideAnomaly_OutDistance' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, CallFunc_IsInsideAnomaly_OutClosestPoint) == 0x000038, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::CallFunc_IsInsideAnomaly_OutClosestPoint' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI, CallFunc_IsInsideAnomaly_ReturnValue) == 0x000050, "Member 'BTDecorator_IsInsideAnomaly_C_PerformConditionCheckAI::CallFunc_IsInsideAnomaly_ReturnValue' has a wrong offset!");

}

