#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_IsLured

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTDecorator_IsLured.BTDecorator_IsLured_C.PerformConditionCheckAI
// 0x0040 (0x0040 - 0x0000)
struct BTDecorator_IsLured_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTDecorator_IsLured_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_IsLured_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_IsLured_C_PerformConditionCheckAI) == 0x000040, "Wrong size on BTDecorator_IsLured_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000018, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000028, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BTDecorator_IsLured_C_PerformConditionCheckAI, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000038, "Member 'BTDecorator_IsLured_C_PerformConditionCheckAI::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

