#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_AlwaysTrue

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_AlwaysTrue.BTTask_AlwaysTrue_C.ExecuteUbergraph_BTTask_AlwaysTrue
// 0x0010 (0x0010 - 0x0000)
struct BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue) == 0x000008, "Wrong alignment on BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue");
static_assert(sizeof(BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue) == 0x000010, "Wrong size on BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue");
static_assert(offsetof(BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue, EntryPoint) == 0x000000, "Member 'BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTTask_AlwaysTrue_C_ExecuteUbergraph_BTTask_AlwaysTrue::K2Node_Event_OwnerActor' has a wrong offset!");

// Function BTTask_AlwaysTrue.BTTask_AlwaysTrue_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTTask_AlwaysTrue_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_AlwaysTrue_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTTask_AlwaysTrue_C_ReceiveExecute");
static_assert(sizeof(BTTask_AlwaysTrue_C_ReceiveExecute) == 0x000008, "Wrong size on BTTask_AlwaysTrue_C_ReceiveExecute");
static_assert(offsetof(BTTask_AlwaysTrue_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTTask_AlwaysTrue_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

