#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetClosestPointToAnomaly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTTask_GetClosestPointToAnomaly.BTTask_GetClosestPointToAnomaly_C.ExecuteUbergraph_BTTask_GetClosestPointToAnomaly
// 0x02E0 (0x02E0 - 0x0000)
struct BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2NpcFlyingCharacter*                  K2Node_DynamicCast_AsP2Npc_Flying_Character;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_IsInsideAnomaly_OutDistance;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_IsInsideAnomaly_OutClosestPoint;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInsideAnomaly_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMercunaNavOctree*                      CallFunc_GetNavOctree_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B3[0x1];                                      // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ClampToNavigable_ClampedPosition;         // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClampToNavigable_Result;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly) == 0x000008, "Wrong alignment on BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly");
static_assert(sizeof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly) == 0x0002E0, "Wrong size on BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, EntryPoint) == 0x000000, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, Temp_object_Variable) == 0x000008, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, K2Node_Event_OwnerController) == 0x000018, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, K2Node_DynamicCast_AsP2Npc_Flying_Character) == 0x000028, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::K2Node_DynamicCast_AsP2Npc_Flying_Character' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_IsInsideAnomaly_OutDistance) == 0x000050, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_IsInsideAnomaly_OutDistance' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_IsInsideAnomaly_OutClosestPoint) == 0x000058, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_IsInsideAnomaly_OutClosestPoint' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_IsInsideAnomaly_ReturnValue) == 0x000070, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_IsInsideAnomaly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_GetNavOctree_ReturnValue) == 0x000090, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_GetNavOctree_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_IsValid_ReturnValue_1) == 0x000098, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x00009C, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_MakeVector_ReturnValue) == 0x0000A0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, K2Node_MakeArray_Array) == 0x0000B8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_LineTraceSingleForObjects_OutHit) == 0x0000C8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0001B0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_bBlockingHit) == 0x0001B1, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001B2, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_Time) == 0x0001B4, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_Distance) == 0x0001B8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_Location) == 0x0001C0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_ImpactPoint) == 0x0001D8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_Normal) == 0x0001F0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_ImpactNormal) == 0x000208, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_BoneName) == 0x000240, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_HitItem) == 0x000248, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_ElementIndex) == 0x00024C, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_FaceIndex) == 0x000250, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_TraceStart) == 0x000258, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_BreakHitResult_TraceEnd) == 0x000270, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_SelectVector_ReturnValue) == 0x000288, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002A0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_ClampToNavigable_ClampedPosition) == 0x0002B8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_ClampToNavigable_ClampedPosition' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_ClampToNavigable_Result) == 0x0002D0, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_ClampToNavigable_Result' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly, CallFunc_MakeVector_Z_ImplicitCast) == 0x0002D8, "Member 'BTTask_GetClosestPointToAnomaly_C_ExecuteUbergraph_BTTask_GetClosestPointToAnomaly::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");

// Function BTTask_GetClosestPointToAnomaly.BTTask_GetClosestPointToAnomaly_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_GetClosestPointToAnomaly_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

