#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetFlightAltitude

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_GetFlightAltitude.BTTask_GetFlightAltitude_C
// 0x0058 (0x0100 - 0x00A8)
class UBTTask_GetFlightAltitude_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 OutPointKey;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 HeightKey;                                         // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_GetFlightAltitude(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BTTask_GetFlightAltitude_C">();
	}
	static class UBTTask_GetFlightAltitude_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTTask_GetFlightAltitude_C>();
	}
};
static_assert(alignof(UBTTask_GetFlightAltitude_C) == 0x000008, "Wrong alignment on UBTTask_GetFlightAltitude_C");
static_assert(sizeof(UBTTask_GetFlightAltitude_C) == 0x000100, "Wrong size on UBTTask_GetFlightAltitude_C");
static_assert(offsetof(UBTTask_GetFlightAltitude_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_GetFlightAltitude_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_GetFlightAltitude_C, OutPointKey) == 0x0000B0, "Member 'UBTTask_GetFlightAltitude_C::OutPointKey' has a wrong offset!");
static_assert(offsetof(UBTTask_GetFlightAltitude_C, HeightKey) == 0x0000D8, "Member 'UBTTask_GetFlightAltitude_C::HeightKey' has a wrong offset!");

}

