#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SelectRandomLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_SelectRandomLocation.BTTask_SelectRandomLocation_C.ExecuteUbergraph_BTTask_SelectRandomLocation
// 0x0078 (0x0078 - 0x0000)
struct BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCenterLocation_Center;                 // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCenterLocation_bIsValid;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation) == 0x000008, "Wrong alignment on BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation");
static_assert(sizeof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation) == 0x000078, "Wrong size on BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, EntryPoint) == 0x000000, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_GetCenterLocation_Center) == 0x000008, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_GetCenterLocation_Center' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_GetCenterLocation_bIsValid) == 0x000020, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_GetCenterLocation_bIsValid' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, K2Node_Event_OwnerController) == 0x000028, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, K2Node_Event_ControlledPawn) == 0x000030, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000038, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000050, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000058, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000070, "Member 'BTTask_SelectRandomLocation_C_ExecuteUbergraph_BTTask_SelectRandomLocation::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");

// Function BTTask_SelectRandomLocation.BTTask_SelectRandomLocation_C.GetCenterLocation
// 0x0068 (0x0068 - 0x0000)
struct BTTask_SelectRandomLocation_C_GetCenterLocation final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBlackboardValueAsObject_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SelectRandomLocation_C_GetCenterLocation) == 0x000008, "Wrong alignment on BTTask_SelectRandomLocation_C_GetCenterLocation");
static_assert(sizeof(BTTask_SelectRandomLocation_C_GetCenterLocation) == 0x000068, "Wrong size on BTTask_SelectRandomLocation_C_GetCenterLocation");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, Center) == 0x000000, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::Center' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, bIsValid) == 0x000018, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::bIsValid' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000020, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_GetBlackboardValueAsObject_ReturnValue) == 0x000038, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_GetBlackboardValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, K2Node_DynamicCast_AsActor) == 0x000040, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x00004A, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x00004B, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_GetCenterLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BTTask_SelectRandomLocation_C_GetCenterLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BTTask_SelectRandomLocation.BTTask_SelectRandomLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SelectRandomLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SelectRandomLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SelectRandomLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SelectRandomLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SelectRandomLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SelectRandomLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SelectRandomLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SelectRandomLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

