#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SelectRandomLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_SelectRandomLocation.BTTask_SelectRandomLocation_C
// 0x0060 (0x0108 - 0x00A8)
class UBTTask_SelectRandomLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 CenterKey;                                         // 0x00D8(0x0028)(Edit, BlueprintVisible)
	float                                         Radius;                                            // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_SelectRandomLocation(int32 EntryPoint)	 // 0xae1e64;
	void GetCenterLocation(struct FVector* Center, bool* bIsValid)	 // 0xae1e64;
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BTTask_SelectRandomLocation_C">();
	}
	static class UBTTask_SelectRandomLocation_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTTask_SelectRandomLocation_C>();
	}
};
static_assert(alignof(UBTTask_SelectRandomLocation_C) == 0x000008, "Wrong alignment on UBTTask_SelectRandomLocation_C");
static_assert(sizeof(UBTTask_SelectRandomLocation_C) == 0x000108, "Wrong size on UBTTask_SelectRandomLocation_C");
static_assert(offsetof(UBTTask_SelectRandomLocation_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_SelectRandomLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_SelectRandomLocation_C, ResultKey) == 0x0000B0, "Member 'UBTTask_SelectRandomLocation_C::ResultKey' has a wrong offset!");
static_assert(offsetof(UBTTask_SelectRandomLocation_C, CenterKey) == 0x0000D8, "Member 'UBTTask_SelectRandomLocation_C::CenterKey' has a wrong offset!");
static_assert(offsetof(UBTTask_SelectRandomLocation_C, Radius) == 0x000100, "Member 'UBTTask_SelectRandomLocation_C::Radius' has a wrong offset!");

}

