#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetClosestPointToAnomaly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_GetClosestPointToAnomaly.BTTask_GetClosestPointToAnomaly_C
// 0x0058 (0x0100 - 0x00A8)
class UBTTask_GetClosestPointToAnomaly_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetKey;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FlightAltKey;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_GetClosestPointToAnomaly(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"BTTask_GetClosestPointToAnomaly_C">();
	}
	static class UBTTask_GetClosestPointToAnomaly_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTTask_GetClosestPointToAnomaly_C>();
	}
};
static_assert(alignof(UBTTask_GetClosestPointToAnomaly_C) == 0x000008, "Wrong alignment on UBTTask_GetClosestPointToAnomaly_C");
static_assert(sizeof(UBTTask_GetClosestPointToAnomaly_C) == 0x000100, "Wrong size on UBTTask_GetClosestPointToAnomaly_C");
static_assert(offsetof(UBTTask_GetClosestPointToAnomaly_C, UberGraphFrame) == 0x0000A8, "Member 'UBTTask_GetClosestPointToAnomaly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_GetClosestPointToAnomaly_C, TargetKey) == 0x0000B0, "Member 'UBTTask_GetClosestPointToAnomaly_C::TargetKey' has a wrong offset!");
static_assert(offsetof(UBTTask_GetClosestPointToAnomaly_C, FlightAltKey) == 0x0000D8, "Member 'UBTTask_GetClosestPointToAnomaly_C::FlightAltKey' has a wrong offset!");

}

