#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraCalibrationCore

#include "Basic.hpp"

#include "CinematicCamera_structs.hpp"
#include "CameraCalibrationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CameraCalibrationCore.LensDistortionModelHandlerBase
// 0x00A0 (0x00C8 - 0x0028)
class ULensDistortionModelHandlerBase : public UObject
{
public:
	TSubclassOf<class ULensModel>                 LensModelClass;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DistortionPostProcessMID;                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLensDistortionState                   CurrentState;                                      // 0x0038(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FCameraFilmbackSettings                CameraFilmback;                                    // 0x0068(0x000C)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OverscanFactor;                                    // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               UndistortionDisplacementMapMID;                    // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DistortionDisplacementMapMID;                      // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 UndistortionDisplacementMapRT;                     // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 DistortionDisplacementMapRT;                       // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  DistortionProducerID;                              // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDistortionState(const struct FLensDistortionState& InNewState)	 // 0x4ffdb6c;

	class UTextureRenderTarget2D* GetDistortionDisplacementMap() const	 // 0x17847f0;
	class UTextureRenderTarget2D* GetUndistortionDisplacementMap() const	 // 0x3c95e6c;
	bool IsModelSupported(const TSubclassOf<class ULensModel>& ModelToSupport) const	 // 0x4ffd7e0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LensDistortionModelHandlerBase">();
	}
	static class ULensDistortionModelHandlerBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULensDistortionModelHandlerBase>();
	}
};
static_assert(alignof(ULensDistortionModelHandlerBase) == 0x000008, "Wrong alignment on ULensDistortionModelHandlerBase");
static_assert(sizeof(ULensDistortionModelHandlerBase) == 0x0000C8, "Wrong size on ULensDistortionModelHandlerBase");
static_assert(offsetof(ULensDistortionModelHandlerBase, LensModelClass) == 0x000028, "Member 'ULensDistortionModelHandlerBase::LensModelClass' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionPostProcessMID) == 0x000030, "Member 'ULensDistortionModelHandlerBase::DistortionPostProcessMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, CurrentState) == 0x000038, "Member 'ULensDistortionModelHandlerBase::CurrentState' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, CameraFilmback) == 0x000068, "Member 'ULensDistortionModelHandlerBase::CameraFilmback' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DisplayName) == 0x000078, "Member 'ULensDistortionModelHandlerBase::DisplayName' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, OverscanFactor) == 0x000088, "Member 'ULensDistortionModelHandlerBase::OverscanFactor' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, UndistortionDisplacementMapMID) == 0x000090, "Member 'ULensDistortionModelHandlerBase::UndistortionDisplacementMapMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionDisplacementMapMID) == 0x000098, "Member 'ULensDistortionModelHandlerBase::DistortionDisplacementMapMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, UndistortionDisplacementMapRT) == 0x0000A0, "Member 'ULensDistortionModelHandlerBase::UndistortionDisplacementMapRT' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionDisplacementMapRT) == 0x0000A8, "Member 'ULensDistortionModelHandlerBase::DistortionDisplacementMapRT' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionProducerID) == 0x0000B0, "Member 'ULensDistortionModelHandlerBase::DistortionProducerID' has a wrong offset!");

// Class CameraCalibrationCore.AnamorphicLensDistortionModelHandler
// 0x0038 (0x0100 - 0x00C8)
class UAnamorphicLensDistortionModelHandler final : public ULensDistortionModelHandlerBase
{
public:
	uint8                                         Pad_C8[0x38];                                      // 0x00C8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AnamorphicLensDistortionModelHandler">();
	}
	static class UAnamorphicLensDistortionModelHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAnamorphicLensDistortionModelHandler>();
	}
};
static_assert(alignof(UAnamorphicLensDistortionModelHandler) == 0x000008, "Wrong alignment on UAnamorphicLensDistortionModelHandler");
static_assert(sizeof(UAnamorphicLensDistortionModelHandler) == 0x000100, "Wrong size on UAnamorphicLensDistortionModelHandler");

// Class CameraCalibrationCore.LensModel
// 0x0000 (0x0028 - 0x0028)
class ULensModel : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LensModel">();
	}
	static class ULensModel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULensModel>();
	}
};
static_assert(alignof(ULensModel) == 0x000008, "Wrong alignment on ULensModel");
static_assert(sizeof(ULensModel) == 0x000028, "Wrong size on ULensModel");

// Class CameraCalibrationCore.AnamorphicLensModel
// 0x0000 (0x0028 - 0x0028)
class UAnamorphicLensModel final : public ULensModel
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AnamorphicLensModel">();
	}
	static class UAnamorphicLensModel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAnamorphicLensModel>();
	}
};
static_assert(alignof(UAnamorphicLensModel) == 0x000008, "Wrong alignment on UAnamorphicLensModel");
static_assert(sizeof(UAnamorphicLensModel) == 0x000028, "Wrong size on UAnamorphicLensModel");

// Class CameraCalibrationCore.CalibrationPointComponent
// 0x0060 (0x06C0 - 0x0660)
class UCalibrationPointComponent final : public UProceduralMeshComponent
{
public:
	TMap<class FString, struct FVector>           SubPoints;                                         // 0x0660(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bVisualizePointsInEditor;                          // 0x06B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B1[0x3];                                      // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointVisualizationScale;                           // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibrationPointVisualization                VisualizationShape;                                // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebuildVertices()	 // 0x4ff7ba0;

	void GetNamespacedPointNames(TArray<class FString>* OutNamespacedNames) const	 // 0x4ff7660;
	bool GetWorldLocation(const class FString& InPointName, struct FVector* OutLocation) const	 // 0x4ff7910;
	bool NamespacedSubpointName(const class FString& InSubpointName, class FString* OutNamespacedName) const	 // 0x4ff7a44;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CalibrationPointComponent">();
	}
	static class UCalibrationPointComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCalibrationPointComponent>();
	}
};
static_assert(alignof(UCalibrationPointComponent) == 0x000010, "Wrong alignment on UCalibrationPointComponent");
static_assert(sizeof(UCalibrationPointComponent) == 0x0006C0, "Wrong size on UCalibrationPointComponent");
static_assert(offsetof(UCalibrationPointComponent, SubPoints) == 0x000660, "Member 'UCalibrationPointComponent::SubPoints' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, bVisualizePointsInEditor) == 0x0006B0, "Member 'UCalibrationPointComponent::bVisualizePointsInEditor' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, PointVisualizationScale) == 0x0006B4, "Member 'UCalibrationPointComponent::PointVisualizationScale' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, VisualizationShape) == 0x0006B8, "Member 'UCalibrationPointComponent::VisualizationShape' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationCheckerboard
// 0x0058 (0x0308 - 0x02B0)
class ACameraCalibrationCheckerboard final : public AActor
{
public:
	class USceneComponent*                        Root;                                              // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             TopLeft;                                           // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             TopRight;                                          // 0x02C0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             BottomLeft;                                        // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             BottomRight;                                       // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             Center;                                            // 0x02D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCornerRows;                                     // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCornerCols;                                     // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SquareSideLength;                                  // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CubeMesh;                                          // 0x02F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OddCubeMaterial;                                   // 0x02F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     EvenCubeMaterial;                                  // 0x0300(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Rebuild()	 // 0x4ff7b8c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraCalibrationCheckerboard">();
	}
	static class ACameraCalibrationCheckerboard* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ACameraCalibrationCheckerboard>();
	}
};
static_assert(alignof(ACameraCalibrationCheckerboard) == 0x000008, "Wrong alignment on ACameraCalibrationCheckerboard");
static_assert(sizeof(ACameraCalibrationCheckerboard) == 0x000308, "Wrong size on ACameraCalibrationCheckerboard");
static_assert(offsetof(ACameraCalibrationCheckerboard, Root) == 0x0002B0, "Member 'ACameraCalibrationCheckerboard::Root' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, TopLeft) == 0x0002B8, "Member 'ACameraCalibrationCheckerboard::TopLeft' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, TopRight) == 0x0002C0, "Member 'ACameraCalibrationCheckerboard::TopRight' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, BottomLeft) == 0x0002C8, "Member 'ACameraCalibrationCheckerboard::BottomLeft' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, BottomRight) == 0x0002D0, "Member 'ACameraCalibrationCheckerboard::BottomRight' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, Center) == 0x0002D8, "Member 'ACameraCalibrationCheckerboard::Center' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, NumCornerRows) == 0x0002E0, "Member 'ACameraCalibrationCheckerboard::NumCornerRows' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, NumCornerCols) == 0x0002E4, "Member 'ACameraCalibrationCheckerboard::NumCornerCols' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, SquareSideLength) == 0x0002E8, "Member 'ACameraCalibrationCheckerboard::SquareSideLength' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, Thickness) == 0x0002EC, "Member 'ACameraCalibrationCheckerboard::Thickness' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, CubeMesh) == 0x0002F0, "Member 'ACameraCalibrationCheckerboard::CubeMesh' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, OddCubeMaterial) == 0x0002F8, "Member 'ACameraCalibrationCheckerboard::OddCubeMaterial' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, EvenCubeMaterial) == 0x000300, "Member 'ACameraCalibrationCheckerboard::EvenCubeMaterial' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationSettings
// 0x0140 (0x0178 - 0x0038)
class UCameraCalibrationSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class ULensFile>               StartupLensFile;                                   // 0x0038(0x0030)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              DisplacementMapResolution;                         // 0x0068(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CalibrationInputTolerance;                         // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultUndistortionDisplacementMaterials; // 0x0078(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultDistortionDisplacementMaterials; // 0x00C8(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultDistortionMaterials; // 0x0118(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bEnableCalibrationDatasetImportExport;             // 0x0168(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_169[0xF];                                      // 0x0169(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraCalibrationSettings">();
	}
	static class UCameraCalibrationSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraCalibrationSettings>();
	}
};
static_assert(alignof(UCameraCalibrationSettings) == 0x000008, "Wrong alignment on UCameraCalibrationSettings");
static_assert(sizeof(UCameraCalibrationSettings) == 0x000178, "Wrong size on UCameraCalibrationSettings");
static_assert(offsetof(UCameraCalibrationSettings, StartupLensFile) == 0x000038, "Member 'UCameraCalibrationSettings::StartupLensFile' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DisplacementMapResolution) == 0x000068, "Member 'UCameraCalibrationSettings::DisplacementMapResolution' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, CalibrationInputTolerance) == 0x000070, "Member 'UCameraCalibrationSettings::CalibrationInputTolerance' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultUndistortionDisplacementMaterials) == 0x000078, "Member 'UCameraCalibrationSettings::DefaultUndistortionDisplacementMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultDistortionDisplacementMaterials) == 0x0000C8, "Member 'UCameraCalibrationSettings::DefaultDistortionDisplacementMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultDistortionMaterials) == 0x000118, "Member 'UCameraCalibrationSettings::DefaultDistortionMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, bEnableCalibrationDatasetImportExport) == 0x000168, "Member 'UCameraCalibrationSettings::bEnableCalibrationDatasetImportExport' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationEditorSettings
// 0x0000 (0x0038 - 0x0038)
class UCameraCalibrationEditorSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraCalibrationEditorSettings">();
	}
	static class UCameraCalibrationEditorSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraCalibrationEditorSettings>();
	}
};
static_assert(alignof(UCameraCalibrationEditorSettings) == 0x000008, "Wrong alignment on UCameraCalibrationEditorSettings");
static_assert(sizeof(UCameraCalibrationEditorSettings) == 0x000038, "Wrong size on UCameraCalibrationEditorSettings");

// Class CameraCalibrationCore.CameraCalibrationStep
// 0x0000 (0x0028 - 0x0028)
class UCameraCalibrationStep final : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraCalibrationStep">();
	}
	static class UCameraCalibrationStep* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraCalibrationStep>();
	}
};
static_assert(alignof(UCameraCalibrationStep) == 0x000008, "Wrong alignment on UCameraCalibrationStep");
static_assert(sizeof(UCameraCalibrationStep) == 0x000028, "Wrong size on UCameraCalibrationStep");

// Class CameraCalibrationCore.CameraCalibrationSubsystem
// 0x01F0 (0x0220 - 0x0030)
class UCameraCalibrationSubsystem final : public UEngineSubsystem
{
public:
	class ULensFile*                              DefaultLensFile;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class ULensModel>> LensModelMap;                                   // 0x0038(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraNodalOffsetAlgo>> CameraNodalOffsetAlgosMap;          // 0x0088(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraImageCenterAlgo>> CameraImageCenterAlgosMap;          // 0x00D8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraCalibrationStep>> CameraCalibrationStepsMap;          // 0x0128(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0xA8];                                     // 0x0178(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ULensDistortionModelHandlerBase* FindOrCreateDistortionModelHandler(struct FDistortionHandlerPicker& DistortionHandlerPicker, const TSubclassOf<class ULensModel> LensModelClass)	 // 0x4ff6eac;
	TArray<class ULensDistortionModelHandlerBase*> GetDistortionModelHandlers(class UCineCameraComponent* Component)	 // 0x4ff73e0;
	void SetDefaultLensFile(class ULensFile* NewDefaultLensFile)	 // 0x4ff7e18;
	void UnregisterDistortionModelHandler(class UCineCameraComponent* Component, class ULensDistortionModelHandlerBase* Handler)	 // 0x4bd0ce8;

	class ULensDistortionModelHandlerBase* FindDistortionModelHandler(struct FDistortionHandlerPicker& DistortionHandlerPicker, bool bUpdatePicker) const	 // 0x4ff6d10;
	TSubclassOf<class UCameraCalibrationStep> GetCameraCalibrationStep(class FName Name_0) const	 // 0x4ff704c;
	TArray<class FName> GetCameraCalibrationSteps() const	 // 0x4ff7114;
	TSubclassOf<class UCameraImageCenterAlgo> GetCameraImageCenterAlgo(class FName Name_0) const	 // 0x4ff7170;
	TArray<class FName> GetCameraImageCenterAlgos() const	 // 0x4ff7238;
	TSubclassOf<class UCameraNodalOffsetAlgo> GetCameraNodalOffsetAlgo(class FName Name_0) const	 // 0x4ff7294;
	TArray<class FName> GetCameraNodalOffsetAlgos() const	 // 0x4ff735c;
	class ULensFile* GetDefaultLensFile() const	 // 0x17cf1b8;
	class ULensFile* GetLensFile(const struct FLensFilePicker& Picker) const	 // 0x4ff7544;
	class UMaterialInterface* GetOverlayMaterial(const class FName& OverlayName) const	 // 0x4ff773c;
	TArray<class FName> GetOverlayMaterialNames() const	 // 0x4ff77d8;
	TSubclassOf<class ULensModel> GetRegisteredLensModel(class FName ModelName) const	 // 0x4ff7848;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraCalibrationSubsystem">();
	}
	static class UCameraCalibrationSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraCalibrationSubsystem>();
	}
};
static_assert(alignof(UCameraCalibrationSubsystem) == 0x000008, "Wrong alignment on UCameraCalibrationSubsystem");
static_assert(sizeof(UCameraCalibrationSubsystem) == 0x000220, "Wrong size on UCameraCalibrationSubsystem");
static_assert(offsetof(UCameraCalibrationSubsystem, DefaultLensFile) == 0x000030, "Member 'UCameraCalibrationSubsystem::DefaultLensFile' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, LensModelMap) == 0x000038, "Member 'UCameraCalibrationSubsystem::LensModelMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraNodalOffsetAlgosMap) == 0x000088, "Member 'UCameraCalibrationSubsystem::CameraNodalOffsetAlgosMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraImageCenterAlgosMap) == 0x0000D8, "Member 'UCameraCalibrationSubsystem::CameraImageCenterAlgosMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraCalibrationStepsMap) == 0x000128, "Member 'UCameraCalibrationSubsystem::CameraCalibrationStepsMap' has a wrong offset!");

// Class CameraCalibrationCore.CameraImageCenterAlgo
// 0x0008 (0x0030 - 0x0028)
class UCameraImageCenterAlgo final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraImageCenterAlgo">();
	}
	static class UCameraImageCenterAlgo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraImageCenterAlgo>();
	}
};
static_assert(alignof(UCameraImageCenterAlgo) == 0x000008, "Wrong alignment on UCameraImageCenterAlgo");
static_assert(sizeof(UCameraImageCenterAlgo) == 0x000030, "Wrong size on UCameraImageCenterAlgo");

// Class CameraCalibrationCore.CameraLensDistortionAlgo
// 0x0000 (0x0028 - 0x0028)
class UCameraLensDistortionAlgo final : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraLensDistortionAlgo">();
	}
	static class UCameraLensDistortionAlgo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraLensDistortionAlgo>();
	}
};
static_assert(alignof(UCameraLensDistortionAlgo) == 0x000008, "Wrong alignment on UCameraLensDistortionAlgo");
static_assert(sizeof(UCameraLensDistortionAlgo) == 0x000028, "Wrong size on UCameraLensDistortionAlgo");

// Class CameraCalibrationCore.CameraNodalOffsetAlgo
// 0x0000 (0x0028 - 0x0028)
class UCameraNodalOffsetAlgo final : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CameraNodalOffsetAlgo">();
	}
	static class UCameraNodalOffsetAlgo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCameraNodalOffsetAlgo>();
	}
};
static_assert(alignof(UCameraNodalOffsetAlgo) == 0x000008, "Wrong alignment on UCameraNodalOffsetAlgo");
static_assert(sizeof(UCameraNodalOffsetAlgo) == 0x000028, "Wrong size on UCameraNodalOffsetAlgo");

// Class CameraCalibrationCore.LensComponent
// 0x01E0 (0x02A0 - 0x00C0)
class ULensComponent final : public UActorComponent
{
public:
	struct FLensFilePicker                        LensFilePicker;                                    // 0x00C0(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EFIZEvaluationMode                            EvaluationMode;                                    // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComponentReference                    TargetCameraComponent;                             // 0x00D8(0x0028)(Edit, DisableEditOnTemplate, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FLensFileEvaluationInputs              EvalInputs;                                        // 0x0100(0x001C)(Edit, EditConst, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	EDistortionSource                             DistortionStateSource;                             // 0x011C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyDistortion;                                  // 0x011D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULensModel>                 LensModel;                                         // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLensDistortionState                   DistortionState;                                   // 0x0128(0x0030)(Edit, BlueprintVisible, Interp, Protected, NativeAccessSpecifierProtected)
	bool                                          bScaleOverscan;                                    // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanMultiplier;                                // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFilmbackOverrideSource                       FilmbackOverride;                                  // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCameraFilmbackSettings                CroppedFilmback;                                   // 0x0164(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bApplyNodalOffsetOnTick;                           // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OriginalTrackedComponentTransform;                 // 0x0180(0x0060)(Edit, BlueprintVisible, EditConst, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDistortionSetup;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OriginalFocalLength;                               // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               LastDistortionMID;                                 // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCineCameraComponent*                   LastCameraComponent;                               // 0x01F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class ULensModel>, class ULensDistortionModelHandlerBase*> LensDistortionHandlerMap; // 0x01F8(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class USceneComponent>         TrackedComponent;                                  // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TrackedComponentName;                              // 0x0250(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x40];                                     // 0x0260(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyNodalOffset(class USceneComponent* ComponentToOffset, bool bUseManualInputs, float ManualFocusInput, float ManualZoomInput)	 // 0x4ff6968;
	void ClearDistortionState()	 // 0x4ff6cfc;
	void SetApplyDistortion(bool bApply)	 // 0x4ff7bbc;
	void SetApplyNodalOffsetOnTick(bool bApplyNodalOffset)	 // 0x4ff7c7c;
	void SetCroppedFilmback(const struct FCameraFilmbackSettings& Filmback)	 // 0x4ff7d3c;
	void SetDistortionSource(EDistortionSource Source)	 // 0x4ff7ed4;
	void SetDistortionState(const struct FLensDistortionState& State)	 // 0x4ff7fb4;
	void SetFilmbackOverrideSetting(EFilmbackOverrideSource Setting)	 // 0x4ff8174;
	void SetFIZEvaluationMode(EFIZEvaluationMode Mode)	 // 0x4ff80b4;
	void SetLensFile(class ULensFile* LensFile)	 // 0x4ff8234;
	void SetLensFilePicker(const struct FLensFilePicker& LensFile)	 // 0x4ff8308;
	void SetLensModel(TSubclassOf<class ULensModel> Model)	 // 0x4ff83d8;
	void SetOverscanMultiplier(float Multiplier)	 // 0x4ff8498;

	struct FCameraFilmbackSettings GetCroppedFilmback() const	 // 0x4ff73b8;
	EDistortionSource GetDistortionSource() const	 // 0x4ff74d8;
	struct FLensDistortionState GetDistortionState() const	 // 0x4ff74f0;
	EFilmbackOverrideSource GetFilmbackOverrideSetting() const	 // 0x4ff752c;
	EFIZEvaluationMode GetFIZEvaluationMode() const	 // 0x4766ea8;
	class ULensFile* GetLensFile() const	 // 0x4ff75e4;
	const struct FLensFileEvaluationInputs GetLensFileEvaluationInputs() const	 // 0x4ff7610;
	struct FLensFilePicker GetLensFilePicker() const	 // 0x4ff7644;
	TSubclassOf<class ULensModel> GetLensModel() const	 // 0x4f1e1b8;
	float GetOriginalFocalLength() const	 // 0x4ff7724;
	float GetOverscanMultiplier() const	 // 0x4ff7818;
	bool ShouldApplyDistortion() const	 // 0x4ff8560;
	bool ShouldApplyNodalOffsetOnTick() const	 // 0x175d440;
	bool WasDistortionEvaluated() const	 // 0x4ff8578;
	bool WasNodalOffsetAppliedThisTick() const	 // 0x4ff8590;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LensComponent">();
	}
	static class ULensComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULensComponent>();
	}
};
static_assert(alignof(ULensComponent) == 0x000010, "Wrong alignment on ULensComponent");
static_assert(sizeof(ULensComponent) == 0x0002A0, "Wrong size on ULensComponent");
static_assert(offsetof(ULensComponent, LensFilePicker) == 0x0000C0, "Member 'ULensComponent::LensFilePicker' has a wrong offset!");
static_assert(offsetof(ULensComponent, EvaluationMode) == 0x0000D0, "Member 'ULensComponent::EvaluationMode' has a wrong offset!");
static_assert(offsetof(ULensComponent, TargetCameraComponent) == 0x0000D8, "Member 'ULensComponent::TargetCameraComponent' has a wrong offset!");
static_assert(offsetof(ULensComponent, EvalInputs) == 0x000100, "Member 'ULensComponent::EvalInputs' has a wrong offset!");
static_assert(offsetof(ULensComponent, DistortionStateSource) == 0x00011C, "Member 'ULensComponent::DistortionStateSource' has a wrong offset!");
static_assert(offsetof(ULensComponent, bApplyDistortion) == 0x00011D, "Member 'ULensComponent::bApplyDistortion' has a wrong offset!");
static_assert(offsetof(ULensComponent, LensModel) == 0x000120, "Member 'ULensComponent::LensModel' has a wrong offset!");
static_assert(offsetof(ULensComponent, DistortionState) == 0x000128, "Member 'ULensComponent::DistortionState' has a wrong offset!");
static_assert(offsetof(ULensComponent, bScaleOverscan) == 0x000158, "Member 'ULensComponent::bScaleOverscan' has a wrong offset!");
static_assert(offsetof(ULensComponent, OverscanMultiplier) == 0x00015C, "Member 'ULensComponent::OverscanMultiplier' has a wrong offset!");
static_assert(offsetof(ULensComponent, FilmbackOverride) == 0x000160, "Member 'ULensComponent::FilmbackOverride' has a wrong offset!");
static_assert(offsetof(ULensComponent, CroppedFilmback) == 0x000164, "Member 'ULensComponent::CroppedFilmback' has a wrong offset!");
static_assert(offsetof(ULensComponent, bApplyNodalOffsetOnTick) == 0x000170, "Member 'ULensComponent::bApplyNodalOffsetOnTick' has a wrong offset!");
static_assert(offsetof(ULensComponent, OriginalTrackedComponentTransform) == 0x000180, "Member 'ULensComponent::OriginalTrackedComponentTransform' has a wrong offset!");
static_assert(offsetof(ULensComponent, bIsDistortionSetup) == 0x0001E0, "Member 'ULensComponent::bIsDistortionSetup' has a wrong offset!");
static_assert(offsetof(ULensComponent, OriginalFocalLength) == 0x0001E4, "Member 'ULensComponent::OriginalFocalLength' has a wrong offset!");
static_assert(offsetof(ULensComponent, LastDistortionMID) == 0x0001E8, "Member 'ULensComponent::LastDistortionMID' has a wrong offset!");
static_assert(offsetof(ULensComponent, LastCameraComponent) == 0x0001F0, "Member 'ULensComponent::LastCameraComponent' has a wrong offset!");
static_assert(offsetof(ULensComponent, LensDistortionHandlerMap) == 0x0001F8, "Member 'ULensComponent::LensDistortionHandlerMap' has a wrong offset!");
static_assert(offsetof(ULensComponent, TrackedComponent) == 0x000248, "Member 'ULensComponent::TrackedComponent' has a wrong offset!");
static_assert(offsetof(ULensComponent, TrackedComponentName) == 0x000250, "Member 'ULensComponent::TrackedComponentName' has a wrong offset!");

// Class CameraCalibrationCore.LensFile
// 0x0288 (0x02B0 - 0x0028)
class ULensFile final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLensInfo                              LensInfo;                                          // 0x0030(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ELensDataMode                                 DataMode;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            UserMetadata;                                      // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FEncodersTable                         EncodersTable;                                     // 0x00C8(0x0100)(NativeAccessSpecifierPublic)
	struct FDistortionTable                       DistortionTable;                                   // 0x01C8(0x0020)(NativeAccessSpecifierPublic)
	struct FFocalLengthTable                      FocalLengthTable;                                  // 0x01E8(0x0020)(NativeAccessSpecifierPublic)
	struct FImageCenterTable                      ImageCenterTable;                                  // 0x0208(0x0020)(NativeAccessSpecifierPublic)
	struct FNodalOffsetTable                      NodalOffsetTable;                                  // 0x0228(0x0020)(NativeAccessSpecifierPublic)
	struct FSTMapTable                            STMapTable;                                        // 0x0248(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextureRenderTarget2D*>         UndistortionDisplacementMapHolders;                // 0x0278(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UTextureRenderTarget2D*>         DistortionDisplacementMapHolders;                  // 0x0288(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x18];                                     // 0x0298(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDistortionPoint(float NewFocus, float NewZoom, const struct FDistortionInfo& NewPoint, const struct FFocalLengthInfo& NewFocalLength)	 // 0x4ffb654;
	void AddFocalLengthPoint(float NewFocus, float NewZoom, const struct FFocalLengthInfo& NewFocalLength)	 // 0x4ffb848;
	void AddImageCenterPoint(float NewFocus, float NewZoom, const struct FImageCenterInfo& NewPoint)	 // 0x4ffb9ec;
	void AddNodalOffsetPoint(float NewFocus, float NewZoom, const struct FNodalPointOffset& NewPoint)	 // 0x4ffbb90;
	void AddSTMapPoint(float NewFocus, float NewZoom, const struct FSTMapInfo& NewPoint)	 // 0x4ffbd58;
	void ClearAll()	 // 0x4ffbefc;
	void ClearData(ELensDataCategory InDataCategory)	 // 0x4ffbf74;
	void RemoveFocusPoint(ELensDataCategory InDataCategory, float InFocus)	 // 0x4ffd878;
	void RemoveZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InZoom)	 // 0x4ffd9b4;

	bool EvaluateDistortionData(float InFocus, float InZoom, const struct FVector2D& InFilmback, class ULensDistortionModelHandlerBase* InLensHandler) const	 // 0x4ffc034;
	bool EvaluateDistortionParameters(float InFocus, float InZoom, struct FDistortionInfo* OutEvaluatedValue) const	 // 0x4ffc304;
	bool EvaluateFocalLength(float InFocus, float InZoom, struct FFocalLengthInfo* OutEvaluatedValue) const	 // 0x4ffc4a4;
	bool EvaluateImageCenterParameters(float InFocus, float InZoom, struct FImageCenterInfo* OutEvaluatedValue) const	 // 0x4ffc638;
	bool EvaluateNodalPointOffset(float InFocus, float InZoom, struct FNodalPointOffset* OutEvaluatedValue) const	 // 0x4ffc7cc;
	float EvaluateNormalizedFocus(float InNormalizedValue) const	 // 0x4ffc984;
	float EvaluateNormalizedIris(float InNormalizedValue) const	 // 0x4ffca5c;
	bool GetDistortionPoint(float InFocus, float InZoom, struct FDistortionInfo* OutDistortionInfo) const	 // 0x4ffcb34;
	TArray<struct FDistortionPointInfo> GetDistortionPoints() const	 // 0x4ffccec;
	bool GetFocalLengthPoint(float InFocus, float InZoom, struct FFocalLengthInfo* OutFocalLengthInfo) const	 // 0x4ffcd94;
	TArray<struct FFocalLengthPointInfo> GetFocalLengthPoints() const	 // 0x4ffcf3c;
	bool GetImageCenterPoint(float InFocus, float InZoom, struct FImageCenterInfo* OutImageCenterInfo) const	 // 0x4ffcfac;
	TArray<struct FImageCenterPointInfo> GetImageCenterPoints() const	 // 0x4ffd154;
	bool GetNodalOffsetPoint(float InFocus, float InZoom, struct FNodalPointOffset* OutNodalPointOffset) const	 // 0x4ffd1c4;
	TArray<struct FNodalOffsetPointInfo> GetNodalOffsetPoints() const	 // 0x4ffd390;
	bool GetSTMapPoint(float InFocus, float InZoom, struct FSTMapInfo* OutSTMapInfo) const	 // 0x4ffd400;
	TArray<struct FSTMapPointInfo> GetSTMapPoints() const	 // 0x4ffd59c;
	int32 GetTotalPointNum(ELensDataCategory InDataCategory) const	 // 0x4ffd60c;
	bool HasFocusEncoderMapping() const	 // 0x4ffd6dc;
	bool HasIrisEncoderMapping() const	 // 0x4ffd6f8;
	bool HasSamples(ELensDataCategory InDataCategory) const	 // 0x4ffd714;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LensFile">();
	}
	static class ULensFile* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULensFile>();
	}
};
static_assert(alignof(ULensFile) == 0x000008, "Wrong alignment on ULensFile");
static_assert(sizeof(ULensFile) == 0x0002B0, "Wrong size on ULensFile");
static_assert(offsetof(ULensFile, LensInfo) == 0x000030, "Member 'ULensFile::LensInfo' has a wrong offset!");
static_assert(offsetof(ULensFile, DataMode) == 0x000070, "Member 'ULensFile::DataMode' has a wrong offset!");
static_assert(offsetof(ULensFile, UserMetadata) == 0x000078, "Member 'ULensFile::UserMetadata' has a wrong offset!");
static_assert(offsetof(ULensFile, EncodersTable) == 0x0000C8, "Member 'ULensFile::EncodersTable' has a wrong offset!");
static_assert(offsetof(ULensFile, DistortionTable) == 0x0001C8, "Member 'ULensFile::DistortionTable' has a wrong offset!");
static_assert(offsetof(ULensFile, FocalLengthTable) == 0x0001E8, "Member 'ULensFile::FocalLengthTable' has a wrong offset!");
static_assert(offsetof(ULensFile, ImageCenterTable) == 0x000208, "Member 'ULensFile::ImageCenterTable' has a wrong offset!");
static_assert(offsetof(ULensFile, NodalOffsetTable) == 0x000228, "Member 'ULensFile::NodalOffsetTable' has a wrong offset!");
static_assert(offsetof(ULensFile, STMapTable) == 0x000248, "Member 'ULensFile::STMapTable' has a wrong offset!");
static_assert(offsetof(ULensFile, UndistortionDisplacementMapHolders) == 0x000278, "Member 'ULensFile::UndistortionDisplacementMapHolders' has a wrong offset!");
static_assert(offsetof(ULensFile, DistortionDisplacementMapHolders) == 0x000288, "Member 'ULensFile::DistortionDisplacementMapHolders' has a wrong offset!");

// Class CameraCalibrationCore.SphericalLensDistortionModelHandler
// 0x0018 (0x00E0 - 0x00C8)
class USphericalLensDistortionModelHandler final : public ULensDistortionModelHandlerBase
{
public:
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SphericalLensDistortionModelHandler">();
	}
	static class USphericalLensDistortionModelHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USphericalLensDistortionModelHandler>();
	}
};
static_assert(alignof(USphericalLensDistortionModelHandler) == 0x000008, "Wrong alignment on USphericalLensDistortionModelHandler");
static_assert(sizeof(USphericalLensDistortionModelHandler) == 0x0000E0, "Wrong size on USphericalLensDistortionModelHandler");

// Class CameraCalibrationCore.SphericalLensModel
// 0x0000 (0x0028 - 0x0028)
class USphericalLensModel final : public ULensModel
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SphericalLensModel">();
	}
	static class USphericalLensModel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USphericalLensModel>();
	}
};
