#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVehicles

#include "Basic.hpp"

#include "ChaosVehicles_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ChaosVehicles.ChaosVehicleMovementComponent
// 0x07C8 (0x0940 - 0x0178)
#pragma pack(push, 0x1)
class alignas(0x10) UChaosVehicleMovementComponent : public UPawnMovementComponent
{
public:
	uint8                                         bReverseAsBrake : 1;                               // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bThrottleAsBrake : 1;                              // 0x0178(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Mass;                                              // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCenterOfMassOverride;                       // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CenterOfMassOverride;                              // 0x0188(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisWidth;                                      // 0x01A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisHeight;                                     // 0x01A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragCoefficient;                                   // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DownforceCoefficient;                              // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragArea;                                          // 0x01B0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugDragMagnitude;                                // 0x01B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensorScale;                                // 0x01B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SleepThreshold;                                    // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SleepSlopeLimit;                                   // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVehicleAerofoilConfig>         Aerofoils;                                         // 0x01D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVehicleThrustConfig>           Thrusters;                                         // 0x01E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVehicleTorqueControlConfig            TorqueControl;                                     // 0x01F8(0x0040)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleTargetRotationControlConfig    TargetRotationControl;                             // 0x0238(0x0058)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleStabilizeControlConfig         StabilizeControl;                                  // 0x0290(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x4];                                      // 0x02A8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bRawHandbrakeInput : 1;                            // 0x02AC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRawGearUpInput : 1;                               // 0x02AC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRawGearDownInput : 1;                             // 0x02AC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_2AC_3 : 5;                                  // 0x02AC(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bWasAvoidanceUpdated : 1;                          // 0x02B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_2B0_1 : 7;                                  // 0x02B0(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bParkEnabled : 1;                                  // 0x02B4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_2B5[0x33];                                     // 0x02B5(0x0033)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleReplicatedState                ReplicatedState;                                   // 0x02E8(0x0028)(Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x4];                                      // 0x0310(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RawSteeringInput;                                  // 0x0314(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawThrottleInput;                                  // 0x0318(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawBrakeInput;                                     // 0x031C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawPitchInput;                                     // 0x0320(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawRollInput;                                      // 0x0324(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawYawInput;                                       // 0x0328(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SteeringInput;                                     // 0x032C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ThrottleInput;                                     // 0x0330(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakeInput;                                        // 0x0334(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PitchInput;                                        // 0x0338(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RollInput;                                         // 0x033C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         YawInput;                                          // 0x0340(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HandbrakeInput;                                    // 0x0344(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRequiresControllerForInputs;                      // 0x0348(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IdleBrakeInput;                                    // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StopThreshold;                                     // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WrongDirectionThreshold;                           // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                ThrottleInputRate;                                 // 0x0358(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                BrakeInputRate;                                    // 0x03F0(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                SteeringInputRate;                                 // 0x0488(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                HandbrakeInputRate;                                // 0x0520(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                PitchInputRate;                                    // 0x05B8(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                RollInputRate;                                     // 0x0650(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRateConfig                YawInputRate;                                      // 0x06E8(0x0098)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_780[0x198];                                    // 0x0780(0x0198)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            OverrideController;                                // 0x0918(0x0008)(Net, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_920[0x18];                                     // 0x0920(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DecreaseThrottleInput(float ThrottleDelta)	 // 0x4a16cd4;
	void EnableSelfRighting(bool InState)	 // 0x4a16db0;
	float GetBrakeInput()	 // 0x4a16e7c;
	float GetSteeringInput()	 // 0x4a16f90;
	float GetThrottleInput()	 // 0x4a17010;
	void IncreaseThrottleInput(float ThrottleDelta)	 // 0x4a170ac;
	void ResetVehicle()	 // 0x4a171dc;
	void ServerUpdateState(float InSteeringInput, float InThrottleInput, float InBrakeInput, float InHandbrakeInput, int32 InCurrentGear, float InRollInput, float InPitchInput, float InYawInput)	 // 0x4a171f4;
	void SetBrakeInput(float Brake)	 // 0x4a1769c;
	void SetChangeDownInput(bool bNewGearDown)	 // 0x4a17770;
	void SetChangeUpInput(bool bNewGearUp)	 // 0x4a17840;
	void SetHandbrakeInput(bool bNewHandbrake)	 // 0x4a17910;
	void SetParked(bool bParked)	 // 0x4a179dc;
	void SetPitchInput(float Pitch)	 // 0x4a17aa8;
	void SetRequiresControllerForInputs(bool bRequiresController)	 // 0x4a17b7c;
	void SetRollInput(float Roll)	 // 0x4a17c3c;
	void SetSleeping(bool bEnableSleep)	 // 0x4a17d10;
	void SetSteeringInput(float Steering)	 // 0x4a17dd4;
	void SetTargetGear(int32 GearNum, bool bImmediate)	 // 0x4a17ea8;
	void SetThrottleInput(float Throttle)	 // 0x4a17fe8;
	void SetUseAutomaticGears(bool bUseAuto)	 // 0x4a180bc;
	void SetYawInput(float Yaw)	 // 0x4a1817c;

	int32 GetCurrentGear() const	 // 0x4a16e94;
	float GetForwardSpeed() const	 // 0x4a16eb4;
	float GetForwardSpeedMPH() const	 // 0x4a16ecc;
	bool GetHandbrakeInput() const	 // 0x4a16ef0;
	int32 GetTargetGear() const	 // 0x4a16ff8;
	bool GetUseAutoGears() const	 // 0x4a17028;
	bool IsParked() const	 // 0x4a171c0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ChaosVehicleMovementComponent">();
	}
	static class UChaosVehicleMovementComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UChaosVehicleMovementComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UChaosVehicleMovementComponent) == 0x000010, "Wrong alignment on UChaosVehicleMovementComponent");
static_assert(sizeof(UChaosVehicleMovementComponent) == 0x000940, "Wrong size on UChaosVehicleMovementComponent");
static_assert(offsetof(UChaosVehicleMovementComponent, Mass) == 0x00017C, "Member 'UChaosVehicleMovementComponent::Mass' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, bEnableCenterOfMassOverride) == 0x000180, "Member 'UChaosVehicleMovementComponent::bEnableCenterOfMassOverride' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, CenterOfMassOverride) == 0x000188, "Member 'UChaosVehicleMovementComponent::CenterOfMassOverride' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, ChassisWidth) == 0x0001A0, "Member 'UChaosVehicleMovementComponent::ChassisWidth' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, ChassisHeight) == 0x0001A4, "Member 'UChaosVehicleMovementComponent::ChassisHeight' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, DragCoefficient) == 0x0001A8, "Member 'UChaosVehicleMovementComponent::DragCoefficient' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, DownforceCoefficient) == 0x0001AC, "Member 'UChaosVehicleMovementComponent::DownforceCoefficient' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, DragArea) == 0x0001B0, "Member 'UChaosVehicleMovementComponent::DragArea' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, DebugDragMagnitude) == 0x0001B4, "Member 'UChaosVehicleMovementComponent::DebugDragMagnitude' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, InertiaTensorScale) == 0x0001B8, "Member 'UChaosVehicleMovementComponent::InertiaTensorScale' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, SleepThreshold) == 0x0001D0, "Member 'UChaosVehicleMovementComponent::SleepThreshold' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, SleepSlopeLimit) == 0x0001D4, "Member 'UChaosVehicleMovementComponent::SleepSlopeLimit' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, Aerofoils) == 0x0001D8, "Member 'UChaosVehicleMovementComponent::Aerofoils' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, Thrusters) == 0x0001E8, "Member 'UChaosVehicleMovementComponent::Thrusters' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, TorqueControl) == 0x0001F8, "Member 'UChaosVehicleMovementComponent::TorqueControl' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, TargetRotationControl) == 0x000238, "Member 'UChaosVehicleMovementComponent::TargetRotationControl' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, StabilizeControl) == 0x000290, "Member 'UChaosVehicleMovementComponent::StabilizeControl' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, ReplicatedState) == 0x0002E8, "Member 'UChaosVehicleMovementComponent::ReplicatedState' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawSteeringInput) == 0x000314, "Member 'UChaosVehicleMovementComponent::RawSteeringInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawThrottleInput) == 0x000318, "Member 'UChaosVehicleMovementComponent::RawThrottleInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawBrakeInput) == 0x00031C, "Member 'UChaosVehicleMovementComponent::RawBrakeInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawPitchInput) == 0x000320, "Member 'UChaosVehicleMovementComponent::RawPitchInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawRollInput) == 0x000324, "Member 'UChaosVehicleMovementComponent::RawRollInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RawYawInput) == 0x000328, "Member 'UChaosVehicleMovementComponent::RawYawInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, SteeringInput) == 0x00032C, "Member 'UChaosVehicleMovementComponent::SteeringInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, ThrottleInput) == 0x000330, "Member 'UChaosVehicleMovementComponent::ThrottleInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, BrakeInput) == 0x000334, "Member 'UChaosVehicleMovementComponent::BrakeInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, PitchInput) == 0x000338, "Member 'UChaosVehicleMovementComponent::PitchInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RollInput) == 0x00033C, "Member 'UChaosVehicleMovementComponent::RollInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, YawInput) == 0x000340, "Member 'UChaosVehicleMovementComponent::YawInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, HandbrakeInput) == 0x000344, "Member 'UChaosVehicleMovementComponent::HandbrakeInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, bRequiresControllerForInputs) == 0x000348, "Member 'UChaosVehicleMovementComponent::bRequiresControllerForInputs' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, IdleBrakeInput) == 0x00034C, "Member 'UChaosVehicleMovementComponent::IdleBrakeInput' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, StopThreshold) == 0x000350, "Member 'UChaosVehicleMovementComponent::StopThreshold' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, WrongDirectionThreshold) == 0x000354, "Member 'UChaosVehicleMovementComponent::WrongDirectionThreshold' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, ThrottleInputRate) == 0x000358, "Member 'UChaosVehicleMovementComponent::ThrottleInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, BrakeInputRate) == 0x0003F0, "Member 'UChaosVehicleMovementComponent::BrakeInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, SteeringInputRate) == 0x000488, "Member 'UChaosVehicleMovementComponent::SteeringInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, HandbrakeInputRate) == 0x000520, "Member 'UChaosVehicleMovementComponent::HandbrakeInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, PitchInputRate) == 0x0005B8, "Member 'UChaosVehicleMovementComponent::PitchInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, RollInputRate) == 0x000650, "Member 'UChaosVehicleMovementComponent::RollInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, YawInputRate) == 0x0006E8, "Member 'UChaosVehicleMovementComponent::YawInputRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleMovementComponent, OverrideController) == 0x000918, "Member 'UChaosVehicleMovementComponent::OverrideController' has a wrong offset!");

// Class ChaosVehicles.ChaosVehicleWheel
// 0x02B8 (0x02E0 - 0x0028)
class UChaosVehicleWheel final : public UObject
{
public:
	class UStaticMesh*                            CollisionMesh;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxleType                                     AxleType;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelRadius;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelWidth;                                        // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelMass;                                         // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CorneringStiffness;                                // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrictionForceMultiplier;                           // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SideSlipModifier;                                  // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlipThreshold;                                     // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkidThreshold;                                     // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSteerAngle;                                     // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedBySteering;                               // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByBrake;                                  // 0x0075(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByHandbrake;                              // 0x0076(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByEngine;                                 // 0x0077(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bABSEnabled;                                       // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTractionControlEnabled;                           // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxWheelspinRotation;                              // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETorqueCombineMethod                          ExternalTorqueCombineMethod;                       // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     LateralSlipGraph;                                  // 0x0088(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                SuspensionAxis;                                    // 0x0110(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SuspensionForceOffset;                             // 0x0128(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxRaise;                                // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxDrop;                                 // 0x0144(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionDampingRatio;                            // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WheelLoadRatio;                                    // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringRate;                                        // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpringPreload;                                     // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SuspensionSmoothing;                               // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollbarScaling;                                    // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESweepShape                                   SweepShape;                                        // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESweepType                                    SweepType;                                         // 0x0161(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBrakeTorque;                                    // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHandBrakeTorque;                                // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosWheeledVehicleMovementComponent*  VehicleComponent;                                  // 0x0170(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelIndex;                                        // 0x0178(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLongSlip;                                     // 0x017C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLatSlip;                                      // 0x0180(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugNormalizedTireLoad;                           // 0x0184(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x4];                                      // 0x0188(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugWheelTorque;                                  // 0x018C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLongForce;                                    // 0x0190(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLatForce;                                     // 0x0194(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0198(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x01B0(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x01C8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E0[0x100];                                    // 0x01E0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EAxleType GetAxleType()	 // 0x46a6c60;

	float GetRotationAngle() const	 // 0x4a16f0c;
	float GetRotationAngularVelocity() const	 // 0x4a16f34;
	float GetSteerAngle() const	 // 0x4a16f5c;
	struct FVector GetSuspensionAxis() const	 // 0x4a16fa8;
	float GetSuspensionOffset() const	 // 0x4a16fd0;
	float GetWheelAngularVelocity() const	 // 0x4a17044;
	float GetWheelRadius() const	 // 0x4a17078;
	bool IsInAir() const	 // 0x4a17188;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ChaosVehicleWheel">();
	}
	static class UChaosVehicleWheel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UChaosVehicleWheel>();
	}
};
static_assert(alignof(UChaosVehicleWheel) == 0x000008, "Wrong alignment on UChaosVehicleWheel");
static_assert(sizeof(UChaosVehicleWheel) == 0x0002E0, "Wrong size on UChaosVehicleWheel");
static_assert(offsetof(UChaosVehicleWheel, CollisionMesh) == 0x000028, "Member 'UChaosVehicleWheel::CollisionMesh' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, AxleType) == 0x000030, "Member 'UChaosVehicleWheel::AxleType' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, Offset) == 0x000038, "Member 'UChaosVehicleWheel::Offset' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, WheelRadius) == 0x000050, "Member 'UChaosVehicleWheel::WheelRadius' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, WheelWidth) == 0x000054, "Member 'UChaosVehicleWheel::WheelWidth' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, WheelMass) == 0x000058, "Member 'UChaosVehicleWheel::WheelMass' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, CorneringStiffness) == 0x00005C, "Member 'UChaosVehicleWheel::CorneringStiffness' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, FrictionForceMultiplier) == 0x000060, "Member 'UChaosVehicleWheel::FrictionForceMultiplier' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SideSlipModifier) == 0x000064, "Member 'UChaosVehicleWheel::SideSlipModifier' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SlipThreshold) == 0x000068, "Member 'UChaosVehicleWheel::SlipThreshold' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SkidThreshold) == 0x00006C, "Member 'UChaosVehicleWheel::SkidThreshold' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, MaxSteerAngle) == 0x000070, "Member 'UChaosVehicleWheel::MaxSteerAngle' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bAffectedBySteering) == 0x000074, "Member 'UChaosVehicleWheel::bAffectedBySteering' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bAffectedByBrake) == 0x000075, "Member 'UChaosVehicleWheel::bAffectedByBrake' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bAffectedByHandbrake) == 0x000076, "Member 'UChaosVehicleWheel::bAffectedByHandbrake' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bAffectedByEngine) == 0x000077, "Member 'UChaosVehicleWheel::bAffectedByEngine' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bABSEnabled) == 0x000078, "Member 'UChaosVehicleWheel::bABSEnabled' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, bTractionControlEnabled) == 0x000079, "Member 'UChaosVehicleWheel::bTractionControlEnabled' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, MaxWheelspinRotation) == 0x00007C, "Member 'UChaosVehicleWheel::MaxWheelspinRotation' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, ExternalTorqueCombineMethod) == 0x000080, "Member 'UChaosVehicleWheel::ExternalTorqueCombineMethod' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, LateralSlipGraph) == 0x000088, "Member 'UChaosVehicleWheel::LateralSlipGraph' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionAxis) == 0x000110, "Member 'UChaosVehicleWheel::SuspensionAxis' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionForceOffset) == 0x000128, "Member 'UChaosVehicleWheel::SuspensionForceOffset' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionMaxRaise) == 0x000140, "Member 'UChaosVehicleWheel::SuspensionMaxRaise' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionMaxDrop) == 0x000144, "Member 'UChaosVehicleWheel::SuspensionMaxDrop' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionDampingRatio) == 0x000148, "Member 'UChaosVehicleWheel::SuspensionDampingRatio' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, WheelLoadRatio) == 0x00014C, "Member 'UChaosVehicleWheel::WheelLoadRatio' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SpringRate) == 0x000150, "Member 'UChaosVehicleWheel::SpringRate' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SpringPreload) == 0x000154, "Member 'UChaosVehicleWheel::SpringPreload' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SuspensionSmoothing) == 0x000158, "Member 'UChaosVehicleWheel::SuspensionSmoothing' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, RollbarScaling) == 0x00015C, "Member 'UChaosVehicleWheel::RollbarScaling' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SweepShape) == 0x000160, "Member 'UChaosVehicleWheel::SweepShape' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, SweepType) == 0x000161, "Member 'UChaosVehicleWheel::SweepType' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, MaxBrakeTorque) == 0x000164, "Member 'UChaosVehicleWheel::MaxBrakeTorque' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, MaxHandBrakeTorque) == 0x000168, "Member 'UChaosVehicleWheel::MaxHandBrakeTorque' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, VehicleComponent) == 0x000170, "Member 'UChaosVehicleWheel::VehicleComponent' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, WheelIndex) == 0x000178, "Member 'UChaosVehicleWheel::WheelIndex' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugLongSlip) == 0x00017C, "Member 'UChaosVehicleWheel::DebugLongSlip' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugLatSlip) == 0x000180, "Member 'UChaosVehicleWheel::DebugLatSlip' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugNormalizedTireLoad) == 0x000184, "Member 'UChaosVehicleWheel::DebugNormalizedTireLoad' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugWheelTorque) == 0x00018C, "Member 'UChaosVehicleWheel::DebugWheelTorque' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugLongForce) == 0x000190, "Member 'UChaosVehicleWheel::DebugLongForce' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, DebugLatForce) == 0x000194, "Member 'UChaosVehicleWheel::DebugLatForce' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, Location) == 0x000198, "Member 'UChaosVehicleWheel::Location' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, OldLocation) == 0x0001B0, "Member 'UChaosVehicleWheel::OldLocation' has a wrong offset!");
static_assert(offsetof(UChaosVehicleWheel, Velocity) == 0x0001C8, "Member 'UChaosVehicleWheel::Velocity' has a wrong offset!");

// Class ChaosVehicles.ChaosWheeledVehicleMovementComponent
// 0x0320 (0x0C60 - 0x0940)
class UChaosWheeledVehicleMovementComponent final : public UChaosVehicleMovementComponent
{
public:
	bool                                          bSuspensionEnabled;                                // 0x0938(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWheelFrictionEnabled;                             // 0x0939(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLegacyWheelFrictionPosition;                      // 0x093A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93B[0x5];                                      // 0x093B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChaosWheelSetup>               WheelSetups;                                       // 0x0940(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCollisionResponseContainer            WheelTraceCollisionResponses;                      // 0x0950(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bMechanicalSimEnabled;                             // 0x0970(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleEngineConfig                   EngineSetup;                                       // 0x0978(0x00C8)(Edit, NativeAccessSpecifierPublic)
	struct FVehicleDifferentialConfig             DifferentialSetup;                                 // 0x0A40(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVehicleTransmissionConfig             TransmissionSetup;                                 // 0x0A50(0x0070)(Edit, NativeAccessSpecifierPublic)
	struct FVehicleSteeringConfig                 SteeringSetup;                                     // 0x0AC0(0x00D8)(Edit, NativeAccessSpecifierPublic)
	TArray<class UChaosVehicleWheel*>             Wheels;                                            // 0x0B98(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA8[0xB8];                                     // 0x0BA8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void BreakWheeledSnapshot(const struct FWheeledSnaphotData& Snapshot, struct FTransform* Transform, struct FVector* LinearVelocity, struct FVector* AngularVelocity, int32* SelectedGear, float* EngineRPM, TArray<struct FWheelSnapshot>* WheelSnapshots)	 // 0x4a22df8;
	static void BreakWheelSnapshot(const struct FWheelSnapshot& Snapshot, float* SuspensionOffset, float* WheelRotationAngle, float* SteeringAngle, float* WheelRadius, float* WheelAngularVelocity)	 // 0x4a22050;
	static void BreakWheelStatus(const struct FWheelStatus& Status, bool* bInContact, struct FVector* ContactPoint, class UPhysicalMaterial** PhysMaterial, float* NormalizedSuspensionLength, float* SpringForce, float* SlipAngle, bool* bIsSlipping, float* SlipMagnitude, bool* bIsSkidding, float* SkidMagnitude, struct FVector* SkidNormal, float* DriveTorque, float* BrakeTorque, bool* bABSActivated)	 // 0x4a2244c;
	static struct FWheeledSnaphotData MakeWheeledSnapshot(const struct FTransform& Transform, const struct FVector& LinearVelocity, const struct FVector& AngularVelocity, int32 SelectedGear, float EngineRPM, const TArray<struct FWheelSnapshot>& WheelSnapshots)	 // 0x4a24128;
	static struct FWheelSnapshot MakeWheelSnapshot(float SuspensionOffset, float WheelRotationAngle, float SteeringAngle, float WheelRadius, float WheelAngularVelocity)	 // 0x4a23708;
	static struct FWheelStatus MakeWheelStatus(bool bInContact, struct FVector* ContactPoint, class UPhysicalMaterial* PhysMaterial, float NormalizedSuspensionLength, float SpringForce, float SlipAngle, bool bIsSlipping, float SlipMagnitude, bool bIsSkidding, float SkidMagnitude, struct FVector* SkidNormal, float DriveTorque, float BrakeTorque, bool bABSActivated)	 // 0x4a239d0;

	void EnableMechanicalSim(bool InState)	 // 0x4a23288;
	void EnableSuspension(bool InState)	 // 0x4a23348;
	void EnableWheelFriction(bool InState)	 // 0x4a23408;
	void SetABSEnabled(int32 WheelIndex, bool Enabled)	 // 0x4a24530;
	void SetAffectedByBrake(int32 WheelIndex, bool Enabled)	 // 0x4a246b4;
	void SetAffectedByEngine(int32 WheelIndex, bool Enabled)	 // 0x4a24838;
	void SetAffectedByHandbrake(int32 WheelIndex, bool Enabled)	 // 0x4a249bc;
	void SetAffectedBySteering(int32 WheelIndex, bool Enabled)	 // 0x4a24b40;
	void SetBrakeTorque(float BrakeTorque, int32 WheelIndex)	 // 0x4a24cc4;
	void SetDifferentialFrontRearSplit(float FrontRearSlpit)	 // 0x4a24e04;
	void SetDownforceCoefficient(float DownforceCoeff)	 // 0x4a24ec8;
	void SetDragCoefficient(float DragCoeff)	 // 0x4a24f8c;
	void SetDriveTorque(float DriveTorque, int32 WheelIndex)	 // 0x4a25050;
	void SetMaxEngineTorque(float Torque)	 // 0x4a25190;
	void SetSnapshot(const struct FWheeledSnaphotData& SnapshotIn)	 // 0x4a25254;
	void SetSuspensionParams(float Rate, float Damping, float Preload, float MaxRaise, float MaxDrop, int32 WheelIndex)	 // 0x4a25320;
	void SetTorqueCombineMethod(ETorqueCombineMethod InCombineMethod, int32 WheelIndex)	 // 0x4a25658;
	void SetTractionControlEnabled(int32 WheelIndex, bool Enabled)	 // 0x4a257d8;
	void SetWheelClass(int32 WheelIndex, TSubclassOf<class UChaosVehicleWheel> InWheelClass)	 // 0x4a2595c;
	void SetWheelFrictionMultiplier(int32 WheelIndex, float Friction)	 // 0x4a25a98;
	void SetWheelHandbrakeTorque(int32 WheelIndex, float Torque)	 // 0x4a25bd4;
	void SetWheelMaxBrakeTorque(int32 WheelIndex, float Torque)	 // 0x4a25d10;
	void SetWheelMaxSteerAngle(int32 WheelIndex, float AngleDegrees)	 // 0x4a25e4c;
	void SetWheelRadius(int32 WheelIndex, float Radius)	 // 0x4a25f88;
	void SetWheelSlipGraphMultiplier(int32 WheelIndex, float Multiplier)	 // 0x4a260c4;

	float GetEngineMaxRotationSpeed() const	 // 0x4a234c8;
	float GetEngineRotationSpeed() const	 // 0x4a234e8;
	int32 GetNumWheels() const	 // 0x4a23508;
	struct FWheeledSnaphotData GetSnapshot() const	 // 0x4a23520;
	const struct FWheelStatus GetWheelState(int32 WheelIndex) const	 // 0x4a235e8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ChaosWheeledVehicleMovementComponent">();
	}
	static class UChaosWheeledVehicleMovementComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UChaosWheeledVehicleMovementComponent>();
	}
};
static_assert(alignof(UChaosWheeledVehicleMovementComponent) == 0x000010, "Wrong alignment on UChaosWheeledVehicleMovementComponent");
static_assert(sizeof(UChaosWheeledVehicleMovementComponent) == 0x000C60, "Wrong size on UChaosWheeledVehicleMovementComponent");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, bSuspensionEnabled) == 0x000938, "Member 'UChaosWheeledVehicleMovementComponent::bSuspensionEnabled' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, bWheelFrictionEnabled) == 0x000939, "Member 'UChaosWheeledVehicleMovementComponent::bWheelFrictionEnabled' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, bLegacyWheelFrictionPosition) == 0x00093A, "Member 'UChaosWheeledVehicleMovementComponent::bLegacyWheelFrictionPosition' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, WheelSetups) == 0x000940, "Member 'UChaosWheeledVehicleMovementComponent::WheelSetups' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, WheelTraceCollisionResponses) == 0x000950, "Member 'UChaosWheeledVehicleMovementComponent::WheelTraceCollisionResponses' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, bMechanicalSimEnabled) == 0x000970, "Member 'UChaosWheeledVehicleMovementComponent::bMechanicalSimEnabled' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, EngineSetup) == 0x000978, "Member 'UChaosWheeledVehicleMovementComponent::EngineSetup' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, DifferentialSetup) == 0x000A40, "Member 'UChaosWheeledVehicleMovementComponent::DifferentialSetup' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, TransmissionSetup) == 0x000A50, "Member 'UChaosWheeledVehicleMovementComponent::TransmissionSetup' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, SteeringSetup) == 0x000AC0, "Member 'UChaosWheeledVehicleMovementComponent::SteeringSetup' has a wrong offset!");
static_assert(offsetof(UChaosWheeledVehicleMovementComponent, Wheels) == 0x000B98, "Member 'UChaosWheeledVehicleMovementComponent::Wheels' has a wrong offset!");

// Class ChaosVehicles.VehicleAnimationInstance
// 0x08C0 (0x0C10 - 0x0350)
class UVehicleAnimationInstance final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8B8];                                    // 0x0348(0x08B8)(Fixing Size After Last Property [ Dumper-7 ])
	class UChaosWheeledVehicleMovementComponent*  WheeledVehicleComponent;                           // 0x0C00(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C08[0x8];                                      // 0x0C08(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AWheeledVehiclePawn* GetVehicle()	 // 0x4a2358c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VehicleAnimationInstance">();
	}
	static class UVehicleAnimationInstance* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVehicleAnimationInstance>();
	}
};
static_assert(alignof(UVehicleAnimationInstance) == 0x000010, "Wrong alignment on UVehicleAnimationInstance");
static_assert(sizeof(UVehicleAnimationInstance) == 0x000C10, "Wrong size on UVehicleAnimationInstance");
static_assert(offsetof(UVehicleAnimationInstance, WheeledVehicleComponent) == 0x000C00, "Member 'UVehicleAnimationInstance::WheeledVehicleComponent' has a wrong offset!");

// Class ChaosVehicles.WheeledVehiclePawn
// 0x0010 (0x0348 - 0x0338)
class AWheeledVehiclePawn final : public APawn
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0338(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChaosVehicleMovementComponent*         VehicleMovementComponent;                          // 0x0340(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WheeledVehiclePawn">();
	}
	static class AWheeledVehiclePawn* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AWheeledVehiclePawn>();
	}
};
static_assert(alignof(AWheeledVehiclePawn) == 0x000008, "Wrong alignment on AWheeledVehiclePawn");
static_assert(sizeof(AWheeledVehiclePawn) == 0x000348, "Wrong size on AWheeledVehiclePawn");
static_assert(offsetof(AWheeledVehiclePawn, Mesh) == 0x000338, "Member 'AWheeledVehiclePawn::Mesh' has a wrong offset!");
static_assert(offsetof(AWheeledVehiclePawn, VehicleMovementComponent) == 0x000340, "Member 'AWheeledVehiclePawn::VehicleMovementComponent' has a wrong offset!");

}

