#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSkinSystem

#include "Basic.hpp"

#include "CharacterSkinSystem_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "GeometryScriptingExtras_structs.hpp"


namespace SDK::Params
{

// Function CharacterSkinSystem.CharacterSkinCommandEditorInterface.GetPrimitiveGizmoInfos
// 0x0010 (0x0010 - 0x0000)
struct CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos final
{
public:
	TArray<struct FPrimitiveGizmoInfo>            GizmoInfos;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos) == 0x000008, "Wrong alignment on CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos");
static_assert(sizeof(CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos) == 0x000010, "Wrong size on CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos");
static_assert(offsetof(CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos, GizmoInfos) == 0x000000, "Member 'CharacterSkinCommandEditorInterface_GetPrimitiveGizmoInfos::GizmoInfos' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSkinComponent.AddSkinObject
// 0x0010 (0x0010 - 0x0000)
struct CharacterSkinComponent_AddSkinObject final
{
public:
	class UCustomizableSkinObject*                InSkinObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterSkinComponent_AddSkinObject) == 0x000008, "Wrong alignment on CharacterSkinComponent_AddSkinObject");
static_assert(sizeof(CharacterSkinComponent_AddSkinObject) == 0x000010, "Wrong size on CharacterSkinComponent_AddSkinObject");
static_assert(offsetof(CharacterSkinComponent_AddSkinObject, InSkinObject) == 0x000000, "Member 'CharacterSkinComponent_AddSkinObject::InSkinObject' has a wrong offset!");
static_assert(offsetof(CharacterSkinComponent_AddSkinObject, ReturnValue) == 0x000008, "Member 'CharacterSkinComponent_AddSkinObject::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSkinComponent.RemoveSkinObject
// 0x000C (0x000C - 0x0000)
struct CharacterSkinComponent_RemoveSkinObject final
{
public:
	class FName                                   InSlotName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterSkinComponent_RemoveSkinObject) == 0x000004, "Wrong alignment on CharacterSkinComponent_RemoveSkinObject");
static_assert(sizeof(CharacterSkinComponent_RemoveSkinObject) == 0x00000C, "Wrong size on CharacterSkinComponent_RemoveSkinObject");
static_assert(offsetof(CharacterSkinComponent_RemoveSkinObject, InSlotName) == 0x000000, "Member 'CharacterSkinComponent_RemoveSkinObject::InSlotName' has a wrong offset!");
static_assert(offsetof(CharacterSkinComponent_RemoveSkinObject, ReturnValue) == 0x000008, "Member 'CharacterSkinComponent_RemoveSkinObject::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSkinComponent.StartAsyncSkinUpdate
// 0x0001 (0x0001 - 0x0000)
struct CharacterSkinComponent_StartAsyncSkinUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinComponent_StartAsyncSkinUpdate) == 0x000001, "Wrong alignment on CharacterSkinComponent_StartAsyncSkinUpdate");
static_assert(sizeof(CharacterSkinComponent_StartAsyncSkinUpdate) == 0x000001, "Wrong size on CharacterSkinComponent_StartAsyncSkinUpdate");
static_assert(offsetof(CharacterSkinComponent_StartAsyncSkinUpdate, ReturnValue) == 0x000000, "Member 'CharacterSkinComponent_StartAsyncSkinUpdate::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSkinComponent.StartSkinUpdate
// 0x0008 (0x0008 - 0x0000)
struct CharacterSkinComponent_StartSkinUpdate final
{
public:
	class USkeletalMesh*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterSkinComponent_StartSkinUpdate) == 0x000008, "Wrong alignment on CharacterSkinComponent_StartSkinUpdate");
static_assert(sizeof(CharacterSkinComponent_StartSkinUpdate) == 0x000008, "Wrong size on CharacterSkinComponent_StartSkinUpdate");
static_assert(offsetof(CharacterSkinComponent_StartSkinUpdate, ReturnValue) == 0x000000, "Member 'CharacterSkinComponent_StartSkinUpdate::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSystemTestFunctionLibrary.CompareWithSavedMesh
// 0x0038 (0x0038 - 0x0000)
struct CharacterSystemTestFunctionLibrary_CompareWithSavedMesh final
{
public:
	class USkeletalMesh*                          TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SavedMesh;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptIsSameMeshOptions       OPTIONS;                                           // 0x0010(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutErrorMessage;                                   // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh) == 0x000008, "Wrong alignment on CharacterSystemTestFunctionLibrary_CompareWithSavedMesh");
static_assert(sizeof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh) == 0x000038, "Wrong size on CharacterSystemTestFunctionLibrary_CompareWithSavedMesh");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh, TargetMesh) == 0x000000, "Member 'CharacterSystemTestFunctionLibrary_CompareWithSavedMesh::TargetMesh' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh, SavedMesh) == 0x000008, "Member 'CharacterSystemTestFunctionLibrary_CompareWithSavedMesh::SavedMesh' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh, OPTIONS) == 0x000010, "Member 'CharacterSystemTestFunctionLibrary_CompareWithSavedMesh::OPTIONS' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh, OutErrorMessage) == 0x000020, "Member 'CharacterSystemTestFunctionLibrary_CompareWithSavedMesh::OutErrorMessage' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_CompareWithSavedMesh, ReturnValue) == 0x000030, "Member 'CharacterSystemTestFunctionLibrary_CompareWithSavedMesh::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CharacterSystemTestFunctionLibrary.ValidateBoneWeight
// 0x0020 (0x0020 - 0x0000)
struct CharacterSystemTestFunctionLibrary_ValidateBoneWeight final
{
public:
	class USkeletalMesh*                          TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutErrorMessage;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CharacterSystemTestFunctionLibrary_ValidateBoneWeight) == 0x000008, "Wrong alignment on CharacterSystemTestFunctionLibrary_ValidateBoneWeight");
static_assert(sizeof(CharacterSystemTestFunctionLibrary_ValidateBoneWeight) == 0x000020, "Wrong size on CharacterSystemTestFunctionLibrary_ValidateBoneWeight");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_ValidateBoneWeight, TargetMesh) == 0x000000, "Member 'CharacterSystemTestFunctionLibrary_ValidateBoneWeight::TargetMesh' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_ValidateBoneWeight, OutErrorMessage) == 0x000008, "Member 'CharacterSystemTestFunctionLibrary_ValidateBoneWeight::OutErrorMessage' has a wrong offset!");
static_assert(offsetof(CharacterSystemTestFunctionLibrary_ValidateBoneWeight, ReturnValue) == 0x000018, "Member 'CharacterSystemTestFunctionLibrary_ValidateBoneWeight::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CustomSkinCommand.OnExecuteCommand
// 0x0028 (0x0028 - 0x0000)
struct CustomSkinCommand_OnExecuteCommand final
{
public:
	TArray<class UDynamicMesh*>                   LODMeshes;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FSkinOperationMeshMaterial>     Materials;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CustomSkinCommand_OnExecuteCommand) == 0x000008, "Wrong alignment on CustomSkinCommand_OnExecuteCommand");
static_assert(sizeof(CustomSkinCommand_OnExecuteCommand) == 0x000028, "Wrong size on CustomSkinCommand_OnExecuteCommand");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommand, LODMeshes) == 0x000000, "Member 'CustomSkinCommand_OnExecuteCommand::LODMeshes' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommand, Materials) == 0x000010, "Member 'CustomSkinCommand_OnExecuteCommand::Materials' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommand, ReturnValue) == 0x000020, "Member 'CustomSkinCommand_OnExecuteCommand::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CustomSkinCommand.OnExecuteCommandForEachLOD
// 0x0038 (0x0038 - 0x0000)
struct CustomSkinCommand_OnExecuteCommandForEachLOD final
{
public:
	class UDynamicMesh*                           LODMesh;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSkinOperationMeshMaterial>     Materials;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         CurrentLOD;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeometryScriptingExtrasDebugMeshInfo> OutputDebugMeshes;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomSkinCommand_OnExecuteCommandForEachLOD) == 0x000008, "Wrong alignment on CustomSkinCommand_OnExecuteCommandForEachLOD");
static_assert(sizeof(CustomSkinCommand_OnExecuteCommandForEachLOD) == 0x000038, "Wrong size on CustomSkinCommand_OnExecuteCommandForEachLOD");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommandForEachLOD, LODMesh) == 0x000000, "Member 'CustomSkinCommand_OnExecuteCommandForEachLOD::LODMesh' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommandForEachLOD, Materials) == 0x000008, "Member 'CustomSkinCommand_OnExecuteCommandForEachLOD::Materials' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommandForEachLOD, CurrentLOD) == 0x000018, "Member 'CustomSkinCommand_OnExecuteCommandForEachLOD::CurrentLOD' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommandForEachLOD, OutputDebugMeshes) == 0x000020, "Member 'CustomSkinCommand_OnExecuteCommandForEachLOD::OutputDebugMeshes' has a wrong offset!");
static_assert(offsetof(CustomSkinCommand_OnExecuteCommandForEachLOD, ReturnValue) == 0x000030, "Member 'CustomSkinCommand_OnExecuteCommandForEachLOD::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CustomSkinCommand.OnDisplayName
// 0x0018 (0x0018 - 0x0000)
struct CustomSkinCommand_OnDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomSkinCommand_OnDisplayName) == 0x000008, "Wrong alignment on CustomSkinCommand_OnDisplayName");
static_assert(sizeof(CustomSkinCommand_OnDisplayName) == 0x000018, "Wrong size on CustomSkinCommand_OnDisplayName");
static_assert(offsetof(CustomSkinCommand_OnDisplayName, ReturnValue) == 0x000000, "Member 'CustomSkinCommand_OnDisplayName::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CustomSkinCommand.OnIsAllowFirstCommand
// 0x0001 (0x0001 - 0x0000)
struct CustomSkinCommand_OnIsAllowFirstCommand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomSkinCommand_OnIsAllowFirstCommand) == 0x000001, "Wrong alignment on CustomSkinCommand_OnIsAllowFirstCommand");
static_assert(sizeof(CustomSkinCommand_OnIsAllowFirstCommand) == 0x000001, "Wrong size on CustomSkinCommand_OnIsAllowFirstCommand");
static_assert(offsetof(CustomSkinCommand_OnIsAllowFirstCommand, ReturnValue) == 0x000000, "Member 'CustomSkinCommand_OnIsAllowFirstCommand::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.CustomSkinCommand.OnIsSkipCommand
// 0x0001 (0x0001 - 0x0000)
struct CustomSkinCommand_OnIsSkipCommand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CustomSkinCommand_OnIsSkipCommand) == 0x000001, "Wrong alignment on CustomSkinCommand_OnIsSkipCommand");
static_assert(sizeof(CustomSkinCommand_OnIsSkipCommand) == 0x000001, "Wrong size on CustomSkinCommand_OnIsSkipCommand");
static_assert(offsetof(CustomSkinCommand_OnIsSkipCommand, ReturnValue) == 0x000000, "Member 'CustomSkinCommand_OnIsSkipCommand::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.ConvertDynamicToSkeletalMesh
// 0x0058 (0x0058 - 0x0000)
struct SkinOperationProvider_ConvertDynamicToSkeletalMesh final
{
public:
	TArray<class UDynamicMesh*>                   LODMeshes;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FConvertToSkeletalMeshParams           ConvertParams;                                     // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FCreateSkeletalMeshParams              CreateParams;                                      // 0x0030(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FImmatureSkeletalMesh                  ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_ConvertDynamicToSkeletalMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_ConvertDynamicToSkeletalMesh");
static_assert(sizeof(SkinOperationProvider_ConvertDynamicToSkeletalMesh) == 0x000058, "Wrong size on SkinOperationProvider_ConvertDynamicToSkeletalMesh");
static_assert(offsetof(SkinOperationProvider_ConvertDynamicToSkeletalMesh, LODMeshes) == 0x000000, "Member 'SkinOperationProvider_ConvertDynamicToSkeletalMesh::LODMeshes' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertDynamicToSkeletalMesh, Materials) == 0x000010, "Member 'SkinOperationProvider_ConvertDynamicToSkeletalMesh::Materials' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertDynamicToSkeletalMesh, ConvertParams) == 0x000020, "Member 'SkinOperationProvider_ConvertDynamicToSkeletalMesh::ConvertParams' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertDynamicToSkeletalMesh, CreateParams) == 0x000030, "Member 'SkinOperationProvider_ConvertDynamicToSkeletalMesh::CreateParams' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertDynamicToSkeletalMesh, ReturnValue) == 0x000048, "Member 'SkinOperationProvider_ConvertDynamicToSkeletalMesh::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.ConvertSkeletalToDynamicMesh
// 0x0078 (0x0078 - 0x0000)
struct SkinOperationProvider_ConvertSkeletalToDynamicMesh final
{
public:
	TArray<class UDynamicMesh*>                   OutLODMeshes;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             OutMaterials;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConvertToSkinOperationMeshParams      Params_0;                                          // 0x0028(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_ConvertSkeletalToDynamicMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_ConvertSkeletalToDynamicMesh");
static_assert(sizeof(SkinOperationProvider_ConvertSkeletalToDynamicMesh) == 0x000078, "Wrong size on SkinOperationProvider_ConvertSkeletalToDynamicMesh");
static_assert(offsetof(SkinOperationProvider_ConvertSkeletalToDynamicMesh, OutLODMeshes) == 0x000000, "Member 'SkinOperationProvider_ConvertSkeletalToDynamicMesh::OutLODMeshes' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertSkeletalToDynamicMesh, OutMaterials) == 0x000010, "Member 'SkinOperationProvider_ConvertSkeletalToDynamicMesh::OutMaterials' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertSkeletalToDynamicMesh, SkeletalMesh) == 0x000020, "Member 'SkinOperationProvider_ConvertSkeletalToDynamicMesh::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertSkeletalToDynamicMesh, Params_0) == 0x000028, "Member 'SkinOperationProvider_ConvertSkeletalToDynamicMesh::Params_0' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.ConvertStaticToDynamicMesh
// 0x0078 (0x0078 - 0x0000)
struct SkinOperationProvider_ConvertStaticToDynamicMesh final
{
public:
	TArray<class UDynamicMesh*>                   OutLODMeshes;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             OutMaterials;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConvertToSkinOperationMeshParams      Params_0;                                          // 0x0028(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_ConvertStaticToDynamicMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_ConvertStaticToDynamicMesh");
static_assert(sizeof(SkinOperationProvider_ConvertStaticToDynamicMesh) == 0x000078, "Wrong size on SkinOperationProvider_ConvertStaticToDynamicMesh");
static_assert(offsetof(SkinOperationProvider_ConvertStaticToDynamicMesh, OutLODMeshes) == 0x000000, "Member 'SkinOperationProvider_ConvertStaticToDynamicMesh::OutLODMeshes' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertStaticToDynamicMesh, OutMaterials) == 0x000010, "Member 'SkinOperationProvider_ConvertStaticToDynamicMesh::OutMaterials' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertStaticToDynamicMesh, StaticMesh) == 0x000020, "Member 'SkinOperationProvider_ConvertStaticToDynamicMesh::StaticMesh' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_ConvertStaticToDynamicMesh, Params_0) == 0x000028, "Member 'SkinOperationProvider_ConvertStaticToDynamicMesh::Params_0' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.CreateEmptySkeletalMesh
// 0x0018 (0x0018 - 0x0000)
struct SkinOperationProvider_CreateEmptySkeletalMesh final
{
public:
	class USkeletalMesh*                          TemplateMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OuterObject;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_CreateEmptySkeletalMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_CreateEmptySkeletalMesh");
static_assert(sizeof(SkinOperationProvider_CreateEmptySkeletalMesh) == 0x000018, "Wrong size on SkinOperationProvider_CreateEmptySkeletalMesh");
static_assert(offsetof(SkinOperationProvider_CreateEmptySkeletalMesh, TemplateMesh) == 0x000000, "Member 'SkinOperationProvider_CreateEmptySkeletalMesh::TemplateMesh' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_CreateEmptySkeletalMesh, OuterObject) == 0x000008, "Member 'SkinOperationProvider_CreateEmptySkeletalMesh::OuterObject' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_CreateEmptySkeletalMesh, ReturnValue) == 0x000010, "Member 'SkinOperationProvider_CreateEmptySkeletalMesh::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.DeferInitImmatureSkeletalMesh
// 0x0020 (0x0020 - 0x0000)
struct SkinOperationProvider_DeferInitImmatureSkeletalMesh final
{
public:
	struct FImmatureSkeletalMesh                  ImmatureSkeletalMesh;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	class UWorld*                                 InWorld;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_DeferInitImmatureSkeletalMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_DeferInitImmatureSkeletalMesh");
static_assert(sizeof(SkinOperationProvider_DeferInitImmatureSkeletalMesh) == 0x000020, "Wrong size on SkinOperationProvider_DeferInitImmatureSkeletalMesh");
static_assert(offsetof(SkinOperationProvider_DeferInitImmatureSkeletalMesh, ImmatureSkeletalMesh) == 0x000000, "Member 'SkinOperationProvider_DeferInitImmatureSkeletalMesh::ImmatureSkeletalMesh' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_DeferInitImmatureSkeletalMesh, InWorld) == 0x000010, "Member 'SkinOperationProvider_DeferInitImmatureSkeletalMesh::InWorld' has a wrong offset!");
static_assert(offsetof(SkinOperationProvider_DeferInitImmatureSkeletalMesh, ReturnValue) == 0x000018, "Member 'SkinOperationProvider_DeferInitImmatureSkeletalMesh::ReturnValue' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.PrepareSkeletalMesh
// 0x0008 (0x0008 - 0x0000)
struct SkinOperationProvider_PrepareSkeletalMesh final
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_PrepareSkeletalMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_PrepareSkeletalMesh");
static_assert(sizeof(SkinOperationProvider_PrepareSkeletalMesh) == 0x000008, "Wrong size on SkinOperationProvider_PrepareSkeletalMesh");
static_assert(offsetof(SkinOperationProvider_PrepareSkeletalMesh, SkeletalMesh) == 0x000000, "Member 'SkinOperationProvider_PrepareSkeletalMesh::SkeletalMesh' has a wrong offset!");

// Function CharacterSkinSystem.SkinOperationProvider.PrepareStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct SkinOperationProvider_PrepareStaticMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkinOperationProvider_PrepareStaticMesh) == 0x000008, "Wrong alignment on SkinOperationProvider_PrepareStaticMesh");
static_assert(sizeof(SkinOperationProvider_PrepareStaticMesh) == 0x000008, "Wrong size on SkinOperationProvider_PrepareStaticMesh");
static_assert(offsetof(SkinOperationProvider_PrepareStaticMesh, StaticMesh) == 0x000000, "Member 'SkinOperationProvider_PrepareStaticMesh::StaticMesh' has a wrong offset!");

}

