#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CineCameraRigs

#include "Basic.hpp"

#include "CinematicCamera_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CineCameraRigs_structs.hpp"


namespace SDK
{

// Class CineCameraRigs.CineCameraRigRail
// 0x0048 (0x0318 - 0x02D0)
class ACineCameraRigRail final : public ACameraRig_Rail
{
public:
	bool                                          bUseAbsolutePosition;                              // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AbsolutePositionOnRail;                            // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePointRotation;                                 // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     SplineMeshMaterial;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       SplineMeshMIDs;                                    // 0x02E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UTexture2D*                             SplineMeshTexture;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationX;                                  // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationY;                                  // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachLocationZ;                                  // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationX;                                  // 0x0303(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationY;                                  // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttachRotationZ;                                  // 0x0305(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritFocalLength;                               // 0x0306(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritAperture;                                  // 0x0307(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInheritFocusDistance;                             // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0xF];                                      // 0x0309(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSplineMeshMaterial(class UMaterialInterface* InMaterial)	 // 0x50ec9d4;
	void SetSplineMeshTexture(class UTexture2D* InTexture)	 // 0x50ecaa4;

	class UCineSplineComponent* GetCineSplineComponent() const	 // 0x405fac0;
	struct FVector GetVelocityAtPosition(const float InPosition, const float Delta) const	 // 0x50ec1e0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CineCameraRigRail">();
	}
	static class ACineCameraRigRail* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ACineCameraRigRail>();
	}
};
static_assert(alignof(ACineCameraRigRail) == 0x000008, "Wrong alignment on ACineCameraRigRail");
static_assert(sizeof(ACineCameraRigRail) == 0x000318, "Wrong size on ACineCameraRigRail");
static_assert(offsetof(ACineCameraRigRail, bUseAbsolutePosition) == 0x0002D0, "Member 'ACineCameraRigRail::bUseAbsolutePosition' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, AbsolutePositionOnRail) == 0x0002D4, "Member 'ACineCameraRigRail::AbsolutePositionOnRail' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bUsePointRotation) == 0x0002D8, "Member 'ACineCameraRigRail::bUsePointRotation' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, SplineMeshMaterial) == 0x0002E0, "Member 'ACineCameraRigRail::SplineMeshMaterial' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, SplineMeshMIDs) == 0x0002E8, "Member 'ACineCameraRigRail::SplineMeshMIDs' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, SplineMeshTexture) == 0x0002F8, "Member 'ACineCameraRigRail::SplineMeshTexture' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachLocationX) == 0x000300, "Member 'ACineCameraRigRail::bAttachLocationX' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachLocationY) == 0x000301, "Member 'ACineCameraRigRail::bAttachLocationY' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachLocationZ) == 0x000302, "Member 'ACineCameraRigRail::bAttachLocationZ' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachRotationX) == 0x000303, "Member 'ACineCameraRigRail::bAttachRotationX' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachRotationY) == 0x000304, "Member 'ACineCameraRigRail::bAttachRotationY' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bAttachRotationZ) == 0x000305, "Member 'ACineCameraRigRail::bAttachRotationZ' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bInheritFocalLength) == 0x000306, "Member 'ACineCameraRigRail::bInheritFocalLength' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bInheritAperture) == 0x000307, "Member 'ACineCameraRigRail::bInheritAperture' has a wrong offset!");
static_assert(offsetof(ACineCameraRigRail, bInheritFocusDistance) == 0x000308, "Member 'ACineCameraRigRail::bInheritFocusDistance' has a wrong offset!");

// Class CineCameraRigs.CineCameraRigRailHelpers
// 0x0000 (0x0028 - 0x0028)
class UCineCameraRigRailHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void CreateOrUpdateSplineHeatmapTexture(class UTexture2D*& Texture, const TArray<float>& DataValues, const float LowValue, const float AverageValue, const float HighValue)	 // 0x50eb884;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CineCameraRigRailHelpers">();
	}
	static class UCineCameraRigRailHelpers* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCineCameraRigRailHelpers>();
	}
};
static_assert(alignof(UCineCameraRigRailHelpers) == 0x000008, "Wrong alignment on UCineCameraRigRailHelpers");
static_assert(sizeof(UCineCameraRigRailHelpers) == 0x000028, "Wrong size on UCineCameraRigRailHelpers");

// Class CineCameraRigs.CineCameraRigRailSettings
// 0x0060 (0x0088 - 0x0028)
class UCineCameraRigRailSettings final : public UObject
{
public:
	TSoftObjectPtr<class UMaterialInterface>      DefaultSplineMeshMaterial;                         // 0x0028(0x0030)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              DefaultSplineMeshTexture;                          // 0x0058(0x0030)(Edit, BlueprintVisible, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CineCameraRigRailSettings">();
	}
	static class UCineCameraRigRailSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCineCameraRigRailSettings>();
	}
};
static_assert(alignof(UCineCameraRigRailSettings) == 0x000008, "Wrong alignment on UCineCameraRigRailSettings");
static_assert(sizeof(UCineCameraRigRailSettings) == 0x000088, "Wrong size on UCineCameraRigRailSettings");
static_assert(offsetof(UCineCameraRigRailSettings, DefaultSplineMeshMaterial) == 0x000028, "Member 'UCineCameraRigRailSettings::DefaultSplineMeshMaterial' has a wrong offset!");
static_assert(offsetof(UCineCameraRigRailSettings, DefaultSplineMeshTexture) == 0x000058, "Member 'UCineCameraRigRailSettings::DefaultSplineMeshTexture' has a wrong offset!");

// Class CineCameraRigs.CineSplineComponent
// 0x0060 (0x0710 - 0x06B0)
class UCineSplineComponent final : public USplineComponent
{
public:
	uint8                                         Pad_6A8[0x8];                                      // 0x06A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCineSplineCurveDefaults               CameraSplineDefaults;                              // 0x06B0(0x0030)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class UCineSplineMetadata*                    CineSplineMetadata;                                // 0x06E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E8[0x18];                                     // 0x06E8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSplineEdited_BP;                                 // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void AddSplineDataAtPosition(const float InPosition, const struct FCineSplinePointData& InPointData)	 // 0x50eb730;
	void SetAbsolutePositionAtSplinePoint(const int32 PointIndex, const float Value)	 // 0x50ec344;
	void SetApertureAtSplinePoint(const int32 PointIndex, const float Value)	 // 0x50ec490;
	void SetFocalLengthAtSplinePoint(const int32 PointIndex, const float Value)	 // 0x50ec5dc;
	void SetFocusDistanceAtSplinePoint(const int32 PointIndex, const float Value)	 // 0x50ec728;
	void SetPointRotationAtSplinePoint(const int32 PointIndex, const struct FQuat& Value)	 // 0x50ec874;
	void UpdateSplineDataAtIndex(const int32 InIndex, const struct FCineSplinePointData& InPointData)	 // 0x50ecb74;

	bool FindSplineDataAtPosition(const float InPosition, int32* OutIndex, const float Tolerance) const	 // 0x50ebbc8;
	float GetInputKeyAtPosition(const float InPosition) const	 // 0x50ebd54;
	struct FQuat GetPointRotationAtSplineInputKey(float InKey) const	 // 0x50ebe28;
	struct FQuat GetPointRotationAtSplinePoint(int32 Index_0) const	 // 0x50ebf08;
	float GetPositionAtInputKey(const float InKey) const	 // 0x50ec018;
	struct FCineSplinePointData GetSplineDataAtPosition(const float InPosition) const	 // 0x50ec0ec;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CineSplineComponent">();
	}
	static class UCineSplineComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCineSplineComponent>();
	}
};
static_assert(alignof(UCineSplineComponent) == 0x000010, "Wrong alignment on UCineSplineComponent");
static_assert(sizeof(UCineSplineComponent) == 0x000710, "Wrong size on UCineSplineComponent");
static_assert(offsetof(UCineSplineComponent, CameraSplineDefaults) == 0x0006B0, "Member 'UCineSplineComponent::CameraSplineDefaults' has a wrong offset!");
static_assert(offsetof(UCineSplineComponent, CineSplineMetadata) == 0x0006E0, "Member 'UCineSplineComponent::CineSplineMetadata' has a wrong offset!");
static_assert(offsetof(UCineSplineComponent, OnSplineEdited_BP) == 0x000700, "Member 'UCineSplineComponent::OnSplineEdited_BP' has a wrong offset!");

// Class CineCameraRigs.CineSplineMetadata
// 0x0078 (0x00A0 - 0x0028)
class UCineSplineMetadata final : public USplineMetadata
{
public:
	struct FInterpCurveFloat                      AbsolutePosition;                                  // 0x0028(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      FocalLength;                                       // 0x0040(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      Aperture;                                          // 0x0058(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      FocusDistance;                                     // 0x0070(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveQuat                       PointRotation;                                     // 0x0088(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CineSplineMetadata">();
	}
	static class UCineSplineMetadata* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCineSplineMetadata>();
	}
};
static_assert(alignof(UCineSplineMetadata) == 0x000008, "Wrong alignment on UCineSplineMetadata");
static_assert(sizeof(UCineSplineMetadata) == 0x0000A0, "Wrong size on UCineSplineMetadata");
static_assert(offsetof(UCineSplineMetadata, AbsolutePosition) == 0x000028, "Member 'UCineSplineMetadata::AbsolutePosition' has a wrong offset!");
static_assert(offsetof(UCineSplineMetadata, FocalLength) == 0x000040, "Member 'UCineSplineMetadata::FocalLength' has a wrong offset!");
static_assert(offsetof(UCineSplineMetadata, Aperture) == 0x000058, "Member 'UCineSplineMetadata::Aperture' has a wrong offset!");
static_assert(offsetof(UCineSplineMetadata, FocusDistance) == 0x000070, "Member 'UCineSplineMetadata::FocusDistance' has a wrong offset!");
static_assert(offsetof(UCineSplineMetadata, PointRotation) == 0x000088, "Member 'UCineSplineMetadata::PointRotation' has a wrong offset!");

}

