#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonUI

#include "Basic.hpp"

#include "CommonUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class CommonUI.CommonUIVisibilitySubsystem
// 0x0058 (0x0088 - 0x0030)
class UCommonUIVisibilitySubsystem final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonUIVisibilitySubsystem">();
	}
	static class UCommonUIVisibilitySubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonUIVisibilitySubsystem>();
	}
};
static_assert(alignof(UCommonUIVisibilitySubsystem) == 0x000008, "Wrong alignment on UCommonUIVisibilitySubsystem");
static_assert(sizeof(UCommonUIVisibilitySubsystem) == 0x000088, "Wrong size on UCommonUIVisibilitySubsystem");

// Class CommonUI.CommonStyleSheetTypeBase
// 0x0008 (0x0030 - 0x0028)
class UCommonStyleSheetTypeBase : public UObject
{
public:
	bool                                          bIsEnabled;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeBase">();
	}
	static class UCommonStyleSheetTypeBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeBase>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeBase) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeBase");
static_assert(sizeof(UCommonStyleSheetTypeBase) == 0x000030, "Wrong size on UCommonStyleSheetTypeBase");
static_assert(offsetof(UCommonStyleSheetTypeBase, bIsEnabled) == 0x000028, "Member 'UCommonStyleSheetTypeBase::bIsEnabled' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeColor
// 0x0010 (0x0040 - 0x0030)
class UCommonStyleSheetTypeColor final : public UCommonStyleSheetTypeBase
{
public:
	struct FLinearColor                           Color;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeColor">();
	}
	static class UCommonStyleSheetTypeColor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeColor>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeColor) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeColor");
static_assert(sizeof(UCommonStyleSheetTypeColor) == 0x000040, "Wrong size on UCommonStyleSheetTypeColor");
static_assert(offsetof(UCommonStyleSheetTypeColor, Color) == 0x000030, "Member 'UCommonStyleSheetTypeColor::Color' has a wrong offset!");

// Class CommonUI.CommonBorder
// 0x0020 (0x0330 - 0x0310)
#pragma pack(push, 0x1)
class alignas(0x10) UCommonBorder : public UBorder
{
public:
	TSubclassOf<class UCommonBorderStyle>         Style;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReducePaddingBySafezone;                          // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                MinimumPadding;                                    // 0x0314(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStyle(TSubclassOf<class UCommonBorderStyle> InStyle)	 // 0x4a9070c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonBorder">();
	}
	static class UCommonBorder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonBorder>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCommonBorder) == 0x000010, "Wrong alignment on UCommonBorder");
static_assert(sizeof(UCommonBorder) == 0x000330, "Wrong size on UCommonBorder");
static_assert(offsetof(UCommonBorder, Style) == 0x000308, "Member 'UCommonBorder::Style' has a wrong offset!");
static_assert(offsetof(UCommonBorder, bReducePaddingBySafezone) == 0x000310, "Member 'UCommonBorder::bReducePaddingBySafezone' has a wrong offset!");
static_assert(offsetof(UCommonBorder, MinimumPadding) == 0x000314, "Member 'UCommonBorder::MinimumPadding' has a wrong offset!");

// Class CommonUI.CommonHardwareVisibilityBorder
// 0x0050 (0x0380 - 0x0330)
class UCommonHardwareVisibilityBorder final : public UCommonBorder
{
public:
	struct FGameplayTagQuery                      VisibilityQuery;                                   // 0x0328(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              VisibleType;                                       // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenType;                                        // 0x0371(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_372[0xE];                                      // 0x0372(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonHardwareVisibilityBorder">();
	}
	static class UCommonHardwareVisibilityBorder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonHardwareVisibilityBorder>();
	}
};
static_assert(alignof(UCommonHardwareVisibilityBorder) == 0x000010, "Wrong alignment on UCommonHardwareVisibilityBorder");
static_assert(sizeof(UCommonHardwareVisibilityBorder) == 0x000380, "Wrong size on UCommonHardwareVisibilityBorder");
static_assert(offsetof(UCommonHardwareVisibilityBorder, VisibilityQuery) == 0x000328, "Member 'UCommonHardwareVisibilityBorder::VisibilityQuery' has a wrong offset!");
static_assert(offsetof(UCommonHardwareVisibilityBorder, VisibleType) == 0x000370, "Member 'UCommonHardwareVisibilityBorder::VisibleType' has a wrong offset!");
static_assert(offsetof(UCommonHardwareVisibilityBorder, HiddenType) == 0x000371, "Member 'UCommonHardwareVisibilityBorder::HiddenType' has a wrong offset!");

// Class CommonUI.CommonUserWidget
// 0x0028 (0x02A8 - 0x0280)
class UCommonUserWidget : public UUserWidget
{
public:
	bool                                          bDisplayInActionBar;                               // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConsumePointerInput;                              // 0x0281(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_282[0x26];                                     // 0x0282(0x0026)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetConsumePointerInput(bool bInConsumePointerInput)	 // 0x4a8da88;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonUserWidget">();
	}
	static class UCommonUserWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonUserWidget>();
	}
};
static_assert(alignof(UCommonUserWidget) == 0x000008, "Wrong alignment on UCommonUserWidget");
static_assert(sizeof(UCommonUserWidget) == 0x0002A8, "Wrong size on UCommonUserWidget");
static_assert(offsetof(UCommonUserWidget, bDisplayInActionBar) == 0x000280, "Member 'UCommonUserWidget::bDisplayInActionBar' has a wrong offset!");
static_assert(offsetof(UCommonUserWidget, bConsumePointerInput) == 0x000281, "Member 'UCommonUserWidget::bConsumePointerInput' has a wrong offset!");

// Class CommonUI.CommonVisibilitySwitcher
// 0x0028 (0x01A0 - 0x0178)
class UCommonVisibilitySwitcher final : public UOverlay
{
public:
	ESlateVisibility                              ShownVisibility;                                   // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActiveWidgetIndex;                                 // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoActivateSlot;                                 // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bActivateFirstSlotOnAdding;                        // 0x0181(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_182[0x1E];                                     // 0x0182(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateVisibleSlot()	 // 0x4a88d3c;
	void DeactivateVisibleSlot()	 // 0x4a89288;
	void DecrementActiveWidgetIndex(bool bAllowWrapping)	 // 0x4a892dc;
	void IncrementActiveWidgetIndex(bool bAllowWrapping)	 // 0x4a8bc80;
	void SetActiveWidget(const class UWidget* Widget)	 // 0x4a8d184;
	void SetActiveWidgetIndex(int32 Index_0)	 // 0x4a8d250;

	class UWidget* GetActiveWidget() const	 // 0x4a89878;
	int32 GetActiveWidgetIndex() const	 // 0x4a8989c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonVisibilitySwitcher">();
	}
	static class UCommonVisibilitySwitcher* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonVisibilitySwitcher>();
	}
};
static_assert(alignof(UCommonVisibilitySwitcher) == 0x000008, "Wrong alignment on UCommonVisibilitySwitcher");
static_assert(sizeof(UCommonVisibilitySwitcher) == 0x0001A0, "Wrong size on UCommonVisibilitySwitcher");
static_assert(offsetof(UCommonVisibilitySwitcher, ShownVisibility) == 0x000178, "Member 'UCommonVisibilitySwitcher::ShownVisibility' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, ActiveWidgetIndex) == 0x00017C, "Member 'UCommonVisibilitySwitcher::ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, bAutoActivateSlot) == 0x000180, "Member 'UCommonVisibilitySwitcher::bAutoActivateSlot' has a wrong offset!");
static_assert(offsetof(UCommonVisibilitySwitcher, bActivateFirstSlotOnAdding) == 0x000181, "Member 'UCommonVisibilitySwitcher::bActivateFirstSlotOnAdding' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeFontTypeface
// 0x0058 (0x0088 - 0x0030)
class UCommonStyleSheetTypeFontTypeface final : public UCommonStyleSheetTypeBase
{
public:
	struct FSlateFontInfo                         Typeface;                                          // 0x0030(0x0058)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeFontTypeface">();
	}
	static class UCommonStyleSheetTypeFontTypeface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeFontTypeface>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeFontTypeface) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeFontTypeface");
static_assert(sizeof(UCommonStyleSheetTypeFontTypeface) == 0x000088, "Wrong size on UCommonStyleSheetTypeFontTypeface");
static_assert(offsetof(UCommonStyleSheetTypeFontTypeface, Typeface) == 0x000030, "Member 'UCommonStyleSheetTypeFontTypeface::Typeface' has a wrong offset!");

// Class CommonUI.CommonWidgetGroupBase
// 0x0000 (0x0028 - 0x0028)
class UCommonWidgetGroupBase : public UObject
{
public:
	void AddWidget(class UWidget* InWidget)	 // 0x4a88d90;
	void RemoveAll()	 // 0x3fa3790;
	void RemoveWidget(class UWidget* InWidget)	 // 0x4a8cc30;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonWidgetGroupBase">();
	}
	static class UCommonWidgetGroupBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonWidgetGroupBase>();
	}
};
static_assert(alignof(UCommonWidgetGroupBase) == 0x000008, "Wrong alignment on UCommonWidgetGroupBase");
static_assert(sizeof(UCommonWidgetGroupBase) == 0x000028, "Wrong size on UCommonWidgetGroupBase");

// Class CommonUI.AnalogSlider
// 0x0020 (0x0720 - 0x0700)
class UAnalogSlider final : public USlider
{
public:
	TMulticastInlineDelegate<void(float Value)>   OnAnalogCapture;                                   // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_710[0x10];                                     // 0x0710(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AnalogSlider">();
	}
	static class UAnalogSlider* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAnalogSlider>();
	}
};
static_assert(alignof(UAnalogSlider) == 0x000010, "Wrong alignment on UAnalogSlider");
static_assert(sizeof(UAnalogSlider) == 0x000720, "Wrong size on UAnalogSlider");
static_assert(offsetof(UAnalogSlider, OnAnalogCapture) == 0x000700, "Member 'UAnalogSlider::OnAnalogCapture' has a wrong offset!");

// Class CommonUI.CommonActivatableWidget
// 0x0138 (0x03E0 - 0x02A8)
class UCommonActivatableWidget : public UCommonUserWidget
{
public:
	bool                                          bIsBackHandler;                                    // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBackActionDisplayedInActionBar;                 // 0x02A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoActivate;                                     // 0x02AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsActivationFocus;                          // 0x02AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsModal;                                          // 0x02AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoRestoreFocus;                                 // 0x02AD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideActionDomain;                             // 0x02AE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AF[0x1];                                      // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputMappingContext*                   InputMapping;                                      // 0x02B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InputMappingPriority;                              // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCommonInputActionDomain> ActionDomainOverride;                             // 0x02C0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              BP_OnWidgetActivated;                              // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              BP_OnWidgetDeactivated;                            // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	bool                                          bIsActive;                                         // 0x0310(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UCommonActivatableWidget>> VisibilityBoundWidgets;                   // 0x0318(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_328[0xB0];                                     // 0x0328(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetVisibilityOnActivated;                         // 0x03D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              ActivatedVisibility;                               // 0x03D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSetVisibilityOnDeactivated;                       // 0x03DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateVisibility                              DeactivatedVisibility;                             // 0x03DB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateWidget()	 // 0x4a88d7c;
	void BindVisibilityToActivation(class UCommonActivatableWidget* ActivatableWidget)	 // 0x4a89084;
	void BP_OnActivated()	 // 0xae1e64;
	void BP_OnDeactivated()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void DeactivateWidget()	 // 0x4a892c8;
	void SetBindVisibilities(ESlateVisibility OnActivatedVisibility, ESlateVisibility OnDeactivatedVisibility, bool bInAllActive)	 // 0x4a8d3d4;

	class UWidget* BP_GetDesiredFocusTarget() const	 // 0xae1e64;
	class UWidget* GetDesiredFocusTarget() const	 // 0x4a89e34;
	bool IsActivated() const	 // 0x4a8bf8c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonActivatableWidget">();
	}
	static class UCommonActivatableWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonActivatableWidget>();
	}
};
static_assert(alignof(UCommonActivatableWidget) == 0x000008, "Wrong alignment on UCommonActivatableWidget");
static_assert(sizeof(UCommonActivatableWidget) == 0x0003E0, "Wrong size on UCommonActivatableWidget");
static_assert(offsetof(UCommonActivatableWidget, bIsBackHandler) == 0x0002A8, "Member 'UCommonActivatableWidget::bIsBackHandler' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsBackActionDisplayedInActionBar) == 0x0002A9, "Member 'UCommonActivatableWidget::bIsBackActionDisplayedInActionBar' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bAutoActivate) == 0x0002AA, "Member 'UCommonActivatableWidget::bAutoActivate' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSupportsActivationFocus) == 0x0002AB, "Member 'UCommonActivatableWidget::bSupportsActivationFocus' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsModal) == 0x0002AC, "Member 'UCommonActivatableWidget::bIsModal' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bAutoRestoreFocus) == 0x0002AD, "Member 'UCommonActivatableWidget::bAutoRestoreFocus' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bOverrideActionDomain) == 0x0002AE, "Member 'UCommonActivatableWidget::bOverrideActionDomain' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, InputMapping) == 0x0002B0, "Member 'UCommonActivatableWidget::InputMapping' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, InputMappingPriority) == 0x0002B8, "Member 'UCommonActivatableWidget::InputMappingPriority' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, ActionDomainOverride) == 0x0002C0, "Member 'UCommonActivatableWidget::ActionDomainOverride' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, BP_OnWidgetActivated) == 0x0002F0, "Member 'UCommonActivatableWidget::BP_OnWidgetActivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, BP_OnWidgetDeactivated) == 0x000300, "Member 'UCommonActivatableWidget::BP_OnWidgetDeactivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bIsActive) == 0x000310, "Member 'UCommonActivatableWidget::bIsActive' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, VisibilityBoundWidgets) == 0x000318, "Member 'UCommonActivatableWidget::VisibilityBoundWidgets' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSetVisibilityOnActivated) == 0x0003D8, "Member 'UCommonActivatableWidget::bSetVisibilityOnActivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, ActivatedVisibility) == 0x0003D9, "Member 'UCommonActivatableWidget::ActivatedVisibility' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, bSetVisibilityOnDeactivated) == 0x0003DA, "Member 'UCommonActivatableWidget::bSetVisibilityOnDeactivated' has a wrong offset!");
static_assert(offsetof(UCommonActivatableWidget, DeactivatedVisibility) == 0x0003DB, "Member 'UCommonActivatableWidget::DeactivatedVisibility' has a wrong offset!");

// Class CommonUI.CommonMappingContextMetadataInterface
// 0x0000 (0x0000 - 0x0000)
class ICommonMappingContextMetadataInterface final
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonMappingContextMetadataInterface">();
	}
	static class ICommonMappingContextMetadataInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ICommonMappingContextMetadataInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICommonMappingContextMetadataInterface) == 0x000001, "Wrong alignment on ICommonMappingContextMetadataInterface");
static_assert(sizeof(ICommonMappingContextMetadataInterface) == 0x000001, "Wrong size on ICommonMappingContextMetadataInterface");

// Class CommonUI.CommonBoundActionButtonInterface
// 0x0000 (0x0000 - 0x0000)
class ICommonBoundActionButtonInterface final
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonBoundActionButtonInterface">();
	}
	static class ICommonBoundActionButtonInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ICommonBoundActionButtonInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICommonBoundActionButtonInterface) == 0x000001, "Wrong alignment on ICommonBoundActionButtonInterface");
static_assert(sizeof(ICommonBoundActionButtonInterface) == 0x000001, "Wrong size on ICommonBoundActionButtonInterface");

// Class CommonUI.CommonMappingContextMetadata
// 0x0060 (0x0090 - 0x0030)
class UCommonMappingContextMetadata final : public UDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputMetadata*                   EnhancedInputMetadata;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UInputAction*, class UCommonInputMetadata*> PerActionEnhancedInputMetadata;           // 0x0040(0x0050)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonMappingContextMetadata">();
	}
	static class UCommonMappingContextMetadata* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonMappingContextMetadata>();
	}
};
static_assert(alignof(UCommonMappingContextMetadata) == 0x000008, "Wrong alignment on UCommonMappingContextMetadata");
static_assert(sizeof(UCommonMappingContextMetadata) == 0x000090, "Wrong size on UCommonMappingContextMetadata");
static_assert(offsetof(UCommonMappingContextMetadata, EnhancedInputMetadata) == 0x000038, "Member 'UCommonMappingContextMetadata::EnhancedInputMetadata' has a wrong offset!");
static_assert(offsetof(UCommonMappingContextMetadata, PerActionEnhancedInputMetadata) == 0x000040, "Member 'UCommonMappingContextMetadata::PerActionEnhancedInputMetadata' has a wrong offset!");

// Class CommonUI.CommonVideoPlayer
// 0x0160 (0x02B0 - 0x0150)
class UCommonVideoPlayer final : public UWidget
{
public:
	class UMediaSource*                           Video;                                             // 0x0150(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0158(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0160(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterial*                              VideoMaterial;                                     // 0x0168(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0170(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            VideoBrush;                                        // 0x0180(0x00D0)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x60];                                     // 0x0250(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonVideoPlayer">();
	}
	static class UCommonVideoPlayer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonVideoPlayer>();
	}
};
static_assert(alignof(UCommonVideoPlayer) == 0x000010, "Wrong alignment on UCommonVideoPlayer");
static_assert(sizeof(UCommonVideoPlayer) == 0x0002B0, "Wrong size on UCommonVideoPlayer");
static_assert(offsetof(UCommonVideoPlayer, Video) == 0x000150, "Member 'UCommonVideoPlayer::Video' has a wrong offset!");
static_assert(offsetof(UCommonVideoPlayer, MediaPlayer) == 0x000158, "Member 'UCommonVideoPlayer::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UCommonVideoPlayer, MediaTexture) == 0x000160, "Member 'UCommonVideoPlayer::MediaTexture' has a wrong offset!");
static_assert(offsetof(UCommonVideoPlayer, VideoMaterial) == 0x000168, "Member 'UCommonVideoPlayer::VideoMaterial' has a wrong offset!");
static_assert(offsetof(UCommonVideoPlayer, SoundComponent) == 0x000170, "Member 'UCommonVideoPlayer::SoundComponent' has a wrong offset!");
static_assert(offsetof(UCommonVideoPlayer, VideoBrush) == 0x000180, "Member 'UCommonVideoPlayer::VideoBrush' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeOpacity
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeOpacity final : public UCommonStyleSheetTypeBase
{
public:
	float                                         Opacity;                                           // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeOpacity">();
	}
	static class UCommonStyleSheetTypeOpacity* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeOpacity>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeOpacity) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeOpacity");
static_assert(sizeof(UCommonStyleSheetTypeOpacity) == 0x000038, "Wrong size on UCommonStyleSheetTypeOpacity");
static_assert(offsetof(UCommonStyleSheetTypeOpacity, Opacity) == 0x000030, "Member 'UCommonStyleSheetTypeOpacity::Opacity' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeLineHeightPercentage
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeLineHeightPercentage final : public UCommonStyleSheetTypeBase
{
public:
	float                                         LineHeightPercentage;                              // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeLineHeightPercentage">();
	}
	static class UCommonStyleSheetTypeLineHeightPercentage* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeLineHeightPercentage>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeLineHeightPercentage) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeLineHeightPercentage");
static_assert(sizeof(UCommonStyleSheetTypeLineHeightPercentage) == 0x000038, "Wrong size on UCommonStyleSheetTypeLineHeightPercentage");
static_assert(offsetof(UCommonStyleSheetTypeLineHeightPercentage, LineHeightPercentage) == 0x000030, "Member 'UCommonStyleSheetTypeLineHeightPercentage::LineHeightPercentage' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeFontSize
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeFontSize final : public UCommonStyleSheetTypeBase
{
public:
	int32                                         Size;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeFontSize">();
	}
	static class UCommonStyleSheetTypeFontSize* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeFontSize>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeFontSize) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeFontSize");
static_assert(sizeof(UCommonStyleSheetTypeFontSize) == 0x000038, "Wrong size on UCommonStyleSheetTypeFontSize");
static_assert(offsetof(UCommonStyleSheetTypeFontSize, Size) == 0x000030, "Member 'UCommonStyleSheetTypeFontSize::Size' has a wrong offset!");

// Class CommonUI.CommonVisibilitySwitcherSlot
// 0x0010 (0x0068 - 0x0058)
class UCommonVisibilitySwitcherSlot final : public UOverlaySlot
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonVisibilitySwitcherSlot">();
	}
	static class UCommonVisibilitySwitcherSlot* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonVisibilitySwitcherSlot>();
	}
};
static_assert(alignof(UCommonVisibilitySwitcherSlot) == 0x000008, "Wrong alignment on UCommonVisibilitySwitcherSlot");
static_assert(sizeof(UCommonVisibilitySwitcherSlot) == 0x000068, "Wrong size on UCommonVisibilitySwitcherSlot");

// Class CommonUI.CommonStyleSheetTypeFontLetterSpacing
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeFontLetterSpacing final : public UCommonStyleSheetTypeBase
{
public:
	int32                                         LetterSpacing;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeFontLetterSpacing">();
	}
	static class UCommonStyleSheetTypeFontLetterSpacing* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeFontLetterSpacing>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeFontLetterSpacing) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeFontLetterSpacing");
static_assert(sizeof(UCommonStyleSheetTypeFontLetterSpacing) == 0x000038, "Wrong size on UCommonStyleSheetTypeFontLetterSpacing");
static_assert(offsetof(UCommonStyleSheetTypeFontLetterSpacing, LetterSpacing) == 0x000030, "Member 'UCommonStyleSheetTypeFontLetterSpacing::LetterSpacing' has a wrong offset!");

// Class CommonUI.UCommonVisibilityWidgetBase
// 0x0050 (0x0380 - 0x0330)
class UUCommonVisibilityWidgetBase final : public UCommonBorder
{
public:
	TMap<class FName, bool>                       VisibilityControls;                                // 0x0328(0x0050)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
	bool                                          bShowForGamepad;                                   // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForMouseAndKeyboard;                          // 0x0379(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForTouch;                                     // 0x037A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              VisibleType;                                       // 0x037B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              HiddenType;                                        // 0x037C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static const TArray<class FName> GetRegisteredPlatforms()	 // 0x4a8a9f8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"UCommonVisibilityWidgetBase">();
	}
	static class UUCommonVisibilityWidgetBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UUCommonVisibilityWidgetBase>();
	}
};
static_assert(alignof(UUCommonVisibilityWidgetBase) == 0x000010, "Wrong alignment on UUCommonVisibilityWidgetBase");
static_assert(sizeof(UUCommonVisibilityWidgetBase) == 0x000380, "Wrong size on UUCommonVisibilityWidgetBase");
static_assert(offsetof(UUCommonVisibilityWidgetBase, VisibilityControls) == 0x000328, "Member 'UUCommonVisibilityWidgetBase::VisibilityControls' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForGamepad) == 0x000378, "Member 'UUCommonVisibilityWidgetBase::bShowForGamepad' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForMouseAndKeyboard) == 0x000379, "Member 'UUCommonVisibilityWidgetBase::bShowForMouseAndKeyboard' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, bShowForTouch) == 0x00037A, "Member 'UUCommonVisibilityWidgetBase::bShowForTouch' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, VisibleType) == 0x00037B, "Member 'UUCommonVisibilityWidgetBase::VisibleType' has a wrong offset!");
static_assert(offsetof(UUCommonVisibilityWidgetBase, HiddenType) == 0x00037C, "Member 'UUCommonVisibilityWidgetBase::HiddenType' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeMarginLeft
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeMarginLeft final : public UCommonStyleSheetTypeBase
{
public:
	float                                         Left;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeMarginLeft">();
	}
	static class UCommonStyleSheetTypeMarginLeft* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeMarginLeft>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeMarginLeft) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeMarginLeft");
static_assert(sizeof(UCommonStyleSheetTypeMarginLeft) == 0x000038, "Wrong size on UCommonStyleSheetTypeMarginLeft");
static_assert(offsetof(UCommonStyleSheetTypeMarginLeft, Left) == 0x000030, "Member 'UCommonStyleSheetTypeMarginLeft::Left' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeMarginRight
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeMarginRight final : public UCommonStyleSheetTypeBase
{
public:
	float                                         Right;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeMarginRight">();
	}
	static class UCommonStyleSheetTypeMarginRight* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeMarginRight>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeMarginRight) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeMarginRight");
static_assert(sizeof(UCommonStyleSheetTypeMarginRight) == 0x000038, "Wrong size on UCommonStyleSheetTypeMarginRight");
static_assert(offsetof(UCommonStyleSheetTypeMarginRight, Right) == 0x000030, "Member 'UCommonStyleSheetTypeMarginRight::Right' has a wrong offset!");

// Class CommonUI.CommonVisualAttachment
// 0x0020 (0x01C0 - 0x01A0)
class UCommonVisualAttachment final : public USizeBox
{
public:
	struct FVector2D                              ContentAnchor;                                     // 0x01A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonVisualAttachment">();
	}
	static class UCommonVisualAttachment* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonVisualAttachment>();
	}
};
static_assert(alignof(UCommonVisualAttachment) == 0x000008, "Wrong alignment on UCommonVisualAttachment");
static_assert(sizeof(UCommonVisualAttachment) == 0x0001C0, "Wrong size on UCommonVisualAttachment");
static_assert(offsetof(UCommonVisualAttachment, ContentAnchor) == 0x0001A0, "Member 'UCommonVisualAttachment::ContentAnchor' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeMarginTop
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeMarginTop final : public UCommonStyleSheetTypeBase
{
public:
	float                                         Top;                                               // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeMarginTop">();
	}
	static class UCommonStyleSheetTypeMarginTop* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeMarginTop>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeMarginTop) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeMarginTop");
static_assert(sizeof(UCommonStyleSheetTypeMarginTop) == 0x000038, "Wrong size on UCommonStyleSheetTypeMarginTop");
static_assert(offsetof(UCommonStyleSheetTypeMarginTop, Top) == 0x000030, "Member 'UCommonStyleSheetTypeMarginTop::Top' has a wrong offset!");

// Class CommonUI.CommonWidgetCarousel
// 0x0048 (0x01B0 - 0x0168)
class UCommonWidgetCarousel final : public UPanelWidget
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonWidgetCarousel* CarouselWidget, int32 CurrentPageIndex)> OnCurrentPageIndexChanged; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x30];                                     // 0x0180(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginAutoScrolling(float ScrollInterval)	 // 0x4a88fc0;
	void EndAutoScrolling()	 // 0x4a89588;
	void NextPage()	 // 0x4a8c228;
	void PreviousPage()	 // 0x4a8c8e0;
	void SetActiveWidget(class UWidget* Widget)	 // 0x472b054;
	void SetActiveWidgetIndex(int32 Index_0)	 // 0x4a8d310;

	int32 GetActiveWidgetIndex() const	 // 0x4a898b4;
	class UWidget* GetWidgetAtIndex(int32 Index_0) const	 // 0x4a8b348;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonWidgetCarousel">();
	}
	static class UCommonWidgetCarousel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonWidgetCarousel>();
	}
};
static_assert(alignof(UCommonWidgetCarousel) == 0x000008, "Wrong alignment on UCommonWidgetCarousel");
static_assert(sizeof(UCommonWidgetCarousel) == 0x0001B0, "Wrong size on UCommonWidgetCarousel");
static_assert(offsetof(UCommonWidgetCarousel, ActiveWidgetIndex) == 0x000168, "Member 'UCommonWidgetCarousel::ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(UCommonWidgetCarousel, OnCurrentPageIndexChanged) == 0x000170, "Member 'UCommonWidgetCarousel::OnCurrentPageIndexChanged' has a wrong offset!");

// Class CommonUI.CommonStyleSheetTypeMarginBottom
// 0x0008 (0x0038 - 0x0030)
class UCommonStyleSheetTypeMarginBottom final : public UCommonStyleSheetTypeBase
{
public:
	float                                         Bottom;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonStyleSheetTypeMarginBottom">();
	}
	static class UCommonStyleSheetTypeMarginBottom* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonStyleSheetTypeMarginBottom>();
	}
};
static_assert(alignof(UCommonStyleSheetTypeMarginBottom) == 0x000008, "Wrong alignment on UCommonStyleSheetTypeMarginBottom");
static_assert(sizeof(UCommonStyleSheetTypeMarginBottom) == 0x000038, "Wrong size on UCommonStyleSheetTypeMarginBottom");
static_assert(offsetof(UCommonStyleSheetTypeMarginBottom, Bottom) == 0x000030, "Member 'UCommonStyleSheetTypeMarginBottom::Bottom' has a wrong offset!");

// Class CommonUI.CommonButtonGroupBase
// 0x00E8 (0x0110 - 0x0028)
class UCommonButtonGroupBase final : public UCommonWidgetGroupBase
{
public:
	TMulticastInlineDelegate<void(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex)> OnSelectedButtonBaseChanged; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex)> OnHoveredButtonBaseChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex)> OnButtonBaseClicked; // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* AssociatedButton, int32 ButtonIndex)> OnButtonBaseDoubleClicked; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSelectionCleared;                                // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x18];                                      // 0x00D8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSelectionRequired;                                // 0x00F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x1F];                                      // 0x00F1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeselectAll()	 // 0x4a893b0;
	void OnButtonBaseHovered(class UCommonButtonBase* BaseButton)	 // 0x4a8c280;
	void OnButtonBaseUnhovered(class UCommonButtonBase* BaseButton)	 // 0x4a8c344;
	void OnHandleButtonBaseClicked(class UCommonButtonBase* BaseButton)	 // 0x4a8c408;
	void OnHandleButtonBaseDoubleClicked(class UCommonButtonBase* BaseButton)	 // 0x4a8c4cc;
	void OnSelectionStateChangedBase(class UCommonButtonBase* BaseButton, bool bIsSelected)	 // 0x4a8c668;
	void SelectButtonAtIndex(int32 ButtonIndex, const bool bAllowSound)	 // 0x4a8cd68;
	void SelectNextButton(bool bAllowWrap)	 // 0x4a8cea8;
	void SelectPreviousButton(bool bAllowWrap)	 // 0x4a8cf6c;
	void SetSelectionRequired(bool bRequireSelection)	 // 0x4a9049c;

	int32 FindButtonIndex(const class UCommonButtonBase* ButtonToFind) const	 // 0x4a8959c;
	class UCommonButtonBase* GetButtonBaseAtIndex(int32 Index_0) const	 // 0x4a899e0;
	int32 GetButtonCount() const	 // 0x4a89ab0;
	int32 GetHoveredButtonIndex() const	 // 0x4a8a2a0;
	class UCommonButtonBase* GetSelectedButtonBase() const	 // 0x4a8ab4c;
	int32 GetSelectedButtonIndex() const	 // 0x4a8ab74;
	bool HasAnyButtons() const	 // 0x4a8bc48;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonButtonGroupBase">();
	}
	static class UCommonButtonGroupBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonButtonGroupBase>();
	}
};
static_assert(alignof(UCommonButtonGroupBase) == 0x000008, "Wrong alignment on UCommonButtonGroupBase");
static_assert(sizeof(UCommonButtonGroupBase) == 0x000110, "Wrong size on UCommonButtonGroupBase");
static_assert(offsetof(UCommonButtonGroupBase, OnSelectedButtonBaseChanged) == 0x000028, "Member 'UCommonButtonGroupBase::OnSelectedButtonBaseChanged' has a wrong offset!");
static_assert(offsetof(UCommonButtonGroupBase, OnHoveredButtonBaseChanged) == 0x000050, "Member 'UCommonButtonGroupBase::OnHoveredButtonBaseChanged' has a wrong offset!");
static_assert(offsetof(UCommonButtonGroupBase, OnButtonBaseClicked) == 0x000078, "Member 'UCommonButtonGroupBase::OnButtonBaseClicked' has a wrong offset!");
static_assert(offsetof(UCommonButtonGroupBase, OnButtonBaseDoubleClicked) == 0x0000A0, "Member 'UCommonButtonGroupBase::OnButtonBaseDoubleClicked' has a wrong offset!");
static_assert(offsetof(UCommonButtonGroupBase, OnSelectionCleared) == 0x0000C8, "Member 'UCommonButtonGroupBase::OnSelectionCleared' has a wrong offset!");
static_assert(offsetof(UCommonButtonGroupBase, bSelectionRequired) == 0x0000F0, "Member 'UCommonButtonGroupBase::bSelectionRequired' has a wrong offset!");

// Class CommonUI.CommonActionHandlerInterface
// 0x0000 (0x0000 - 0x0000)
class ICommonActionHandlerInterface final
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonActionHandlerInterface">();
	}
	static class ICommonActionHandlerInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ICommonActionHandlerInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ICommonActionHandlerInterface) == 0x000001, "Wrong alignment on ICommonActionHandlerInterface");
static_assert(sizeof(ICommonActionHandlerInterface) == 0x000001, "Wrong size on ICommonActionHandlerInterface");

// Class CommonUI.CommonActionWidget
// 0x0310 (0x0460 - 0x0150)
class UCommonActionWidget final : public UWidget
{
public:
	TMulticastInlineDelegate<void(bool bUsingGamepad)> OnInputMethodChanged;                         // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ProgressMaterialBrush;                             // 0x0160(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   ProgressMaterialParam;                             // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconRimBrush;                                      // 0x0240(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UInputAction*                           EnhancedInputAction;                               // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ProgressDynamicMaterial;                           // 0x0330(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x128];                                    // 0x0338(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetEnhancedInputAction(class UInputAction* InInputAction)	 // 0x4a8dfac;
	void SetIconRimBrush(const struct FSlateBrush& InIconRimBrush)	 // 0x4a8e390;
	void SetInputAction(const struct FDataTableRowHandle& InputActionRow)	 // 0x4a8e488;
	void SetInputActions(const TArray<struct FDataTableRowHandle>& NewInputActions)	 // 0x4a8e6d4;

	class FText GetDisplayText() const	 // 0x4a89f8c;
	struct FSlateBrush GetIcon() const	 // 0x4a8a2b8;
	bool IsHeldAction() const	 // 0x4a8bfbc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CommonActionWidget">();
	}
	static class UCommonActionWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCommonActionWidget>();
	}
};
static_assert(alignof(UCommonActionWidget) == 0x000010, "Wrong alignment on UCommonActionWidget");
static_assert(sizeof(UCommonActionWidget) == 0x000460, "Wrong size on UCommonActionWidget");
static_assert(offsetof(UCommonActionWidget, OnInputMethodChanged) == 0x000150, "Member 'UCommonActionWidget::OnInputMethodChanged' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressMaterialBrush) == 0x000160, "Member 'UCommonActionWidget::ProgressMaterialBrush' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressMaterialParam) == 0x000230, "Member 'UCommonActionWidget::ProgressMaterialParam' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, IconRimBrush) == 0x000240, "Member 'UCommonActionWidget::IconRimBrush' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, InputActions) == 0x000310, "Member 'UCommonActionWidget::InputActions' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, EnhancedInputAction) == 0x000320, "Member 'UCommonActionWidget::EnhancedInputAction' has a wrong offset!");
static_assert(offsetof(UCommonActionWidget, ProgressDynamicMaterial) == 0x000330, "Member 'UCommonActionWidget::ProgressDynamicMaterial' has a wrong offset!");

// Class CommonUI.CommonButtonBase
// 0x1258 (0x1500 - 0x02A8)
class UCommonButtonBase : public UCommonUserWidget
{
public:
	int32                                         MinWidth;                                          // 0x02A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MinHeight;                                         // 0x02AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>         Style;                                             // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideInputAction;                                  // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateSound                            PressedSlateSoundOverride;                         // 0x02C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateSound                            HoveredSlateSoundOverride;                         // 0x02D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateSound                            SelectedPressedSlateSoundOverride;                 // 0x02F0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateSound                            SelectedHoveredSlateSoundOverride;                 // 0x0308(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
