#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Constraints_structs.hpp"
#include "Constraints_classes.hpp"
#include "RigVM_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class ControlRig.ControlRigBlueprintGeneratedClass
// 0x0000 (0x03A0 - 0x03A0)
class UControlRigBlueprintGeneratedClass final : public URigVMBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigBlueprintGeneratedClass">();
	}
	static class UControlRigBlueprintGeneratedClass* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UControlRigBlueprintGeneratedClass>();
	}
};
static_assert(alignof(UControlRigBlueprintGeneratedClass) == 0x000010, "Wrong alignment on UControlRigBlueprintGeneratedClass");
static_assert(sizeof(UControlRigBlueprintGeneratedClass) == 0x0003A0, "Wrong size on UControlRigBlueprintGeneratedClass");

// Class ControlRig.RigHierarchy
// 0x0348 (0x0370 - 0x0028)
class alignas(0x10) URigHierarchy final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        TopologyVersion;                                   // 0x0088(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        MetadataVersion;                                   // 0x008A(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        MetadataTagVersion;                                // 0x008C(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableDirtyPropagation;                           // 0x008E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F[0x99];                                      // 0x008F(0x0099)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TransformStackIndex;                               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x74];                                     // 0x012C(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchyController*                HierarchyController;                               // 0x01A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x58];                                     // 0x01A8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FRigElementKey, struct FRigElementKey> PreviousNameMap;                              // 0x0200(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x80];                                     // 0x0250(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchy*                          HierarchyForCacheValidation;                       // 0x02D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D8[0x98];                                     // 0x02D8(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FEulerTransform GetEulerTransformFromControlValue(const struct FRigControlValue& InValue)	 // 0x4022d54;
	static float GetFloatFromControlValue(const struct FRigControlValue& InValue)	 // 0x4023148;
	static int32 GetIntFromControlValue(const struct FRigControlValue& InValue)	 // 0x40242b0;
	static struct FRotator GetRotatorFromControlValue(const struct FRigControlValue& InValue)	 // 0x4026f74;
	static struct FTransform GetTransformFromControlValue(const struct FRigControlValue& InValue)	 // 0x4027644;
	static struct FTransformNoScale GetTransformNoScaleFromControlValue(const struct FRigControlValue& InValue)	 // 0x4027a98;
	static struct FVector2D GetVector2DFromControlValue(const struct FRigControlValue& InValue)	 // 0x4027bec;
	static struct FVector GetVectorFromControlValue(const struct FRigControlValue& InValue)	 // 0x4027e70;
	static struct FRigControlValue MakeControlValueFromBool(bool InValue)	 // 0x40289e8;
	static struct FRigControlValue MakeControlValueFromEulerTransform(const struct FEulerTransform& InValue)	 // 0x4028b34;
	static struct FRigControlValue MakeControlValueFromFloat(float InValue)	 // 0x4028cb0;
	static struct FRigControlValue MakeControlValueFromInt(int32 InValue)	 // 0x4028dec;
	static struct FRigControlValue MakeControlValueFromRotator(const struct FRotator& InValue)	 // 0x4028f20;
	static struct FRigControlValue MakeControlValueFromTransform(const struct FTransform& InValue)	 // 0x4029048;
	static struct FRigControlValue MakeControlValueFromTransformNoScale(const struct FTransformNoScale& InValue)	 // 0x4029224;
	static struct FRigControlValue MakeControlValueFromVector(const struct FVector& InValue)	 // 0x40294e4;
	static struct FRigControlValue MakeControlValueFromVector2D(const struct FVector2D& InValue)	 // 0x4029380;

	void CopyHierarchy(class URigHierarchy* InHierarchy)	 // 0x40213f0;
	void CopyPose(class URigHierarchy* InHierarchy, bool bCurrent, bool bInitial, bool bWeights, bool bMatchPoseInGlobalIfNeeded)	 // 0x40214b0;
	class URigHierarchyController* GetController(bool bCreateIfNeeded)	 // 0x4022984;
	TArray<class FName> GetMetadataNames(const struct FRigElementKey& InItem)	 // 0x40250fc;
	ERigMetadataType GetMetadataType(const struct FRigElementKey& InItem, class FName InMetadataName)	 // 0x4025200;
	bool RemoveAllMetadata(const struct FRigElementKey& InItem)	 // 0x4029668;
	bool RemoveMetadata(const struct FRigElementKey& InItem, class FName InMetadataName)	 // 0x402976c;
	void Reset()	 // 0x40298ec;
	void ResetCurveValues()	 // 0x4029900;
	void ResetPoseToInitial(ERigElementType InTypeFilter)	 // 0x4029958;
	void ResetToDefault()	 // 0x4029a18;
	void SendAutoKeyEvent(const struct FRigElementKey& InElement, float InOffsetInSeconds, bool bAsynchronous)	 // 0x4029a2c;
	bool SetBoolArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<bool>& InValue)	 // 0x4029bfc;
	bool SetBoolMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, bool InValue)	 // 0x4029e74;
	void SetControlOffsetTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402a07c;
	void SetControlOffsetTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402a47c;
	void SetControlPreferredRotator(const struct FRigElementKey& InKey, const struct FRotator& InValue, bool bInitial, bool bFixEulerFlips)	 // 0x402a864;
	void SetControlPreferredRotatorByIndex(int32 InElementIndex, const struct FRotator& InValue, bool bInitial, bool bFixEulerFlips)	 // 0x402aa94;
	void SetControlSettings(const struct FRigElementKey& InKey, const struct FRigControlSettings& InSettings, bool bSetupUndo, bool bForce, bool bPrintPythonCommands)	 // 0x402aca4;
	void SetControlSettingsByIndex(int32 InElementIndex, const struct FRigControlSettings& InSettings, bool bSetupUndo, bool bForce, bool bPrintPythonCommands)	 // 0x402afe4;
	void SetControlShapeTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bSetupUndo)	 // 0x402b2e4;
	void SetControlShapeTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bSetupUndo)	 // 0x402b5ec;
	void SetControlValue(const struct FRigElementKey& InKey, const struct FRigControlValue& InValue, ERigControlValueType InValueType, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402b8d0;
	void SetControlValueByIndex(int32 InElementIndex, const struct FRigControlValue& InValue, ERigControlValueType InValueType, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402bc28;
	void SetControlVisibility(const struct FRigElementKey& InKey, bool bVisibility)	 // 0x402bf64;
	void SetControlVisibilityByIndex(int32 InElementIndex, bool bVisibility)	 // 0x402c0cc;
	void SetCurveValue(const struct FRigElementKey& InKey, float InValue, bool bSetupUndo)	 // 0x402c20c;
	void SetCurveValueByIndex(int32 InElementIndex, float InValue, bool bSetupUndo)	 // 0x402c3e0;
	bool SetFloatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<float>& InValue)	 // 0x402c5a0;
	bool SetFloatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, float InValue)	 // 0x402c7e4;
	void SetGlobalTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommand)	 // 0x402c9c8;
	void SetGlobalTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommand)	 // 0x402cdc8;
	bool SetInt32ArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<int32>& InValue)	 // 0x402d1b0;
	bool SetInt32Metadata(const struct FRigElementKey& InItem, class FName InMetadataName, int32 InValue)	 // 0x402d42c;
	bool SetLinearColorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FLinearColor>& InValue)	 // 0x402d630;
	bool SetLinearColorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FLinearColor& InValue)	 // 0x402d880;
	void SetLocalTransform(const struct FRigElementKey& InKey, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402da98;
	void SetLocalTransformByIndex(int32 InElementIndex, const struct FTransform& InTransform, bool bInitial, bool bAffectChildren, bool bSetupUndo, bool bPrintPythonCommands)	 // 0x402de98;
	bool SetNameArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<class FName>& InValue)	 // 0x402e280;
	bool SetNameMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, class FName InValue)	 // 0x402e4b0;
	bool SetParentWeight(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, const struct FRigElementWeight& InWeight, bool bInitial, bool bAffectChildren)	 // 0x402e6b8;
	bool SetParentWeightArray(const struct FRigElementKey& InChild, const TArray<struct FRigElementWeight>& InWeights, bool bInitial, bool bAffectChildren)	 // 0x402e9d4;
	void SetPose_ForBlueprint(const struct FRigPose& InPose)	 // 0x402ec88;
	bool SetQuatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FQuat>& InValue)	 // 0x402edc0;
	bool SetQuatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FQuat& InValue)	 // 0x402f000;
	bool SetRigElementKeyArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FRigElementKey>& InValue)	 // 0x402f224;
	bool SetRigElementKeyMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRigElementKey& InValue)	 // 0x402f4a0;
	bool SetRotatorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FRotator>& InValue)	 // 0x402f6c4;
	bool SetRotatorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRotator& InValue)	 // 0x402f910;
	bool SetTag(const struct FRigElementKey& InItem, class FName InTag)	 // 0x402fb38;
	bool SetTransformArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FTransform>& InValue)	 // 0x402fca4;
	bool SetTransformMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FTransform& InValue)	 // 0x402ff20;
	bool SetVectorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const TArray<struct FVector>& InValue)	 // 0x40301c8;
	bool SetVectorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FVector& InValue)	 // 0x403040c;
	bool SwitchToDefaultParent(const struct FRigElementKey& InChild, bool bInitial, bool bAffectChildren)	 // 0x40306fc;
	bool SwitchToParent(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, bool bInitial, bool bAffectChildren)	 // 0x40308e4;
	bool SwitchToWorldSpace(const struct FRigElementKey& InChild, bool bInitial, bool bAffectChildren)	 // 0x4030b5c;
	void UnsetCurveValue(const struct FRigElementKey& InKey, bool bSetupUndo)	 // 0x4030d44;
	void UnsetCurveValueByIndex(int32 InElementIndex, bool bSetupUndo)	 // 0x4030ea4;

	bool Contains_ForBlueprint(const struct FRigElementKey& InKey) const	 // 0x4021304;
	struct FRigBoneElement FindBone_ForBlueprintOnly(const struct FRigElementKey& InKey) const	 // 0x402177c;
	struct FRigControlElement FindControl_ForBlueprintOnly(const struct FRigElementKey& InKey) const	 // 0x40218bc;
	struct FRigNullElement FindNull_ForBlueprintOnly(const struct FRigElementKey& InKey) const	 // 0x40219a0;
	TArray<struct FRigElementKey> GetAllKeys_ForBlueprint(bool bTraverse) const	 // 0x4021b00;
	TArray<struct FRigElementKey> GetBoneKeys(bool bTraverse) const	 // 0x4021bec;
	TArray<bool> GetBoolArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4021cd8;
	bool GetBoolMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, bool DefaultValue) const	 // 0x4021e94;
	TArray<struct FRigElementKey> GetChildren(const struct FRigElementKey& InKey, bool bRecursive) const	 // 0x4022094;
	TArray<struct FRigElementKey> GetControlKeys(bool bTraverse) const	 // 0x402221c;
	struct FRotator GetControlPreferredRotator(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4022308;
	struct FRotator GetControlPreferredRotatorByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4022498;
	struct FRigControlValue GetControlValue(const struct FRigElementKey& InKey, ERigControlValueType InValueType) const	 // 0x40225fc;
	struct FRigControlValue GetControlValueByIndex(int32 InElementIndex, ERigControlValueType InValueType) const	 // 0x40227c4;
	TArray<struct FRigElementKey> GetCurveKeys() const	 // 0x4022a54;
	float GetCurveValue(const struct FRigElementKey& InKey) const	 // 0x4022a98;
	float GetCurveValueByIndex(int32 InElementIndex) const	 // 0x4022b8c;
	struct FRigElementKey GetDefaultParent(const struct FRigElementKey& InKey) const	 // 0x4022c5c;
	struct FRigElementKey GetFirstParent(const struct FRigElementKey& InKey) const	 // 0x4022eb0;
	TArray<float> GetFloatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4022fa8;
	float GetFloatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, float DefaultValue) const	 // 0x402321c;
	struct FTransform GetGlobalControlOffsetTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x402341c;
	struct FTransform GetGlobalControlOffsetTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x40235c8;
	struct FTransform GetGlobalControlShapeTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4023768;
	struct FTransform GetGlobalControlShapeTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4023920;
	struct FTransform GetGlobalTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4023ac0;
	struct FTransform GetGlobalTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4023c6c;
	int32 GetIndex_ForBlueprint(const struct FRigElementKey& InKey) const	 // 0x4023e0c;
	TArray<int32> GetInt32ArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4023ef4;
	int32 GetInt32Metadata(const struct FRigElementKey& InItem, class FName InMetadataName, int32 DefaultValue) const	 // 0x40240b4;
	struct FRigElementKey GetKey(int32 InElementIndex) const	 // 0x4024380;
	TArray<struct FRigElementKey> GetKeys(const TArray<int32>& InElementIndices) const	 // 0x4024460;
	TArray<struct FLinearColor> GetLinearColorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x40245a4;
	struct FLinearColor GetLinearColorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FLinearColor& DefaultValue) const	 // 0x4024750;
	struct FTransform GetLocalControlShapeTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4024964;
	struct FTransform GetLocalControlShapeTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4024b1c;
	int32 GetLocalIndex_ForBlueprint(const struct FRigElementKey& InKey) const	 // 0x4024cbc;
	struct FTransform GetLocalTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4024db0;
	struct FTransform GetLocalTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4024f5c;
	TArray<class FName> GetNameArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x40253a4;
	class FName GetNameMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, class FName DefaultValue) const	 // 0x402552c;
	TArray<struct FRigElementKey> GetNullKeys(bool bTraverse) const	 // 0x402572c;
	int32 GetNumberOfParents(const struct FRigElementKey& InKey) const	 // 0x4025818;
	TArray<struct FRigElementKey> GetParents(const struct FRigElementKey& InKey, bool bRecursive) const	 // 0x4026004;
	struct FTransform GetParentTransform(const struct FRigElementKey& InKey, bool bInitial) const	 // 0x4025908;
	struct FTransform GetParentTransformByIndex(int32 InElementIndex, bool bInitial) const	 // 0x4025ac0;
	struct FRigElementWeight GetParentWeight(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent, bool bInitial) const	 // 0x4025c5c;
	TArray<struct FRigElementWeight> GetParentWeightArray(const struct FRigElementKey& InChild, bool bInitial) const	 // 0x4025e80;
	struct FRigPose GetPose(bool bInitial) const	 // 0x402618c;
	class FName GetPreviousName(const struct FRigElementKey& InKey) const	 // 0x4026290;
	struct FRigElementKey GetPreviousParent(const struct FRigElementKey& InKey) const	 // 0x4026338;
	TArray<struct FQuat> GetQuatArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x40263e8;
	struct FQuat GetQuatMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FQuat& DefaultValue) const	 // 0x4026578;
	TArray<struct FRigElementKey> GetReferenceKeys(bool bTraverse) const	 // 0x40267a0;
	TArray<struct FRigElementKey> GetRigElementKeyArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x402688c;
	struct FRigElementKey GetRigElementKeyMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRigElementKey& DefaultValue) const	 // 0x4026a4c;
	TArray<struct FRigElementKey> GetRigidBodyKeys(bool bTraverse) const	 // 0x4026c7c;
	TArray<struct FRigElementKey> GetRootElementKeys() const	 // 0x4026d68;
	TArray<struct FRotator> GetRotatorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4026dcc;
	struct FRotator GetRotatorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FRotator& DefaultValue) const	 // 0x4027070;
	TArray<struct FRigElementKey> GetSelectedKeys(ERigElementType InTypeFilter) const	 // 0x402729c;
	TArray<class FName> GetTags(const struct FRigElementKey& InItem) const	 // 0x4027380;
	TArray<struct FTransform> GetTransformArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4027484;
	struct FTransform GetTransformMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FTransform& DefaultValue) const	 // 0x40277c8;
	TArray<struct FVector> GetVectorArrayMetadata(const struct FRigElementKey& InItem, class FName InMetadataName) const	 // 0x4027cd0;
	struct FVector GetVectorMetadata(const struct FRigElementKey& InItem, class FName InMetadataName, const struct FVector& DefaultValue) const	 // 0x4027f6c;
	bool HasTag(const struct FRigElementKey& InItem, class FName InTag) const	 // 0x4028198;
	bool IsControllerAvailable() const	 // 0x4028328;
	bool IsCurveValueSet(const struct FRigElementKey& InKey) const	 // 0x4028340;
	bool IsCurveValueSetByIndex(int32 InElementIndex) const	 // 0x4028434;
	bool IsParentedTo(const struct FRigElementKey& InChild, const struct FRigElementKey& InParent) const	 // 0x4028500;
	bool IsProcedural(const struct FRigElementKey& InKey) const	 // 0x4028680;
	bool IsSelected(const struct FRigElementKey& InKey) const	 // 0x402872c;
	bool IsSelectedByIndex(int32 InIndex) const	 // 0x4028820;
	bool IsValidIndex(int32 InElementIndex) const	 // 0x4028910;
	int32 Num() const	 // 0x4029650;
	TArray<struct FRigElementKey> SortKeys(const TArray<struct FRigElementKey>& InKeys) const	 // 0x4030634;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigHierarchy">();
	}
	static class URigHierarchy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URigHierarchy>();
	}
};
static_assert(alignof(URigHierarchy) == 0x000010, "Wrong alignment on URigHierarchy");
static_assert(sizeof(URigHierarchy) == 0x000370, "Wrong size on URigHierarchy");
static_assert(offsetof(URigHierarchy, TopologyVersion) == 0x000088, "Member 'URigHierarchy::TopologyVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, MetadataVersion) == 0x00008A, "Member 'URigHierarchy::MetadataVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, MetadataTagVersion) == 0x00008C, "Member 'URigHierarchy::MetadataTagVersion' has a wrong offset!");
static_assert(offsetof(URigHierarchy, bEnableDirtyPropagation) == 0x00008E, "Member 'URigHierarchy::bEnableDirtyPropagation' has a wrong offset!");
static_assert(offsetof(URigHierarchy, TransformStackIndex) == 0x000128, "Member 'URigHierarchy::TransformStackIndex' has a wrong offset!");
static_assert(offsetof(URigHierarchy, HierarchyController) == 0x0001A0, "Member 'URigHierarchy::HierarchyController' has a wrong offset!");
static_assert(offsetof(URigHierarchy, PreviousNameMap) == 0x000200, "Member 'URigHierarchy::PreviousNameMap' has a wrong offset!");
static_assert(offsetof(URigHierarchy, HierarchyForCacheValidation) == 0x0002D0, "Member 'URigHierarchy::HierarchyForCacheValidation' has a wrong offset!");

// Class ControlRig.ControlRigShapeActor
// 0x0048 (0x02F8 - 0x02B0)
class AControlRigShapeActor final : public AActor
{
public:
	class USceneComponent*                        ActorRootComponent;                                // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ControlRigIndex;                                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UControlRig>             ControlRig;                                        // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControlName;                                       // 0x02CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ShapeName;                                         // 0x02D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ColorParameterName;                                // 0x02DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x10];                                     // 0x02E4(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bSelected : 1;                                     // 0x02F4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHovered : 1;                                      // 0x02F4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnabledChanged(bool bIsEnabled)	 // 0xae1e64;
	void OnHoveredChanged(bool bIsSelected)	 // 0xae1e64;
	void OnManipulatingChanged(bool bIsManipulating)	 // 0xae1e64;
	void OnSelectionChanged(bool bIsSelected)	 // 0xae1e64;
	void OnTransformChanged(const struct FTransform& NewTransform)	 // 0xae1e64;
	void SetEnabled(bool bInEnabled)	 // 0x4061c8c;
	void SetGlobalTransform(const struct FTransform& InTransform)	 // 0x4061d54;
	void SetHovered(bool bInHovered)	 // 0x4061e64;
	void SetSelectable(bool bInSelectable)	 // 0x4062850;
	void SetSelected(bool bInSelected)	 // 0x4062918;

	struct FTransform GetGlobalTransform() const	 // 0x405f65c;
	bool IsEnabled() const	 // 0x405fe48;
	bool IsHovered() const	 // 0x405fe70;
	bool IsSelectedInEditor() const	 // 0x405fee0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigShapeActor">();
	}
	static class AControlRigShapeActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AControlRigShapeActor>();
	}
};
static_assert(alignof(AControlRigShapeActor) == 0x000008, "Wrong alignment on AControlRigShapeActor");
static_assert(sizeof(AControlRigShapeActor) == 0x0002F8, "Wrong size on AControlRigShapeActor");
static_assert(offsetof(AControlRigShapeActor, ActorRootComponent) == 0x0002B0, "Member 'AControlRigShapeActor::ActorRootComponent' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, StaticMeshComponent) == 0x0002B8, "Member 'AControlRigShapeActor::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlRigIndex) == 0x0002C0, "Member 'AControlRigShapeActor::ControlRigIndex' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlRig) == 0x0002C4, "Member 'AControlRigShapeActor::ControlRig' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ControlName) == 0x0002CC, "Member 'AControlRigShapeActor::ControlName' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ShapeName) == 0x0002D4, "Member 'AControlRigShapeActor::ShapeName' has a wrong offset!");
static_assert(offsetof(AControlRigShapeActor, ColorParameterName) == 0x0002DC, "Member 'AControlRigShapeActor::ColorParameterName' has a wrong offset!");

// Class ControlRig.ControlRigAnimInstance
// 0x0000 (0x0350 - 0x0350)
class UControlRigAnimInstance final : public UAnimInstance
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigAnimInstance">();
	}
	static class UControlRigAnimInstance* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UControlRigAnimInstance>();
	}
};
static_assert(alignof(UControlRigAnimInstance) == 0x000010, "Wrong alignment on UControlRigAnimInstance");
static_assert(sizeof(UControlRigAnimInstance) == 0x000350, "Wrong size on UControlRigAnimInstance");

// Class ControlRig.TransformableControlHandle
// 0x0038 (0x0090 - 0x0058)
class UTransformableControlHandle final : public UTransformableHandle
{
public:
	TSoftObjectPtr<class UControlRig>             ControlRig;                                        // 0x0058(0x0030)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ControlName;                                       // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"TransformableControlHandle">();
	}
	static class UTransformableControlHandle* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UTransformableControlHandle>();
	}
};
static_assert(alignof(UTransformableControlHandle) == 0x000008, "Wrong alignment on UTransformableControlHandle");
static_assert(sizeof(UTransformableControlHandle) == 0x000090, "Wrong size on UTransformableControlHandle");
static_assert(offsetof(UTransformableControlHandle, ControlRig) == 0x000058, "Member 'UTransformableControlHandle::ControlRig' has a wrong offset!");
static_assert(offsetof(UTransformableControlHandle, ControlName) == 0x000088, "Member 'UTransformableControlHandle::ControlName' has a wrong offset!");

// Class ControlRig.ControlRig
// 0x0278 (0x03F8 - 0x0180)
class UControlRig : public URigVMHost
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ERigExecutionType                             ExecutionType;                                     // 0x0188(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigHierarchySettings                  HierarchySettings;                                 // 0x018C(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	TMap<struct FRigElementKey, struct FRigControlElementCustomization> ControlCustomizations;       // 0x0190(0x0050)(Protected, NativeAccessSpecifierProtected)
	class URigHierarchy*                          DynamicHierarchy;                                  // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UControlRigShapeLibrary>> ShapeLibraries;                            // 0x01E8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F8[0x18];                                     // 0x01F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationDataSourceRegistry*           DataSourceRegistry;                                // 0x0210(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x90];                                     // 0x0218(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigInfluenceMapPerEvent               Influences;                                        // 0x02A8(0x0060)(NativeAccessSpecifierPrivate)
	class UControlRig*                            InteractionRig;                                    // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UControlRig>                InteractionRigClass;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0xC0];                                     // 0x0318(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastSparseDelegateProperty_             OnControlSelected_BP;                              // 0x03D8(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D9[0x1F];                                     // 0x03D9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class UControlRig*> FindControlRigs(class UObject* Outer_0, TSubclassOf<class UControlRig> OptionalClass)	 // 0x405e4c8;

	bool ClearControlSelection()	 // 0x405e010;
	class URigHierarchy* GetHierarchy()	 // 0x405f718;
	void RequestConstruction()	 // 0x406062c;
	void SelectControl(const class FName& InControlName, bool bSelect)	 // 0x4060654;
	void SetInteractionRig(class UControlRig* InInteractionRig)	 // 0x40624f4;
	void SetInteractionRigClass(TSubclassOf<class UControlRig> InInteractionRigClass)	 // 0x40625b4;

	class UTransformableControlHandle* CreateTransformableControlHandle(class UObject* Outer_0, const class FName& ControlName) const	 // 0x405e1f0;
	TArray<class FName> CurrentControlSelection() const	 // 0x405e30c;
	class AActor* GetHostingActor() const	 // 0x405f730;
	class UControlRig* GetInteractionRig() const	 // 0x405faa8;
	TSubclassOf<class UControlRig> GetInteractionRigClass() const	 // 0x405fac0;
	bool IsControlSelected(const class FName& InControlName) const	 // 0x405fda8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRig">();
	}
	static class UControlRig* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UControlRig>();
	}
};
static_assert(alignof(UControlRig) == 0x000008, "Wrong alignment on UControlRig");
static_assert(sizeof(UControlRig) == 0x0003F8, "Wrong size on UControlRig");
static_assert(offsetof(UControlRig, ExecutionType) == 0x000188, "Member 'UControlRig::ExecutionType' has a wrong offset!");
static_assert(offsetof(UControlRig, HierarchySettings) == 0x00018C, "Member 'UControlRig::HierarchySettings' has a wrong offset!");
static_assert(offsetof(UControlRig, ControlCustomizations) == 0x000190, "Member 'UControlRig::ControlCustomizations' has a wrong offset!");
static_assert(offsetof(UControlRig, DynamicHierarchy) == 0x0001E0, "Member 'UControlRig::DynamicHierarchy' has a wrong offset!");
static_assert(offsetof(UControlRig, ShapeLibraries) == 0x0001E8, "Member 'UControlRig::ShapeLibraries' has a wrong offset!");
static_assert(offsetof(UControlRig, DataSourceRegistry) == 0x000210, "Member 'UControlRig::DataSourceRegistry' has a wrong offset!");
static_assert(offsetof(UControlRig, Influences) == 0x0002A8, "Member 'UControlRig::Influences' has a wrong offset!");
static_assert(offsetof(UControlRig, InteractionRig) == 0x000308, "Member 'UControlRig::InteractionRig' has a wrong offset!");
static_assert(offsetof(UControlRig, InteractionRigClass) == 0x000310, "Member 'UControlRig::InteractionRigClass' has a wrong offset!");
static_assert(offsetof(UControlRig, OnControlSelected_BP) == 0x0003D8, "Member 'UControlRig::OnControlSelected_BP' has a wrong offset!");

// Class ControlRig.ControlRigComponent
// 0x0160 (0x0710 - 0x05B0)
class UControlRigComponent final : public UPrimitiveComponent
{
public:
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPreInitializeDelegate;   // 0x05B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPostInitializeDelegate;  // 0x05C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPreConstructionDelegate; // 0x05D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPostConstructionDelegate; // 0x05E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPreForwardsSolveDelegate; // 0x05F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UControlRigComponent* Component)> OnPostForwardsSolveDelegate; // 0x0600(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FControlRigComponentMappedElement> UserDefinedElements;                            // 0x0610(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FControlRigComponentMappedElement> MappedElements;                                 // 0x0620(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bEnableLazyEvaluation;                             // 0x0630(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LazyEvaluationPositionThreshold;                   // 0x0634(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LazyEvaluationRotationThreshold;                   // 0x0638(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LazyEvaluationScaleThreshold;                      // 0x063C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetTransformBeforeTick;                         // 0x0640(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetInitialsBeforeConstruction;                  // 0x0641(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateRigOnTick;                                  // 0x0642(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateInEditor;                                   // 0x0643(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawBones;                                        // 0x0644(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugDrawing;                                 // 0x0645(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_646[0x2];                                      // 0x0646(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UControlRig*                            ControlRig;                                        // 0x0648(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_650[0xC0];                                     // 0x0650(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddMappedCompleteSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent)	 // 0x405dacc;
	void AddMappedComponents(const TArray<struct FControlRigComponentMappedComponent>& Components)	 // 0x405dbb0;
	void AddMappedElements(const TArray<struct FControlRigComponentMappedElement>& NewMappedElements)	 // 0x405dccc;
	void AddMappedSkeletalMesh(class USkeletalMeshComponent* SkeletalMeshComponent, const TArray<struct FControlRigComponentMappedBone>& Bones, const TArray<struct FControlRigComponentMappedCurve>& Curves)	 // 0x405ddb4;
	bool CanExecute()	 // 0x405dfd8;
	void ClearMappedElements()	 // 0x405e038;
	bool DoesElementExist(class FName Name_0, ERigElementType ElementType)	 // 0x405e350;
	struct FTransform GetBoneTransform(class FName BoneName, EControlRigComponentSpace Space)	 // 0x405e67c;
	bool GetControlBool(class FName ControlName)	 // 0x405e81c;
	float GetControlFloat(class FName ControlName)	 // 0x405e94c;
	int32 GetControlInt(class FName ControlName)	 // 0x405ea1c;
	struct FTransform GetControlOffset(class FName ControlName, EControlRigComponentSpace Space)	 // 0x405eb48;
	struct FVector GetControlPosition(class FName ControlName, EControlRigComponentSpace Space)	 // 0x405ece8;
	class UControlRig* GetControlRig()	 // 0x405ee64;
	struct FRotator GetControlRotator(class FName ControlName, EControlRigComponentSpace Space)	 // 0x405ee88;
	struct FVector GetControlScale(class FName ControlName, EControlRigComponentSpace Space)	 // 0x405f02c;
	struct FTransform GetControlTransform(class FName ControlName, EControlRigComponentSpace Space)	 // 0x405f1a8;
	struct FVector2D GetControlVector2D(class FName ControlName)	 // 0x405f348;
	TArray<class FName> GetElementNames(ERigElementType ElementType)	 // 0x405f420;
	struct FTransform GetInitialBoneTransform(class FName BoneName, EControlRigComponentSpace Space)	 // 0x405f768;
	struct FTransform GetInitialSpaceTransform(class FName SpaceName, EControlRigComponentSpace Space)	 // 0x405f908;
	struct FTransform GetSpaceTransform(class FName SpaceName, EControlRigComponentSpace Space)	 // 0x405fb18;
	void Initialize()	 // 0x405fd94;
	void OnPostConstruction(class UControlRigComponent* Component)	 // 0x405ff08;
	void OnPostForwardsSolve(class UControlRigComponent* Component)	 // 0x405ffcc;
	void OnPostInitialize(class UControlRigComponent* Component)	 // 0x4060090;
	void OnPreConstruction(class UControlRigComponent* Component)	 // 0x4060154;
	void OnPreForwardsSolve(class UControlRigComponent* Component)	 // 0x4060218;
	void OnPreInitialize(class UControlRigComponent* Component)	 // 0x40602dc;
	void SetBoneInitialTransformsFromSkeletalMesh(class USkeletalMesh* InSkeletalMesh)	 // 0x406076c;
	void SetBoneTransform(class FName BoneName, const struct FTransform& Transform, EControlRigComponentSpace Space, float Weight, bool bPropagateToChildren)	 // 0x4060848;
	void SetControlBool(class FName ControlName, bool Value)	 // 0x4060bac;
	void SetControlFloat(class FName ControlName, float Value)	 // 0x4060d3c;
	void SetControlInt(class FName ControlName, int32 Value)	 // 0x4060e7c;
	void SetControlOffset(class FName ControlName, const struct FTransform& OffsetTransform, EControlRigComponentSpace Space)	 // 0x4061008;
	void SetControlPosition(class FName ControlName, const struct FVector& Value, EControlRigComponentSpace Space)	 // 0x4061268;
	void SetControlRigClass(TSubclassOf<class UControlRig> InControlRigClass)	 // 0x4061434;
	void SetControlRotator(class FName ControlName, const struct FRotator& Value, EControlRigComponentSpace Space)	 // 0x40614fc;
	void SetControlScale(class FName ControlName, const struct FVector& Value, EControlRigComponentSpace Space)	 // 0x40616c8;
	void SetControlTransform(class FName ControlName, const struct FTransform& Value, EControlRigComponentSpace Space)	 // 0x4061894;
	void SetControlVector2D(class FName ControlName, const struct FVector2D& Value)	 // 0x4061af4;
	void SetInitialBoneTransform(class FName BoneName, const struct FTransform& InitialTransform, EControlRigComponentSpace Space, bool bPropagateToChildren)	 // 0x4061f2c;
	void SetInitialSpaceTransform(class FName SpaceName, const struct FTransform& InitialTransform, EControlRigComponentSpace Space)	 // 0x4062210;
	void SetMappedElements(const TArray<struct FControlRigComponentMappedElement>& NewMappedElements)	 // 0x4062674;
	void SetObjectBinding(class UObject* InObjectToBind)	 // 0x4062790;
	void Update(float DeltaTime)	 // 0x4062cbc;

	float GetAbsoluteTime() const	 // 0x405e650;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigComponent">();
	}
	static class UControlRigComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UControlRigComponent>();
	}
};
static_assert(alignof(UControlRigComponent) == 0x000010, "Wrong alignment on UControlRigComponent");
static_assert(sizeof(UControlRigComponent) == 0x000710, "Wrong size on UControlRigComponent");
static_assert(offsetof(UControlRigComponent, ControlRigClass) == 0x0005A8, "Member 'UControlRigComponent::ControlRigClass' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreInitializeDelegate) == 0x0005B0, "Member 'UControlRigComponent::OnPreInitializeDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostInitializeDelegate) == 0x0005C0, "Member 'UControlRigComponent::OnPostInitializeDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreConstructionDelegate) == 0x0005D0, "Member 'UControlRigComponent::OnPreConstructionDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostConstructionDelegate) == 0x0005E0, "Member 'UControlRigComponent::OnPostConstructionDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPreForwardsSolveDelegate) == 0x0005F0, "Member 'UControlRigComponent::OnPreForwardsSolveDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, OnPostForwardsSolveDelegate) == 0x000600, "Member 'UControlRigComponent::OnPostForwardsSolveDelegate' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, UserDefinedElements) == 0x000610, "Member 'UControlRigComponent::UserDefinedElements' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, MappedElements) == 0x000620, "Member 'UControlRigComponent::MappedElements' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bEnableLazyEvaluation) == 0x000630, "Member 'UControlRigComponent::bEnableLazyEvaluation' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationPositionThreshold) == 0x000634, "Member 'UControlRigComponent::LazyEvaluationPositionThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationRotationThreshold) == 0x000638, "Member 'UControlRigComponent::LazyEvaluationRotationThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, LazyEvaluationScaleThreshold) == 0x00063C, "Member 'UControlRigComponent::LazyEvaluationScaleThreshold' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bResetTransformBeforeTick) == 0x000640, "Member 'UControlRigComponent::bResetTransformBeforeTick' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bResetInitialsBeforeConstruction) == 0x000641, "Member 'UControlRigComponent::bResetInitialsBeforeConstruction' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bUpdateRigOnTick) == 0x000642, "Member 'UControlRigComponent::bUpdateRigOnTick' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bUpdateInEditor) == 0x000643, "Member 'UControlRigComponent::bUpdateInEditor' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bDrawBones) == 0x000644, "Member 'UControlRigComponent::bDrawBones' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, bShowDebugDrawing) == 0x000645, "Member 'UControlRigComponent::bShowDebugDrawing' has a wrong offset!");
static_assert(offsetof(UControlRigComponent, ControlRig) == 0x000648, "Member 'UControlRigComponent::ControlRig' has a wrong offset!");

// Class ControlRig.ControlRigControlActor
// 0x00B8 (0x0368 - 0x02B0)
class AControlRigControlActor final : public AActor
{
public:
	class AActor*                                 ActorToTrack;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControlRig>                ControlRigClass;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefreshOnTick;                                    // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelectable;                                     // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MaterialOverride;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ColorParameter;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadows;                                      // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ActorRootComponent;                                // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UControlRig>             ControlRig;                                        // 0x02F0(0x0030)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           ControlNames;                                      // 0x0320(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     ShapeTransforms;                                   // 0x0330(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           Components;                                        // 0x0340(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMaterialInstanceDynamic*>       Materials;                                         // 0x0350(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class FName                                   ColorParameterName;                                // 0x0360(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void Clear()	 // 0x405dffc;
	void Refresh()	 // 0x4060604;
	void ResetControlActor()	 // 0x4060640;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigControlActor">();
	}
	static class AControlRigControlActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AControlRigControlActor>();
	}
};
static_assert(alignof(AControlRigControlActor) == 0x000008, "Wrong alignment on AControlRigControlActor");
static_assert(sizeof(AControlRigControlActor) == 0x000368, "Wrong size on AControlRigControlActor");
static_assert(offsetof(AControlRigControlActor, ActorToTrack) == 0x0002B0, "Member 'AControlRigControlActor::ActorToTrack' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlRigClass) == 0x0002B8, "Member 'AControlRigControlActor::ControlRigClass' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bRefreshOnTick) == 0x0002C0, "Member 'AControlRigControlActor::bRefreshOnTick' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bIsSelectable) == 0x0002C1, "Member 'AControlRigControlActor::bIsSelectable' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, MaterialOverride) == 0x0002C8, "Member 'AControlRigControlActor::MaterialOverride' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ColorParameter) == 0x0002D0, "Member 'AControlRigControlActor::ColorParameter' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, bCastShadows) == 0x0002E0, "Member 'AControlRigControlActor::bCastShadows' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ActorRootComponent) == 0x0002E8, "Member 'AControlRigControlActor::ActorRootComponent' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlRig) == 0x0002F0, "Member 'AControlRigControlActor::ControlRig' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ControlNames) == 0x000320, "Member 'AControlRigControlActor::ControlNames' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ShapeTransforms) == 0x000330, "Member 'AControlRigControlActor::ShapeTransforms' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, Components) == 0x000340, "Member 'AControlRigControlActor::Components' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, Materials) == 0x000350, "Member 'AControlRigControlActor::Materials' has a wrong offset!");
static_assert(offsetof(AControlRigControlActor, ColorParameterName) == 0x000360, "Member 'AControlRigControlActor::ColorParameterName' has a wrong offset!");

// Class ControlRig.ControlRigShapeLibrary
// 0x0148 (0x0170 - 0x0028)
class UControlRigShapeLibrary final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigShapeDefinition             DefaultShape;                                      // 0x0030(0x00B0)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               DefaultMaterial;                                   // 0x00E0(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               XRayMaterial;                                      // 0x0110(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialColorParameter;                            // 0x0140(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FControlRigShapeDefinition>     Shapes;                                            // 0x0148(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x18];                                     // 0x0158(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ControlRigShapeLibrary">();
	}
	static class UControlRigShapeLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UControlRigShapeLibrary>();
	}
};
static_assert(alignof(UControlRigShapeLibrary) == 0x000010, "Wrong alignment on UControlRigShapeLibrary");
static_assert(sizeof(UControlRigShapeLibrary) == 0x000170, "Wrong size on UControlRigShapeLibrary");
static_assert(offsetof(UControlRigShapeLibrary, DefaultShape) == 0x000030, "Member 'UControlRigShapeLibrary::DefaultShape' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, DefaultMaterial) == 0x0000E0, "Member 'UControlRigShapeLibrary::DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, XRayMaterial) == 0x000110, "Member 'UControlRigShapeLibrary::XRayMaterial' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, MaterialColorParameter) == 0x000140, "Member 'UControlRigShapeLibrary::MaterialColorParameter' has a wrong offset!");
static_assert(offsetof(UControlRigShapeLibrary, Shapes) == 0x000148, "Member 'UControlRigShapeLibrary::Shapes' has a wrong offset!");

// Class ControlRig.ControlRigTestData
// 0x0128 (0x0150 - 0x0028)
class UControlRigTestData final : public UObject
{
public:
	struct FSoftObjectPath                        ControlRigObjectPath;                              // 0x0028(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FControlRigTestDataFrame               Initial;                                           // 0x0048(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FControlRigTestDataFrame>       InputFrames;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FControlRigTestDataFrame>       OutputFrames;                                      // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int32>                                 FramesToSkip;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        Tolerance;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x40];                                     // 0x0110(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UControlRigTestData* CreateNewAsset(const class FString& InDesiredPackagePath, const class FString& InBlueprintPathName)	 // 0x405e04c;

	bool Record(class UControlRig* InControlRig, double InRecordingDuration)	 // 0x40603a0;
	void ReleaseReplay()	 // 0x4060618;
	bool SetupReplay(class UControlRig* InControlRig, bool bGroundTruth)	 // 0x40629e0;

	int32 GetFrameIndexForTime(double InSeconds, bool bInput) const	 // 0x405f504;
