#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContractScriptAddItemCharacter

#include "Basic.hpp"


namespace SDK::Params
{

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.ExecuteUbergraph_ContractScriptAddItemCharacter
// 0x0060 (0x0060 - 0x0000)
struct ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWorld*                           K2Node_Event_InWorld_1;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServerNetMode_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWorld*                           K2Node_Event_InWorld_2;                            // 0x0018(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       CallFunc_GetRandomCharacter_OutCharacter;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServerNetMode_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Item*                                CallFunc_AddItemDataActor_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideoutWorld_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2MapMarkerActor*                      CallFunc_CreateMapMarker_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWorld*                           K2Node_Event_InWorld;                              // 0x0058(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter");
static_assert(sizeof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter) == 0x000060, "Wrong size on ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, EntryPoint) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, K2Node_Event_InWorld_1) == 0x000008, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::K2Node_Event_InWorld_1' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000010, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsServerNetMode_ReturnValue) == 0x000011, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsServerNetMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, K2Node_Event_InWorld_2) == 0x000018, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::K2Node_Event_InWorld_2' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsValidClass_ReturnValue) == 0x000020, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_GetRandomCharacter_OutCharacter) == 0x000028, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_GetRandomCharacter_OutCharacter' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsServerNetMode_ReturnValue_1) == 0x000030, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsServerNetMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_AddItemDataActor_ReturnValue) == 0x000038, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_AddItemDataActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsHideoutWorld_ReturnValue) == 0x000040, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsHideoutWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_CreateMapMarker_ReturnValue) == 0x000048, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_CreateMapMarker_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_BooleanAND_ReturnValue_1) == 0x000052, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_IsValid_ReturnValue_2) == 0x000053, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, CallFunc_BooleanAND_ReturnValue_2) == 0x000054, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter, K2Node_Event_InWorld) == 0x000058, "Member 'ContractScriptAddItemCharacter_C_ExecuteUbergraph_ContractScriptAddItemCharacter::K2Node_Event_InWorld' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.BP_Reset
// 0x0008 (0x0008 - 0x0000)
struct ContractScriptAddItemCharacter_C_BP_Reset final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_BP_Reset) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_BP_Reset");
static_assert(sizeof(ContractScriptAddItemCharacter_C_BP_Reset) == 0x000008, "Wrong size on ContractScriptAddItemCharacter_C_BP_Reset");
static_assert(offsetof(ContractScriptAddItemCharacter_C_BP_Reset, InWorld) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_BP_Reset::InWorld' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.BP_Completed
// 0x0008 (0x0008 - 0x0000)
struct ContractScriptAddItemCharacter_C_BP_Completed final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_BP_Completed) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_BP_Completed");
static_assert(sizeof(ContractScriptAddItemCharacter_C_BP_Completed) == 0x000008, "Wrong size on ContractScriptAddItemCharacter_C_BP_Completed");
static_assert(offsetof(ContractScriptAddItemCharacter_C_BP_Completed, InWorld) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_BP_Completed::InWorld' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.BP_Activated
// 0x0008 (0x0008 - 0x0000)
struct ContractScriptAddItemCharacter_C_BP_Activated final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_BP_Activated) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_BP_Activated");
static_assert(sizeof(ContractScriptAddItemCharacter_C_BP_Activated) == 0x000008, "Wrong size on ContractScriptAddItemCharacter_C_BP_Activated");
static_assert(offsetof(ContractScriptAddItemCharacter_C_BP_Activated, InWorld) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_BP_Activated::InWorld' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.MeetRequirementContractInProgress
// 0x0020 (0x0020 - 0x0000)
struct ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress final
{
public:
	const class UWorld*                           InWorld;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       CallFunc_GetRandomCharacter_OutCharacter;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress");
static_assert(sizeof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress) == 0x000020, "Wrong size on ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress");
static_assert(offsetof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress, InWorld) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress::InWorld' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress, ReturnValue) == 0x000008, "Member 'ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress::ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress, CallFunc_GetRandomCharacter_OutCharacter) == 0x000010, "Member 'ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress::CallFunc_GetRandomCharacter_OutCharacter' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ContractScriptAddItemCharacter_C_MeetRequirementContractInProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.IsServerOnly
// 0x0001 (0x0001 - 0x0000)
struct ContractScriptAddItemCharacter_C_IsServerOnly final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_IsServerOnly) == 0x000001, "Wrong alignment on ContractScriptAddItemCharacter_C_IsServerOnly");
static_assert(sizeof(ContractScriptAddItemCharacter_C_IsServerOnly) == 0x000001, "Wrong size on ContractScriptAddItemCharacter_C_IsServerOnly");
static_assert(offsetof(ContractScriptAddItemCharacter_C_IsServerOnly, ReturnValue) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_IsServerOnly::ReturnValue' has a wrong offset!");

// Function ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C.GetRandomCharacter
// 0x0078 (0x0078 - 0x0000)
struct ContractScriptAddItemCharacter_C_GetRandomCharacter final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       OutCharacter;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AP2BaseCharacter*>               TempListCharacter;                                 // 0x0010(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       CallFunc_Array_Random_OutItem;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2BaseCharacter*>               CallFunc_FindCharacterByTag_OutCharacters;         // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UP2EquipmentManagerComponent*     CallFunc_GetPawnEquipment_ReturnValue;             // 0x0068(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasSpaceForData_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ContractScriptAddItemCharacter_C_GetRandomCharacter) == 0x000008, "Wrong alignment on ContractScriptAddItemCharacter_C_GetRandomCharacter");
static_assert(sizeof(ContractScriptAddItemCharacter_C_GetRandomCharacter) == 0x000078, "Wrong size on ContractScriptAddItemCharacter_C_GetRandomCharacter");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, InWorldContext) == 0x000000, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::InWorldContext' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, OutCharacter) == 0x000008, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::OutCharacter' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, TempListCharacter) == 0x000010, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::TempListCharacter' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Array_Random_OutItem) == 0x000030, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Array_Random_OutIndex) == 0x000038, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_FindCharacterByTag_OutCharacters) == 0x000040, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_FindCharacterByTag_OutCharacters' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Array_Get_Item) == 0x000058, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_GetPawnEquipment_ReturnValue) == 0x000068, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_GetPawnEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(ContractScriptAddItemCharacter_C_GetRandomCharacter, CallFunc_HasSpaceForData_ReturnValue) == 0x000070, "Member 'ContractScriptAddItemCharacter_C_GetRandomCharacter::CallFunc_HasSpaceForData_ReturnValue' has a wrong offset!");

}

