#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContractScriptAddItemCharacter

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ContractScriptAddItemCharacter.ContractScriptAddItemCharacter_C
// 0x0030 (0x0078 - 0x0048)
class UContractScriptAddItemCharacter_C final : public UP2ContractScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           CharacterTag;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UP2ItemData*                            ItemData;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MapMarkerActor;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FP2ContractRequirementIndexInfo        ContractRequirementIndexInfoTrack;                 // 0x0068(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_ContractScriptAddItemCharacter(int32 EntryPoint)	 // 0xae1e64;
	void BP_Reset(const class UWorld* InWorld)	 // 0xae1e64;
	void BP_Completed(const class UWorld* InWorld)	 // 0xae1e64;
	void BP_Activated(const class UWorld* InWorld)	 // 0xae1e64;

	bool MeetRequirementContractInProgress(const class UWorld* InWorld) const	 // 0xae1e64;
	bool IsServerOnly() const	 // 0xae1e64;
	void GetRandomCharacter(class UObject* InWorldContext, class AP2BaseCharacter** OutCharacter) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"ContractScriptAddItemCharacter_C">();
	}
	static class UContractScriptAddItemCharacter_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UContractScriptAddItemCharacter_C>();
	}
};
static_assert(alignof(UContractScriptAddItemCharacter_C) == 0x000008, "Wrong alignment on UContractScriptAddItemCharacter_C");
static_assert(sizeof(UContractScriptAddItemCharacter_C) == 0x000078, "Wrong size on UContractScriptAddItemCharacter_C");
static_assert(offsetof(UContractScriptAddItemCharacter_C, UberGraphFrame) == 0x000048, "Member 'UContractScriptAddItemCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UContractScriptAddItemCharacter_C, CharacterTag) == 0x000050, "Member 'UContractScriptAddItemCharacter_C::CharacterTag' has a wrong offset!");
static_assert(offsetof(UContractScriptAddItemCharacter_C, ItemData) == 0x000058, "Member 'UContractScriptAddItemCharacter_C::ItemData' has a wrong offset!");
static_assert(offsetof(UContractScriptAddItemCharacter_C, MapMarkerActor) == 0x000060, "Member 'UContractScriptAddItemCharacter_C::MapMarkerActor' has a wrong offset!");
static_assert(offsetof(UContractScriptAddItemCharacter_C, ContractRequirementIndexInfoTrack) == 0x000068, "Member 'UContractScriptAddItemCharacter_C::ContractRequirementIndexInfoTrack' has a wrong offset!");

}

