#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DirectExcel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DirectExcel_structs.hpp"
#include "Engine_structs.hpp"
#include "DataRegistry_structs.hpp"


namespace SDK::Params
{

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_datetime
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_datetime::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_ddmmyyyy
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_ddmmyyyy::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_dmminus
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmminus::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_dmyminus
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyminus::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_dmyslash
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_dmyslash::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_myminus
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_myminus::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time1
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time1::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time2
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time2::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time3
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time3::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time4
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time4::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time5
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time5::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_time6
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_time6::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_xlsx14
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx14::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_xlsx15
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx15::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_xlsx16
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx16::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_xlsx17
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx17::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_xlsx22
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_xlsx22::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_yymmdd
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_yymmdd::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Date_yyyymmdd2
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Date_yyyymmdd2::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_General
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_General final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_General) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_General");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_General) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_General");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_General, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_General::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Number
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Number final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Number) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Number");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Number) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Number");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Number, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Number::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Number00
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Number00 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Number00) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Number00");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Number00) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Number00");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Number00, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Number00::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_NumberCommaSeparated1
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_NumberCommaSeparated1::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Percentage
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Percentage final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Percentage");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Percentage");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Percentage::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Percentage00
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00 final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Percentage00::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelNumberFormatLibrary.MakeNumberFormat_Text
// 0x0018 (0x0018 - 0x0000)
struct ExcelNumberFormatLibrary_MakeNumberFormat_Text final
{
public:
	struct FExcelNumberFormat                     ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelNumberFormatLibrary_MakeNumberFormat_Text) == 0x000008, "Wrong alignment on ExcelNumberFormatLibrary_MakeNumberFormat_Text");
static_assert(sizeof(ExcelNumberFormatLibrary_MakeNumberFormat_Text) == 0x000018, "Wrong size on ExcelNumberFormatLibrary_MakeNumberFormat_Text");
static_assert(offsetof(ExcelNumberFormatLibrary_MakeNumberFormat_Text, ReturnValue) == 0x000000, "Member 'ExcelNumberFormatLibrary_MakeNumberFormat_Text::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.CreateExcel
// 0x0008 (0x0008 - 0x0000)
struct DirectExcelLibrary_CreateExcel final
{
public:
	class UExcelWorkbook*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DirectExcelLibrary_CreateExcel) == 0x000008, "Wrong alignment on DirectExcelLibrary_CreateExcel");
static_assert(sizeof(DirectExcelLibrary_CreateExcel) == 0x000008, "Wrong size on DirectExcelLibrary_CreateExcel");
static_assert(offsetof(DirectExcelLibrary_CreateExcel, ReturnValue) == 0x000000, "Member 'DirectExcelLibrary_CreateExcel::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.DoesExcelFileExists
// 0x0018 (0x0018 - 0x0000)
struct DirectExcelLibrary_DoesExcelFileExists final
{
public:
	struct FFilePath                              file;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectExcelLibrary_DoesExcelFileExists) == 0x000008, "Wrong alignment on DirectExcelLibrary_DoesExcelFileExists");
static_assert(sizeof(DirectExcelLibrary_DoesExcelFileExists) == 0x000018, "Wrong size on DirectExcelLibrary_DoesExcelFileExists");
static_assert(offsetof(DirectExcelLibrary_DoesExcelFileExists, file) == 0x000000, "Member 'DirectExcelLibrary_DoesExcelFileExists::file' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_DoesExcelFileExists, ReturnValue) == 0x000010, "Member 'DirectExcelLibrary_DoesExcelFileExists::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.GetAllRegistryIds
// 0x0018 (0x0018 - 0x0000)
struct DirectExcelLibrary_GetAllRegistryIds final
{
public:
	struct FDataRegistryType                      RegistryType;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDataRegistryId>                ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DirectExcelLibrary_GetAllRegistryIds) == 0x000008, "Wrong alignment on DirectExcelLibrary_GetAllRegistryIds");
static_assert(sizeof(DirectExcelLibrary_GetAllRegistryIds) == 0x000018, "Wrong size on DirectExcelLibrary_GetAllRegistryIds");
static_assert(offsetof(DirectExcelLibrary_GetAllRegistryIds, RegistryType) == 0x000000, "Member 'DirectExcelLibrary_GetAllRegistryIds::RegistryType' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_GetAllRegistryIds, ReturnValue) == 0x000008, "Member 'DirectExcelLibrary_GetAllRegistryIds::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.LoadExcel
// 0x0018 (0x0018 - 0x0000)
struct DirectExcelLibrary_LoadExcel final
{
public:
	struct FFilePath                              file;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelWorkbook*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DirectExcelLibrary_LoadExcel) == 0x000008, "Wrong alignment on DirectExcelLibrary_LoadExcel");
static_assert(sizeof(DirectExcelLibrary_LoadExcel) == 0x000018, "Wrong size on DirectExcelLibrary_LoadExcel");
static_assert(offsetof(DirectExcelLibrary_LoadExcel, file) == 0x000000, "Member 'DirectExcelLibrary_LoadExcel::file' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_LoadExcel, ReturnValue) == 0x000010, "Member 'DirectExcelLibrary_LoadExcel::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.ReadItemAtCell
// 0x0020 (0x0020 - 0x0000)
struct DirectExcelLibrary_ReadItemAtCell final
{
public:
	const class UExcelWorksheet*                  sheet;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExcelCellReference                    cellReference;                                     // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTableRowBase                          OutItem;                                           // 0x0010(0x0008)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectExcelLibrary_ReadItemAtCell) == 0x000008, "Wrong alignment on DirectExcelLibrary_ReadItemAtCell");
static_assert(sizeof(DirectExcelLibrary_ReadItemAtCell) == 0x000020, "Wrong size on DirectExcelLibrary_ReadItemAtCell");
static_assert(offsetof(DirectExcelLibrary_ReadItemAtCell, sheet) == 0x000000, "Member 'DirectExcelLibrary_ReadItemAtCell::sheet' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadItemAtCell, cellReference) == 0x000008, "Member 'DirectExcelLibrary_ReadItemAtCell::cellReference' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadItemAtCell, OutItem) == 0x000010, "Member 'DirectExcelLibrary_ReadItemAtCell::OutItem' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadItemAtCell, ReturnValue) == 0x000018, "Member 'DirectExcelLibrary_ReadItemAtCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.ReadStructAtRowIndex
// 0x0020 (0x0020 - 0x0000)
struct DirectExcelLibrary_ReadStructAtRowIndex final
{
public:
	const class UExcelWorksheet*                  sheet;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTableRowBase                          OutItem;                                           // 0x0010(0x0008)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectExcelLibrary_ReadStructAtRowIndex) == 0x000008, "Wrong alignment on DirectExcelLibrary_ReadStructAtRowIndex");
static_assert(sizeof(DirectExcelLibrary_ReadStructAtRowIndex) == 0x000020, "Wrong size on DirectExcelLibrary_ReadStructAtRowIndex");
static_assert(offsetof(DirectExcelLibrary_ReadStructAtRowIndex, sheet) == 0x000000, "Member 'DirectExcelLibrary_ReadStructAtRowIndex::sheet' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructAtRowIndex, Row) == 0x000008, "Member 'DirectExcelLibrary_ReadStructAtRowIndex::Row' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructAtRowIndex, OutItem) == 0x000010, "Member 'DirectExcelLibrary_ReadStructAtRowIndex::OutItem' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructAtRowIndex, ReturnValue) == 0x000018, "Member 'DirectExcelLibrary_ReadStructAtRowIndex::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.ReadStructWithRowName
// 0x0020 (0x0020 - 0x0000)
struct DirectExcelLibrary_ReadStructWithRowName final
{
public:
	const class UExcelWorksheet*                  sheet;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTableRowBase                          OutItem;                                           // 0x0010(0x0008)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectExcelLibrary_ReadStructWithRowName) == 0x000008, "Wrong alignment on DirectExcelLibrary_ReadStructWithRowName");
static_assert(sizeof(DirectExcelLibrary_ReadStructWithRowName) == 0x000020, "Wrong size on DirectExcelLibrary_ReadStructWithRowName");
static_assert(offsetof(DirectExcelLibrary_ReadStructWithRowName, sheet) == 0x000000, "Member 'DirectExcelLibrary_ReadStructWithRowName::sheet' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructWithRowName, RowName) == 0x000008, "Member 'DirectExcelLibrary_ReadStructWithRowName::RowName' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructWithRowName, OutItem) == 0x000010, "Member 'DirectExcelLibrary_ReadStructWithRowName::OutItem' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ReadStructWithRowName, ReturnValue) == 0x000018, "Member 'DirectExcelLibrary_ReadStructWithRowName::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.SaveExcel
// 0x0020 (0x0020 - 0x0000)
struct DirectExcelLibrary_SaveExcel final
{
public:
	class UExcelWorkbook*                         workbook;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilePath                              file;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectExcelLibrary_SaveExcel) == 0x000008, "Wrong alignment on DirectExcelLibrary_SaveExcel");
static_assert(sizeof(DirectExcelLibrary_SaveExcel) == 0x000020, "Wrong size on DirectExcelLibrary_SaveExcel");
static_assert(offsetof(DirectExcelLibrary_SaveExcel, workbook) == 0x000000, "Member 'DirectExcelLibrary_SaveExcel::workbook' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_SaveExcel, file) == 0x000008, "Member 'DirectExcelLibrary_SaveExcel::file' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_SaveExcel, ReturnValue) == 0x000018, "Member 'DirectExcelLibrary_SaveExcel::ReturnValue' has a wrong offset!");

// Function DirectExcel.DirectExcelLibrary.ToAbsolutePath
// 0x0020 (0x0020 - 0x0000)
struct DirectExcelLibrary_ToAbsolutePath final
{
public:
	struct FFilePath                              file;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DirectExcelLibrary_ToAbsolutePath) == 0x000008, "Wrong alignment on DirectExcelLibrary_ToAbsolutePath");
static_assert(sizeof(DirectExcelLibrary_ToAbsolutePath) == 0x000020, "Wrong size on DirectExcelLibrary_ToAbsolutePath");
static_assert(offsetof(DirectExcelLibrary_ToAbsolutePath, file) == 0x000000, "Member 'DirectExcelLibrary_ToAbsolutePath::file' has a wrong offset!");
static_assert(offsetof(DirectExcelLibrary_ToAbsolutePath, ReturnValue) == 0x000010, "Member 'DirectExcelLibrary_ToAbsolutePath::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.EqualEqual_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_EqualEqual_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_EqualEqual_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_EqualEqual_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_EqualEqual_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_EqualEqual_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_EqualEqual_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_EqualEqual_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_EqualEqual_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_EqualEqual_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_EqualEqual_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_EqualEqual_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.Greater_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_Greater_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_Greater_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_Greater_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_Greater_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_Greater_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_Greater_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_Greater_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_Greater_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_Greater_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_Greater_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_Greater_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.GreaterEqual_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_GreaterEqual_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_GreaterEqual_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_GreaterEqual_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_GreaterEqual_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_GreaterEqual_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_GreaterEqual_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_GreaterEqual_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_GreaterEqual_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_GreaterEqual_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_GreaterEqual_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_GreaterEqual_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.Less_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_Less_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_Less_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_Less_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_Less_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_Less_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_Less_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_Less_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_Less_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_Less_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_Less_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_Less_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.LessEqual_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_LessEqual_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_LessEqual_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_LessEqual_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_LessEqual_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_LessEqual_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_LessEqual_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_LessEqual_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_LessEqual_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_LessEqual_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_LessEqual_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_LessEqual_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.NotEqual_ExcelCellExcelCell
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_NotEqual_ExcelCellExcelCell final
{
public:
	class UExcelCell*                             A;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ExcelCell_NotEqual_ExcelCellExcelCell) == 0x000008, "Wrong alignment on ExcelCell_NotEqual_ExcelCellExcelCell");
static_assert(sizeof(ExcelCell_NotEqual_ExcelCellExcelCell) == 0x000018, "Wrong size on ExcelCell_NotEqual_ExcelCellExcelCell");
static_assert(offsetof(ExcelCell_NotEqual_ExcelCellExcelCell, A) == 0x000000, "Member 'ExcelCell_NotEqual_ExcelCellExcelCell::A' has a wrong offset!");
static_assert(offsetof(ExcelCell_NotEqual_ExcelCellExcelCell, B) == 0x000008, "Member 'ExcelCell_NotEqual_ExcelCellExcelCell::B' has a wrong offset!");
static_assert(offsetof(ExcelCell_NotEqual_ExcelCellExcelCell, ReturnValue) == 0x000010, "Member 'ExcelCell_NotEqual_ExcelCellExcelCell::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.MakeCellWithOffset
// 0x0010 (0x0010 - 0x0000)
struct ExcelCell_MakeCellWithOffset final
{
public:
	int32                                         columnOffset;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         rowOffset;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExcelCell*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_MakeCellWithOffset) == 0x000008, "Wrong alignment on ExcelCell_MakeCellWithOffset");
static_assert(sizeof(ExcelCell_MakeCellWithOffset) == 0x000010, "Wrong size on ExcelCell_MakeCellWithOffset");
static_assert(offsetof(ExcelCell_MakeCellWithOffset, columnOffset) == 0x000000, "Member 'ExcelCell_MakeCellWithOffset::columnOffset' has a wrong offset!");
static_assert(offsetof(ExcelCell_MakeCellWithOffset, rowOffset) == 0x000004, "Member 'ExcelCell_MakeCellWithOffset::rowOffset' has a wrong offset!");
static_assert(offsetof(ExcelCell_MakeCellWithOffset, ReturnValue) == 0x000008, "Member 'ExcelCell_MakeCellWithOffset::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetBool
// 0x0001 (0x0001 - 0x0000)
struct ExcelCell_SetBool final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetBool) == 0x000001, "Wrong alignment on ExcelCell_SetBool");
static_assert(sizeof(ExcelCell_SetBool) == 0x000001, "Wrong size on ExcelCell_SetBool");
static_assert(offsetof(ExcelCell_SetBool, Value) == 0x000000, "Member 'ExcelCell_SetBool::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetColor
// 0x0004 (0x0004 - 0x0000)
struct ExcelCell_SetColor final
{
public:
	struct FColor                                 Value;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetColor) == 0x000004, "Wrong alignment on ExcelCell_SetColor");
static_assert(sizeof(ExcelCell_SetColor) == 0x000004, "Wrong size on ExcelCell_SetColor");
static_assert(offsetof(ExcelCell_SetColor, Value) == 0x000000, "Member 'ExcelCell_SetColor::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetComment
// 0x0020 (0x0020 - 0x0000)
struct ExcelCell_SetComment final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Author;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetComment) == 0x000008, "Wrong alignment on ExcelCell_SetComment");
static_assert(sizeof(ExcelCell_SetComment) == 0x000020, "Wrong size on ExcelCell_SetComment");
static_assert(offsetof(ExcelCell_SetComment, Text) == 0x000000, "Member 'ExcelCell_SetComment::Text' has a wrong offset!");
static_assert(offsetof(ExcelCell_SetComment, Author) == 0x000010, "Member 'ExcelCell_SetComment::Author' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetDateTime
// 0x0008 (0x0008 - 0x0000)
struct ExcelCell_SetDateTime final
{
public:
	struct FDateTime                              Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetDateTime) == 0x000008, "Wrong alignment on ExcelCell_SetDateTime");
static_assert(sizeof(ExcelCell_SetDateTime) == 0x000008, "Wrong size on ExcelCell_SetDateTime");
static_assert(offsetof(ExcelCell_SetDateTime, Value) == 0x000000, "Member 'ExcelCell_SetDateTime::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetFloat
// 0x0004 (0x0004 - 0x0000)
struct ExcelCell_SetFloat final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetFloat) == 0x000004, "Wrong alignment on ExcelCell_SetFloat");
static_assert(sizeof(ExcelCell_SetFloat) == 0x000004, "Wrong size on ExcelCell_SetFloat");
static_assert(offsetof(ExcelCell_SetFloat, Value) == 0x000000, "Member 'ExcelCell_SetFloat::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetFormat
// 0x0008 (0x0008 - 0x0000)
struct ExcelCell_SetFormat final
{
public:
	class UExcelFormat*                           Format;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetFormat) == 0x000008, "Wrong alignment on ExcelCell_SetFormat");
static_assert(sizeof(ExcelCell_SetFormat) == 0x000008, "Wrong size on ExcelCell_SetFormat");
static_assert(offsetof(ExcelCell_SetFormat, Format) == 0x000000, "Member 'ExcelCell_SetFormat::Format' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetFormula
// 0x0010 (0x0010 - 0x0000)
struct ExcelCell_SetFormula final
{
public:
	class FString                                 formula;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetFormula) == 0x000008, "Wrong alignment on ExcelCell_SetFormula");
static_assert(sizeof(ExcelCell_SetFormula) == 0x000010, "Wrong size on ExcelCell_SetFormula");
static_assert(offsetof(ExcelCell_SetFormula, formula) == 0x000000, "Member 'ExcelCell_SetFormula::formula' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetHyperlink
// 0x0020 (0x0020 - 0x0000)
struct ExcelCell_SetHyperlink final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Display;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetHyperlink) == 0x000008, "Wrong alignment on ExcelCell_SetHyperlink");
static_assert(sizeof(ExcelCell_SetHyperlink) == 0x000020, "Wrong size on ExcelCell_SetHyperlink");
static_assert(offsetof(ExcelCell_SetHyperlink, URL) == 0x000000, "Member 'ExcelCell_SetHyperlink::URL' has a wrong offset!");
static_assert(offsetof(ExcelCell_SetHyperlink, Display) == 0x000010, "Member 'ExcelCell_SetHyperlink::Display' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetInt
// 0x0004 (0x0004 - 0x0000)
struct ExcelCell_SetInt final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetInt) == 0x000004, "Wrong alignment on ExcelCell_SetInt");
static_assert(sizeof(ExcelCell_SetInt) == 0x000004, "Wrong size on ExcelCell_SetInt");
static_assert(offsetof(ExcelCell_SetInt, Value) == 0x000000, "Member 'ExcelCell_SetInt::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetMatrix
// 0x0080 (0x0080 - 0x0000)
struct ExcelCell_SetMatrix final
{
public:
	struct FMatrix                                Value;                                             // 0x0000(0x0080)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetMatrix) == 0x000010, "Wrong alignment on ExcelCell_SetMatrix");
static_assert(sizeof(ExcelCell_SetMatrix) == 0x000080, "Wrong size on ExcelCell_SetMatrix");
static_assert(offsetof(ExcelCell_SetMatrix, Value) == 0x000000, "Member 'ExcelCell_SetMatrix::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetObject
// 0x0008 (0x0008 - 0x0000)
struct ExcelCell_SetObject final
{
public:
	const class UObject*                          Value;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetObject) == 0x000008, "Wrong alignment on ExcelCell_SetObject");
static_assert(sizeof(ExcelCell_SetObject) == 0x000008, "Wrong size on ExcelCell_SetObject");
static_assert(offsetof(ExcelCell_SetObject, Value) == 0x000000, "Member 'ExcelCell_SetObject::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetRotator
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_SetRotator final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetRotator) == 0x000008, "Wrong alignment on ExcelCell_SetRotator");
static_assert(sizeof(ExcelCell_SetRotator) == 0x000018, "Wrong size on ExcelCell_SetRotator");
static_assert(offsetof(ExcelCell_SetRotator, Value) == 0x000000, "Member 'ExcelCell_SetRotator::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetString
// 0x0010 (0x0010 - 0x0000)
struct ExcelCell_SetString final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetString) == 0x000008, "Wrong alignment on ExcelCell_SetString");
static_assert(sizeof(ExcelCell_SetString) == 0x000010, "Wrong size on ExcelCell_SetString");
static_assert(offsetof(ExcelCell_SetString, Value) == 0x000000, "Member 'ExcelCell_SetString::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetTransform
// 0x0060 (0x0060 - 0x0000)
struct ExcelCell_SetTransform final
{
public:
	struct FTransform                             Value;                                             // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetTransform) == 0x000010, "Wrong alignment on ExcelCell_SetTransform");
static_assert(sizeof(ExcelCell_SetTransform) == 0x000060, "Wrong size on ExcelCell_SetTransform");
static_assert(offsetof(ExcelCell_SetTransform, Value) == 0x000000, "Member 'ExcelCell_SetTransform::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.SetVector
// 0x0018 (0x0018 - 0x0000)
struct ExcelCell_SetVector final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_SetVector) == 0x000008, "Wrong alignment on ExcelCell_SetVector");
static_assert(sizeof(ExcelCell_SetVector) == 0x000018, "Wrong size on ExcelCell_SetVector");
static_assert(offsetof(ExcelCell_SetVector, Value) == 0x000000, "Member 'ExcelCell_SetVector::Value' has a wrong offset!");

// Function DirectExcel.ExcelCell.Column
// 0x0004 (0x0004 - 0x0000)
struct ExcelCell_Column final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExcelCell_Column) == 0x000004, "Wrong alignment on ExcelCell_Column");
static_assert(sizeof(ExcelCell_Column) == 0x000004, "Wrong size on ExcelCell_Column");
static_assert(offsetof(ExcelCell_Column, ReturnValue) == 0x000000, "Member 'ExcelCell_Column::ReturnValue' has a wrong offset!");

// Function DirectExcel.ExcelCell.Compare
// 0x0010 (0x0010 - 0x0000)
struct ExcelCell_Compare final
{
public:
