#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DirectExcel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum DirectExcel.ExcelSortType
// NumValues: 0x0004
enum class ExcelSortType : uint8
{
	None                                     = 0,
	Ascending                                = 1,
	Descending                               = 2,
	ExcelSortType_MAX                        = 3,
};

// Enum DirectExcel.ExcelVariantType
// NumValues: 0x0007
enum class ExcelVariantType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Int32                                    = 2,
	String                                   = 3,
	DateTime                                 = 4,
	Array                                    = 5,
	ExcelVariantType_MAX                     = 6,
};

// Enum DirectExcel.ExcelBaseDate
// NumValues: 0x0003
enum class ExcelBaseDate : uint8
{
	Windows1900                              = 0,
	Mac1904                                  = 1,
	ExcelBaseDate_MAX                        = 2,
};

// Enum DirectExcel.ExcelCellType
// NumValues: 0x0009
enum class ExcelCellType : uint8
{
	Empty                                    = 0,
	Boolean                                  = 1,
	Date                                     = 2,
	Error                                    = 3,
	InlineString                             = 4,
	Number                                   = 5,
	SharedString                             = 6,
	FormulaString                            = 7,
	ExcelCellType_MAX                        = 8,
};

// Enum DirectExcel.ExcelCoreProperty
// NumValues: 0x0010
enum class ExcelCoreProperty : uint8
{
	Category                                 = 0,
	Content_status                           = 1,
	Created                                  = 2,
	Creator                                  = 3,
	Description                              = 4,
	Identifier                               = 5,
	Keywords                                 = 6,
	Language                                 = 7,
	LastModifiedBy                           = 8,
	LastPrinted                              = 9,
	Modified                                 = 10,
	Revision                                 = 11,
	Subject                                  = 12,
	Title                                    = 13,
	Version                                  = 14,
	ExcelCoreProperty_MAX                    = 15,
};

// Enum DirectExcel.ExcelExtendedProperty
// NumValues: 0x001C
enum class ExcelExtendedProperty : uint8
{
	Application                              = 0,
	AppVersion                               = 1,
	Characters                               = 2,
	CharactersWithWpaces                     = 3,
	Company                                  = 4,
	Digsig                                   = 5,
	DocSecurity                              = 6,
	HeadingPairs                             = 7,
	HiddenSlides                             = 8,
	HLinks                                   = 9,
	HyperlinkBase                            = 10,
	HyperlinksChanged                        = 11,
	Lines                                    = 12,
	LinksUpToDate                            = 13,
	Manager                                  = 14,
	MMClips                                  = 15,
	Notes                                    = 16,
	Pages                                    = 17,
	Paragraphs                               = 18,
	PresentationFormat                       = 19,
	ScaleCrop                                = 20,
	SharedDoc                                = 21,
	Slides                                   = 22,
	Template                                 = 23,
	TitlesOfParts                            = 24,
	TotalTime                                = 25,
	Words                                    = 26,
	ExcelExtendedProperty_MAX                = 27,
};

// Enum DirectExcel.ExcelHorizontalAlignment
// NumValues: 0x0009
enum class ExcelHorizontalAlignment : uint8
{
	General                                  = 0,
	Left                                     = 1,
	Center                                   = 2,
	Right                                    = 3,
	Fill                                     = 4,
	Justify                                  = 5,
	CenterContinuous                         = 6,
	Distributed                              = 7,
	ExcelHorizontalAlignment_MAX             = 8,
};

// Enum DirectExcel.ExcelVerticalAlignment
// NumValues: 0x0006
enum class ExcelVerticalAlignment : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	Justify                                  = 3,
	Distributed                              = 4,
	ExcelVerticalAlignment_MAX               = 5,
};

// Enum DirectExcel.ExcelBorderDiagonalDirection
// NumValues: 0x0005
enum class ExcelBorderDiagonalDirection : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	Both                                     = 3,
	ExcelBorderDiagonalDirection_MAX         = 4,
};

// Enum DirectExcel.ExcelBorderSideType
// NumValues: 0x0008
enum class ExcelBorderSideType : uint8
{
	Start                                    = 0,
	End                                      = 1,
	Top                                      = 2,
	Bottom                                   = 3,
	Diagonal                                 = 4,
	Vertical                                 = 5,
	Horizontal                               = 6,
	ExcelBorderSideType_MAX                  = 7,
};

// Enum DirectExcel.ExcelBorderStyle
// NumValues: 0x000F
enum class ExcelBorderStyle : uint8
{
	None                                     = 0,
	DashDot                                  = 1,
	DashDotDot                               = 2,
	Dashed                                   = 3,
	Dotted                                   = 4,
	Double                                   = 5,
	Hair                                     = 6,
	Medium                                   = 7,
	MediumDashDot                            = 8,
	MediumDashDotDot                         = 9,
	MediumDashed                             = 10,
	SlantDashDot                             = 11,
	Thick                                    = 12,
	Thin                                     = 13,
	ExcelBorderStyle_MAX                     = 14,
};

// Enum DirectExcel.ExcelColorType
// NumValues: 0x0004
enum class ExcelColorType : uint8
{
	Indexed                                  = 0,
	Theme                                    = 1,
	RGB                                      = 2,
	ExcelColorType_MAX                       = 3,
};

// Enum DirectExcel.ExcelPatternFillType
// NumValues: 0x0014
enum class ExcelPatternFillType : uint8
{
	None                                     = 0,
	Solid                                    = 1,
	Mediumgray                               = 2,
	Darkgray                                 = 3,
	LightGray                                = 4,
	DarkHorizontal                           = 5,
	DarkVertical                             = 6,
	DarkDown                                 = 7,
	DarkUp                                   = 8,
	DarkGrid                                 = 9,
	DarkTrellis                              = 10,
	LightHorizontal                          = 11,
	LightVertical                            = 12,
	LightDown                                = 13,
	LightUp                                  = 14,
	LightGrid                                = 15,
	LightTrellis                             = 16,
	Gray125                                  = 17,
	Gray0625                                 = 18,
	ExcelPatternFillType_MAX                 = 19,
};

// Enum DirectExcel.ExcelGradientFillType
// NumValues: 0x0003
enum class ExcelGradientFillType : uint8
{
	Linear                                   = 0,
	Path                                     = 1,
	ExcelGradientFillType_MAX                = 2,
};

// Enum DirectExcel.ExcelFillType
// NumValues: 0x0003
enum class ExcelFillType : uint8
{
	Pattern                                  = 0,
	Gradient                                 = 1,
	ExcelFillType_MAX                        = 2,
};

// Enum DirectExcel.ExcelUnderlineType
// NumValues: 0x0006
enum class ExcelUnderlineType : uint8
{
	None                                     = 0,
	Double                                   = 1,
	DoubleAccounting                         = 2,
	Single                                   = 3,
	SingleAccounting                         = 4,
	ExcelUnderlineType_MAX                   = 5,
};

// Enum DirectExcel.ExcelTableFormat
// NumValues: 0x0005
enum class ExcelTableFormat : uint8
{
	Normal                                   = 0,
	TableWithFirstRowColumnHeader            = 1,
	TableWithFirstRowFlatColumnHeader        = 2,
	UnrealDataTableExportCSV                 = 3,
	ExcelTableFormat_MAX                     = 4,
};

// Enum DirectExcel.ExcelReloadStrategy
// NumValues: 0x0004
enum class ExcelReloadStrategy : uint8
{
	NotReload                                = 0,
	ReloadAsNew                              = 1,
	ReloadWithOriginalTableHeaders           = 2,
	ExcelReloadStrategy_MAX                  = 3,
};

// ScriptStruct DirectExcel.DataRegistrySource_ExcelRules
// 0x0008 (0x0008 - 0x0000)
struct FDataRegistrySource_ExcelRules final
{
public:
	bool                                          bPrecacheExcel;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedTableKeepSeconds;                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataRegistrySource_ExcelRules) == 0x000004, "Wrong alignment on FDataRegistrySource_ExcelRules");
static_assert(sizeof(FDataRegistrySource_ExcelRules) == 0x000008, "Wrong size on FDataRegistrySource_ExcelRules");
static_assert(offsetof(FDataRegistrySource_ExcelRules, bPrecacheExcel) == 0x000000, "Member 'FDataRegistrySource_ExcelRules::bPrecacheExcel' has a wrong offset!");
static_assert(offsetof(FDataRegistrySource_ExcelRules, CachedTableKeepSeconds) == 0x000004, "Member 'FDataRegistrySource_ExcelRules::CachedTableKeepSeconds' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelAlignment
// 0x0010 (0x0010 - 0x0000)
struct FExcelAlignment final
{
public:
	bool                                          ShrinkToFit;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WrapText;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Indent;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextRotation;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ExcelHorizontalAlignment                      HorizontalAlignment;                               // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ExcelVerticalAlignment                        VerticalAlignment;                                 // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExcelAlignment) == 0x000004, "Wrong alignment on FExcelAlignment");
static_assert(sizeof(FExcelAlignment) == 0x000010, "Wrong size on FExcelAlignment");
static_assert(offsetof(FExcelAlignment, ShrinkToFit) == 0x000000, "Member 'FExcelAlignment::ShrinkToFit' has a wrong offset!");
static_assert(offsetof(FExcelAlignment, WrapText) == 0x000001, "Member 'FExcelAlignment::WrapText' has a wrong offset!");
static_assert(offsetof(FExcelAlignment, Indent) == 0x000004, "Member 'FExcelAlignment::Indent' has a wrong offset!");
static_assert(offsetof(FExcelAlignment, TextRotation) == 0x000008, "Member 'FExcelAlignment::TextRotation' has a wrong offset!");
static_assert(offsetof(FExcelAlignment, HorizontalAlignment) == 0x00000C, "Member 'FExcelAlignment::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FExcelAlignment, VerticalAlignment) == 0x00000D, "Member 'FExcelAlignment::VerticalAlignment' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelColor
// 0x0020 (0x0020 - 0x0000)
struct FExcelColor final
{
public:
	ExcelColorType                                Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ColorIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorValue;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tint;                                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoColor;                                       // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExcelColor) == 0x000004, "Wrong alignment on FExcelColor");
static_assert(sizeof(FExcelColor) == 0x000020, "Wrong size on FExcelColor");
static_assert(offsetof(FExcelColor, Type) == 0x000000, "Member 'FExcelColor::Type' has a wrong offset!");
static_assert(offsetof(FExcelColor, ColorIndex) == 0x000004, "Member 'FExcelColor::ColorIndex' has a wrong offset!");
static_assert(offsetof(FExcelColor, ColorValue) == 0x000008, "Member 'FExcelColor::ColorValue' has a wrong offset!");
static_assert(offsetof(FExcelColor, Tint) == 0x000018, "Member 'FExcelColor::Tint' has a wrong offset!");
static_assert(offsetof(FExcelColor, IsAutoColor) == 0x00001C, "Member 'FExcelColor::IsAutoColor' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelBorderSide
// 0x0024 (0x0024 - 0x0000)
struct FExcelBorderSide final
{
public:
	struct FExcelColor                            Color;                                             // 0x0000(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ExcelBorderStyle                              Style;                                             // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExcelBorderSide) == 0x000004, "Wrong alignment on FExcelBorderSide");
static_assert(sizeof(FExcelBorderSide) == 0x000024, "Wrong size on FExcelBorderSide");
static_assert(offsetof(FExcelBorderSide, Color) == 0x000000, "Member 'FExcelBorderSide::Color' has a wrong offset!");
static_assert(offsetof(FExcelBorderSide, Style) == 0x000020, "Member 'FExcelBorderSide::Style' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelBorder
// 0x0100 (0x0100 - 0x0000)
struct FExcelBorder final
{
public:
	struct FExcelBorderSide                       Start;                                             // 0x0000(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       End;                                               // 0x0024(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       Top;                                               // 0x0048(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       Bottom;                                            // 0x006C(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       Horizontal;                                        // 0x0090(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       Vertical;                                          // 0x00B4(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelBorderSide                       Diagonal;                                          // 0x00D8(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ExcelBorderDiagonalDirection                  DiagonalDirection;                                 // 0x00FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExcelBorder) == 0x000004, "Wrong alignment on FExcelBorder");
static_assert(sizeof(FExcelBorder) == 0x000100, "Wrong size on FExcelBorder");
static_assert(offsetof(FExcelBorder, Start) == 0x000000, "Member 'FExcelBorder::Start' has a wrong offset!");
static_assert(offsetof(FExcelBorder, End) == 0x000024, "Member 'FExcelBorder::End' has a wrong offset!");
static_assert(offsetof(FExcelBorder, Top) == 0x000048, "Member 'FExcelBorder::Top' has a wrong offset!");
static_assert(offsetof(FExcelBorder, Bottom) == 0x00006C, "Member 'FExcelBorder::Bottom' has a wrong offset!");
static_assert(offsetof(FExcelBorder, Horizontal) == 0x000090, "Member 'FExcelBorder::Horizontal' has a wrong offset!");
static_assert(offsetof(FExcelBorder, Vertical) == 0x0000B4, "Member 'FExcelBorder::Vertical' has a wrong offset!");
static_assert(offsetof(FExcelBorder, Diagonal) == 0x0000D8, "Member 'FExcelBorder::Diagonal' has a wrong offset!");
static_assert(offsetof(FExcelBorder, DiagonalDirection) == 0x0000FC, "Member 'FExcelBorder::DiagonalDirection' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelCellReference
// 0x0008 (0x0008 - 0x0000)
struct FExcelCellReference final
{
public:
	int32                                         Column;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Row;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelCellReference) == 0x000004, "Wrong alignment on FExcelCellReference");
static_assert(sizeof(FExcelCellReference) == 0x000008, "Wrong size on FExcelCellReference");
static_assert(offsetof(FExcelCellReference, Column) == 0x000000, "Member 'FExcelCellReference::Column' has a wrong offset!");
static_assert(offsetof(FExcelCellReference, Row) == 0x000004, "Member 'FExcelCellReference::Row' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelCellRangeReference
// 0x0010 (0x0010 - 0x0000)
struct FExcelCellRangeReference final
{
public:
	struct FExcelCellReference                    TopLeft;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelCellReference                    BottomRight;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelCellRangeReference) == 0x000004, "Wrong alignment on FExcelCellRangeReference");
static_assert(sizeof(FExcelCellRangeReference) == 0x000010, "Wrong size on FExcelCellRangeReference");
static_assert(offsetof(FExcelCellRangeReference, TopLeft) == 0x000000, "Member 'FExcelCellRangeReference::TopLeft' has a wrong offset!");
static_assert(offsetof(FExcelCellRangeReference, BottomRight) == 0x000008, "Member 'FExcelCellRangeReference::BottomRight' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelPatternFill
// 0x0044 (0x0044 - 0x0000)
struct FExcelPatternFill final
{
public:
	ExcelPatternFillType                          Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExcelColor                            ForegroundColor;                                   // 0x0004(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelColor                            BackgroundColor;                                   // 0x0024(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelPatternFill) == 0x000004, "Wrong alignment on FExcelPatternFill");
static_assert(sizeof(FExcelPatternFill) == 0x000044, "Wrong size on FExcelPatternFill");
static_assert(offsetof(FExcelPatternFill, Type) == 0x000000, "Member 'FExcelPatternFill::Type' has a wrong offset!");
static_assert(offsetof(FExcelPatternFill, ForegroundColor) == 0x000004, "Member 'FExcelPatternFill::ForegroundColor' has a wrong offset!");
static_assert(offsetof(FExcelPatternFill, BackgroundColor) == 0x000024, "Member 'FExcelPatternFill::BackgroundColor' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelGradientFill
// 0x0068 (0x0068 - 0x0000)
struct FExcelGradientFill final
{
public:
	ExcelGradientFillType                         Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Degree;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Distance;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMap<float, struct FExcelColor>               Stops;                                             // 0x0018(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelGradientFill) == 0x000008, "Wrong alignment on FExcelGradientFill");
static_assert(sizeof(FExcelGradientFill) == 0x000068, "Wrong size on FExcelGradientFill");
static_assert(offsetof(FExcelGradientFill, Type) == 0x000000, "Member 'FExcelGradientFill::Type' has a wrong offset!");
static_assert(offsetof(FExcelGradientFill, Degree) == 0x000004, "Member 'FExcelGradientFill::Degree' has a wrong offset!");
static_assert(offsetof(FExcelGradientFill, Distance) == 0x000008, "Member 'FExcelGradientFill::Distance' has a wrong offset!");
static_assert(offsetof(FExcelGradientFill, Stops) == 0x000018, "Member 'FExcelGradientFill::Stops' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelFill
// 0x00B0 (0x00B0 - 0x0000)
struct FExcelFill final
{
public:
	ExcelFillType                                 Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExcelPatternFill                      PatternFill;                                       // 0x0004(0x0044)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FExcelGradientFill                     GradientFill;                                      // 0x0048(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelFill) == 0x000008, "Wrong alignment on FExcelFill");
static_assert(sizeof(FExcelFill) == 0x0000B0, "Wrong size on FExcelFill");
static_assert(offsetof(FExcelFill, Type) == 0x000000, "Member 'FExcelFill::Type' has a wrong offset!");
static_assert(offsetof(FExcelFill, PatternFill) == 0x000004, "Member 'FExcelFill::PatternFill' has a wrong offset!");
static_assert(offsetof(FExcelFill, GradientFill) == 0x000048, "Member 'FExcelFill::GradientFill' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelFont
// 0x0058 (0x0058 - 0x0000)
struct FExcelFont final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Size;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBold;                                            // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsItalic;                                          // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSuperScript;                                     // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStrikeThrough;                                   // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsOutline;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsShadow;                                          // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ExcelUnderlineType                            UnderlineType;                                     // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExcelColor                            Color;                                             // 0x001C(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Family;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Charset;                                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Scheme;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelFont) == 0x000008, "Wrong alignment on FExcelFont");
static_assert(sizeof(FExcelFont) == 0x000058, "Wrong size on FExcelFont");
static_assert(offsetof(FExcelFont, Name) == 0x000000, "Member 'FExcelFont::Name' has a wrong offset!");
static_assert(offsetof(FExcelFont, Size) == 0x000010, "Member 'FExcelFont::Size' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsBold) == 0x000014, "Member 'FExcelFont::IsBold' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsItalic) == 0x000015, "Member 'FExcelFont::IsItalic' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsSuperScript) == 0x000016, "Member 'FExcelFont::IsSuperScript' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsStrikeThrough) == 0x000017, "Member 'FExcelFont::IsStrikeThrough' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsOutline) == 0x000018, "Member 'FExcelFont::IsOutline' has a wrong offset!");
static_assert(offsetof(FExcelFont, IsShadow) == 0x000019, "Member 'FExcelFont::IsShadow' has a wrong offset!");
static_assert(offsetof(FExcelFont, UnderlineType) == 0x00001A, "Member 'FExcelFont::UnderlineType' has a wrong offset!");
static_assert(offsetof(FExcelFont, Color) == 0x00001C, "Member 'FExcelFont::Color' has a wrong offset!");
static_assert(offsetof(FExcelFont, Family) == 0x00003C, "Member 'FExcelFont::Family' has a wrong offset!");
static_assert(offsetof(FExcelFont, Charset) == 0x000040, "Member 'FExcelFont::Charset' has a wrong offset!");
static_assert(offsetof(FExcelFont, Scheme) == 0x000048, "Member 'FExcelFont::Scheme' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelNumberFormat
// 0x0018 (0x0018 - 0x0000)
struct FExcelNumberFormat final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FormatString;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelNumberFormat) == 0x000008, "Wrong alignment on FExcelNumberFormat");
static_assert(sizeof(FExcelNumberFormat) == 0x000018, "Wrong size on FExcelNumberFormat");
static_assert(offsetof(FExcelNumberFormat, ID) == 0x000000, "Member 'FExcelNumberFormat::ID' has a wrong offset!");
static_assert(offsetof(FExcelNumberFormat, FormatString) == 0x000008, "Member 'FExcelNumberFormat::FormatString' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelProtection
// 0x0002 (0x0002 - 0x0000)
struct FExcelProtection final
{
public:
	bool                                          IsLocked;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHidden;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelProtection) == 0x000001, "Wrong alignment on FExcelProtection");
static_assert(sizeof(FExcelProtection) == 0x000002, "Wrong size on FExcelProtection");
static_assert(offsetof(FExcelProtection, IsLocked) == 0x000000, "Member 'FExcelProtection::IsLocked' has a wrong offset!");
static_assert(offsetof(FExcelProtection, IsHidden) == 0x000001, "Member 'FExcelProtection::IsHidden' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelTableHeader
// 0x0078 (0x0078 - 0x0000)
struct FExcelTableHeader final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          RowStruct;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ExcelTableFormat                              TableFormat;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      ColumnNames;                                       // 0x0018(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         ColumnHeaderStartRowIndex;                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColumnHeaderStartColumnIndex;                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataRowStartIndex;                                 // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataRowEndIndex;                                   // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FExcelTableHeader) == 0x000008, "Wrong alignment on FExcelTableHeader");
static_assert(sizeof(FExcelTableHeader) == 0x000078, "Wrong size on FExcelTableHeader");
static_assert(offsetof(FExcelTableHeader, Enabled) == 0x000000, "Member 'FExcelTableHeader::Enabled' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, RowStruct) == 0x000008, "Member 'FExcelTableHeader::RowStruct' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, TableFormat) == 0x000010, "Member 'FExcelTableHeader::TableFormat' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, ColumnNames) == 0x000018, "Member 'FExcelTableHeader::ColumnNames' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, ColumnHeaderStartRowIndex) == 0x000068, "Member 'FExcelTableHeader::ColumnHeaderStartRowIndex' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, ColumnHeaderStartColumnIndex) == 0x00006C, "Member 'FExcelTableHeader::ColumnHeaderStartColumnIndex' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, DataRowStartIndex) == 0x000070, "Member 'FExcelTableHeader::DataRowStartIndex' has a wrong offset!");
static_assert(offsetof(FExcelTableHeader, DataRowEndIndex) == 0x000074, "Member 'FExcelTableHeader::DataRowEndIndex' has a wrong offset!");

// ScriptStruct DirectExcel.ExcelVariant
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FExcelVariant final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExcelVariant) == 0x000008, "Wrong alignment on FExcelVariant");
static_assert(sizeof(FExcelVariant) == 0x000030, "Wrong size on FExcelVariant");

}

