#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EngineExtRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct EngineExtRuntime.EngineExtNiagaraHandle
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FEngineExtNiagaraHandle final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEngineExtNiagaraHandle) == 0x000004, "Wrong alignment on FEngineExtNiagaraHandle");
static_assert(sizeof(FEngineExtNiagaraHandle) == 0x000004, "Wrong size on FEngineExtNiagaraHandle");

// ScriptStruct EngineExtRuntime.EngineExtNiagaraProxy
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x10) FEngineExtNiagaraProxy final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEngineExtNiagaraProxy) == 0x000010, "Wrong alignment on FEngineExtNiagaraProxy");
static_assert(sizeof(FEngineExtNiagaraProxy) == 0x000090, "Wrong size on FEngineExtNiagaraProxy");

// ScriptStruct EngineExtRuntime.InstancedNiagaraData
// 0x0054 (0x0054 - 0x0000)
struct FInstancedNiagaraData final
{
public:
	class FName                                   BurstTriggerParameterName;                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BurstCullDistance;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BurstLifeTime;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInstances;                                      // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedLocationParameterName;                    // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedRotationParameterName;                    // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedScaleParameterName;                       // 0x0024(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedVelocityParameterName;                    // 0x002C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BurstTimeParameterName;                            // 0x0034(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedAttachIndexParameterName;                 // 0x003C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedAttachPositionParameterName;              // 0x0044(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InstancedAttachRotationParameterName;              // 0x004C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FInstancedNiagaraData) == 0x000004, "Wrong alignment on FInstancedNiagaraData");
static_assert(sizeof(FInstancedNiagaraData) == 0x000054, "Wrong size on FInstancedNiagaraData");
static_assert(offsetof(FInstancedNiagaraData, BurstTriggerParameterName) == 0x000000, "Member 'FInstancedNiagaraData::BurstTriggerParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, BurstCullDistance) == 0x000008, "Member 'FInstancedNiagaraData::BurstCullDistance' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, BurstLifeTime) == 0x00000C, "Member 'FInstancedNiagaraData::BurstLifeTime' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, MaxInstances) == 0x000010, "Member 'FInstancedNiagaraData::MaxInstances' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedLocationParameterName) == 0x000014, "Member 'FInstancedNiagaraData::InstancedLocationParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedRotationParameterName) == 0x00001C, "Member 'FInstancedNiagaraData::InstancedRotationParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedScaleParameterName) == 0x000024, "Member 'FInstancedNiagaraData::InstancedScaleParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedVelocityParameterName) == 0x00002C, "Member 'FInstancedNiagaraData::InstancedVelocityParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, BurstTimeParameterName) == 0x000034, "Member 'FInstancedNiagaraData::BurstTimeParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedAttachIndexParameterName) == 0x00003C, "Member 'FInstancedNiagaraData::InstancedAttachIndexParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedAttachPositionParameterName) == 0x000044, "Member 'FInstancedNiagaraData::InstancedAttachPositionParameterName' has a wrong offset!");
static_assert(offsetof(FInstancedNiagaraData, InstancedAttachRotationParameterName) == 0x00004C, "Member 'FInstancedNiagaraData::InstancedAttachRotationParameterName' has a wrong offset!");

// ScriptStruct EngineExtRuntime.EngineExtNiagaraParameterUpdateRequestData
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FEngineExtNiagaraParameterUpdateRequestData final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEngineExtNiagaraParameterUpdateRequestData) == 0x000008, "Wrong alignment on FEngineExtNiagaraParameterUpdateRequestData");
static_assert(sizeof(FEngineExtNiagaraParameterUpdateRequestData) == 0x000028, "Wrong size on FEngineExtNiagaraParameterUpdateRequestData");

// ScriptStruct EngineExtRuntime.EngineExtNiagaraParameterUpdateRequest
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FEngineExtNiagaraParameterUpdateRequest final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEngineExtNiagaraParameterUpdateRequest) == 0x000008, "Wrong alignment on FEngineExtNiagaraParameterUpdateRequest");
static_assert(sizeof(FEngineExtNiagaraParameterUpdateRequest) == 0x000028, "Wrong size on FEngineExtNiagaraParameterUpdateRequest");

// ScriptStruct EngineExtRuntime.EngineExtNiagaraSystemInstanceMapDataTable
// 0x0098 (0x00A0 - 0x0008)
struct FEngineExtNiagaraSystemInstanceMapDataTable final : public FTableRowBase
{
public:
	struct FSoftObjectPath                        LegacySystemTemplate;                              // 0x0008(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        InstancedSystemTemplate;                           // 0x0028(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedNiagaraData                  InstancedNiagaraData;                              // 0x0048(0x0054)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FEngineExtNiagaraSystemInstanceMapDataTable) == 0x000008, "Wrong alignment on FEngineExtNiagaraSystemInstanceMapDataTable");
static_assert(sizeof(FEngineExtNiagaraSystemInstanceMapDataTable) == 0x0000A0, "Wrong size on FEngineExtNiagaraSystemInstanceMapDataTable");
static_assert(offsetof(FEngineExtNiagaraSystemInstanceMapDataTable, LegacySystemTemplate) == 0x000008, "Member 'FEngineExtNiagaraSystemInstanceMapDataTable::LegacySystemTemplate' has a wrong offset!");
static_assert(offsetof(FEngineExtNiagaraSystemInstanceMapDataTable, InstancedSystemTemplate) == 0x000028, "Member 'FEngineExtNiagaraSystemInstanceMapDataTable::InstancedSystemTemplate' has a wrong offset!");
static_assert(offsetof(FEngineExtNiagaraSystemInstanceMapDataTable, InstancedNiagaraData) == 0x000048, "Member 'FEngineExtNiagaraSystemInstanceMapDataTable::InstancedNiagaraData' has a wrong offset!");

// ScriptStruct EngineExtRuntime.EngineExtRainDropPostProcessParams
// 0x0020 (0x0020 - 0x0000)
struct FEngineExtRainDropPostProcessParams final
{
public:
	float                                         RainLevelThreshold;                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchThreshold;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImmersionRatioThreshold;                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRainPostProcessMaterialLevel;                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RainPostProcessMaterialLevelName;                  // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PostProcessMaterial;                               // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEngineExtRainDropPostProcessParams) == 0x000008, "Wrong alignment on FEngineExtRainDropPostProcessParams");
static_assert(sizeof(FEngineExtRainDropPostProcessParams) == 0x000020, "Wrong size on FEngineExtRainDropPostProcessParams");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, RainLevelThreshold) == 0x000000, "Member 'FEngineExtRainDropPostProcessParams::RainLevelThreshold' has a wrong offset!");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, PitchThreshold) == 0x000004, "Member 'FEngineExtRainDropPostProcessParams::PitchThreshold' has a wrong offset!");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, ImmersionRatioThreshold) == 0x000008, "Member 'FEngineExtRainDropPostProcessParams::ImmersionRatioThreshold' has a wrong offset!");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, MaxRainPostProcessMaterialLevel) == 0x00000C, "Member 'FEngineExtRainDropPostProcessParams::MaxRainPostProcessMaterialLevel' has a wrong offset!");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, RainPostProcessMaterialLevelName) == 0x000010, "Member 'FEngineExtRainDropPostProcessParams::RainPostProcessMaterialLevelName' has a wrong offset!");
static_assert(offsetof(FEngineExtRainDropPostProcessParams, PostProcessMaterial) == 0x000018, "Member 'FEngineExtRainDropPostProcessParams::PostProcessMaterial' has a wrong offset!");

}

