#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_LastTargetLocation_Context

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_LastTargetLocation_Context.EQS_LastTargetLocation_Context_C.ProvideSingleLocation
// 0x0098 (0x0098 - 0x0000)
struct EQS_LastTargetLocation_Context_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackupKey;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Key;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2AIController*                        K2Node_DynamicCast_AsP2AIController;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue_1;           // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_LastTargetLocation_Context_C_ProvideSingleLocation");
static_assert(sizeof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation) == 0x000098, "Wrong size on EQS_LastTargetLocation_Context_C_ProvideSingleLocation");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, BackupKey) == 0x000028, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::BackupKey' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, Key) == 0x000030, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::Key' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, K2Node_DynamicCast_AsCharacter) == 0x000038, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, CallFunc_GetController_ReturnValue) == 0x000048, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, K2Node_DynamicCast_AsP2AIController) == 0x000050, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::K2Node_DynamicCast_AsP2AIController' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000060, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue_1) == 0x000078, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EQS_LastTargetLocation_Context_C_ProvideSingleLocation, CallFunc_IsValidAILocation_ReturnValue) == 0x000090, "Member 'EQS_LastTargetLocation_Context_C_ProvideSingleLocation::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");

}

