#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_ScanStructure

#include "Basic.hpp"

#include "F_TargetPoint_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_ScanStructure.F_ScanStructure
// 0x0048 (0x0048 - 0x0000)
struct FF_ScanStructure final
{
public:
	class UMaterialInstance*                      ScanMaterialInstance_3_B404F42C4EFE593CD3CBB1998E96B7AF; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ScanOrigin_53_06EA5E284F2EC46799E941BAB3F88C78;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve_10_D8DD176C4CCFF025F9523A88485FAB72;         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ScanSpeed_13_DBB4DD134E5747DC6B72149E5F6EB946;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxRadius_15_175A36CC4614AA3B7F382DA86A584406;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableObjectScan_20_C5359F974D07C82C81BAF9B9C70500F0; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCameraPosition_67_204B945F42D2DE4934ABA88B24D3404B; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateOrigin_21_CDB0C6BE4B9AA5FEB1EF888B8C3AE691;  // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FF_TargetPoint>                 TargetPoint_48_3D0DD93E47934280694486A43692F8B3;   // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         ExcludeIndex_65_86158D2A483323AEBEF239BFADE27770;  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_ScanStructure) == 0x000008, "Wrong alignment on FF_ScanStructure");
static_assert(sizeof(FF_ScanStructure) == 0x000048, "Wrong size on FF_ScanStructure");
static_assert(offsetof(FF_ScanStructure, ScanMaterialInstance_3_B404F42C4EFE593CD3CBB1998E96B7AF) == 0x000000, "Member 'FF_ScanStructure::ScanMaterialInstance_3_B404F42C4EFE593CD3CBB1998E96B7AF' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, ScanOrigin_53_06EA5E284F2EC46799E941BAB3F88C78) == 0x000008, "Member 'FF_ScanStructure::ScanOrigin_53_06EA5E284F2EC46799E941BAB3F88C78' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, Curve_10_D8DD176C4CCFF025F9523A88485FAB72) == 0x000010, "Member 'FF_ScanStructure::Curve_10_D8DD176C4CCFF025F9523A88485FAB72' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, ScanSpeed_13_DBB4DD134E5747DC6B72149E5F6EB946) == 0x000018, "Member 'FF_ScanStructure::ScanSpeed_13_DBB4DD134E5747DC6B72149E5F6EB946' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, MaxRadius_15_175A36CC4614AA3B7F382DA86A584406) == 0x000020, "Member 'FF_ScanStructure::MaxRadius_15_175A36CC4614AA3B7F382DA86A584406' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, EnableObjectScan_20_C5359F974D07C82C81BAF9B9C70500F0) == 0x000028, "Member 'FF_ScanStructure::EnableObjectScan_20_C5359F974D07C82C81BAF9B9C70500F0' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, UseCameraPosition_67_204B945F42D2DE4934ABA88B24D3404B) == 0x000029, "Member 'FF_ScanStructure::UseCameraPosition_67_204B945F42D2DE4934ABA88B24D3404B' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, UpdateOrigin_21_CDB0C6BE4B9AA5FEB1EF888B8C3AE691) == 0x00002A, "Member 'FF_ScanStructure::UpdateOrigin_21_CDB0C6BE4B9AA5FEB1EF888B8C3AE691' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, TargetPoint_48_3D0DD93E47934280694486A43692F8B3) == 0x000030, "Member 'FF_ScanStructure::TargetPoint_48_3D0DD93E47934280694486A43692F8B3' has a wrong offset!");
static_assert(offsetof(FF_ScanStructure, ExcludeIndex_65_86158D2A483323AEBEF239BFADE27770) == 0x000040, "Member 'FF_ScanStructure::ExcludeIndex_65_86158D2A483323AEBEF239BFADE27770' has a wrong offset!");

}

