#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_TargetPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct F_TargetPoint.F_TargetPoint
// 0x00C0 (0x00C0 - 0x0000)
struct FF_TargetPoint final
{
public:
	double                                        Delay_21_B0EB87F046BEBB39BBDBC7B89608F614;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Tag_6_31B1680A43AEBFB89143489456A3D644;            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomDepth_27_A41C75474DAFF4CE37D3E2AC0F40DC6A;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HightLightIndex_25_DA96E565470C4FCD308D509303E0F0DA; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor_2_E2B450554552B6E238D324996BE5DA26; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           StrokeColor_9_2575BB4D44E8C67682D066B4E7EC6765;    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Text_22_68F7C77649D565DB3C3A87BCC7475374;          // 0x0038(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLinearColor                           IconColor_33_E59B56E345D01D7E40630FBED4CE5BEE;     // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon_15_43747EA94A913B0E0B5C5BA8E1B00C22;          // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize_18_6F008CC641F4628B7BE524A127E3FB11;      // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LiveUpdate_39_744904F041822925E0C64DB10492AF1E;    // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FF_TargetPoint) == 0x000008, "Wrong alignment on FF_TargetPoint");
static_assert(sizeof(FF_TargetPoint) == 0x0000C0, "Wrong size on FF_TargetPoint");
static_assert(offsetof(FF_TargetPoint, Delay_21_B0EB87F046BEBB39BBDBC7B89608F614) == 0x000000, "Member 'FF_TargetPoint::Delay_21_B0EB87F046BEBB39BBDBC7B89608F614' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, Tag_6_31B1680A43AEBFB89143489456A3D644) == 0x000008, "Member 'FF_TargetPoint::Tag_6_31B1680A43AEBFB89143489456A3D644' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, CustomDepth_27_A41C75474DAFF4CE37D3E2AC0F40DC6A) == 0x000010, "Member 'FF_TargetPoint::CustomDepth_27_A41C75474DAFF4CE37D3E2AC0F40DC6A' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, HightLightIndex_25_DA96E565470C4FCD308D509303E0F0DA) == 0x000014, "Member 'FF_TargetPoint::HightLightIndex_25_DA96E565470C4FCD308D509303E0F0DA' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, BackgroundColor_2_E2B450554552B6E238D324996BE5DA26) == 0x000018, "Member 'FF_TargetPoint::BackgroundColor_2_E2B450554552B6E238D324996BE5DA26' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, StrokeColor_9_2575BB4D44E8C67682D066B4E7EC6765) == 0x000028, "Member 'FF_TargetPoint::StrokeColor_9_2575BB4D44E8C67682D066B4E7EC6765' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, Text_22_68F7C77649D565DB3C3A87BCC7475374) == 0x000038, "Member 'FF_TargetPoint::Text_22_68F7C77649D565DB3C3A87BCC7475374' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, IconColor_33_E59B56E345D01D7E40630FBED4CE5BEE) == 0x000090, "Member 'FF_TargetPoint::IconColor_33_E59B56E345D01D7E40630FBED4CE5BEE' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, Icon_15_43747EA94A913B0E0B5C5BA8E1B00C22) == 0x0000A0, "Member 'FF_TargetPoint::Icon_15_43747EA94A913B0E0B5C5BA8E1B00C22' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, IconSize_18_6F008CC641F4628B7BE524A127E3FB11) == 0x0000A8, "Member 'FF_TargetPoint::IconSize_18_6F008CC641F4628B7BE524A127E3FB11' has a wrong offset!");
static_assert(offsetof(FF_TargetPoint, LiveUpdate_39_744904F041822925E0C64DB10492AF1E) == 0x0000B8, "Member 'FF_TargetPoint::LiveUpdate_39_744904F041822925E0C64DB10492AF1E' has a wrong offset!");

}

