#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ActivateLean

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_ActivateLean.GA_ActivateLean_C.ExecuteUbergraph_GA_ActivateLean
// 0x0020 (0x0020 - 0x0000)
struct GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       CallFunc_GetP2CharacterFromCurrentActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAdaptiveLeanComponent*                 CallFunc_GetAdaptiveLeanComponent_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean) == 0x000008, "Wrong alignment on GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean");
static_assert(sizeof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean) == 0x000020, "Wrong size on GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean");
static_assert(offsetof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean, EntryPoint) == 0x000000, "Member 'GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean, CallFunc_GetP2CharacterFromCurrentActorInfo_ReturnValue) == 0x000008, "Member 'GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean::CallFunc_GetP2CharacterFromCurrentActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean, CallFunc_GetAdaptiveLeanComponent_ReturnValue) == 0x000010, "Member 'GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean::CallFunc_GetAdaptiveLeanComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_ActivateLean_C_ExecuteUbergraph_GA_ActivateLean::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

