#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ADS_Dbno

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_ADS_Dbno.GA_ADS_Dbno_C.ExecuteUbergraph_GA_ADS_Dbno
// 0x0108 (0x0108 - 0x0000)
struct GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2WeaponData*                    CallFunc_GetWeaponDataFromCurrentActorInfo_ReturnValue; // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0018(0x00F0)(ContainsInstancedReference)
};
static_assert(alignof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno) == 0x000008, "Wrong alignment on GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno");
static_assert(sizeof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno) == 0x000108, "Wrong size on GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno");
static_assert(offsetof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno, EntryPoint) == 0x000000, "Member 'GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno, CallFunc_GetWeaponDataFromCurrentActorInfo_ReturnValue) == 0x000008, "Member 'GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno::CallFunc_GetWeaponDataFromCurrentActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000018, "Member 'GA_ADS_Dbno_C_ExecuteUbergraph_GA_ADS_Dbno::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

}

