#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Arm3

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Arm3.GA_Arm3_C.ExecuteUbergraph_GA_Arm3
// 0x0070 (0x0070 - 0x0000)
struct GA_Arm3_C_ExecuteUbergraph_GA_Arm3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	class UP2EquipmentManagerComponent*           CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2UsableSlot*                          CallFunc_GetUsableSlotByTag_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2UtilitySlot*                         K2Node_DynamicCast_AsP2Utility_Slot;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3) == 0x000008, "Wrong alignment on GA_Arm3_C_ExecuteUbergraph_GA_Arm3");
static_assert(sizeof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3) == 0x000070, "Wrong size on GA_Arm3_C_ExecuteUbergraph_GA_Arm3");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, EntryPoint) == 0x000000, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, CallFunc_K2_HasAuthority_ReturnValue) == 0x000004, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue) == 0x000050, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, CallFunc_GetUsableSlotByTag_ReturnValue) == 0x000058, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::CallFunc_GetUsableSlotByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, K2Node_DynamicCast_AsP2Utility_Slot) == 0x000060, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::K2Node_DynamicCast_AsP2Utility_Slot' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_ExecuteUbergraph_GA_Arm3, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'GA_Arm3_C_ExecuteUbergraph_GA_Arm3::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Arm3.GA_Arm3_C.K2_CanActivateAbility
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Arm3_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_K2_CanActivateAbility_RelevantTags;       // 0x0078(0x0020)()
	bool                                          CallFunc_K2_CanActivateAbility_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2EquipmentManagerComponent*           CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2UsableSlot*                          CallFunc_GetUsableSlotByTag_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetActiveUsableSlotTag_ReturnValue;       // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	const class UP2Item*                          CallFunc_GetItemFromSlot_ReturnValue;              // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2Item*>                        CallFunc_GetItemsFromContainersForSlot_OutItems;   // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetItemsFromContainersForSlot_ReturnValue; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Arm3_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Arm3_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Arm3_C_K2_CanActivateAbility) == 0x0000E0, "Wrong size on GA_Arm3_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Arm3_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Arm3_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Arm3_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Arm3_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_K2_CanActivateAbility_RelevantTags) == 0x000078, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_K2_CanActivateAbility_RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_K2_CanActivateAbility_ReturnValue) == 0x000098, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_K2_CanActivateAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue) == 0x0000A0, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetEquipmentManagerUsingActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetUsableSlotByTag_ReturnValue) == 0x0000A8, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetUsableSlotByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetActiveUsableSlotTag_ReturnValue) == 0x0000B0, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetActiveUsableSlotTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetItemFromSlot_ReturnValue) == 0x0000B8, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetItemFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000C0, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetItemsFromContainersForSlot_OutItems) == 0x0000C8, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetItemsFromContainersForSlot_OutItems' has a wrong offset!");
static_assert(offsetof(GA_Arm3_C_K2_CanActivateAbility, CallFunc_GetItemsFromContainersForSlot_ReturnValue) == 0x0000D8, "Member 'GA_Arm3_C_K2_CanActivateAbility::CallFunc_GetItemsFromContainersForSlot_ReturnValue' has a wrong offset!");

}

