#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BioArmor

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_BioArmor.GA_BioArmor_C.ExecuteUbergraph_GA_BioArmor
// 0x00E8 (0x00E8 - 0x0000)
struct GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CheckAbilityCost_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Item*                                CallFunc_GetAssociatedItem_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2Armor*>                       CallFunc_GetArmors_OutArmors;                      // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Armor*                               CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInitialDurability_ReturnValue;         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDurability_ReturnValue;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_WaitDelay_Time_ImplicitCast;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_StartArmorRegen_InRestoreDurabilityPercent_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor) == 0x000008, "Wrong alignment on GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor");
static_assert(sizeof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor) == 0x0000E8, "Wrong size on GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, EntryPoint) == 0x000000, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, K2Node_Event_bWasCancelled) == 0x000020, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_WaitDelay_ReturnValue) == 0x000028, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_K2_CheckAbilityCost_ReturnValue) == 0x00003C, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_K2_CheckAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GetAssociatedItem_ReturnValue) == 0x000040, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GetAssociatedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GetArmors_OutArmors) == 0x000048, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GetArmors_OutArmors' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_K2_CommitAbility_ReturnValue) == 0x000058, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Array_Get_Item) == 0x000060, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GetInitialDurability_ReturnValue) == 0x000068, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GetInitialDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GetDurability_ReturnValue) == 0x00006C, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GetDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000081, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_BooleanAND_ReturnValue) == 0x000082, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000083, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_FMin_ReturnValue) == 0x000088, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000090, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GetTimeSeconds_ReturnValue) == 0x0000A0, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000A9, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AA, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast) == 0x0000B8, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_WaitDelay_Time_ImplicitCast) == 0x0000C0, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_WaitDelay_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0000C8, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0000D8, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor, CallFunc_StartArmorRegen_InRestoreDurabilityPercent_ImplicitCast) == 0x0000E0, "Member 'GA_BioArmor_C_ExecuteUbergraph_GA_BioArmor::CallFunc_StartArmorRegen_InRestoreDurabilityPercent_ImplicitCast' has a wrong offset!");

// Function GA_BioArmor.GA_BioArmor_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_BioArmor_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_BioArmor_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_BioArmor_C_K2_OnEndAbility");
static_assert(sizeof(GA_BioArmor_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_BioArmor_C_K2_OnEndAbility");
static_assert(offsetof(GA_BioArmor_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_BioArmor_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

