#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ConsumeItem

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ConsumeItem.GA_ConsumeItem_C
// 0x0018 (0x0560 - 0x0548)
class UGA_ConsumeItem_C final : public UP2Ability_ConsumeItem
{
public:
	class UAbilityTask_WaitGameplayEvent*         AT_ConsumableDone;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 AT_ConsumableWaitDelay;                            // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_Consume;                                       // 0x0558(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_ConsumeItem_C">();
	}
	static class UGA_ConsumeItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_ConsumeItem_C>();
	}
};
static_assert(alignof(UGA_ConsumeItem_C) == 0x000008, "Wrong alignment on UGA_ConsumeItem_C");
static_assert(sizeof(UGA_ConsumeItem_C) == 0x000560, "Wrong size on UGA_ConsumeItem_C");
static_assert(offsetof(UGA_ConsumeItem_C, AT_ConsumableDone) == 0x000548, "Member 'UGA_ConsumeItem_C::AT_ConsumableDone' has a wrong offset!");
static_assert(offsetof(UGA_ConsumeItem_C, AT_ConsumableWaitDelay) == 0x000550, "Member 'UGA_ConsumeItem_C::AT_ConsumableWaitDelay' has a wrong offset!");
static_assert(offsetof(UGA_ConsumeItem_C, GEH_Consume) == 0x000558, "Member 'UGA_ConsumeItem_C::GEH_Consume' has a wrong offset!");

}

