#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DPV_Accelerate

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_DPV_Accelerate.GA_DPV_Accelerate_C.ExecuteUbergraph_GA_DPV_Accelerate
// 0x0030 (0x0030 - 0x0000)
struct GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate) == 0x000008, "Wrong alignment on GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate");
static_assert(sizeof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate) == 0x000030, "Wrong size on GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, EntryPoint) == 0x000000, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, Temp_real_Variable) == 0x000018, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate, K2Node_Event_bWasCancelled) == 0x000029, "Member 'GA_DPV_Accelerate_C_ExecuteUbergraph_GA_DPV_Accelerate::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_DPV_Accelerate.GA_DPV_Accelerate_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DPV_Accelerate_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DPV_Accelerate_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DPV_Accelerate_C_K2_OnEndAbility");
static_assert(sizeof(GA_DPV_Accelerate_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DPV_Accelerate_C_K2_OnEndAbility");
static_assert(offsetof(GA_DPV_Accelerate_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DPV_Accelerate_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_DPV_Accelerate.GA_DPV_Accelerate_C.OnRelease_953177EF4715425595C294A51C7F2EC7
// 0x0004 (0x0004 - 0x0000)
struct GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7) == 0x000004, "Wrong alignment on GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7");
static_assert(sizeof(GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7) == 0x000004, "Wrong size on GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7");
static_assert(offsetof(GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7, TimeHeld) == 0x000000, "Member 'GA_DPV_Accelerate_C_OnRelease_953177EF4715425595C294A51C7F2EC7::TimeHeld' has a wrong offset!");

}

