#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DPV_Decelerate

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_DPV_Decelerate.GA_DPV_Decelerate_C.ExecuteUbergraph_GA_DPV_Decelerate
// 0x0030 (0x0030 - 0x0000)
struct GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeHeld)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          CallFunc_WaitInputRelease_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate) == 0x000008, "Wrong alignment on GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate");
static_assert(sizeof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate) == 0x000030, "Wrong size on GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, EntryPoint) == 0x000000, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, K2Node_CustomEvent_TimeHeld) == 0x000004, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, Temp_real_Variable) == 0x000018, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, CallFunc_WaitInputRelease_ReturnValue) == 0x000020, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::CallFunc_WaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GA_DPV_Decelerate_C_ExecuteUbergraph_GA_DPV_Decelerate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_DPV_Decelerate.GA_DPV_Decelerate_C.OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631
// 0x0004 (0x0004 - 0x0000)
struct GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631) == 0x000004, "Wrong alignment on GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631");
static_assert(sizeof(GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631) == 0x000004, "Wrong size on GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631");
static_assert(offsetof(GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631, TimeHeld) == 0x000000, "Member 'GA_DPV_Decelerate_C_OnRelease_CC1FE7A840B878FE9F84BBA0D50DA631::TimeHeld' has a wrong offset!");

}

