#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Exfiltrated

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Exfiltrated.GA_Exfiltrated_C.ExecuteUbergraph_GA_Exfiltrated
// 0x0018 (0x0018 - 0x0000)
struct GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityTask_OutOfGame*               CallFunc_SetHeroOutOfGame_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated) == 0x000008, "Wrong alignment on GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated");
static_assert(sizeof(GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated) == 0x000018, "Wrong size on GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated");
static_assert(offsetof(GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated, EntryPoint) == 0x000000, "Member 'GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated, CallFunc_SetHeroOutOfGame_ReturnValue) == 0x000008, "Member 'GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated::CallFunc_SetHeroOutOfGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GA_Exfiltrated_C_ExecuteUbergraph_GA_Exfiltrated::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

