#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Jump

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hero_Jump.GA_Hero_Jump_C
// 0x0020 (0x04D0 - 0x04B0)
class UGA_Hero_Jump_C final : public UP2Ability_Jump
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        JumpTimeOut;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAbilityTask*>                   Async_TaskArray;                                   // 0x04C0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Hero_Jump(int32 EntryPoint)	 // 0xae1e64;
	void K2_ActivateAbility()	 // 0xae1e64;
	void K2_OnEndAbility(bool bWasCancelled)	 // 0xae1e64;
	void OnFinish_60BF1141483C6E813528948B535DBB38()	 // 0xae1e64;
	void OnFinish_7F49E449427B49DEB58D55879B9D23BD()	 // 0xae1e64;
	void OnFinish_865570CD4174651B9A1D15AF5D78C91C()	 // 0xae1e64;
	void Removed_F9FD9C7C4A9E5CF743785BA5DA069E51()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_Hero_Jump_C">();
	}
	static class UGA_Hero_Jump_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_Hero_Jump_C>();
	}
};
static_assert(alignof(UGA_Hero_Jump_C) == 0x000008, "Wrong alignment on UGA_Hero_Jump_C");
static_assert(sizeof(UGA_Hero_Jump_C) == 0x0004D0, "Wrong size on UGA_Hero_Jump_C");
static_assert(offsetof(UGA_Hero_Jump_C, UberGraphFrame) == 0x0004B0, "Member 'UGA_Hero_Jump_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Jump_C, JumpTimeOut) == 0x0004B8, "Member 'UGA_Hero_Jump_C::JumpTimeOut' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Jump_C, Async_TaskArray) == 0x0004C0, "Member 'UGA_Hero_Jump_C::Async_TaskArray' has a wrong offset!");

}

