#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_CrouchInput

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hero_CrouchInput.GA_Hero_CrouchInput_C
// 0x0030 (0x04C0 - 0x0490)
class UGA_Hero_CrouchInput_C final : public UP2Ability
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            GE_CrouchHandle;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToggle;                                         // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          InputReleaseTask;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputPress*            InputPressTask;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CrouchAbility;                                     // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Hero_CrouchInput(int32 EntryPoint)	 // 0xae1e64;
	void K2_ActivateAbility()	 // 0xae1e64;
	void K2_OnEndAbility(bool bWasCancelled)	 // 0xae1e64;
	void OnInputReleased(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilityActivationInfo& ActivationInfo)	 // 0xae1e64;

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_Hero_CrouchInput_C">();
	}
	static class UGA_Hero_CrouchInput_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_Hero_CrouchInput_C>();
	}
};
static_assert(alignof(UGA_Hero_CrouchInput_C) == 0x000008, "Wrong alignment on UGA_Hero_CrouchInput_C");
static_assert(sizeof(UGA_Hero_CrouchInput_C) == 0x0004C0, "Wrong size on UGA_Hero_CrouchInput_C");
static_assert(offsetof(UGA_Hero_CrouchInput_C, UberGraphFrame) == 0x000490, "Member 'UGA_Hero_CrouchInput_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Hero_CrouchInput_C, GE_CrouchHandle) == 0x000498, "Member 'UGA_Hero_CrouchInput_C::GE_CrouchHandle' has a wrong offset!");
static_assert(offsetof(UGA_Hero_CrouchInput_C, bIsToggle) == 0x0004A0, "Member 'UGA_Hero_CrouchInput_C::bIsToggle' has a wrong offset!");
static_assert(offsetof(UGA_Hero_CrouchInput_C, InputReleaseTask) == 0x0004A8, "Member 'UGA_Hero_CrouchInput_C::InputReleaseTask' has a wrong offset!");
static_assert(offsetof(UGA_Hero_CrouchInput_C, InputPressTask) == 0x0004B0, "Member 'UGA_Hero_CrouchInput_C::InputPressTask' has a wrong offset!");
static_assert(offsetof(UGA_Hero_CrouchInput_C, CrouchAbility) == 0x0004B8, "Member 'UGA_Hero_CrouchInput_C::CrouchAbility' has a wrong offset!");

}

