#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Exfil

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hero_Exfil.GA_Hero_Exfil_C
// 0x0018 (0x04E0 - 0x04C8)
class UGA_Hero_Exfil_C final : public UP2Ability_Exfil
{
public:
	class UW_AUV_ExtractionScreen_C*              ExfilWidget;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ExfilHoldTime;                                     // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainingTime;                                     // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_Hero_Exfil_C">();
	}
	static class UGA_Hero_Exfil_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_Hero_Exfil_C>();
	}
};
static_assert(alignof(UGA_Hero_Exfil_C) == 0x000008, "Wrong alignment on UGA_Hero_Exfil_C");
static_assert(sizeof(UGA_Hero_Exfil_C) == 0x0004E0, "Wrong size on UGA_Hero_Exfil_C");
static_assert(offsetof(UGA_Hero_Exfil_C, ExfilWidget) == 0x0004C8, "Member 'UGA_Hero_Exfil_C::ExfilWidget' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Exfil_C, ExfilHoldTime) == 0x0004D0, "Member 'UGA_Hero_Exfil_C::ExfilHoldTime' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Exfil_C, RemainingTime) == 0x0004D4, "Member 'UGA_Hero_Exfil_C::RemainingTime' has a wrong offset!");
static_assert(offsetof(UGA_Hero_Exfil_C, TimerHandle) == 0x0004D8, "Member 'UGA_Hero_Exfil_C::TimerHandle' has a wrong offset!");

}

