#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Death

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Hero_Death.GA_Hero_Death_C.ExecuteUbergraph_GA_Hero_Death
// 0x0368 (0x0368 - 0x0000)
struct GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x00B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0278(0x00F0)(ContainsInstancedReference)
};
static_assert(alignof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death) == 0x000008, "Wrong alignment on GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death");
static_assert(sizeof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death) == 0x000368, "Wrong size on GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, EntryPoint) == 0x000000, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, K2Node_Event_EventData) == 0x000008, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0000B8, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_bBlockingHit) == 0x0001A0, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001A1, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_Time) == 0x0001A4, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_Distance) == 0x0001A8, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_Location) == 0x0001B0, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_ImpactPoint) == 0x0001C8, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_Normal) == 0x0001E0, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_ImpactNormal) == 0x0001F8, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_PhysMat) == 0x000210, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_HitActor) == 0x000218, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_HitComponent) == 0x000220, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_HitBoneName) == 0x000228, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_BoneName) == 0x000230, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_HitItem) == 0x000238, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_ElementIndex) == 0x00023C, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_FaceIndex) == 0x000240, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_TraceStart) == 0x000248, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_BreakHitResult_TraceEnd) == 0x000260, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000278, "Member 'GA_Hero_Death_C_ExecuteUbergraph_GA_Hero_Death::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");

// Function GA_Hero_Death.GA_Hero_Death_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Hero_Death_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Hero_Death_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Hero_Death_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Hero_Death_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Hero_Death_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Hero_Death_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Hero_Death_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

}

