#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_ToggleWorldMap

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Hero_ToggleWorldMap.GA_Hero_ToggleWorldMap_C.ExecuteUbergraph_GA_Hero_ToggleWorldMap
// 0x02A0 (0x02A0 - 0x0000)
struct GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Temp_struct_Variable;                              // 0x0008(0x00F0)(ConstParm, ContainsInstancedReference)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              K2Node_DynamicCast_AsP2Ability_System_Component;   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1; // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              K2Node_DynamicCast_AsP2Ability_System_Component_1; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilitySpecHandle             K2Node_Event_Handle;                               // 0x0124(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0128(0x0048)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         K2Node_Event_ActivationInfo;                       // 0x0170(0x0020)(ConstParm, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_CreateWidgetInHUD_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Temp_struct_Variable_1;                            // 0x01A8(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap) == 0x000008, "Wrong alignment on GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap");
static_assert(sizeof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap) == 0x0002A0, "Wrong size on GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, EntryPoint) == 0x000000, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, Temp_struct_Variable) == 0x000008, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue) == 0x0000F8, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_DynamicCast_AsP2Ability_System_Component) == 0x000100, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_DynamicCast_AsP2Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1) == 0x000110, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::CallFunc_GetAbilitySystemComponentFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_DynamicCast_AsP2Ability_System_Component_1) == 0x000118, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_DynamicCast_AsP2Ability_System_Component_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_Event_Handle) == 0x000124, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_Event_Handle' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_Event_ActorInfo) == 0x000128, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_Event_ActivationInfo) == 0x000170, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_Event_ActivationInfo' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, K2Node_Event_bWasCancelled) == 0x000190, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, CallFunc_CreateWidgetInHUD_ReturnValue) == 0x000198, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::CallFunc_CreateWidgetInHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, CallFunc_GetWidget_ReturnValue) == 0x0001A0, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, Temp_struct_Variable_1) == 0x0001A8, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap, CallFunc_IsValid_ReturnValue) == 0x000298, "Member 'GA_Hero_ToggleWorldMap_C_ExecuteUbergraph_GA_Hero_ToggleWorldMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Hero_ToggleWorldMap.GA_Hero_ToggleWorldMap_C.GetP2HUD
// 0x0070 (0x0070 - 0x0000)
struct GA_Hero_ToggleWorldMap_C_GetP2HUD final
{
public:
	class AP2HUD*                                 InP2HUD;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0048)(ContainsInstancedReference)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HUD*                                 K2Node_DynamicCast_AsP2HUD;                        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_ToggleWorldMap_C_GetP2HUD) == 0x000008, "Wrong alignment on GA_Hero_ToggleWorldMap_C_GetP2HUD");
static_assert(sizeof(GA_Hero_ToggleWorldMap_C_GetP2HUD) == 0x000070, "Wrong size on GA_Hero_ToggleWorldMap_C_GetP2HUD");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, InP2HUD) == 0x000000, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::InP2HUD' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, CallFunc_GetHUD_ReturnValue) == 0x000050, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, K2Node_DynamicCast_AsP2HUD) == 0x000060, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::K2Node_DynamicCast_AsP2HUD' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_GetP2HUD, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'GA_Hero_ToggleWorldMap_C_GetP2HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Hero_ToggleWorldMap.GA_Hero_ToggleWorldMap_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Hero_ToggleWorldMap_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_ToggleWorldMap_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Hero_ToggleWorldMap_C_K2_OnEndAbility");
static_assert(sizeof(GA_Hero_ToggleWorldMap_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Hero_ToggleWorldMap_C_K2_OnEndAbility");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Hero_ToggleWorldMap_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Hero_ToggleWorldMap.GA_Hero_ToggleWorldMap_C.OnInputPressed
// 0x0070 (0x0070 - 0x0000)
struct GA_Hero_ToggleWorldMap_C_OnInputPressed final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0008(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0050(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Hero_ToggleWorldMap_C_OnInputPressed) == 0x000008, "Wrong alignment on GA_Hero_ToggleWorldMap_C_OnInputPressed");
static_assert(sizeof(GA_Hero_ToggleWorldMap_C_OnInputPressed) == 0x000070, "Wrong size on GA_Hero_ToggleWorldMap_C_OnInputPressed");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_OnInputPressed, Handle) == 0x000000, "Member 'GA_Hero_ToggleWorldMap_C_OnInputPressed::Handle' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_OnInputPressed, ActorInfo) == 0x000008, "Member 'GA_Hero_ToggleWorldMap_C_OnInputPressed::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Hero_ToggleWorldMap_C_OnInputPressed, ActivationInfo) == 0x000050, "Member 'GA_Hero_ToggleWorldMap_C_OnInputPressed::ActivationInfo' has a wrong offset!");

}

