#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_ToggleWorldMap

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Hero_ToggleWorldMap.GA_Hero_ToggleWorldMap_C
// 0x0018 (0x04A8 - 0x0490)
class UGA_Hero_ToggleWorldMap_C final : public UP2Ability
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           GameplayCue;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MapActor_C*                         MapActor;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Hero_ToggleWorldMap(int32 EntryPoint)	 // 0xae1e64;
	void GetP2HUD(class AP2HUD** InP2HUD)	 // 0xae1e64;
	void K2_ActivateAbility()	 // 0xae1e64;
	void K2_OnEndAbility(bool bWasCancelled)	 // 0xae1e64;
	void OnInputPressed(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilityActivationInfo& ActivationInfo)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_Hero_ToggleWorldMap_C">();
	}
	static class UGA_Hero_ToggleWorldMap_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_Hero_ToggleWorldMap_C>();
	}
};
static_assert(alignof(UGA_Hero_ToggleWorldMap_C) == 0x000008, "Wrong alignment on UGA_Hero_ToggleWorldMap_C");
static_assert(sizeof(UGA_Hero_ToggleWorldMap_C) == 0x0004A8, "Wrong size on UGA_Hero_ToggleWorldMap_C");
static_assert(offsetof(UGA_Hero_ToggleWorldMap_C, UberGraphFrame) == 0x000490, "Member 'UGA_Hero_ToggleWorldMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Hero_ToggleWorldMap_C, GameplayCue) == 0x000498, "Member 'UGA_Hero_ToggleWorldMap_C::GameplayCue' has a wrong offset!");
static_assert(offsetof(UGA_Hero_ToggleWorldMap_C, MapActor) == 0x0004A0, "Member 'UGA_Hero_ToggleWorldMap_C::MapActor' has a wrong offset!");

}

