#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hero_Exfil

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Hero_Exfil.GA_Hero_Exfil_C.K2_CanActivateAbility
// 0x0088 (0x0088 - 0x0000)
struct GA_Hero_Exfil_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0048(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0050(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0070(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       CallFunc_GetP2CharacterUsingActorInfo_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Hero_Exfil_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Hero_Exfil_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Hero_Exfil_C_K2_CanActivateAbility) == 0x000088, "Wrong size on GA_Hero_Exfil_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, Handle) == 0x000048, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::Handle' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, RelevantTags) == 0x000050, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, ReturnValue) == 0x000070, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, CallFunc_GetP2CharacterUsingActorInfo_ReturnValue) == 0x000078, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::CallFunc_GetP2CharacterUsingActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Hero_Exfil_C_K2_CanActivateAbility, CallFunc_IsValid_ReturnValue_1) == 0x000081, "Member 'GA_Hero_Exfil_C_K2_CanActivateAbility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

