#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MeleeAttack_Processor

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_MeleeAttack_Processor.GA_MeleeAttack_Processor_C.ExecuteUbergraph_GA_MeleeAttack_Processor
// 0x0004 (0x0004 - 0x0000)
struct GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor) == 0x000004, "Wrong alignment on GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor");
static_assert(sizeof(GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor) == 0x000004, "Wrong size on GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor");
static_assert(offsetof(GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor, EntryPoint) == 0x000000, "Member 'GA_MeleeAttack_Processor_C_ExecuteUbergraph_GA_MeleeAttack_Processor::EntryPoint' has a wrong offset!");

// Function GA_MeleeAttack_Processor.GA_MeleeAttack_Processor_C.GetBounceMontageTag
// 0x00C0 (0x00C0 - 0x0000)
struct GA_MeleeAttack_Processor_C_GetBounceMontageTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BounceTag;                                         // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, struct FGameplayTag> BounceMontageMap;                                 // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<struct FGameplayTag, struct FGameplayTag> K2Node_MakeVariable_MakeVariableOutput;           // 0x0060(0x0050)()
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MeleeAttack_Processor_C_GetBounceMontageTag) == 0x000008, "Wrong alignment on GA_MeleeAttack_Processor_C_GetBounceMontageTag");
static_assert(sizeof(GA_MeleeAttack_Processor_C_GetBounceMontageTag) == 0x0000C0, "Wrong size on GA_MeleeAttack_Processor_C_GetBounceMontageTag");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, Tag) == 0x000000, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::Tag' has a wrong offset!");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, BounceTag) == 0x000008, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::BounceTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, BounceMontageMap) == 0x000010, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::BounceMontageMap' has a wrong offset!");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, K2Node_MakeVariable_MakeVariableOutput) == 0x000060, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, CallFunc_Map_Find_Value) == 0x0000B0, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GA_MeleeAttack_Processor_C_GetBounceMontageTag, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'GA_MeleeAttack_Processor_C_GetBounceMontageTag::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

