#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Death

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_NPC_Death.GA_NPC_Death_C.ExecuteUbergraph_GA_NPC_Death
// 0x0090 (0x0090 - 0x0000)
struct GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0008(0x0020)()
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HasAuthority_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NpcCharacter_Default_C*             K2Node_DynamicCast_AsBP_Npc_Character_Default;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTaskOwnerInterface> CallFunc_TaskWaitDelay_TaskOwner_CastInput;  // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UGameplayTask_WaitDelay*                CallFunc_TaskWaitDelay_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TaskWaitDelay_Time_ImplicitCast;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death) == 0x000008, "Wrong alignment on GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death");
static_assert(sizeof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death) == 0x000090, "Wrong size on GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, EntryPoint) == 0x000000, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000008, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000028, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_K2_HasAuthority_ReturnValue) == 0x000030, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_K2_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, K2Node_DynamicCast_AsBP_Npc_Character_Default) == 0x000038, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::K2Node_DynamicCast_AsBP_Npc_Character_Default' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_TaskWaitDelay_TaskOwner_CastInput) == 0x000060, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_TaskWaitDelay_TaskOwner_CastInput' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_TaskWaitDelay_ReturnValue) == 0x000070, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_TaskWaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000078, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death, CallFunc_TaskWaitDelay_Time_ImplicitCast) == 0x00008C, "Member 'GA_NPC_Death_C_ExecuteUbergraph_GA_NPC_Death::CallFunc_TaskWaitDelay_Time_ImplicitCast' has a wrong offset!");

}

