#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Operate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Operate.GA_Operate_C.OnInputPressed
// 0x0070 (0x0070 - 0x0000)
struct GA_Operate_C_OnInputPressed final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0008(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0050(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_Operate_C_OnInputPressed) == 0x000008, "Wrong alignment on GA_Operate_C_OnInputPressed");
static_assert(sizeof(GA_Operate_C_OnInputPressed) == 0x000070, "Wrong size on GA_Operate_C_OnInputPressed");
static_assert(offsetof(GA_Operate_C_OnInputPressed, Handle) == 0x000000, "Member 'GA_Operate_C_OnInputPressed::Handle' has a wrong offset!");
static_assert(offsetof(GA_Operate_C_OnInputPressed, ActorInfo) == 0x000008, "Member 'GA_Operate_C_OnInputPressed::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Operate_C_OnInputPressed, ActivationInfo) == 0x000050, "Member 'GA_Operate_C_OnInputPressed::ActivationInfo' has a wrong offset!");

// Function GA_Operate.GA_Operate_C.ExecuteUbergraph_GA_Operate
// 0x0070 (0x0070 - 0x0000)
struct GA_Operate_C_ExecuteUbergraph_GA_Operate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             K2Node_Event_Handle;                               // 0x0004(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0008(0x0048)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         K2Node_Event_ActivationInfo;                       // 0x0050(0x0020)(ConstParm, NoDestructor)
};
static_assert(alignof(GA_Operate_C_ExecuteUbergraph_GA_Operate) == 0x000008, "Wrong alignment on GA_Operate_C_ExecuteUbergraph_GA_Operate");
static_assert(sizeof(GA_Operate_C_ExecuteUbergraph_GA_Operate) == 0x000070, "Wrong size on GA_Operate_C_ExecuteUbergraph_GA_Operate");
static_assert(offsetof(GA_Operate_C_ExecuteUbergraph_GA_Operate, EntryPoint) == 0x000000, "Member 'GA_Operate_C_ExecuteUbergraph_GA_Operate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Operate_C_ExecuteUbergraph_GA_Operate, K2Node_Event_Handle) == 0x000004, "Member 'GA_Operate_C_ExecuteUbergraph_GA_Operate::K2Node_Event_Handle' has a wrong offset!");
static_assert(offsetof(GA_Operate_C_ExecuteUbergraph_GA_Operate, K2Node_Event_ActorInfo) == 0x000008, "Member 'GA_Operate_C_ExecuteUbergraph_GA_Operate::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Operate_C_ExecuteUbergraph_GA_Operate, K2Node_Event_ActivationInfo) == 0x000050, "Member 'GA_Operate_C_ExecuteUbergraph_GA_Operate::K2Node_Event_ActivationInfo' has a wrong offset!");

}

