#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlaceableDestroy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_PlaceableDestroy.GA_PlaceableDestroy_C.CanDestroyTarget
// 0x0128 (0x0128 - 0x0000)
struct GA_PlaceableDestroy_C_CanDestroyTarget final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     CallFunc_GetCurrentEventData_ReturnValue;          // 0x0010(0x00B0)(ConstParm)
	class AP2FacilitySpot*                        K2Node_DynamicCast_AsP2Facility_Spot;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility*                            CallFunc_GetFacility_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AP2Facility*>                    CallFunc_GetFacilityRequireingThisAsFoundation_OutFacilities; // 0x00E0(0x0010)(ReferenceParm)
	class AP2FacilitySpot*                        K2Node_DynamicCast_AsP2Facility_Spot_1;            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2Facility*                            CallFunc_GetFacility_ReturnValue_1;                // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B[0x5];                                      // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsContentUnlocked_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlaceableDestroy_C_CanDestroyTarget) == 0x000008, "Wrong alignment on GA_PlaceableDestroy_C_CanDestroyTarget");
static_assert(sizeof(GA_PlaceableDestroy_C_CanDestroyTarget) == 0x000128, "Wrong size on GA_PlaceableDestroy_C_CanDestroyTarget");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, InTarget) == 0x000000, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::InTarget' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, ReturnValue) == 0x000008, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_GetCurrentEventData_ReturnValue) == 0x000010, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_GetCurrentEventData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, K2Node_DynamicCast_AsP2Facility_Spot) == 0x0000C0, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::K2Node_DynamicCast_AsP2Facility_Spot' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_GetFacility_ReturnValue) == 0x0000D0, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_GetFacility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_HasTag_ReturnValue) == 0x0000D8, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_GetFacilityRequireingThisAsFoundation_OutFacilities) == 0x0000E0, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_GetFacilityRequireingThisAsFoundation_OutFacilities' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, K2Node_DynamicCast_AsP2Facility_Spot_1) == 0x0000F0, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::K2Node_DynamicCast_AsP2Facility_Spot_1' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_Array_Length_ReturnValue) == 0x0000FC, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_GetFacility_ReturnValue_1) == 0x000100, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_GetFacility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x000108, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_IsValid_ReturnValue_1) == 0x000109, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_ObjectIsA_ReturnValue) == 0x00010A, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue) == 0x000110, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000118, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlaceableDestroy_C_CanDestroyTarget, CallFunc_IsContentUnlocked_ReturnValue) == 0x000120, "Member 'GA_PlaceableDestroy_C_CanDestroyTarget::CallFunc_IsContentUnlocked_ReturnValue' has a wrong offset!");

}

