#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Reload

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Reload.GA_Reload_C.GetReloadPlayRate
// 0x0018 (0x0018 - 0x0000)
struct GA_Reload_C_GetReloadPlayRate final
{
public:
	class UP2Weapon*                              Weapon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatValue_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Reload_C_GetReloadPlayRate) == 0x000008, "Wrong alignment on GA_Reload_C_GetReloadPlayRate");
static_assert(sizeof(GA_Reload_C_GetReloadPlayRate) == 0x000018, "Wrong size on GA_Reload_C_GetReloadPlayRate");
static_assert(offsetof(GA_Reload_C_GetReloadPlayRate, Weapon) == 0x000000, "Member 'GA_Reload_C_GetReloadPlayRate::Weapon' has a wrong offset!");
static_assert(offsetof(GA_Reload_C_GetReloadPlayRate, ReturnValue) == 0x000008, "Member 'GA_Reload_C_GetReloadPlayRate::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Reload_C_GetReloadPlayRate, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x00000C, "Member 'GA_Reload_C_GetReloadPlayRate::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Reload_C_GetReloadPlayRate, CallFunc_GetStatValue_ReturnValue) == 0x000014, "Member 'GA_Reload_C_GetReloadPlayRate::CallFunc_GetStatValue_ReturnValue' has a wrong offset!");

}

