#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpectateNextPlayer

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SpectateNextPlayer.GA_SpectateNextPlayer_C.ExecuteUbergraph_GA_SpectateNextPlayer
// 0x0080 (0x0080 - 0x0000)
struct GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerController*                    CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             K2Node_Event_Handle;                               // 0x0010(0x0004)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              K2Node_Event_ActorInfo;                            // 0x0018(0x0048)(ConstParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         K2Node_Event_ActivationInfo;                       // 0x0060(0x0020)(ConstParm, NoDestructor)
};
static_assert(alignof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer) == 0x000008, "Wrong alignment on GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer");
static_assert(sizeof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer) == 0x000080, "Wrong size on GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer");
static_assert(offsetof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer, EntryPoint) == 0x000000, "Member 'GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer, CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue) == 0x000008, "Member 'GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer::CallFunc_GetP2PlayerControllerFromCurrentActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer, K2Node_Event_Handle) == 0x000010, "Member 'GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer::K2Node_Event_Handle' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer, K2Node_Event_ActorInfo) == 0x000018, "Member 'GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer::K2Node_Event_ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer, K2Node_Event_ActivationInfo) == 0x000060, "Member 'GA_SpectateNextPlayer_C_ExecuteUbergraph_GA_SpectateNextPlayer::K2Node_Event_ActivationInfo' has a wrong offset!");

// Function GA_SpectateNextPlayer.GA_SpectateNextPlayer_C.OnInputReleased
// 0x0070 (0x0070 - 0x0000)
struct GA_SpectateNextPlayer_C_OnInputReleased final
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0008(0x0048)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0050(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(GA_SpectateNextPlayer_C_OnInputReleased) == 0x000008, "Wrong alignment on GA_SpectateNextPlayer_C_OnInputReleased");
static_assert(sizeof(GA_SpectateNextPlayer_C_OnInputReleased) == 0x000070, "Wrong size on GA_SpectateNextPlayer_C_OnInputReleased");
static_assert(offsetof(GA_SpectateNextPlayer_C_OnInputReleased, Handle) == 0x000000, "Member 'GA_SpectateNextPlayer_C_OnInputReleased::Handle' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_OnInputReleased, ActorInfo) == 0x000008, "Member 'GA_SpectateNextPlayer_C_OnInputReleased::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_SpectateNextPlayer_C_OnInputReleased, ActivationInfo) == 0x000050, "Member 'GA_SpectateNextPlayer_C_OnInputReleased::ActivationInfo' has a wrong offset!");

}

