#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SplineMove

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SplineMove.GA_SplineMove_C
// 0x0020 (0x04B0 - 0x0490)
class UGA_SplineMove_C final : public UP2Ability_SplineMove
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAbilityTask*>                   TaskArray;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                SplineMoveTask;                                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SplineMove(int32 EntryPoint)	 // 0xae1e64;
	void K2_ActivateAbility()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GA_SplineMove_C">();
	}
	static class UGA_SplineMove_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGA_SplineMove_C>();
	}
};
static_assert(alignof(UGA_SplineMove_C) == 0x000008, "Wrong alignment on UGA_SplineMove_C");
static_assert(sizeof(UGA_SplineMove_C) == 0x0004B0, "Wrong size on UGA_SplineMove_C");
static_assert(offsetof(UGA_SplineMove_C, UberGraphFrame) == 0x000490, "Member 'UGA_SplineMove_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SplineMove_C, TaskArray) == 0x000498, "Member 'UGA_SplineMove_C::TaskArray' has a wrong offset!");
static_assert(offsetof(UGA_SplineMove_C, SplineMoveTask) == 0x0004A8, "Member 'UGA_SplineMove_C::SplineMoveTask' has a wrong offset!");

}

