#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SplineMove

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_SplineMove.GA_SplineMove_C.ExecuteUbergraph_GA_SplineMove
// 0x0020 (0x0020 - 0x0000)
struct GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2SplineMoveData*                CallFunc_GetActiveSplineMoveData_ReturnValue;      // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove) == 0x000008, "Wrong alignment on GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove");
static_assert(sizeof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove) == 0x000020, "Wrong size on GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, EntryPoint) == 0x000000, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, CallFunc_GetActiveSplineMoveData_ReturnValue) == 0x000010, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::CallFunc_GetActiveSplineMoveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, CallFunc_K2_CommitAbility_ReturnValue) == 0x000019, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove, CallFunc_IsGameplayTagValid_ReturnValue) == 0x00001A, "Member 'GA_SplineMove_C_ExecuteUbergraph_GA_SplineMove::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");

}

