#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Sentry_Flamethrower_Activate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Sentry_Flamethrower_Activate.GA_Sentry_Flamethrower_Activate_C.ExecuteUbergraph_GA_Sentry_Flamethrower_Activate
// 0x0200 (0x0200 - 0x0000)
struct GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0008(0x00F0)(ContainsInstancedReference)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x0110(0x00F0)(ContainsInstancedReference)
};
static_assert(alignof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate) == 0x000008, "Wrong alignment on GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate");
static_assert(sizeof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate) == 0x000200, "Wrong size on GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, EntryPoint) == 0x000000, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000008, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, K2Node_Event_bWasCancelled) == 0x0000F8, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000100, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000108, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate, CallFunc_MakeGameplayCueParameters_ReturnValue_1) == 0x000110, "Member 'GA_Sentry_Flamethrower_Activate_C_ExecuteUbergraph_GA_Sentry_Flamethrower_Activate::CallFunc_MakeGameplayCueParameters_ReturnValue_1' has a wrong offset!");

// Function GA_Sentry_Flamethrower_Activate.GA_Sentry_Flamethrower_Activate_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility");
static_assert(sizeof(GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility");
static_assert(offsetof(GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Sentry_Flamethrower_Activate_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

