#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vault

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Vault.GA_Vault_C.ExecuteUbergraph_GA_Vault
// 0x0014 (0x0014 - 0x0000)
struct GA_Vault_C_ExecuteUbergraph_GA_Vault final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Vault_C_ExecuteUbergraph_GA_Vault) == 0x000004, "Wrong alignment on GA_Vault_C_ExecuteUbergraph_GA_Vault");
static_assert(sizeof(GA_Vault_C_ExecuteUbergraph_GA_Vault) == 0x000014, "Wrong size on GA_Vault_C_ExecuteUbergraph_GA_Vault");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, EntryPoint) == 0x000000, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, K2Node_Event_bWasCancelled) == 0x000006, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000008, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Vault_C_ExecuteUbergraph_GA_Vault, CallFunc_K2_CommitAbility_ReturnValue) == 0x000010, "Member 'GA_Vault_C_ExecuteUbergraph_GA_Vault::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Vault.GA_Vault_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Vault_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Vault_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Vault_C_K2_OnEndAbility");
static_assert(sizeof(GA_Vault_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Vault_C_K2_OnEndAbility");
static_assert(offsetof(GA_Vault_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Vault_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

