#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Game

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Niagara_structs.hpp"


namespace SDK::Params
{

// Function Game.P2Object.BP_GetOuterByClass
// 0x0010 (0x0010 - 0x0000)
struct P2Object_BP_GetOuterByClass final
{
public:
	class UClass*                                 OuterClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_BP_GetOuterByClass) == 0x000008, "Wrong alignment on P2Object_BP_GetOuterByClass");
static_assert(sizeof(P2Object_BP_GetOuterByClass) == 0x000010, "Wrong size on P2Object_BP_GetOuterByClass");
static_assert(offsetof(P2Object_BP_GetOuterByClass, OuterClass) == 0x000000, "Member 'P2Object_BP_GetOuterByClass::OuterClass' has a wrong offset!");
static_assert(offsetof(P2Object_BP_GetOuterByClass, ReturnValue) == 0x000008, "Member 'P2Object_BP_GetOuterByClass::ReturnValue' has a wrong offset!");

// Function Game.P2Object.BP_GetOutermostActor
// 0x0008 (0x0008 - 0x0000)
struct P2Object_BP_GetOutermostActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_BP_GetOutermostActor) == 0x000008, "Wrong alignment on P2Object_BP_GetOutermostActor");
static_assert(sizeof(P2Object_BP_GetOutermostActor) == 0x000008, "Wrong size on P2Object_BP_GetOutermostActor");
static_assert(offsetof(P2Object_BP_GetOutermostActor, ReturnValue) == 0x000000, "Member 'P2Object_BP_GetOutermostActor::ReturnValue' has a wrong offset!");

// Function Game.P2Object.BP_GetOutermostActorComponent
// 0x0008 (0x0008 - 0x0000)
struct P2Object_BP_GetOutermostActorComponent final
{
public:
	class UActorComponent*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_BP_GetOutermostActorComponent) == 0x000008, "Wrong alignment on P2Object_BP_GetOutermostActorComponent");
static_assert(sizeof(P2Object_BP_GetOutermostActorComponent) == 0x000008, "Wrong size on P2Object_BP_GetOutermostActorComponent");
static_assert(offsetof(P2Object_BP_GetOutermostActorComponent, ReturnValue) == 0x000000, "Member 'P2Object_BP_GetOutermostActorComponent::ReturnValue' has a wrong offset!");

// Function Game.P2Object.BP_GetOwner
// 0x0008 (0x0008 - 0x0000)
struct P2Object_BP_GetOwner final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_BP_GetOwner) == 0x000008, "Wrong alignment on P2Object_BP_GetOwner");
static_assert(sizeof(P2Object_BP_GetOwner) == 0x000008, "Wrong size on P2Object_BP_GetOwner");
static_assert(offsetof(P2Object_BP_GetOwner, ReturnValue) == 0x000000, "Member 'P2Object_BP_GetOwner::ReturnValue' has a wrong offset!");

// Function Game.P2Object.GetOwningController
// 0x0008 (0x0008 - 0x0000)
struct P2Object_GetOwningController final
{
public:
	class AController*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_GetOwningController) == 0x000008, "Wrong alignment on P2Object_GetOwningController");
static_assert(sizeof(P2Object_GetOwningController) == 0x000008, "Wrong size on P2Object_GetOwningController");
static_assert(offsetof(P2Object_GetOwningController, ReturnValue) == 0x000000, "Member 'P2Object_GetOwningController::ReturnValue' has a wrong offset!");

// Function Game.P2Object.GetOwningPawn
// 0x0008 (0x0008 - 0x0000)
struct P2Object_GetOwningPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_GetOwningPawn) == 0x000008, "Wrong alignment on P2Object_GetOwningPawn");
static_assert(sizeof(P2Object_GetOwningPawn) == 0x000008, "Wrong size on P2Object_GetOwningPawn");
static_assert(offsetof(P2Object_GetOwningPawn, ReturnValue) == 0x000000, "Member 'P2Object_GetOwningPawn::ReturnValue' has a wrong offset!");

// Function Game.P2Object.GetOwningPlayerController
// 0x0008 (0x0008 - 0x0000)
struct P2Object_GetOwningPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_GetOwningPlayerController) == 0x000008, "Wrong alignment on P2Object_GetOwningPlayerController");
static_assert(sizeof(P2Object_GetOwningPlayerController) == 0x000008, "Wrong size on P2Object_GetOwningPlayerController");
static_assert(offsetof(P2Object_GetOwningPlayerController, ReturnValue) == 0x000000, "Member 'P2Object_GetOwningPlayerController::ReturnValue' has a wrong offset!");

// Function Game.P2Object.GetOwningPlayerState
// 0x0008 (0x0008 - 0x0000)
struct P2Object_GetOwningPlayerState final
{
public:
	class APlayerState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Object_GetOwningPlayerState) == 0x000008, "Wrong alignment on P2Object_GetOwningPlayerState");
static_assert(sizeof(P2Object_GetOwningPlayerState) == 0x000008, "Wrong size on P2Object_GetOwningPlayerState");
static_assert(offsetof(P2Object_GetOwningPlayerState, ReturnValue) == 0x000000, "Member 'P2Object_GetOwningPlayerState::ReturnValue' has a wrong offset!");

// Function Game.P2Item.AddStatTagStack
// 0x000C (0x000C - 0x0000)
struct P2Item_AddStatTagStack final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackCount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_AddStatTagStack) == 0x000004, "Wrong alignment on P2Item_AddStatTagStack");
static_assert(sizeof(P2Item_AddStatTagStack) == 0x00000C, "Wrong size on P2Item_AddStatTagStack");
static_assert(offsetof(P2Item_AddStatTagStack, Tag) == 0x000000, "Member 'P2Item_AddStatTagStack::Tag' has a wrong offset!");
static_assert(offsetof(P2Item_AddStatTagStack, StackCount) == 0x000008, "Member 'P2Item_AddStatTagStack::StackCount' has a wrong offset!");

// Function Game.P2Item.AddTagToContainer
// 0x0008 (0x0008 - 0x0000)
struct P2Item_AddTagToContainer final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_AddTagToContainer) == 0x000004, "Wrong alignment on P2Item_AddTagToContainer");
static_assert(sizeof(P2Item_AddTagToContainer) == 0x000008, "Wrong size on P2Item_AddTagToContainer");
static_assert(offsetof(P2Item_AddTagToContainer, InTag) == 0x000000, "Member 'P2Item_AddTagToContainer::InTag' has a wrong offset!");

// Function Game.P2Item.CanCompatibleItem
// 0x0010 (0x0010 - 0x0000)
struct P2Item_CanCompatibleItem final
{
public:
	class UP2Item*                                InOtherItem;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_CanCompatibleItem) == 0x000008, "Wrong alignment on P2Item_CanCompatibleItem");
static_assert(sizeof(P2Item_CanCompatibleItem) == 0x000010, "Wrong size on P2Item_CanCompatibleItem");
static_assert(offsetof(P2Item_CanCompatibleItem, InOtherItem) == 0x000000, "Member 'P2Item_CanCompatibleItem::InOtherItem' has a wrong offset!");
static_assert(offsetof(P2Item_CanCompatibleItem, ReturnValue) == 0x000008, "Member 'P2Item_CanCompatibleItem::ReturnValue' has a wrong offset!");

// Function Game.P2Item.CanDragFromItemToItem
// 0x0018 (0x0018 - 0x0000)
struct P2Item_CanDragFromItemToItem final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                InDragItem;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInventoryDragType                            OutInventoryDragType;                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_CanDragFromItemToItem) == 0x000008, "Wrong alignment on P2Item_CanDragFromItemToItem");
static_assert(sizeof(P2Item_CanDragFromItemToItem) == 0x000018, "Wrong size on P2Item_CanDragFromItemToItem");
static_assert(offsetof(P2Item_CanDragFromItemToItem, InPlayerController) == 0x000000, "Member 'P2Item_CanDragFromItemToItem::InPlayerController' has a wrong offset!");
static_assert(offsetof(P2Item_CanDragFromItemToItem, InDragItem) == 0x000008, "Member 'P2Item_CanDragFromItemToItem::InDragItem' has a wrong offset!");
static_assert(offsetof(P2Item_CanDragFromItemToItem, OutInventoryDragType) == 0x000010, "Member 'P2Item_CanDragFromItemToItem::OutInventoryDragType' has a wrong offset!");
static_assert(offsetof(P2Item_CanDragFromItemToItem, ReturnValue) == 0x000011, "Member 'P2Item_CanDragFromItemToItem::ReturnValue' has a wrong offset!");

// Function Game.P2Item.CreateMapMarker
// 0x0010 (0x0010 - 0x0000)
struct P2Item_CreateMapMarker final
{
public:
	TSubclassOf<class AP2MapMarkerActor>          InMapMarkerActorClass;                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2MapMarkerActor*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_CreateMapMarker) == 0x000008, "Wrong alignment on P2Item_CreateMapMarker");
static_assert(sizeof(P2Item_CreateMapMarker) == 0x000010, "Wrong size on P2Item_CreateMapMarker");
static_assert(offsetof(P2Item_CreateMapMarker, InMapMarkerActorClass) == 0x000000, "Member 'P2Item_CreateMapMarker::InMapMarkerActorClass' has a wrong offset!");
static_assert(offsetof(P2Item_CreateMapMarker, ReturnValue) == 0x000008, "Member 'P2Item_CreateMapMarker::ReturnValue' has a wrong offset!");

// Function Game.P2Item.IsBoneAnimated
// 0x000C (0x000C - 0x0000)
struct P2Item_IsBoneAnimated final
{
public:
	class FName                                   InBoneName;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_IsBoneAnimated) == 0x000004, "Wrong alignment on P2Item_IsBoneAnimated");
static_assert(sizeof(P2Item_IsBoneAnimated) == 0x00000C, "Wrong size on P2Item_IsBoneAnimated");
static_assert(offsetof(P2Item_IsBoneAnimated, InBoneName) == 0x000000, "Member 'P2Item_IsBoneAnimated::InBoneName' has a wrong offset!");
static_assert(offsetof(P2Item_IsBoneAnimated, ReturnValue) == 0x000008, "Member 'P2Item_IsBoneAnimated::ReturnValue' has a wrong offset!");

// Function Game.P2Item.OnAnySlotsChangedWhenPickupable
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnAnySlotsChangedWhenPickupable final
{
public:
	class UP2Item*                                InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnAnySlotsChangedWhenPickupable) == 0x000008, "Wrong alignment on P2Item_OnAnySlotsChangedWhenPickupable");
static_assert(sizeof(P2Item_OnAnySlotsChangedWhenPickupable) == 0x000008, "Wrong size on P2Item_OnAnySlotsChangedWhenPickupable");
static_assert(offsetof(P2Item_OnAnySlotsChangedWhenPickupable, InItem) == 0x000000, "Member 'P2Item_OnAnySlotsChangedWhenPickupable::InItem' has a wrong offset!");

// Function Game.P2Item.OnArmorDurabilityChanged
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnArmorDurabilityChanged final
{
public:
	float                                         InNewValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InOldValue;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnArmorDurabilityChanged) == 0x000004, "Wrong alignment on P2Item_OnArmorDurabilityChanged");
static_assert(sizeof(P2Item_OnArmorDurabilityChanged) == 0x000008, "Wrong size on P2Item_OnArmorDurabilityChanged");
static_assert(offsetof(P2Item_OnArmorDurabilityChanged, InNewValue) == 0x000000, "Member 'P2Item_OnArmorDurabilityChanged::InNewValue' has a wrong offset!");
static_assert(offsetof(P2Item_OnArmorDurabilityChanged, InOldValue) == 0x000004, "Member 'P2Item_OnArmorDurabilityChanged::InOldValue' has a wrong offset!");

// Function Game.P2Item.OnChildSlotItemChanged
// 0x0018 (0x0018 - 0x0000)
struct P2Item_OnChildSlotItemChanged final
{
public:
	class UP2Slot*                                InSlot;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                InNewItem;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                InOldItem;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnChildSlotItemChanged) == 0x000008, "Wrong alignment on P2Item_OnChildSlotItemChanged");
static_assert(sizeof(P2Item_OnChildSlotItemChanged) == 0x000018, "Wrong size on P2Item_OnChildSlotItemChanged");
static_assert(offsetof(P2Item_OnChildSlotItemChanged, InSlot) == 0x000000, "Member 'P2Item_OnChildSlotItemChanged::InSlot' has a wrong offset!");
static_assert(offsetof(P2Item_OnChildSlotItemChanged, InNewItem) == 0x000008, "Member 'P2Item_OnChildSlotItemChanged::InNewItem' has a wrong offset!");
static_assert(offsetof(P2Item_OnChildSlotItemChanged, InOldItem) == 0x000010, "Member 'P2Item_OnChildSlotItemChanged::InOldItem' has a wrong offset!");

// Function Game.P2Item.OnDropFailedMessageItemToItem
// 0x0018 (0x0018 - 0x0000)
struct P2Item_OnDropFailedMessageItemToItem final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                InDropItem;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInventoryDragType                            InventoryDragType;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_OnDropFailedMessageItemToItem) == 0x000008, "Wrong alignment on P2Item_OnDropFailedMessageItemToItem");
static_assert(sizeof(P2Item_OnDropFailedMessageItemToItem) == 0x000018, "Wrong size on P2Item_OnDropFailedMessageItemToItem");
static_assert(offsetof(P2Item_OnDropFailedMessageItemToItem, InPlayerController) == 0x000000, "Member 'P2Item_OnDropFailedMessageItemToItem::InPlayerController' has a wrong offset!");
static_assert(offsetof(P2Item_OnDropFailedMessageItemToItem, InDropItem) == 0x000008, "Member 'P2Item_OnDropFailedMessageItemToItem::InDropItem' has a wrong offset!");
static_assert(offsetof(P2Item_OnDropFailedMessageItemToItem, InventoryDragType) == 0x000010, "Member 'P2Item_OnDropFailedMessageItemToItem::InventoryDragType' has a wrong offset!");

// Function Game.P2Item.OnDropFromItemToItem
// 0x0018 (0x0018 - 0x0000)
struct P2Item_OnDropFromItemToItem final
{
public:
	class APlayerController*                      InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                InDropItem;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInventoryDragType                            InventoryDragType;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_OnDropFromItemToItem) == 0x000008, "Wrong alignment on P2Item_OnDropFromItemToItem");
static_assert(sizeof(P2Item_OnDropFromItemToItem) == 0x000018, "Wrong size on P2Item_OnDropFromItemToItem");
static_assert(offsetof(P2Item_OnDropFromItemToItem, InPlayerController) == 0x000000, "Member 'P2Item_OnDropFromItemToItem::InPlayerController' has a wrong offset!");
static_assert(offsetof(P2Item_OnDropFromItemToItem, InDropItem) == 0x000008, "Member 'P2Item_OnDropFromItemToItem::InDropItem' has a wrong offset!");
static_assert(offsetof(P2Item_OnDropFromItemToItem, InventoryDragType) == 0x000010, "Member 'P2Item_OnDropFromItemToItem::InventoryDragType' has a wrong offset!");

// Function Game.P2Item.OnRep_Armor
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnRep_Armor final
{
public:
	class UP2Armor*                               InOldArmor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_Armor) == 0x000008, "Wrong alignment on P2Item_OnRep_Armor");
static_assert(sizeof(P2Item_OnRep_Armor) == 0x000008, "Wrong size on P2Item_OnRep_Armor");
static_assert(offsetof(P2Item_OnRep_Armor, InOldArmor) == 0x000000, "Member 'P2Item_OnRep_Armor::InOldArmor' has a wrong offset!");

// Function Game.P2Item.OnRep_Data
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnRep_Data final
{
public:
	const class UP2ItemData*                      InOldData;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_Data) == 0x000008, "Wrong alignment on P2Item_OnRep_Data");
static_assert(sizeof(P2Item_OnRep_Data) == 0x000008, "Wrong size on P2Item_OnRep_Data");
static_assert(offsetof(P2Item_OnRep_Data, InOldData) == 0x000000, "Member 'P2Item_OnRep_Data::InOldData' has a wrong offset!");

// Function Game.P2Item.OnRep_ItemSkin
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnRep_ItemSkin final
{
public:
	const class UP2ItemSkin*                      InOld;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_ItemSkin) == 0x000008, "Wrong alignment on P2Item_OnRep_ItemSkin");
static_assert(sizeof(P2Item_OnRep_ItemSkin) == 0x000008, "Wrong size on P2Item_OnRep_ItemSkin");
static_assert(offsetof(P2Item_OnRep_ItemSkin, InOld) == 0x000000, "Member 'P2Item_OnRep_ItemSkin::InOld' has a wrong offset!");

// Function Game.P2Item.OnRep_ItemSkinsContainer
// 0x0008 (0x0008 - 0x0000)
struct P2Item_OnRep_ItemSkinsContainer final
{
public:
	const class UP2ItemSkinContainer*             InOld;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_ItemSkinsContainer) == 0x000008, "Wrong alignment on P2Item_OnRep_ItemSkinsContainer");
static_assert(sizeof(P2Item_OnRep_ItemSkinsContainer) == 0x000008, "Wrong size on P2Item_OnRep_ItemSkinsContainer");
static_assert(offsetof(P2Item_OnRep_ItemSkinsContainer, InOld) == 0x000000, "Member 'P2Item_OnRep_ItemSkinsContainer::InOld' has a wrong offset!");

// Function Game.P2Item.OnRep_SearchedPlayers
// 0x0010 (0x0010 - 0x0000)
struct P2Item_OnRep_SearchedPlayers final
{
public:
	TArray<class AP2HeroCharacter*>               InOldPlayers;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_SearchedPlayers) == 0x000008, "Wrong alignment on P2Item_OnRep_SearchedPlayers");
static_assert(sizeof(P2Item_OnRep_SearchedPlayers) == 0x000010, "Wrong size on P2Item_OnRep_SearchedPlayers");
static_assert(offsetof(P2Item_OnRep_SearchedPlayers, InOldPlayers) == 0x000000, "Member 'P2Item_OnRep_SearchedPlayers::InOldPlayers' has a wrong offset!");

// Function Game.P2Item.OnRep_SkinSlotPresets
// 0x0010 (0x0010 - 0x0000)
struct P2Item_OnRep_SkinSlotPresets final
{
public:
	TArray<class UP2SkinSlotPreset*>              InOld;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_SkinSlotPresets) == 0x000008, "Wrong alignment on P2Item_OnRep_SkinSlotPresets");
static_assert(sizeof(P2Item_OnRep_SkinSlotPresets) == 0x000010, "Wrong size on P2Item_OnRep_SkinSlotPresets");
static_assert(offsetof(P2Item_OnRep_SkinSlotPresets, InOld) == 0x000000, "Member 'P2Item_OnRep_SkinSlotPresets::InOld' has a wrong offset!");

// Function Game.P2Item.OnRep_Slots
// 0x0010 (0x0010 - 0x0000)
struct P2Item_OnRep_Slots final
{
public:
	TArray<class UP2Slot*>                        InOldSlots;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_Slots) == 0x000008, "Wrong alignment on P2Item_OnRep_Slots");
static_assert(sizeof(P2Item_OnRep_Slots) == 0x000010, "Wrong size on P2Item_OnRep_Slots");
static_assert(offsetof(P2Item_OnRep_Slots, InOldSlots) == 0x000000, "Member 'P2Item_OnRep_Slots::InOldSlots' has a wrong offset!");

// Function Game.P2Item.OnRep_TagContainer
// 0x0020 (0x0020 - 0x0000)
struct P2Item_OnRep_TagContainer final
{
public:
	struct FGameplayTagContainer                  InOldTagContainer;                                 // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_OnRep_TagContainer) == 0x000008, "Wrong alignment on P2Item_OnRep_TagContainer");
static_assert(sizeof(P2Item_OnRep_TagContainer) == 0x000020, "Wrong size on P2Item_OnRep_TagContainer");
static_assert(offsetof(P2Item_OnRep_TagContainer, InOldTagContainer) == 0x000000, "Member 'P2Item_OnRep_TagContainer::InOldTagContainer' has a wrong offset!");

// Function Game.P2Item.RemoveStatTagStack
// 0x000C (0x000C - 0x0000)
struct P2Item_RemoveStatTagStack final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackCount;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_RemoveStatTagStack) == 0x000004, "Wrong alignment on P2Item_RemoveStatTagStack");
static_assert(sizeof(P2Item_RemoveStatTagStack) == 0x00000C, "Wrong size on P2Item_RemoveStatTagStack");
static_assert(offsetof(P2Item_RemoveStatTagStack, Tag) == 0x000000, "Member 'P2Item_RemoveStatTagStack::Tag' has a wrong offset!");
static_assert(offsetof(P2Item_RemoveStatTagStack, StackCount) == 0x000008, "Member 'P2Item_RemoveStatTagStack::StackCount' has a wrong offset!");

// Function Game.P2Item.RemoveTagFromContainer
// 0x0008 (0x0008 - 0x0000)
struct P2Item_RemoveTagFromContainer final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_RemoveTagFromContainer) == 0x000004, "Wrong alignment on P2Item_RemoveTagFromContainer");
static_assert(sizeof(P2Item_RemoveTagFromContainer) == 0x000008, "Wrong size on P2Item_RemoveTagFromContainer");
static_assert(offsetof(P2Item_RemoveTagFromContainer, InTag) == 0x000000, "Member 'P2Item_RemoveTagFromContainer::InTag' has a wrong offset!");

// Function Game.P2Item.SetInventoryOccupation
// 0x0018 (0x0018 - 0x0000)
struct P2Item_SetInventoryOccupation final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplitPart;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOccupiedByInventory;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           User;                                              // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_SetInventoryOccupation) == 0x000008, "Wrong alignment on P2Item_SetInventoryOccupation");
static_assert(sizeof(P2Item_SetInventoryOccupation) == 0x000018, "Wrong size on P2Item_SetInventoryOccupation");
static_assert(offsetof(P2Item_SetInventoryOccupation, Duration) == 0x000000, "Member 'P2Item_SetInventoryOccupation::Duration' has a wrong offset!");
static_assert(offsetof(P2Item_SetInventoryOccupation, SplitPart) == 0x000004, "Member 'P2Item_SetInventoryOccupation::SplitPart' has a wrong offset!");
static_assert(offsetof(P2Item_SetInventoryOccupation, bIsOccupiedByInventory) == 0x000008, "Member 'P2Item_SetInventoryOccupation::bIsOccupiedByInventory' has a wrong offset!");
static_assert(offsetof(P2Item_SetInventoryOccupation, User) == 0x000010, "Member 'P2Item_SetInventoryOccupation::User' has a wrong offset!");

// Function Game.P2Item.TrySetItemState
// 0x000C (0x000C - 0x0000)
struct P2Item_TrySetItemState final
{
public:
	struct FGameplayTag                           InStateTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_TrySetItemState) == 0x000004, "Wrong alignment on P2Item_TrySetItemState");
static_assert(sizeof(P2Item_TrySetItemState) == 0x00000C, "Wrong size on P2Item_TrySetItemState");
static_assert(offsetof(P2Item_TrySetItemState, InStateTag) == 0x000000, "Member 'P2Item_TrySetItemState::InStateTag' has a wrong offset!");
static_assert(offsetof(P2Item_TrySetItemState, bIsActive) == 0x000008, "Member 'P2Item_TrySetItemState::bIsActive' has a wrong offset!");

// Function Game.P2Item.GetBaseStatValue
// 0x0010 (0x0010 - 0x0000)
struct P2Item_GetBaseStatValue final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDefaultValue;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetBaseStatValue) == 0x000004, "Wrong alignment on P2Item_GetBaseStatValue");
static_assert(sizeof(P2Item_GetBaseStatValue) == 0x000010, "Wrong size on P2Item_GetBaseStatValue");
static_assert(offsetof(P2Item_GetBaseStatValue, InTag) == 0x000000, "Member 'P2Item_GetBaseStatValue::InTag' has a wrong offset!");
static_assert(offsetof(P2Item_GetBaseStatValue, InDefaultValue) == 0x000008, "Member 'P2Item_GetBaseStatValue::InDefaultValue' has a wrong offset!");
static_assert(offsetof(P2Item_GetBaseStatValue, ReturnValue) == 0x00000C, "Member 'P2Item_GetBaseStatValue::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetDisplayDurability
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetDisplayDurability final
{
public:
	EP2DisplayDurabilityType                      DisplayDurabilityType;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetDisplayDurability) == 0x000004, "Wrong alignment on P2Item_GetDisplayDurability");
static_assert(sizeof(P2Item_GetDisplayDurability) == 0x000008, "Wrong size on P2Item_GetDisplayDurability");
static_assert(offsetof(P2Item_GetDisplayDurability, DisplayDurabilityType) == 0x000000, "Member 'P2Item_GetDisplayDurability::DisplayDurabilityType' has a wrong offset!");
static_assert(offsetof(P2Item_GetDisplayDurability, ReturnValue) == 0x000004, "Member 'P2Item_GetDisplayDurability::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetDisplayInitialDurability
// 0x0004 (0x0004 - 0x0000)
struct P2Item_GetDisplayInitialDurability final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetDisplayInitialDurability) == 0x000004, "Wrong alignment on P2Item_GetDisplayInitialDurability");
static_assert(sizeof(P2Item_GetDisplayInitialDurability) == 0x000004, "Wrong size on P2Item_GetDisplayInitialDurability");
static_assert(offsetof(P2Item_GetDisplayInitialDurability, ReturnValue) == 0x000000, "Member 'P2Item_GetDisplayInitialDurability::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetDisplayMaxDurability
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetDisplayMaxDurability final
{
public:
	EP2DisplayDurabilityType                      DisplayDurabilityType;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetDisplayMaxDurability) == 0x000004, "Wrong alignment on P2Item_GetDisplayMaxDurability");
static_assert(sizeof(P2Item_GetDisplayMaxDurability) == 0x000008, "Wrong size on P2Item_GetDisplayMaxDurability");
static_assert(offsetof(P2Item_GetDisplayMaxDurability, DisplayDurabilityType) == 0x000000, "Member 'P2Item_GetDisplayMaxDurability::DisplayDurabilityType' has a wrong offset!");
static_assert(offsetof(P2Item_GetDisplayMaxDurability, ReturnValue) == 0x000004, "Member 'P2Item_GetDisplayMaxDurability::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetFunctionFromClass
// 0x0010 (0x0010 - 0x0000)
struct P2Item_GetFunctionFromClass final
{
public:
	TSubclassOf<class UP2ItemFunction>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2ItemFunction*                  ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetFunctionFromClass) == 0x000008, "Wrong alignment on P2Item_GetFunctionFromClass");
static_assert(sizeof(P2Item_GetFunctionFromClass) == 0x000010, "Wrong size on P2Item_GetFunctionFromClass");
static_assert(offsetof(P2Item_GetFunctionFromClass, InClass) == 0x000000, "Member 'P2Item_GetFunctionFromClass::InClass' has a wrong offset!");
static_assert(offsetof(P2Item_GetFunctionFromClass, ReturnValue) == 0x000008, "Member 'P2Item_GetFunctionFromClass::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetItemData
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetItemData final
{
public:
	const class UP2ItemData*                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetItemData) == 0x000008, "Wrong alignment on P2Item_GetItemData");
static_assert(sizeof(P2Item_GetItemData) == 0x000008, "Wrong size on P2Item_GetItemData");
static_assert(offsetof(P2Item_GetItemData, ReturnValue) == 0x000000, "Member 'P2Item_GetItemData::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetMinStatValue
// 0x0014 (0x0014 - 0x0000)
struct P2Item_GetMinStatValue final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDefaultValue;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InBaseOnly;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetMinStatValue) == 0x000004, "Wrong alignment on P2Item_GetMinStatValue");
static_assert(sizeof(P2Item_GetMinStatValue) == 0x000014, "Wrong size on P2Item_GetMinStatValue");
static_assert(offsetof(P2Item_GetMinStatValue, InTag) == 0x000000, "Member 'P2Item_GetMinStatValue::InTag' has a wrong offset!");
static_assert(offsetof(P2Item_GetMinStatValue, InDefaultValue) == 0x000008, "Member 'P2Item_GetMinStatValue::InDefaultValue' has a wrong offset!");
static_assert(offsetof(P2Item_GetMinStatValue, InBaseOnly) == 0x00000C, "Member 'P2Item_GetMinStatValue::InBaseOnly' has a wrong offset!");
static_assert(offsetof(P2Item_GetMinStatValue, ReturnValue) == 0x000010, "Member 'P2Item_GetMinStatValue::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetSize
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetSize final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetSize) == 0x000004, "Wrong alignment on P2Item_GetSize");
static_assert(sizeof(P2Item_GetSize) == 0x000008, "Wrong size on P2Item_GetSize");
static_assert(offsetof(P2Item_GetSize, ReturnValue) == 0x000000, "Member 'P2Item_GetSize::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetSlots
// 0x0038 (0x0038 - 0x0000)
struct P2Item_GetSlots final
{
public:
	TArray<class UP2Slot*>                        OutSlots;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InRecursive;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2SlotModQueryType                           InModQuery;                                        // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2SlotBlockQueryType                         InBlockQuery;                                      // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  BlockSlotTagContainer;                             // 0x0018(0x0020)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetSlots) == 0x000008, "Wrong alignment on P2Item_GetSlots");
static_assert(sizeof(P2Item_GetSlots) == 0x000038, "Wrong size on P2Item_GetSlots");
static_assert(offsetof(P2Item_GetSlots, OutSlots) == 0x000000, "Member 'P2Item_GetSlots::OutSlots' has a wrong offset!");
static_assert(offsetof(P2Item_GetSlots, InRecursive) == 0x000010, "Member 'P2Item_GetSlots::InRecursive' has a wrong offset!");
static_assert(offsetof(P2Item_GetSlots, InModQuery) == 0x000011, "Member 'P2Item_GetSlots::InModQuery' has a wrong offset!");
static_assert(offsetof(P2Item_GetSlots, InBlockQuery) == 0x000012, "Member 'P2Item_GetSlots::InBlockQuery' has a wrong offset!");
static_assert(offsetof(P2Item_GetSlots, BlockSlotTagContainer) == 0x000018, "Member 'P2Item_GetSlots::BlockSlotTagContainer' has a wrong offset!");

// Function Game.P2Item.GetSlotsFast
// 0x0010 (0x0010 - 0x0000)
struct P2Item_GetSlotsFast final
{
public:
	TArray<class UP2Slot*>                        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetSlotsFast) == 0x000008, "Wrong alignment on P2Item_GetSlotsFast");
static_assert(sizeof(P2Item_GetSlotsFast) == 0x000010, "Wrong size on P2Item_GetSlotsFast");
static_assert(offsetof(P2Item_GetSlotsFast, ReturnValue) == 0x000000, "Member 'P2Item_GetSlotsFast::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetSortPriority
// 0x0004 (0x0004 - 0x0000)
struct P2Item_GetSortPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetSortPriority) == 0x000004, "Wrong alignment on P2Item_GetSortPriority");
static_assert(sizeof(P2Item_GetSortPriority) == 0x000004, "Wrong size on P2Item_GetSortPriority");
static_assert(offsetof(P2Item_GetSortPriority, ReturnValue) == 0x000000, "Member 'P2Item_GetSortPriority::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetStatTagStackCount
// 0x000C (0x000C - 0x0000)
struct P2Item_GetStatTagStackCount final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetStatTagStackCount) == 0x000004, "Wrong alignment on P2Item_GetStatTagStackCount");
static_assert(sizeof(P2Item_GetStatTagStackCount) == 0x00000C, "Wrong size on P2Item_GetStatTagStackCount");
static_assert(offsetof(P2Item_GetStatTagStackCount, Tag) == 0x000000, "Member 'P2Item_GetStatTagStackCount::Tag' has a wrong offset!");
static_assert(offsetof(P2Item_GetStatTagStackCount, ReturnValue) == 0x000008, "Member 'P2Item_GetStatTagStackCount::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetStatValue
// 0x0014 (0x0014 - 0x0000)
struct P2Item_GetStatValue final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDefaultValue;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InBaseOnly;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetStatValue) == 0x000004, "Wrong alignment on P2Item_GetStatValue");
static_assert(sizeof(P2Item_GetStatValue) == 0x000014, "Wrong size on P2Item_GetStatValue");
static_assert(offsetof(P2Item_GetStatValue, InTag) == 0x000000, "Member 'P2Item_GetStatValue::InTag' has a wrong offset!");
static_assert(offsetof(P2Item_GetStatValue, InDefaultValue) == 0x000008, "Member 'P2Item_GetStatValue::InDefaultValue' has a wrong offset!");
static_assert(offsetof(P2Item_GetStatValue, InBaseOnly) == 0x00000C, "Member 'P2Item_GetStatValue::InBaseOnly' has a wrong offset!");
static_assert(offsetof(P2Item_GetStatValue, ReturnValue) == 0x000010, "Member 'P2Item_GetStatValue::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetTag
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetTag) == 0x000004, "Wrong alignment on P2Item_GetTag");
static_assert(sizeof(P2Item_GetTag) == 0x000008, "Wrong size on P2Item_GetTag");
static_assert(offsetof(P2Item_GetTag, ReturnValue) == 0x000000, "Member 'P2Item_GetTag::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetTagContainer
// 0x0020 (0x0020 - 0x0000)
struct P2Item_GetTagContainer final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetTagContainer) == 0x000008, "Wrong alignment on P2Item_GetTagContainer");
static_assert(sizeof(P2Item_GetTagContainer) == 0x000020, "Wrong size on P2Item_GetTagContainer");
static_assert(offsetof(P2Item_GetTagContainer, ReturnValue) == 0x000000, "Member 'P2Item_GetTagContainer::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetValue
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetValue final
{
public:
	bool                                          InBaseOnly;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetValue) == 0x000004, "Wrong alignment on P2Item_GetValue");
static_assert(sizeof(P2Item_GetValue) == 0x000008, "Wrong size on P2Item_GetValue");
static_assert(offsetof(P2Item_GetValue, InBaseOnly) == 0x000000, "Member 'P2Item_GetValue::InBaseOnly' has a wrong offset!");
static_assert(offsetof(P2Item_GetValue, ReturnValue) == 0x000004, "Member 'P2Item_GetValue::ReturnValue' has a wrong offset!");

// Function Game.P2Item.GetWeight
// 0x0008 (0x0008 - 0x0000)
struct P2Item_GetWeight final
{
public:
	bool                                          InBaseOnly;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_GetWeight) == 0x000004, "Wrong alignment on P2Item_GetWeight");
static_assert(sizeof(P2Item_GetWeight) == 0x000008, "Wrong size on P2Item_GetWeight");
static_assert(offsetof(P2Item_GetWeight, InBaseOnly) == 0x000000, "Member 'P2Item_GetWeight::InBaseOnly' has a wrong offset!");
static_assert(offsetof(P2Item_GetWeight, ReturnValue) == 0x000004, "Member 'P2Item_GetWeight::ReturnValue' has a wrong offset!");

// Function Game.P2Item.HasStatTag
// 0x000C (0x000C - 0x0000)
struct P2Item_HasStatTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_HasStatTag) == 0x000004, "Wrong alignment on P2Item_HasStatTag");
static_assert(sizeof(P2Item_HasStatTag) == 0x00000C, "Wrong size on P2Item_HasStatTag");
static_assert(offsetof(P2Item_HasStatTag, Tag) == 0x000000, "Member 'P2Item_HasStatTag::Tag' has a wrong offset!");
static_assert(offsetof(P2Item_HasStatTag, ReturnValue) == 0x000008, "Member 'P2Item_HasStatTag::ReturnValue' has a wrong offset!");

// Function Game.P2Item.IsAvailableForRecipe
// 0x0020 (0x0020 - 0x0000)
struct P2Item_IsAvailableForRecipe final
{
public:
	class FText                                   OutFaildText;                                      // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Item_IsAvailableForRecipe) == 0x000008, "Wrong alignment on P2Item_IsAvailableForRecipe");
static_assert(sizeof(P2Item_IsAvailableForRecipe) == 0x000020, "Wrong size on P2Item_IsAvailableForRecipe");
static_assert(offsetof(P2Item_IsAvailableForRecipe, OutFaildText) == 0x000000, "Member 'P2Item_IsAvailableForRecipe::OutFaildText' has a wrong offset!");
static_assert(offsetof(P2Item_IsAvailableForRecipe, ReturnValue) == 0x000018, "Member 'P2Item_IsAvailableForRecipe::ReturnValue' has a wrong offset!");

// Function Game.P2Item.IsMod
// 0x0001 (0x0001 - 0x0000)
struct P2Item_IsMod final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Item_IsMod) == 0x000001, "Wrong alignment on P2Item_IsMod");
static_assert(sizeof(P2Item_IsMod) == 0x000001, "Wrong size on P2Item_IsMod");
static_assert(offsetof(P2Item_IsMod, ReturnValue) == 0x000000, "Member 'P2Item_IsMod::ReturnValue' has a wrong offset!");

// Function Game.P2Equipment.IsEquipped
// 0x0001 (0x0001 - 0x0000)
struct P2Equipment_IsEquipped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Equipment_IsEquipped) == 0x000001, "Wrong alignment on P2Equipment_IsEquipped");
static_assert(sizeof(P2Equipment_IsEquipped) == 0x000001, "Wrong size on P2Equipment_IsEquipped");
static_assert(offsetof(P2Equipment_IsEquipped, ReturnValue) == 0x000000, "Member 'P2Equipment_IsEquipped::ReturnValue' has a wrong offset!");

// Function Game.P2Usable.OnRep_UsageMode
// 0x0004 (0x0004 - 0x0000)
struct P2Usable_OnRep_UsageMode final
{
public:
	int32                                         InOldUsageMode;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Usable_OnRep_UsageMode) == 0x000004, "Wrong alignment on P2Usable_OnRep_UsageMode");
static_assert(sizeof(P2Usable_OnRep_UsageMode) == 0x000004, "Wrong size on P2Usable_OnRep_UsageMode");
static_assert(offsetof(P2Usable_OnRep_UsageMode, InOldUsageMode) == 0x000000, "Member 'P2Usable_OnRep_UsageMode::InOldUsageMode' has a wrong offset!");

// Function Game.P2Usable.SwitchToNextUsageMode
// 0x0001 (0x0001 - 0x0000)
struct P2Usable_SwitchToNextUsageMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Usable_SwitchToNextUsageMode) == 0x000001, "Wrong alignment on P2Usable_SwitchToNextUsageMode");
static_assert(sizeof(P2Usable_SwitchToNextUsageMode) == 0x000001, "Wrong size on P2Usable_SwitchToNextUsageMode");
static_assert(offsetof(P2Usable_SwitchToNextUsageMode, ReturnValue) == 0x000000, "Member 'P2Usable_SwitchToNextUsageMode::ReturnValue' has a wrong offset!");

// Function Game.P2Usable.SwitchToPrevUsageMode
// 0x0001 (0x0001 - 0x0000)
struct P2Usable_SwitchToPrevUsageMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Usable_SwitchToPrevUsageMode) == 0x000001, "Wrong alignment on P2Usable_SwitchToPrevUsageMode");
static_assert(sizeof(P2Usable_SwitchToPrevUsageMode) == 0x000001, "Wrong size on P2Usable_SwitchToPrevUsageMode");
static_assert(offsetof(P2Usable_SwitchToPrevUsageMode, ReturnValue) == 0x000000, "Member 'P2Usable_SwitchToPrevUsageMode::ReturnValue' has a wrong offset!");

// Function Game.P2Usable.GetGripAnimation
// 0x0010 (0x0010 - 0x0000)
struct P2Usable_GetGripAnimation final
{
public:
	EP2GripType                                   InGripType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInTpp;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Usable_GetGripAnimation) == 0x000008, "Wrong alignment on P2Usable_GetGripAnimation");
static_assert(sizeof(P2Usable_GetGripAnimation) == 0x000010, "Wrong size on P2Usable_GetGripAnimation");
static_assert(offsetof(P2Usable_GetGripAnimation, InGripType) == 0x000000, "Member 'P2Usable_GetGripAnimation::InGripType' has a wrong offset!");
static_assert(offsetof(P2Usable_GetGripAnimation, bInTpp) == 0x000001, "Member 'P2Usable_GetGripAnimation::bInTpp' has a wrong offset!");
static_assert(offsetof(P2Usable_GetGripAnimation, ReturnValue) == 0x000008, "Member 'P2Usable_GetGripAnimation::ReturnValue' has a wrong offset!");

// Function Game.P2Usable.GetGripAnimationData
// 0x0080 (0x0080 - 0x0000)
struct P2Usable_GetGripAnimationData final
{
public:
	EP2GripType                                   InGripType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MeshReturnType                             ReturnType;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutTM;                                             // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UP2GripAnimData*                  ReturnValue;                                       // 0x0070(0x0008)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2Usable_GetGripAnimationData) == 0x000010, "Wrong alignment on P2Usable_GetGripAnimationData");
static_assert(sizeof(P2Usable_GetGripAnimationData) == 0x000080, "Wrong size on P2Usable_GetGripAnimationData");
static_assert(offsetof(P2Usable_GetGripAnimationData, InGripType) == 0x000000, "Member 'P2Usable_GetGripAnimationData::InGripType' has a wrong offset!");
static_assert(offsetof(P2Usable_GetGripAnimationData, ReturnType) == 0x000001, "Member 'P2Usable_GetGripAnimationData::ReturnType' has a wrong offset!");
