#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayAbilities

#include "Basic.hpp"

#include "GameplayTasks_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class GameplayAbilities.AbilityAsync
// 0x0008 (0x0038 - 0x0030)
class UAbilityAsync : public UCancellableAsyncAction
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndAction()	 // 0x3d9afa4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync">();
	}
	static class UAbilityAsync* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync>();
	}
};
static_assert(alignof(UAbilityAsync) == 0x000008, "Wrong alignment on UAbilityAsync");
static_assert(sizeof(UAbilityAsync) == 0x000038, "Wrong size on UAbilityAsync");

// Class GameplayAbilities.GameplayAbility
// 0x0390 (0x03B8 - 0x0028)
class UGameplayAbility : public UObject
{
public:
	uint8                                         Pad_28[0x80];                                      // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x00A8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bReplicateInputDirectly;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RemoteInstanceEnded;                               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x4];                                       // 0x00CA(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayAbilityReplicationPolicy             ReplicationPolicy;                                 // 0x00CE(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityInstancingPolicy              InstancingPolicy;                                  // 0x00CF(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bServerRespectsRemoteAbilityCancellation;          // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRetriggerInstancedAbility;                        // 0x00D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActivationInfo         CurrentActivationInfo;                             // 0x00D8(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayEventData                     CurrentEventData;                                  // 0x00F8(0x00B0)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EGameplayAbilityNetExecutionPolicy            NetExecutionPolicy;                                // 0x01A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityNetSecurityPolicy             NetSecurityPolicy;                                 // 0x01A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            CostGameplayEffectClass;                           // 0x01B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAbilityTriggerData>            AbilityTriggers;                                   // 0x01B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            CooldownGameplayEffectClass;                       // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CancelAbilitiesWithTag;                            // 0x01D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilitiesWithTag;                             // 0x01F0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationOwnedTags;                               // 0x0210(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationRequiredTags;                            // 0x0230(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationBlockedTags;                             // 0x0250(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceRequiredTags;                                // 0x0270(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceBlockedTags;                                 // 0x0290(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetRequiredTags;                                // 0x02B0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetBlockedTags;                                 // 0x02D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x20];                                     // 0x02F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayTask*>                  ActiveTasks;                                       // 0x0310(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentMontage;                                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x60];                                     // 0x0338(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsActive;                                         // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAbilityEnding;                                  // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCancelable;                                     // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlockingOtherAbilities;                         // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39C[0x14];                                     // 0x039C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMarkPendingKillOnAbilityEnd;                      // 0x03B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToOwner(TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks)	 // 0xa2dae4;
	TArray<struct FActiveGameplayEffectHandle> BP_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks)	 // 0x3d980a8;
	void BP_RemoveGameplayEffectFromOwnerWithAssetTags(const struct FGameplayTagContainer& WithAssetTags, int32 StacksToRemove)	 // 0x3d983a0;
	void BP_RemoveGameplayEffectFromOwnerWithGrantedTags(const struct FGameplayTagContainer& WithGrantedTags, int32 StacksToRemove)	 // 0x3d9858c;
	void BP_RemoveGameplayEffectFromOwnerWithHandle(const struct FActiveGameplayEffectHandle& Handle, int32 StacksToRemove)	 // 0x175e578;
	void CancelTaskByInstanceName(class FName InstanceName)	 // 0x3d98cf8;
	void ConfirmTaskByInstanceName(class FName InstanceName, bool bEndTask)	 // 0x3d99018;
	void EndAbilityState(class FName OptionalStateNameToEnd)	 // 0x3d9aedc;
	void EndTaskByInstanceName(class FName InstanceName)	 // 0x3d9afbc;
	void K2_ActivateAbility()	 // 0xae1e64;
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData)	 // 0xae1e64;
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd)	 // 0x1760dd0;
	void K2_AddGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameter, bool bRemoveOnAbilityEnd)	 // 0x3da002c;
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectSpecToOwner(const struct FGameplayEffectSpecHandle& EffectSpecHandle)	 // 0x3da0220;
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& EffectSpecHandle, const struct FGameplayAbilityTargetDataHandle& TargetData)	 // 0x3da03d0;
	void K2_CancelAbility()	 // 0x3da084c;
	bool K2_CheckAbilityCooldown()	 // 0x3da0860;
	bool K2_CheckAbilityCost()	 // 0x3da0888;
	bool K2_CommitAbility()	 // 0x1768c8c;
	bool K2_CommitAbilityCooldown(bool BroadcastCommitEvent, bool ForceCooldown)	 // 0x1331008;
	bool K2_CommitAbilityCost(bool BroadcastCommitEvent)	 // 0x3da08b0;
	void K2_CommitExecute()	 // 0xae1e64;
	void K2_EndAbility()	 // 0x13308a8;
	void K2_EndAbilityLocally()	 // 0x3da0988;
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context)	 // 0x3da09a0;
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters)	 // 0x1723ac4;
	void K2_OnEndAbility(bool bWasCancelled)	 // 0xae1e64;
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag)	 // 0x17e2530;
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerActor()	 // 0x3da11ac;
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerSkeletalMeshComponent(class FName SocketName)	 // 0x3da1244;
	void MontageJumpToSection(class FName SectionName)	 // 0x3da1364;
	void MontageSetNextSectionName(class FName FromSectionName, class FName ToSectionName)	 // 0x3da1424;
	void MontageStop(float OverrideBlendOutTime)	 // 0x3da1594;
	void RemoveGrantedByEffect()	 // 0x3da331c;
	void SendGameplayEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload)	 // 0x1364820;
	void SetCanBeCanceled(bool bCanBeCanceled)	 // 0x3da36e0;
	void SetShouldBlockOtherAbilities(bool bShouldBlockAbilities)	 // 0x3da39a8;

	int32 GetAbilityLevel() const	 // 0x3d9c978;
	int32 GetAbilityLevel_BP(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo) const	 // 0x3d9c99c;
	class UAbilitySystemComponent* GetAbilitySystemComponentFromActorInfo() const	 // 0x3d9cac4;
	struct FGameplayAbilityActorInfo GetActorInfo() const	 // 0xd91350;
	class AActor* GetAvatarActorFromActorInfo() const	 // 0x3d9d8ac;
	struct FGameplayEffectContextHandle GetContextFromOwner(const struct FGameplayAbilityTargetDataHandle& OptionalTargetData) const	 // 0x3d9d8d0;
	float GetCooldownTimeRemaining() const	 // 0x3d9da04;
	class UAnimMontage* GetCurrentMontage() const	 // 0x3d9da2c;
	class UObject* GetCurrentSourceObject() const	 // 0x3d9da44;
	struct FGameplayEffectContextHandle GetGrantedByEffectContext() const	 // 0x3d9e9a0;
	class AActor* GetOwningActorFromActorInfo() const	 // 0x3d9f42c;
	class USkeletalMeshComponent* GetOwningComponentFromActorInfo() const	 // 0x3d9f450;
	class UObject* GetSourceObject_BP(const struct FGameplayAbilitySpecHandle& Handle, const struct FGameplayAbilityActorInfo& ActorInfo) const	 // 0x3d9f488;
	void InvalidateClientPredictionKey() const	 // 0x3d9fcac;
	bool IsLocallyControlled() const	 // 0x17f9208;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const	 // 0xae1e64;
	bool K2_HasAuthority() const	 // 0x180c644;
	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const	 // 0xae1e64;
	struct FGameplayEffectSpecHandle MakeOutgoingGameplayEffectSpec(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level) const	 // 0x3da0d14;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbility">();
	}
	static class UGameplayAbility* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayAbility>();
	}
};
static_assert(alignof(UGameplayAbility) == 0x000008, "Wrong alignment on UGameplayAbility");
static_assert(sizeof(UGameplayAbility) == 0x0003B8, "Wrong size on UGameplayAbility");
static_assert(offsetof(UGameplayAbility, AbilityTags) == 0x0000A8, "Member 'UGameplayAbility::AbilityTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bReplicateInputDirectly) == 0x0000C8, "Member 'UGameplayAbility::bReplicateInputDirectly' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, RemoteInstanceEnded) == 0x0000C9, "Member 'UGameplayAbility::RemoteInstanceEnded' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ReplicationPolicy) == 0x0000CE, "Member 'UGameplayAbility::ReplicationPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, InstancingPolicy) == 0x0000CF, "Member 'UGameplayAbility::InstancingPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bServerRespectsRemoteAbilityCancellation) == 0x0000D0, "Member 'UGameplayAbility::bServerRespectsRemoteAbilityCancellation' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bRetriggerInstancedAbility) == 0x0000D1, "Member 'UGameplayAbility::bRetriggerInstancedAbility' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CurrentActivationInfo) == 0x0000D8, "Member 'UGameplayAbility::CurrentActivationInfo' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CurrentEventData) == 0x0000F8, "Member 'UGameplayAbility::CurrentEventData' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, NetExecutionPolicy) == 0x0001A8, "Member 'UGameplayAbility::NetExecutionPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, NetSecurityPolicy) == 0x0001A9, "Member 'UGameplayAbility::NetSecurityPolicy' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CostGameplayEffectClass) == 0x0001B0, "Member 'UGameplayAbility::CostGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, AbilityTriggers) == 0x0001B8, "Member 'UGameplayAbility::AbilityTriggers' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CooldownGameplayEffectClass) == 0x0001C8, "Member 'UGameplayAbility::CooldownGameplayEffectClass' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CancelAbilitiesWithTag) == 0x0001D0, "Member 'UGameplayAbility::CancelAbilitiesWithTag' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, BlockAbilitiesWithTag) == 0x0001F0, "Member 'UGameplayAbility::BlockAbilitiesWithTag' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationOwnedTags) == 0x000210, "Member 'UGameplayAbility::ActivationOwnedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationRequiredTags) == 0x000230, "Member 'UGameplayAbility::ActivationRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActivationBlockedTags) == 0x000250, "Member 'UGameplayAbility::ActivationBlockedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, SourceRequiredTags) == 0x000270, "Member 'UGameplayAbility::SourceRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, SourceBlockedTags) == 0x000290, "Member 'UGameplayAbility::SourceBlockedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, TargetRequiredTags) == 0x0002B0, "Member 'UGameplayAbility::TargetRequiredTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, TargetBlockedTags) == 0x0002D0, "Member 'UGameplayAbility::TargetBlockedTags' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, ActiveTasks) == 0x000310, "Member 'UGameplayAbility::ActiveTasks' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, CurrentMontage) == 0x000330, "Member 'UGameplayAbility::CurrentMontage' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bIsActive) == 0x000398, "Member 'UGameplayAbility::bIsActive' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bIsAbilityEnding) == 0x000399, "Member 'UGameplayAbility::bIsAbilityEnding' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bIsCancelable) == 0x00039A, "Member 'UGameplayAbility::bIsCancelable' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bIsBlockingOtherAbilities) == 0x00039B, "Member 'UGameplayAbility::bIsBlockingOtherAbilities' has a wrong offset!");
static_assert(offsetof(UGameplayAbility, bMarkPendingKillOnAbilityEnd) == 0x0003B0, "Member 'UGameplayAbility::bMarkPendingKillOnAbilityEnd' has a wrong offset!");

// Class GameplayAbilities.AbilitySystemDebugHUD
// 0x0000 (0x03A0 - 0x03A0)
class AAbilitySystemDebugHUD final : public AHUD
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilitySystemDebugHUD">();
	}
	static class AAbilitySystemDebugHUD* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AAbilitySystemDebugHUD>();
	}
};
static_assert(alignof(AAbilitySystemDebugHUD) == 0x000008, "Wrong alignment on AAbilitySystemDebugHUD");
static_assert(sizeof(AAbilitySystemDebugHUD) == 0x0003A0, "Wrong size on AAbilitySystemDebugHUD");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTag
// 0x0018 (0x0050 - 0x0038)
class UAbilityAsync_WaitGameplayTag : public UAbilityAsync
{
public:
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTag">();
	}
	static class UAbilityAsync_WaitGameplayTag* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTag>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTag) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTag");
static_assert(sizeof(UAbilityAsync_WaitGameplayTag) == 0x000050, "Wrong size on UAbilityAsync_WaitGameplayTag");

// Class GameplayAbilities.AbilityTask
// 0x0018 (0x0080 - 0x0068)
class UAbilityTask : public UGameplayTask
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAbilitySystemComponent> AbilitySystemComponent;                            // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityTask">();
	}
	static class UAbilityTask* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityTask>();
	}
};
static_assert(alignof(UAbilityTask) == 0x000008, "Wrong alignment on UAbilityTask");
static_assert(sizeof(UAbilityTask) == 0x000080, "Wrong size on UAbilityTask");
static_assert(offsetof(UAbilityTask, Ability) == 0x000068, "Member 'UAbilityTask::Ability' has a wrong offset!");
static_assert(offsetof(UAbilityTask, AbilitySystemComponent) == 0x000070, "Member 'UAbilityTask::AbilitySystemComponent' has a wrong offset!");

// Class GameplayAbilities.AbilityTask_WaitTargetData
// 0x0040 (0x00C0 - 0x0080)
class UAbilityTask_WaitTargetData final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> ValidData;   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayAbilityTargetDataHandle& Data)> Cancelled;   // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameplayAbilityTargetActor> TargetClass;                                      // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGameplayAbilityTargetActor*            TargetActor;                                       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitTargetData* WaitTargetData(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, EGameplayTargetingConfirmation ConfirmationType, TSubclassOf<class AGameplayAbilityTargetActor> Class_0)	 // 0x3daa4dc;
	static class UAbilityTask_WaitTargetData* WaitTargetDataUsingActor(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, EGameplayTargetingConfirmation ConfirmationType, class AGameplayAbilityTargetActor* TargetActor_0)	 // 0x3daa728;

	bool BeginSpawningActor(class UGameplayAbility* OwningAbility, TSubclassOf<class AGameplayAbilityTargetActor> Class_0, class AGameplayAbilityTargetActor** SpawnedActor)	 // 0x3d98b54;
	void FinishSpawningActor(class UGameplayAbility* OwningAbility, class AGameplayAbilityTargetActor* SpawnedActor)	 // 0x3d9c4dc;
	void OnTargetDataCancelledCallback(const struct FGameplayAbilityTargetDataHandle& Data)	 // 0x3da2fd0;
	void OnTargetDataReadyCallback(const struct FGameplayAbilityTargetDataHandle& Data)	 // 0x3da3094;
	void OnTargetDataReplicatedCallback(const struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag)	 // 0x3da3158;
	void OnTargetDataReplicatedCancelledCallback()	 // 0x3da3308;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityTask_WaitTargetData">();
	}
	static class UAbilityTask_WaitTargetData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityTask_WaitTargetData>();
	}
};
static_assert(alignof(UAbilityTask_WaitTargetData) == 0x000008, "Wrong alignment on UAbilityTask_WaitTargetData");
static_assert(sizeof(UAbilityTask_WaitTargetData) == 0x0000C0, "Wrong size on UAbilityTask_WaitTargetData");
static_assert(offsetof(UAbilityTask_WaitTargetData, ValidData) == 0x000080, "Member 'UAbilityTask_WaitTargetData::ValidData' has a wrong offset!");
static_assert(offsetof(UAbilityTask_WaitTargetData, Cancelled) == 0x000090, "Member 'UAbilityTask_WaitTargetData::Cancelled' has a wrong offset!");
static_assert(offsetof(UAbilityTask_WaitTargetData, TargetClass) == 0x0000A0, "Member 'UAbilityTask_WaitTargetData::TargetClass' has a wrong offset!");
static_assert(offsetof(UAbilityTask_WaitTargetData, TargetActor) == 0x0000A8, "Member 'UAbilityTask_WaitTargetData::TargetActor' has a wrong offset!");

// Class GameplayAbilities.GameplayEffectUIData
// 0x0000 (0x0028 - 0x0028)
class UGameplayEffectUIData : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayEffectUIData">();
	}
	static class UGameplayEffectUIData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayEffectUIData>();
	}
};
static_assert(alignof(UGameplayEffectUIData) == 0x000008, "Wrong alignment on UGameplayEffectUIData");
static_assert(sizeof(UGameplayEffectUIData) == 0x000028, "Wrong size on UGameplayEffectUIData");

// Class GameplayAbilities.AbilityTask_WaitVelocityChange
// 0x0038 (0x00B8 - 0x0080)
class UAbilityTask_WaitVelocityChange final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void()>              OnVelocityChage;                                   // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMovementComponent*                     CachedMovementComponent;                           // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitVelocityChange* CreateWaitVelocityChange(class UGameplayAbility* OwningAbility, const struct FVector& Direction, float MinimumMagnitude)	 // 0x3d99704;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityTask_WaitVelocityChange">();
	}
	static class UAbilityTask_WaitVelocityChange* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityTask_WaitVelocityChange>();
	}
};
static_assert(alignof(UAbilityTask_WaitVelocityChange) == 0x000008, "Wrong alignment on UAbilityTask_WaitVelocityChange");
static_assert(sizeof(UAbilityTask_WaitVelocityChange) == 0x0000B8, "Wrong size on UAbilityTask_WaitVelocityChange");
static_assert(offsetof(UAbilityTask_WaitVelocityChange, OnVelocityChage) == 0x000080, "Member 'UAbilityTask_WaitVelocityChange::OnVelocityChage' has a wrong offset!");
static_assert(offsetof(UAbilityTask_WaitVelocityChange, CachedMovementComponent) == 0x000090, "Member 'UAbilityTask_WaitVelocityChange::CachedMovementComponent' has a wrong offset!");

// Class GameplayAbilities.GameplayEffectUIData_TextOnly
// 0x0018 (0x0040 - 0x0028)
class UGameplayEffectUIData_TextOnly final : public UGameplayEffectUIData
{
public:
	class FText                                   Description;                                       // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayEffectUIData_TextOnly">();
	}
	static class UGameplayEffectUIData_TextOnly* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayEffectUIData_TextOnly>();
	}
};
static_assert(alignof(UGameplayEffectUIData_TextOnly) == 0x000008, "Wrong alignment on UGameplayEffectUIData_TextOnly");
static_assert(sizeof(UGameplayEffectUIData_TextOnly) == 0x000040, "Wrong size on UGameplayEffectUIData_TextOnly");
static_assert(offsetof(UGameplayEffectUIData_TextOnly, Description) == 0x000028, "Member 'UGameplayEffectUIData_TextOnly::Description' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitAttributeChanged
// 0x0058 (0x0090 - 0x0038)
class UAbilityAsync_WaitAttributeChanged final : public UAbilityAsync
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> Changed; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitAttributeChanged* WaitForAttributeChanged(class AActor* TargetActor, const struct FGameplayAttribute& Attribute, bool OnlyTriggerOnce)	 // 0x3da7078;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitAttributeChanged">();
	}
	static class UAbilityAsync_WaitAttributeChanged* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitAttributeChanged>();
	}
};
static_assert(alignof(UAbilityAsync_WaitAttributeChanged) == 0x000008, "Wrong alignment on UAbilityAsync_WaitAttributeChanged");
static_assert(sizeof(UAbilityAsync_WaitAttributeChanged) == 0x000090, "Wrong size on UAbilityAsync_WaitAttributeChanged");
static_assert(offsetof(UAbilityAsync_WaitAttributeChanged, Changed) == 0x000038, "Member 'UAbilityAsync_WaitAttributeChanged::Changed' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayEffectApplied
// 0x00C0 (0x00F8 - 0x0038)
class UAbilityAsync_WaitGameplayEffectApplied final : public UAbilityAsync
{
public:
	TMulticastInlineDelegate<void(class AActor* Source, const struct FGameplayEffectSpecHandle& SpecHandle, const struct FActiveGameplayEffectHandle& ActiveHandle)> OnApplied; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0xB0];                                      // 0x0048(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitGameplayEffectApplied* WaitGameplayEffectAppliedToActor(class AActor* TargetActor, const struct FGameplayTargetDataFilterHandle& SourceFilter, const struct FGameplayTagRequirements& SourceTagRequirements, const struct FGameplayTagRequirements& TargetTagRequirements, bool TriggerOnce, bool ListenForPeriodicEffect)	 // 0x3da7694;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayEffectApplied">();
	}
	static class UAbilityAsync_WaitGameplayEffectApplied* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayEffectApplied>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayEffectApplied) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayEffectApplied");
static_assert(sizeof(UAbilityAsync_WaitGameplayEffectApplied) == 0x0000F8, "Wrong size on UAbilityAsync_WaitGameplayEffectApplied");
static_assert(offsetof(UAbilityAsync_WaitGameplayEffectApplied, OnApplied) == 0x000038, "Member 'UAbilityAsync_WaitGameplayEffectApplied::OnApplied' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayEvent
// 0x0028 (0x0060 - 0x0038)
class UAbilityAsync_WaitGameplayEvent final : public UAbilityAsync
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayEventData& Payload)> EventReceived;          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityAsync_WaitGameplayEvent* WaitGameplayEventToActor(class AActor* TargetActor, const struct FGameplayTag& EventTag, bool OnlyTriggerOnce, bool OnlyMatchExact)	 // 0x162e0f4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayEvent">();
	}
	static class UAbilityAsync_WaitGameplayEvent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayEvent>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayEvent) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayEvent");
static_assert(sizeof(UAbilityAsync_WaitGameplayEvent) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayEvent");
static_assert(offsetof(UAbilityAsync_WaitGameplayEvent, EventReceived) == 0x000038, "Member 'UAbilityAsync_WaitGameplayEvent::EventReceived' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagAdded
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagAdded final : public UAbilityAsync_WaitGameplayTag
{
public:
	TMulticastInlineDelegate<void()>              Added;                                             // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAbilityAsync_WaitGameplayTagAdded* WaitGameplayTagAddToActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce)	 // 0x3da96f4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagAdded">();
	}
	static class UAbilityAsync_WaitGameplayTagAdded* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagAdded>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagAdded) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagAdded");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagAdded) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayTagAdded");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagAdded, Added) == 0x000050, "Member 'UAbilityAsync_WaitGameplayTagAdded::Added' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagRemoved
// 0x0010 (0x0060 - 0x0050)
class UAbilityAsync_WaitGameplayTagRemoved final : public UAbilityAsync_WaitGameplayTag
{
public:
	TMulticastInlineDelegate<void()>              Removed;                                           // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAbilityAsync_WaitGameplayTagRemoved* WaitGameplayTagRemoveFromActor(class AActor* TargetActor, const struct FGameplayTag& Tag, bool OnlyTriggerOnce)	 // 0x3da9ef4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagRemoved">();
	}
	static class UAbilityAsync_WaitGameplayTagRemoved* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagRemoved>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagRemoved) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagRemoved");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagRemoved) == 0x000060, "Wrong size on UAbilityAsync_WaitGameplayTagRemoved");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagRemoved, Removed) == 0x000050, "Member 'UAbilityAsync_WaitGameplayTagRemoved::Removed' has a wrong offset!");

// Class GameplayAbilities.AbilityAsync_WaitGameplayTagQuery
// 0x00D0 (0x0108 - 0x0038)
class UAbilityAsync_WaitGameplayTagQuery final : public UAbilityAsync
{
public:
	uint8                                         Pad_38[0xC0];                                      // 0x0038(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Triggered;                                         // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UAbilityAsync_WaitGameplayTagQuery* WaitGameplayTagQueryOnActor(class AActor* TargetActor, const struct FGameplayTagQuery& TagQuery, const EWaitGameplayTagQueryTriggerCondition TriggerCondition, const bool bOnlyTriggerOnce)	 // 0x3da9c04;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AbilityAsync_WaitGameplayTagQuery">();
	}
	static class UAbilityAsync_WaitGameplayTagQuery* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAbilityAsync_WaitGameplayTagQuery>();
	}
};
static_assert(alignof(UAbilityAsync_WaitGameplayTagQuery) == 0x000008, "Wrong alignment on UAbilityAsync_WaitGameplayTagQuery");
static_assert(sizeof(UAbilityAsync_WaitGameplayTagQuery) == 0x000108, "Wrong size on UAbilityAsync_WaitGameplayTagQuery");
static_assert(offsetof(UAbilityAsync_WaitGameplayTagQuery, Triggered) == 0x0000F8, "Member 'UAbilityAsync_WaitGameplayTagQuery::Triggered' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilitySet
// 0x0010 (0x0040 - 0x0030)
class UGameplayAbilitySet final : public UDataAsset
{
public:
	TArray<struct FGameplayAbilityBindInfo>       Abilities;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilitySet">();
	}
	static class UGameplayAbilitySet* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayAbilitySet>();
	}
};
static_assert(alignof(UGameplayAbilitySet) == 0x000008, "Wrong alignment on UGameplayAbilitySet");
static_assert(sizeof(UGameplayAbilitySet) == 0x000040, "Wrong size on UGameplayAbilitySet");
static_assert(offsetof(UGameplayAbilitySet, Abilities) == 0x000030, "Member 'UGameplayAbilitySet::Abilities' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor
// 0x0150 (0x0400 - 0x02B0)
class AGameplayAbilityTargetActor : public AActor
{
public:
	bool                                          ShouldProduceTargetDataOnServer;                   // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0xF];                                      // 0x02B1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetingLocationInfo  StartLocation;                                     // 0x02C0(0x00A0)(BlueprintVisible, BlueprintReadOnly, Net, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                         Pad_360[0x30];                                     // 0x0360(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PrimaryPC;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       OwningAbility;                                     // 0x0398(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyOnConfirmation;                            // 0x03A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SourceActor;                                       // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldReticleParameters                ReticleParams;                                     // 0x03B0(0x0018)(BlueprintVisible, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameplayAbilityWorldReticle> ReticleClass;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTargetDataFilterHandle        Filter;                                            // 0x03D0(0x0010)(BlueprintVisible, Net, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x03E0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E1[0x17];                                     // 0x03E1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                GenericDelegateBoundASC;                           // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CancelTargeting()	 // 0x3d98ce0;
	void ConfirmTargeting()	 // 0x3d99000;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor">();
	}
	static class AGameplayAbilityTargetActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor>();
	}
};
static_assert(alignof(AGameplayAbilityTargetActor) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor");
static_assert(sizeof(AGameplayAbilityTargetActor) == 0x000400, "Wrong size on AGameplayAbilityTargetActor");
static_assert(offsetof(AGameplayAbilityTargetActor, ShouldProduceTargetDataOnServer) == 0x0002B0, "Member 'AGameplayAbilityTargetActor::ShouldProduceTargetDataOnServer' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, StartLocation) == 0x0002C0, "Member 'AGameplayAbilityTargetActor::StartLocation' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, PrimaryPC) == 0x000390, "Member 'AGameplayAbilityTargetActor::PrimaryPC' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, OwningAbility) == 0x000398, "Member 'AGameplayAbilityTargetActor::OwningAbility' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, bDestroyOnConfirmation) == 0x0003A0, "Member 'AGameplayAbilityTargetActor::bDestroyOnConfirmation' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, SourceActor) == 0x0003A8, "Member 'AGameplayAbilityTargetActor::SourceActor' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, ReticleParams) == 0x0003B0, "Member 'AGameplayAbilityTargetActor::ReticleParams' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, ReticleClass) == 0x0003C8, "Member 'AGameplayAbilityTargetActor::ReticleClass' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, Filter) == 0x0003D0, "Member 'AGameplayAbilityTargetActor::Filter' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, bDebug) == 0x0003E0, "Member 'AGameplayAbilityTargetActor::bDebug' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor, GenericDelegateBoundASC) == 0x0003F8, "Member 'AGameplayAbilityTargetActor::GenericDelegateBoundASC' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_Trace
// 0x0020 (0x0420 - 0x0400)
#pragma pack(push, 0x1)
class alignas(0x10) AGameplayAbilityTargetActor_Trace : public AGameplayAbilityTargetActor
{
public:
	float                                         MaxRange;                                          // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollisionProfileName                  TraceProfile;                                      // 0x0404(0x0008)(Edit, BlueprintVisible, Config, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bTraceAffectsAimPitch;                             // 0x040C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40D[0xB];                                      // 0x040D(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_Trace">();
	}
	static class AGameplayAbilityTargetActor_Trace* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_Trace>();
	}
};
#pragma pack(pop)
static_assert(alignof(AGameplayAbilityTargetActor_Trace) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_Trace");
static_assert(sizeof(AGameplayAbilityTargetActor_Trace) == 0x000420, "Wrong size on AGameplayAbilityTargetActor_Trace");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, MaxRange) == 0x000400, "Member 'AGameplayAbilityTargetActor_Trace::MaxRange' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, TraceProfile) == 0x000404, "Member 'AGameplayAbilityTargetActor_Trace::TraceProfile' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_Trace, bTraceAffectsAimPitch) == 0x00040C, "Member 'AGameplayAbilityTargetActor_Trace::bTraceAffectsAimPitch' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_GroundTrace
// 0x0020 (0x0440 - 0x0420)
#pragma pack(push, 0x1)
class alignas(0x10) AGameplayAbilityTargetActor_GroundTrace : public AGameplayAbilityTargetActor_Trace
{
public:
	float                                         CollisionRadius;                                   // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionHeight;                                   // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_420[0x18];                                     // 0x0420(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_GroundTrace">();
	}
	static class AGameplayAbilityTargetActor_GroundTrace* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_GroundTrace>();
	}
};
#pragma pack(pop)
static_assert(alignof(AGameplayAbilityTargetActor_GroundTrace) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_GroundTrace");
static_assert(sizeof(AGameplayAbilityTargetActor_GroundTrace) == 0x000440, "Wrong size on AGameplayAbilityTargetActor_GroundTrace");
static_assert(offsetof(AGameplayAbilityTargetActor_GroundTrace, CollisionRadius) == 0x000418, "Member 'AGameplayAbilityTargetActor_GroundTrace::CollisionRadius' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_GroundTrace, CollisionHeight) == 0x00041C, "Member 'AGameplayAbilityTargetActor_GroundTrace::CollisionHeight' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_ActorPlacement
// 0x0010 (0x0450 - 0x0440)
class AGameplayAbilityTargetActor_ActorPlacement final : public AGameplayAbilityTargetActor_GroundTrace
{
public:
	TSubclassOf<class UObject>                    PlacedActorClass;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     PlacedActorMaterial;                               // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_ActorPlacement">();
	}
	static class AGameplayAbilityTargetActor_ActorPlacement* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_ActorPlacement>();
	}
};
static_assert(alignof(AGameplayAbilityTargetActor_ActorPlacement) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_ActorPlacement");
static_assert(sizeof(AGameplayAbilityTargetActor_ActorPlacement) == 0x000450, "Wrong size on AGameplayAbilityTargetActor_ActorPlacement");
static_assert(offsetof(AGameplayAbilityTargetActor_ActorPlacement, PlacedActorClass) == 0x000438, "Member 'AGameplayAbilityTargetActor_ActorPlacement::PlacedActorClass' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityTargetActor_ActorPlacement, PlacedActorMaterial) == 0x000440, "Member 'AGameplayAbilityTargetActor_ActorPlacement::PlacedActorMaterial' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_Radius
// 0x0010 (0x0410 - 0x0400)
class AGameplayAbilityTargetActor_Radius final : public AGameplayAbilityTargetActor
{
public:
	float                                         Radius;                                            // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_404[0xC];                                      // 0x0404(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_Radius">();
	}
	static class AGameplayAbilityTargetActor_Radius* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_Radius>();
	}
};
static_assert(alignof(AGameplayAbilityTargetActor_Radius) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_Radius");
static_assert(sizeof(AGameplayAbilityTargetActor_Radius) == 0x000410, "Wrong size on AGameplayAbilityTargetActor_Radius");
static_assert(offsetof(AGameplayAbilityTargetActor_Radius, Radius) == 0x000400, "Member 'AGameplayAbilityTargetActor_Radius::Radius' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityTargetActor_SingleLineTrace
// 0x0000 (0x0420 - 0x0420)
class AGameplayAbilityTargetActor_SingleLineTrace final : public AGameplayAbilityTargetActor_Trace
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityTargetActor_SingleLineTrace">();
	}
	static class AGameplayAbilityTargetActor_SingleLineTrace* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityTargetActor_SingleLineTrace>();
	}
};
static_assert(alignof(AGameplayAbilityTargetActor_SingleLineTrace) == 0x000010, "Wrong alignment on AGameplayAbilityTargetActor_SingleLineTrace");
static_assert(sizeof(AGameplayAbilityTargetActor_SingleLineTrace) == 0x000420, "Wrong size on AGameplayAbilityTargetActor_SingleLineTrace");

// Class GameplayAbilities.GameplayAbilityWorldReticle
// 0x0030 (0x02E0 - 0x02B0)
class AGameplayAbilityWorldReticle : public AActor
{
public:
	struct FWorldReticleParameters                Parameters;                                        // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bFaceOwnerFlat;                                    // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToTargetedActor;                              // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTargetValid;                                    // 0x02CA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTargetAnActor;                                  // 0x02CB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PrimaryPC;                                         // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TargetingActor;                                    // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void FaceTowardSource(bool bFaceIn2D)	 // 0x3d9bcc8;
	void OnParametersInitialized()	 // 0xae1e64;
	void OnTargetingAnActor(bool bNewValue)	 // 0xae1e64;
	void OnValidTargetChanged(bool bNewValue)	 // 0xae1e64;
	void SetReticleMaterialParamFloat(class FName ParamName, float Value)	 // 0xae1e64;
	void SetReticleMaterialParamVector(class FName ParamName, const struct FVector& Value)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityWorldReticle">();
	}
	static class AGameplayAbilityWorldReticle* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityWorldReticle>();
	}
};
static_assert(alignof(AGameplayAbilityWorldReticle) == 0x000008, "Wrong alignment on AGameplayAbilityWorldReticle");
static_assert(sizeof(AGameplayAbilityWorldReticle) == 0x0002E0, "Wrong size on AGameplayAbilityWorldReticle");
static_assert(offsetof(AGameplayAbilityWorldReticle, Parameters) == 0x0002B0, "Member 'AGameplayAbilityWorldReticle::Parameters' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, bFaceOwnerFlat) == 0x0002C8, "Member 'AGameplayAbilityWorldReticle::bFaceOwnerFlat' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, bSnapToTargetedActor) == 0x0002C9, "Member 'AGameplayAbilityWorldReticle::bSnapToTargetedActor' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, bIsTargetValid) == 0x0002CA, "Member 'AGameplayAbilityWorldReticle::bIsTargetValid' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, bIsTargetAnActor) == 0x0002CB, "Member 'AGameplayAbilityWorldReticle::bIsTargetAnActor' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, PrimaryPC) == 0x0002D0, "Member 'AGameplayAbilityWorldReticle::PrimaryPC' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle, TargetingActor) == 0x0002D8, "Member 'AGameplayAbilityWorldReticle::TargetingActor' has a wrong offset!");

// Class GameplayAbilities.GameplayAbilityWorldReticle_ActorVisualization
// 0x0018 (0x02F8 - 0x02E0)
class AGameplayAbilityWorldReticle_ActorVisualization final : public AGameplayAbilityWorldReticle
{
public:
	class UCapsuleComponent*                      CollisionComponent;                                // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>                VisualizationComponents;                           // 0x02E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbilityWorldReticle_ActorVisualization">();
	}
	static class AGameplayAbilityWorldReticle_ActorVisualization* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGameplayAbilityWorldReticle_ActorVisualization>();
	}
};
static_assert(alignof(AGameplayAbilityWorldReticle_ActorVisualization) == 0x000008, "Wrong alignment on AGameplayAbilityWorldReticle_ActorVisualization");
static_assert(sizeof(AGameplayAbilityWorldReticle_ActorVisualization) == 0x0002F8, "Wrong size on AGameplayAbilityWorldReticle_ActorVisualization");
static_assert(offsetof(AGameplayAbilityWorldReticle_ActorVisualization, CollisionComponent) == 0x0002E0, "Member 'AGameplayAbilityWorldReticle_ActorVisualization::CollisionComponent' has a wrong offset!");
static_assert(offsetof(AGameplayAbilityWorldReticle_ActorVisualization, VisualizationComponents) == 0x0002E8, "Member 'AGameplayAbilityWorldReticle_ActorVisualization::VisualizationComponents' has a wrong offset!");

// Class GameplayAbilities.GameplayAbility_CharacterJump
// 0x0000 (0x03B8 - 0x03B8)
class UGameplayAbility_CharacterJump final : public UGameplayAbility
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayAbility_CharacterJump">();
	}
	static class UGameplayAbility_CharacterJump* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayAbility_CharacterJump>();
	}
};
static_assert(alignof(UGameplayAbility_CharacterJump) == 0x000008, "Wrong alignment on UGameplayAbility_CharacterJump");
static_assert(sizeof(UGameplayAbility_CharacterJump) == 0x0003B8, "Wrong size on UGameplayAbility_CharacterJump");

// Class GameplayAbilities.GameplayAbility_Montage
// 0x0038 (0x03F0 - 0x03B8)
class UGameplayAbility_Montage final : public UGameplayAbility
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x03B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x03C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SectionName;                                       // 0x03C4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayEffect>>    GameplayEffectClassesWhileAnimating;               // 0x03D0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
