#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BlyatMan

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_BlyatMan.GC_BlyatMan_C.OnActive
// 0x0180 (0x0180 - 0x0000)
struct GC_BlyatMan_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      Temp_byte_Variable;                                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0160(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BlyatMan_C_OnActive) == 0x000008, "Wrong alignment on GC_BlyatMan_C_OnActive");
static_assert(sizeof(GC_BlyatMan_C_OnActive) == 0x000180, "Wrong size on GC_BlyatMan_C_OnActive");
static_assert(offsetof(GC_BlyatMan_C_OnActive, MyTarget) == 0x000000, "Member 'GC_BlyatMan_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Parameters) == 0x000008, "Member 'GC_BlyatMan_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_BlyatMan_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_byte_Variable) == 0x0000F9, "Member 'GC_BlyatMan_C_OnActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, K2Node_DynamicCast_AsP2Hero_Character) == 0x000100, "Member 'GC_BlyatMan_C_OnActive::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_BlyatMan_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_object_Variable) == 0x000110, "Member 'GC_BlyatMan_C_OnActive::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_GetLocalRole_ReturnValue) == 0x000118, "Member 'GC_BlyatMan_C_OnActive::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x000119, "Member 'GC_BlyatMan_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_GetMesh3P_ReturnValue) == 0x000120, "Member 'GC_BlyatMan_C_OnActive::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_GetAkComponent_ComponentCreated) == 0x000128, "Member 'GC_BlyatMan_C_OnActive::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_GetAkComponent_ReturnValue) == 0x000130, "Member 'GC_BlyatMan_C_OnActive::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000138, "Member 'GC_BlyatMan_C_OnActive::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'GC_BlyatMan_C_OnActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_object_Variable_1) == 0x000148, "Member 'GC_BlyatMan_C_OnActive::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_object_Variable_2) == 0x000150, "Member 'GC_BlyatMan_C_OnActive::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_object_Variable_3) == 0x000158, "Member 'GC_BlyatMan_C_OnActive::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, Temp_delegate_Variable) == 0x000160, "Member 'GC_BlyatMan_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, K2Node_Select_Default) == 0x000170, "Member 'GC_BlyatMan_C_OnActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnActive, CallFunc_PostAkEvent_ReturnValue) == 0x000178, "Member 'GC_BlyatMan_C_OnActive::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

// Function GC_BlyatMan.GC_BlyatMan_C.OnRemove
// 0x01D0 (0x01D0 - 0x0000)
struct GC_BlyatMan_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_1;                  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAkComponent_ComponentCreated;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0174(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      Temp_byte_Variable;                                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAttachSocketName_ReturnValue;          // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BlyatMan_C_OnRemove) == 0x000008, "Wrong alignment on GC_BlyatMan_C_OnRemove");
static_assert(sizeof(GC_BlyatMan_C_OnRemove) == 0x0001D0, "Wrong size on GC_BlyatMan_C_OnRemove");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_BlyatMan_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Parameters) == 0x000008, "Member 'GC_BlyatMan_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GC_BlyatMan_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_object_Variable) == 0x000100, "Member 'GC_BlyatMan_C_OnRemove::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x000108, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, K2Node_DynamicCast_AsP2Hero_Character) == 0x000110, "Member 'GC_BlyatMan_C_OnRemove::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'GC_BlyatMan_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_object_Variable_1) == 0x000120, "Member 'GC_BlyatMan_C_OnRemove::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetLocalRole_ReturnValue) == 0x000128, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetMesh3P_ReturnValue) == 0x000130, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetMesh3P_ReturnValue_1) == 0x000138, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetMesh3P_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetAkComponent_ComponentCreated) == 0x000140, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetAkComponent_ComponentCreated' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetAkComponent_ReturnValue) == 0x000148, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x000150, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x000151, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetChildrenComponents_Children) == 0x000158, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_object_Variable_2) == 0x000168, "Member 'GC_BlyatMan_C_OnRemove::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_delegate_Variable) == 0x000174, "Member 'GC_BlyatMan_C_OnRemove::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_byte_Variable) == 0x000184, "Member 'GC_BlyatMan_C_OnRemove::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_int_Loop_Counter_Variable) == 0x000188, "Member 'GC_BlyatMan_C_OnRemove::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_Add_IntInt_ReturnValue) == 0x000190, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_int_Array_Index_Variable) == 0x000194, "Member 'GC_BlyatMan_C_OnRemove::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, Temp_object_Variable_3) == 0x000198, "Member 'GC_BlyatMan_C_OnRemove::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x0001A8, "Member 'GC_BlyatMan_C_OnRemove::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'GC_BlyatMan_C_OnRemove::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, K2Node_Select_Default) == 0x0001B8, "Member 'GC_BlyatMan_C_OnRemove::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_PostAkEvent_ReturnValue) == 0x0001C0, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_GetAttachSocketName_ReturnValue) == 0x0001C4, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_GetAttachSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_OnRemove, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001CC, "Member 'GC_BlyatMan_C_OnRemove::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function GC_BlyatMan.GC_BlyatMan_C.WhileActive
// 0x0130 (0x0130 - 0x0000)
struct GC_BlyatMan_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BlyatMan_C_WhileActive) == 0x000008, "Wrong alignment on GC_BlyatMan_C_WhileActive");
static_assert(sizeof(GC_BlyatMan_C_WhileActive) == 0x000130, "Wrong size on GC_BlyatMan_C_WhileActive");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_BlyatMan_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, Parameters) == 0x000008, "Member 'GC_BlyatMan_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GC_BlyatMan_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, CallFunc_GetVelocity_ReturnValue) == 0x000100, "Member 'GC_BlyatMan_C_WhileActive::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, CallFunc_WhileActive_ReturnValue) == 0x000118, "Member 'GC_BlyatMan_C_WhileActive::CallFunc_WhileActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, CallFunc_VSize_ReturnValue) == 0x000120, "Member 'GC_BlyatMan_C_WhileActive::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BlyatMan_C_WhileActive, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000128, "Member 'GC_BlyatMan_C_WhileActive::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");

}

