#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ChargeStart_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_ChargeStart_Base.GC_ChargeStart_Base_C.OnExecute
// 0x0118 (0x0118 - 0x0000)
struct GC_ChargeStart_Base_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MontagePlayFromTag_ReturnValue;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostLocalRemoteEvents_PlayingID;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ChargeStart_Base_C_OnExecute) == 0x000008, "Wrong alignment on GC_ChargeStart_Base_C_OnExecute");
static_assert(sizeof(GC_ChargeStart_Base_C_OnExecute) == 0x000118, "Wrong size on GC_ChargeStart_Base_C_OnExecute");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_ChargeStart_Base_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, Parameters) == 0x000008, "Member 'GC_ChargeStart_Base_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_ChargeStart_Base_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F9, "Member 'GC_ChargeStart_Base_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, K2Node_DynamicCast_AsP2Hero_Character) == 0x000100, "Member 'GC_ChargeStart_Base_C_OnExecute::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GC_ChargeStart_Base_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, CallFunc_MontagePlayFromTag_ReturnValue) == 0x00010C, "Member 'GC_ChargeStart_Base_C_OnExecute::CallFunc_MontagePlayFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ChargeStart_Base_C_OnExecute, CallFunc_PostLocalRemoteEvents_PlayingID) == 0x000110, "Member 'GC_ChargeStart_Base_C_OnExecute::CallFunc_PostLocalRemoteEvents_PlayingID' has a wrong offset!");

}

