#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ChargeCancel_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_ChargeCancel_Base.GC_ChargeCancel_Base_C
// 0x0020 (0x0060 - 0x0040)
class UGC_ChargeCancel_Base_C : public UGameplayCueNotify_Static
{
public:
	struct FGameplayTag                           MontageTag;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Enemy_Event;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Allied_Event;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Local_Event;                                       // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_ChargeCancel_Base_C">();
	}
	static class UGC_ChargeCancel_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_ChargeCancel_Base_C>();
	}
};
static_assert(alignof(UGC_ChargeCancel_Base_C) == 0x000008, "Wrong alignment on UGC_ChargeCancel_Base_C");
static_assert(sizeof(UGC_ChargeCancel_Base_C) == 0x000060, "Wrong size on UGC_ChargeCancel_Base_C");
static_assert(offsetof(UGC_ChargeCancel_Base_C, MontageTag) == 0x000040, "Member 'UGC_ChargeCancel_Base_C::MontageTag' has a wrong offset!");
static_assert(offsetof(UGC_ChargeCancel_Base_C, Remote_Enemy_Event) == 0x000048, "Member 'UGC_ChargeCancel_Base_C::Remote_Enemy_Event' has a wrong offset!");
static_assert(offsetof(UGC_ChargeCancel_Base_C, Remote_Allied_Event) == 0x000050, "Member 'UGC_ChargeCancel_Base_C::Remote_Allied_Event' has a wrong offset!");
static_assert(offsetof(UGC_ChargeCancel_Base_C, Local_Event) == 0x000058, "Member 'UGC_ChargeCancel_Base_C::Local_Event' has a wrong offset!");

}

