#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage_Falling

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Damage_Falling.GC_Damage_Falling_C.OnExecute
// 0x01B0 (0x01B0 - 0x0000)
struct GC_Damage_Falling_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_1;           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_2;                           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Damage_Falling_C_OnExecute) == 0x000008, "Wrong alignment on GC_Damage_Falling_C_OnExecute");
static_assert(sizeof(GC_Damage_Falling_C_OnExecute) == 0x0001B0, "Wrong size on GC_Damage_Falling_C_OnExecute");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Damage_Falling_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Damage_Falling_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Damage_Falling_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_string_Variable) == 0x000100, "Member 'GC_Damage_Falling_C_OnExecute::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000110, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_DynamicCast_AsP2Base_Character) == 0x000118, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_DynamicCast_AsP2Base_Character_1) == 0x000128, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_DynamicCast_AsP2Base_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_bool_Variable) == 0x000131, "Member 'GC_Damage_Falling_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_GetHealth_ReturnValue) == 0x000134, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_IsDead_ReturnValue) == 0x000138, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000139, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00013A, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_int_Variable) == 0x00013C, "Member 'GC_Damage_Falling_C_OnExecute::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_int_Variable_1) == 0x000140, "Member 'GC_Damage_Falling_C_OnExecute::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_bool_Variable_1) == 0x000144, "Member 'GC_Damage_Falling_C_OnExecute::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_Select_Default) == 0x000148, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_int_Variable_2) == 0x00014C, "Member 'GC_Damage_Falling_C_OnExecute::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_string_Variable_1) == 0x000150, "Member 'GC_Damage_Falling_C_OnExecute::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_Select_Default_1) == 0x000160, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_string_Variable_2) == 0x000168, "Member 'GC_Damage_Falling_C_OnExecute::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_string_Variable_3) == 0x000178, "Member 'GC_Damage_Falling_C_OnExecute::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, Temp_int_Variable_3) == 0x000188, "Member 'GC_Damage_Falling_C_OnExecute::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, K2Node_Select_Default_2) == 0x000190, "Member 'GC_Damage_Falling_C_OnExecute::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_Falling_C_OnExecute, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0001A8, "Member 'GC_Damage_Falling_C_OnExecute::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

