#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage_Melee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "GC_Damage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Damage_Melee.GC_Damage_Melee_C
// 0x0040 (0x1350 - 0x1310)
class AGC_Damage_Melee_C final : public AGC_Damage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_Damage_Melee_C;                  // 0x1310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAkEventSlotConfig                     Melee_Dmg_VO_Events_Config;                        // 0x1318(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EDialogueArgumentType                         DialogueArgumentType;                              // 0x1348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1349[0x3];                                     // 0x1349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Hit_Severity;                                      // 0x134C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Damage_Melee(int32 EntryPoint)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void OnRecurring(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Damage_Melee_C">();
	}
	static class AGC_Damage_Melee_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Damage_Melee_C>();
	}
};
static_assert(alignof(AGC_Damage_Melee_C) == 0x000008, "Wrong alignment on AGC_Damage_Melee_C");
static_assert(sizeof(AGC_Damage_Melee_C) == 0x001350, "Wrong size on AGC_Damage_Melee_C");
static_assert(offsetof(AGC_Damage_Melee_C, UberGraphFrame_GC_Damage_Melee_C) == 0x001310, "Member 'AGC_Damage_Melee_C::UberGraphFrame_GC_Damage_Melee_C' has a wrong offset!");
static_assert(offsetof(AGC_Damage_Melee_C, Melee_Dmg_VO_Events_Config) == 0x001318, "Member 'AGC_Damage_Melee_C::Melee_Dmg_VO_Events_Config' has a wrong offset!");
static_assert(offsetof(AGC_Damage_Melee_C, DialogueArgumentType) == 0x001348, "Member 'AGC_Damage_Melee_C::DialogueArgumentType' has a wrong offset!");
static_assert(offsetof(AGC_Damage_Melee_C, Hit_Severity) == 0x00134C, "Member 'AGC_Damage_Melee_C::Hit_Severity' has a wrong offset!");

}

