#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DPV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_DPV.GC_DPV_C
// 0x0090 (0x1398 - 0x1308)
class AGC_DPV_C final : public AP2GameplayCue_DPV
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Effect;                                            // 0x1310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        EmergeSubmergeImmersionThreshold;                  // 0x1318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPrevSubmergeEmerge;                               // 0x1320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialized;                                    // 0x1321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1322[0x6];                                     // 0x1322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkEventSlotConfig                     DPV_Emerge;                                        // 0x1328(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class AP2HeroCharacter*                       As_P2Hero_Character;                               // 0x1358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAkEventSlotConfig                     DPV_Submerge;                                      // 0x1360(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         WaterSurfaceOn;                                    // 0x1390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static void PostLocalRemoteEvents(class AActor* Target, class UAkAudioEvent* Local_Event, class UAkAudioEvent* Remote_Allied_Event, class UAkAudioEvent* Remote_Enemy_Event, class UObject* __WorldContext, int32* PlayingID)	 // 0xae1e64;

	void ExecuteUbergraph_GC_DPV(int32 EntryPoint)	 // 0xae1e64;
	void Initialize()	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void ReceiveBeginPlay()	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_DPV_C">();
	}
	static class AGC_DPV_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_DPV_C>();
	}
};
static_assert(alignof(AGC_DPV_C) == 0x000008, "Wrong alignment on AGC_DPV_C");
static_assert(sizeof(AGC_DPV_C) == 0x001398, "Wrong size on AGC_DPV_C");
static_assert(offsetof(AGC_DPV_C, UberGraphFrame) == 0x001308, "Member 'AGC_DPV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, Effect) == 0x001310, "Member 'AGC_DPV_C::Effect' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, EmergeSubmergeImmersionThreshold) == 0x001318, "Member 'AGC_DPV_C::EmergeSubmergeImmersionThreshold' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, bPrevSubmergeEmerge) == 0x001320, "Member 'AGC_DPV_C::bPrevSubmergeEmerge' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, bIsInitialized) == 0x001321, "Member 'AGC_DPV_C::bIsInitialized' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, DPV_Emerge) == 0x001328, "Member 'AGC_DPV_C::DPV_Emerge' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, As_P2Hero_Character) == 0x001358, "Member 'AGC_DPV_C::As_P2Hero_Character' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, DPV_Submerge) == 0x001360, "Member 'AGC_DPV_C::DPV_Submerge' has a wrong offset!");
static_assert(offsetof(AGC_DPV_C, WaterSurfaceOn) == 0x001390, "Member 'AGC_DPV_C::WaterSurfaceOn' has a wrong offset!");

}

