#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Damage.GC_Damage_C.ExecuteUbergraph_GC_Damage
// 0x0790 (0x0790 - 0x0000)
struct GC_Damage_C_ExecuteUbergraph_GC_Damage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0160(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0188(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01A8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1; // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude_1; // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext_1; // 0x0238(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName_1; // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag_1; // 0x0258(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1; // 0x0260(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1; // 0x0280(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location_1;    // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal_1;      // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator_1;  // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser_1; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject_1; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel_1; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1; // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         K2Node_MakeStruct_P2VerbMessage;                   // 0x0318(0x0098)()
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindRelativeLookAtRotation_ReturnValue;   // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput;                   // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue;            // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CreateVectorFromYawPitch_ReturnValue;     // 0x0490(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x04F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0500(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x05F8(0x00F0)(ConstParm, ContainsInstancedReference)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_1;        // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x06F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70B[0x5];                                      // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_MakeStruct_Magnitude_ImplicitCast;          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPC_Value_ImplicitCast;               // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5; // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Damage_C_ExecuteUbergraph_GC_Damage) == 0x000010, "Wrong alignment on GC_Damage_C_ExecuteUbergraph_GC_Damage");
static_assert(sizeof(GC_Damage_C_ExecuteUbergraph_GC_Damage) == 0x000790, "Wrong size on GC_Damage_C_ExecuteUbergraph_GC_Damage");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, EntryPoint) == 0x000000, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Target_2) == 0x000008, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Parameters_2) == 0x000010, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000158, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00015C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000160, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000178, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000180, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000188, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001A8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Location) == 0x0001C8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001E0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001F8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000200, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000208, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000210, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000218, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00021C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000220, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000228, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1) == 0x00022C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_RawMagnitude_1) == 0x000230, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_RawMagnitude_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_EffectContext_1) == 0x000238, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_EffectContext_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_MatchedTagName_1) == 0x000250, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_MatchedTagName_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_OriginalTag_1) == 0x000258, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_OriginalTag_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1) == 0x000260, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1) == 0x000280, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Location_1) == 0x0002A0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Location_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Normal_1) == 0x0002B8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Normal_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_Instigator_1) == 0x0002D0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_Instigator_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_EffectCauser_1) == 0x0002D8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_EffectCauser_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_SourceObject_1) == 0x0002E0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_SourceObject_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1) == 0x0002E8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_PhysicalMaterial_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1) == 0x0002F0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_AbilityLevel_1) == 0x0002F4, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_AbilityLevel_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1) == 0x0002F8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_TargetAttachComponent_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1) == 0x000300, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Abs_ReturnValue) == 0x000308, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue_2) == 0x000310, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_MakeStruct_P2VerbMessage) == 0x000318, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_MakeStruct_P2VerbMessage' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003B0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_HasAnyTags_ReturnValue) == 0x0003C8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_HasAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_MapRangeClamped_ReturnValue) == 0x0003D0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_GetTransform_ReturnValue) == 0x0003E0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_DynamicCast_AsP2Base_Character) == 0x000440, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_DynamicCast_bSuccess) == 0x000448, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_FindRelativeLookAtRotation_ReturnValue) == 0x000450, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_FindRelativeLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetRTPC_self_CastInput) == 0x000468, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetRTPC_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakRotator_Roll) == 0x000478, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakRotator_Pitch) == 0x00047C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakRotator_Yaw) == 0x000480, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_GetLocalViewActor_ReturnValue) == 0x000488, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_GetLocalViewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_CreateVectorFromYawPitch_ReturnValue) == 0x000490, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_CreateVectorFromYawPitch_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0004A8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakVector_X) == 0x0004B0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakVector_Y) == 0x0004B8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BreakVector_Z) == 0x0004C0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0004C8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0004D0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0004D8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0004E0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0004E8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0004F0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Target_1) == 0x0004F8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Parameters_1) == 0x000500, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Target) == 0x0005F0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_Event_Parameters) == 0x0005F8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_FindCameraComponent_ReturnValue) == 0x0006E8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_FindCameraComponent_ReturnValue_1) == 0x0006F0, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0006F8, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue_3) == 0x000708, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue_4) == 0x000709, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_BooleanAND_ReturnValue) == 0x00070A, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000710, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000720, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_IsValid_ReturnValue_5) == 0x000728, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_RandomFloatInRange_ReturnValue) == 0x000730, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Abs_A_ImplicitCast) == 0x000738, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000740, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, K2Node_MakeStruct_Magnitude_ImplicitCast) == 0x000748, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::K2Node_MakeStruct_Magnitude_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetRTPC_Value_ImplicitCast) == 0x000750, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetRTPC_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000754, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000758, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000760, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x000768, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x00076C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3) == 0x000770, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4) == 0x000774, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5) == 0x000778, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00077C, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_ExecuteUbergraph_GC_Damage, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000780, "Member 'GC_Damage_C_ExecuteUbergraph_GC_Damage::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function GC_Damage.GC_Damage_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Damage_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Damage_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_Damage_C_OnBecomeViewTarget");
static_assert(sizeof(GC_Damage_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_Damage_C_OnBecomeViewTarget");
static_assert(offsetof(GC_Damage_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_Damage_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_Damage_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_Damage.GC_Damage_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Damage_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Damage_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_Damage_C_OnEndViewTarget");
static_assert(sizeof(GC_Damage_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_Damage_C_OnEndViewTarget");
static_assert(offsetof(GC_Damage_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_Damage_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_Damage_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_Damage.GC_Damage_C.OnRecurring
// 0x0150 (0x0150 - 0x0000)
struct GC_Damage_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Damage_C_OnRecurring) == 0x000008, "Wrong alignment on GC_Damage_C_OnRecurring");
static_assert(sizeof(GC_Damage_C_OnRecurring) == 0x000150, "Wrong size on GC_Damage_C_OnRecurring");
static_assert(offsetof(GC_Damage_C_OnRecurring, Target) == 0x000000, "Member 'GC_Damage_C_OnRecurring::Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_OnRecurring, Parameters) == 0x000008, "Member 'GC_Damage_C_OnRecurring::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_C_OnRecurring, SpawnResults) == 0x0000F8, "Member 'GC_Damage_C_OnRecurring::SpawnResults' has a wrong offset!");

}

