#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage_Melee

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Damage_Melee.GC_Damage_Melee_C.ExecuteUbergraph_GC_Damage_Melee
// 0x04A0 (0x04A0 - 0x0000)
struct GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0080(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0170(0x0058)(ConstParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_4;                               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01D8(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0200(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0220(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x02A8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_482[0x2];                                      // 0x0482(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee) == 0x000008, "Wrong alignment on GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee");
static_assert(sizeof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee) == 0x0004A0, "Wrong size on GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, EntryPoint) == 0x000000, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_bool_Variable) == 0x000004, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_int_Variable) == 0x000008, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_int_Variable_1) == 0x00000C, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_int_Variable_2) == 0x000010, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_string_Variable) == 0x000018, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_string_Variable_1) == 0x000028, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_string_Variable_2) == 0x000038, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_string_Variable_3) == 0x000048, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_bool_Variable_1) == 0x000058, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_int_Variable_3) == 0x00005C, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Select_Default) == 0x000060, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_bool_Variable_2) == 0x000070, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Event_Target) == 0x000078, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Event_Parameters) == 0x000080, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Event_SpawnResults) == 0x000170, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, Temp_int_Variable_4) == 0x0001C8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001CC, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001D0, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001D8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001F0, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001F8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000200, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000220, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_Location) == 0x000240, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_Normal) == 0x000258, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000270, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000278, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000280, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000288, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000290, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000294, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000298, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0002A0, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_HasTag_ReturnValue) == 0x0002A1, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0002A8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_bBlockingHit) == 0x000390, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_bInitialOverlap) == 0x000391, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_Time) == 0x000394, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_Distance) == 0x000398, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_Location) == 0x0003A0, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_ImpactPoint) == 0x0003B8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_Normal) == 0x0003D0, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_ImpactNormal) == 0x0003E8, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_PhysMat) == 0x000400, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_HitActor) == 0x000408, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_HitComponent) == 0x000410, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_HitBoneName) == 0x000418, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_BoneName) == 0x000420, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_HitItem) == 0x000428, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_ElementIndex) == 0x00042C, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_FaceIndex) == 0x000430, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_TraceStart) == 0x000438, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_BreakHitResult_TraceEnd) == 0x000450, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000468, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_DynamicCast_AsP2Base_Character) == 0x000470, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_DynamicCast_bSuccess) == 0x000478, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Select_Default_1) == 0x00047C, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_ObjectIsA_ReturnValue) == 0x000480, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000481, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Select_Default_2) == 0x000484, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, K2Node_Select_Default_3) == 0x000488, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000490, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000498, "Member 'GC_Damage_Melee_C_ExecuteUbergraph_GC_Damage_Melee::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GC_Damage_Melee.GC_Damage_Melee_C.OnRecurring
// 0x0150 (0x0150 - 0x0000)
struct GC_Damage_Melee_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Damage_Melee_C_OnRecurring) == 0x000008, "Wrong alignment on GC_Damage_Melee_C_OnRecurring");
static_assert(sizeof(GC_Damage_Melee_C_OnRecurring) == 0x000150, "Wrong size on GC_Damage_Melee_C_OnRecurring");
static_assert(offsetof(GC_Damage_Melee_C_OnRecurring, Target) == 0x000000, "Member 'GC_Damage_Melee_C_OnRecurring::Target' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_OnRecurring, Parameters) == 0x000008, "Member 'GC_Damage_Melee_C_OnRecurring::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Melee_C_OnRecurring, SpawnResults) == 0x0000F8, "Member 'GC_Damage_Melee_C_OnRecurring::SpawnResults' has a wrong offset!");

}

