#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DPV

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_DPV.GC_DPV_C.PostLocalRemoteEvents
// 0x0078 (0x0078 - 0x0000)
struct GC_DPV_C_PostLocalRemoteEvents final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Local_Event;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Allied_Event;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Enemy_Event;                                // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayingID;                                         // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x002C(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   K2Node_DynamicCast_AsP2Ak_Audio_Interface;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2WwiseTeamStatus                            CallFunc_GetWwiseTeamStatus_ReturnValue;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DPV_C_PostLocalRemoteEvents) == 0x000008, "Wrong alignment on GC_DPV_C_PostLocalRemoteEvents");
static_assert(sizeof(GC_DPV_C_PostLocalRemoteEvents) == 0x000078, "Wrong size on GC_DPV_C_PostLocalRemoteEvents");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Target) == 0x000000, "Member 'GC_DPV_C_PostLocalRemoteEvents::Target' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Local_Event) == 0x000008, "Member 'GC_DPV_C_PostLocalRemoteEvents::Local_Event' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Remote_Allied_Event) == 0x000010, "Member 'GC_DPV_C_PostLocalRemoteEvents::Remote_Allied_Event' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Remote_Enemy_Event) == 0x000018, "Member 'GC_DPV_C_PostLocalRemoteEvents::Remote_Enemy_Event' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, __WorldContext) == 0x000020, "Member 'GC_DPV_C_PostLocalRemoteEvents::__WorldContext' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, PlayingID) == 0x000028, "Member 'GC_DPV_C_PostLocalRemoteEvents::PlayingID' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Temp_delegate_Variable) == 0x00002C, "Member 'GC_DPV_C_PostLocalRemoteEvents::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'GC_DPV_C_PostLocalRemoteEvents::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, Temp_byte_Variable) == 0x000048, "Member 'GC_DPV_C_PostLocalRemoteEvents::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, K2Node_DynamicCast_AsP2Ak_Audio_Interface) == 0x000050, "Member 'GC_DPV_C_PostLocalRemoteEvents::K2Node_DynamicCast_AsP2Ak_Audio_Interface' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'GC_DPV_C_PostLocalRemoteEvents::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, CallFunc_GetWwiseTeamStatus_ReturnValue) == 0x000061, "Member 'GC_DPV_C_PostLocalRemoteEvents::CallFunc_GetWwiseTeamStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, K2Node_Select_Default) == 0x000068, "Member 'GC_DPV_C_PostLocalRemoteEvents::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, CallFunc_PostEvent_ReturnValue) == 0x000070, "Member 'GC_DPV_C_PostLocalRemoteEvents::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_PostLocalRemoteEvents, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'GC_DPV_C_PostLocalRemoteEvents::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_DPV.GC_DPV_C.ExecuteUbergraph_GC_DPV
// 0x01B8 (0x01B8 - 0x0000)
struct GC_DPV_C_ExecuteUbergraph_GC_DPV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector3f_X;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DPV_C_ExecuteUbergraph_GC_DPV) == 0x000008, "Wrong alignment on GC_DPV_C_ExecuteUbergraph_GC_DPV");
static_assert(sizeof(GC_DPV_C_ExecuteUbergraph_GC_DPV) == 0x0001B8, "Wrong size on GC_DPV_C_ExecuteUbergraph_GC_DPV");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, EntryPoint) == 0x000000, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_Event_Target) == 0x000008, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_Event_Parameters) == 0x000010, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_DynamicCast_AsP2Hero_Character) == 0x000158, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_MapRangeClamped_ReturnValue) == 0x000168, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_GetMesh3P_ReturnValue) == 0x000170, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000178, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_IsActive_ReturnValue) == 0x000179, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00017A, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_BreakVector3f_X) == 0x00017C, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_BreakVector3f_Y) == 0x000180, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_BreakVector3f_Z) == 0x000184, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, K2Node_Event_DeltaSeconds) == 0x000188, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000190, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000198, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_ExecuteUbergraph_GC_DPV, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x0001A8, "Member 'GC_DPV_C_ExecuteUbergraph_GC_DPV::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");

// Function GC_DPV.GC_DPV_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct GC_DPV_C_Initialize final
{
public:
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DPV_C_Initialize) == 0x000008, "Wrong alignment on GC_DPV_C_Initialize");
static_assert(sizeof(GC_DPV_C_Initialize) == 0x000010, "Wrong size on GC_DPV_C_Initialize");
static_assert(offsetof(GC_DPV_C_Initialize, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000000, "Member 'GC_DPV_C_Initialize::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_Initialize, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000008, "Member 'GC_DPV_C_Initialize::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GC_DPV.GC_DPV_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_DPV_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_DPV_C_OnApplication) == 0x000008, "Wrong alignment on GC_DPV_C_OnApplication");
static_assert(sizeof(GC_DPV_C_OnApplication) == 0x000150, "Wrong size on GC_DPV_C_OnApplication");
static_assert(offsetof(GC_DPV_C_OnApplication, Target) == 0x000000, "Member 'GC_DPV_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_OnApplication, Parameters) == 0x000008, "Member 'GC_DPV_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_DPV_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_DPV_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_DPV.GC_DPV_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_DPV_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DPV_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_DPV_C_ReceiveTick");
static_assert(sizeof(GC_DPV_C_ReceiveTick) == 0x000004, "Wrong size on GC_DPV_C_ReceiveTick");
static_assert(offsetof(GC_DPV_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_DPV_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

