#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Damage_Spectre_PsiPunch

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Damage_Spectre_PsiPunch.GC_Damage_Spectre_PsiPunch_C.OnExecute
// 0x0108 (0x0108 - 0x0000)
struct GC_Damage_Spectre_PsiPunch_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostLocalOnlyEvent_PlayingID;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Damage_Spectre_PsiPunch_C_OnExecute) == 0x000008, "Wrong alignment on GC_Damage_Spectre_PsiPunch_C_OnExecute");
static_assert(sizeof(GC_Damage_Spectre_PsiPunch_C_OnExecute) == 0x000108, "Wrong size on GC_Damage_Spectre_PsiPunch_C_OnExecute");
static_assert(offsetof(GC_Damage_Spectre_PsiPunch_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Damage_Spectre_PsiPunch_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Damage_Spectre_PsiPunch_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Damage_Spectre_PsiPunch_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Damage_Spectre_PsiPunch_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Damage_Spectre_PsiPunch_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Damage_Spectre_PsiPunch_C_OnExecute, CallFunc_PostLocalOnlyEvent_PlayingID) == 0x0000FC, "Member 'GC_Damage_Spectre_PsiPunch_C_OnExecute::CallFunc_PostLocalOnlyEvent_PlayingID' has a wrong offset!");
static_assert(offsetof(GC_Damage_Spectre_PsiPunch_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000100, "Member 'GC_Damage_Spectre_PsiPunch_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");

}

