#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_FireWeapon_BeamRifle

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_FireWeapon_BeamRifle.GC_FireWeapon_BeamRifle_C.OnExecute
// 0x0448 (0x0448 - 0x0000)
struct GC_FireWeapon_BeamRifle_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0208(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostLocalRemoteEvents_PlayingID;          // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x03F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x042C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_FireWeapon_BeamRifle_C_OnExecute) == 0x000008, "Wrong alignment on GC_FireWeapon_BeamRifle_C_OnExecute");
static_assert(sizeof(GC_FireWeapon_BeamRifle_C_OnExecute) == 0x000448, "Wrong size on GC_FireWeapon_BeamRifle_C_OnExecute");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, Parameters) == 0x000008, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000188, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001D8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001E8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_HasTag_ReturnValue) == 0x000200, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000208, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_bBlockingHit) == 0x0002F0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002F1, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_Time) == 0x0002F4, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_Distance) == 0x0002F8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_Location) == 0x000300, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_ImpactPoint) == 0x000318, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_Normal) == 0x000330, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_ImpactNormal) == 0x000348, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_PhysMat) == 0x000360, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_HitActor) == 0x000368, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_HitComponent) == 0x000370, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_HitBoneName) == 0x000378, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_BoneName) == 0x000380, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_HitItem) == 0x000388, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_ElementIndex) == 0x00038C, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_FaceIndex) == 0x000390, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_TraceStart) == 0x000398, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_BreakHitResult_TraceEnd) == 0x0003B0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003C8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_PostLocalRemoteEvents_PlayingID) == 0x0003E0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_PostLocalRemoteEvents_PlayingID' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_VSize_ReturnValue) == 0x0003E8, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0003F0, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, Temp_name_Variable) == 0x000408, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_VSize_ReturnValue_1) == 0x000410, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_SelectFloat_ReturnValue) == 0x000418, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, Temp_name_Variable_1) == 0x000420, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, Temp_bool_Variable) == 0x000428, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, K2Node_Select_Default) == 0x00042C, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000438, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_FireWeapon_BeamRifle_C_OnExecute, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000440, "Member 'GC_FireWeapon_BeamRifle_C_OnExecute::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");

}

