#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_FireFailed_Base

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_FireFailed_Base.GC_FireFailed_Base_C
// 0x0018 (0x0088 - 0x0070)
class UGC_FireFailed_Base_C : public UP2GameplayCue_FireFailed
{
public:
	class UAkAudioEvent*                          Local_Event;                                       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Allied_Event;                               // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Remote_Enemy_Event;                                // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_FireFailed_Base_C">();
	}
	static class UGC_FireFailed_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_FireFailed_Base_C>();
	}
};
static_assert(alignof(UGC_FireFailed_Base_C) == 0x000008, "Wrong alignment on UGC_FireFailed_Base_C");
static_assert(sizeof(UGC_FireFailed_Base_C) == 0x000088, "Wrong size on UGC_FireFailed_Base_C");
static_assert(offsetof(UGC_FireFailed_Base_C, Local_Event) == 0x000070, "Member 'UGC_FireFailed_Base_C::Local_Event' has a wrong offset!");
static_assert(offsetof(UGC_FireFailed_Base_C, Remote_Allied_Event) == 0x000078, "Member 'UGC_FireFailed_Base_C::Remote_Allied_Event' has a wrong offset!");
static_assert(offsetof(UGC_FireFailed_Base_C, Remote_Enemy_Event) == 0x000080, "Member 'UGC_FireFailed_Base_C::Remote_Enemy_Event' has a wrong offset!");

}

