#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Grenade_Detonate_Frag

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Grenade_Detonate_Frag.GC_Grenade_Detonate_Frag_C.OnBurst
// 0x0250 (0x0250 - 0x0000)
struct GC_Grenade_Detonate_Frag_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAnimSpringSimData*>             K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0168(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0190(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01B0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSpringSimData*>             K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Grenade_Detonate_Frag_C_OnBurst) == 0x000008, "Wrong alignment on GC_Grenade_Detonate_Frag_C_OnBurst");
static_assert(sizeof(GC_Grenade_Detonate_Frag_C_OnBurst) == 0x000250, "Wrong size on GC_Grenade_Detonate_Frag_C_OnBurst");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, Target) == 0x000000, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, SpawnResults) == 0x0000F8, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, K2Node_MakeArray_Array) == 0x000150, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000160, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000164, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000168, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000180, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000188, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000190, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001B0, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001D0, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001E8, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000200, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000208, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000210, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000218, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000220, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000224, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000228, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000230, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, K2Node_MakeArray_Array_1) == 0x000238, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_C_OnBurst, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000248, "Member 'GC_Grenade_Detonate_Frag_C_OnBurst::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

