#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Grenade_Detonate_Frag_Water

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Grenade_Detonate_Frag_Water.GC_Grenade_Detonate_Frag_Water_C.OnBurst
// 0x0318 (0x0318 - 0x0000)
struct GC_Grenade_Detonate_Frag_Water_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	double                                        Depth;                                             // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InWaterPosition;                                   // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SurfacePosition;                                   // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0190(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01B8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01D8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Throwable*                           K2Node_DynamicCast_AsP2Throwable;                  // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetOwner_ReturnValue;                  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2ThrowableActor*                      K2Node_DynamicCast_AsP2Throwable_Actor;            // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector3f_X;                          // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_1;                        // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_1;                        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_1;                        // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X_2;                        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y_2;                        // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z_2;                        // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_1;       // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast_2;       // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Grenade_Detonate_Frag_Water_C_OnBurst) == 0x000008, "Wrong alignment on GC_Grenade_Detonate_Frag_Water_C_OnBurst");
static_assert(sizeof(GC_Grenade_Detonate_Frag_Water_C_OnBurst) == 0x000318, "Wrong size on GC_Grenade_Detonate_Frag_Water_C_OnBurst");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, Target) == 0x000000, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, SpawnResults) == 0x0000F8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, Depth) == 0x000150, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::Depth' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, InWaterPosition) == 0x000158, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::InWaterPosition' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, SurfacePosition) == 0x000170, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::SurfacePosition' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000188, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00018C, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000190, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001A8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001B0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001B8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001D8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001F8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x000210, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000228, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000230, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000238, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000240, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000248, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00024C, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000250, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000258, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, K2Node_DynamicCast_AsP2Throwable) == 0x000260, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::K2Node_DynamicCast_AsP2Throwable' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BP_GetOwner_ReturnValue) == 0x000270, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BP_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, K2Node_DynamicCast_AsP2Throwable_Actor) == 0x000278, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::K2Node_DynamicCast_AsP2Throwable_Actor' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, K2Node_DynamicCast_bSuccess_1) == 0x000280, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000288, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0002A0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0002A8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0002B0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_X) == 0x0002B4, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Y) == 0x0002B8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Z) == 0x0002BC, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_X_1) == 0x0002C0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_X_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Y_1) == 0x0002C4, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Y_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Z_1) == 0x0002C8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Z_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_X_2) == 0x0002CC, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_X_2' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Y_2) == 0x0002D0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Y_2' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_Z_2) == 0x0002D4, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_Z_2' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x0002E0, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_InVec_ImplicitCast_1) == 0x0002EC, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_InVec_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0002F8, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_BreakVector3f_InVec_ImplicitCast_2) == 0x000300, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_BreakVector3f_InVec_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(GC_Grenade_Detonate_Frag_Water_C_OnBurst, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000310, "Member 'GC_Grenade_Detonate_Frag_Water_C_OnBurst::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

