#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Grenade_Detonate_Frag_Water

#include "Basic.hpp"

#include "GC_Grenade_Detonate_Frag_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Grenade_Detonate_Frag_Water.GC_Grenade_Detonate_Frag_Water_C
// 0x0018 (0x04C8 - 0x04B0)
class UGC_Grenade_Detonate_Frag_Water_C final : public UGC_Grenade_Detonate_Frag_C
{
public:
	class UNiagaraSystem*                         SurfaceExplosion;                                  // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         inWaterExplosion;                                  // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        inWaterExplosionDepth;                             // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnBurst(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Grenade_Detonate_Frag_Water_C">();
	}
	static class UGC_Grenade_Detonate_Frag_Water_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_Grenade_Detonate_Frag_Water_C>();
	}
};
static_assert(alignof(UGC_Grenade_Detonate_Frag_Water_C) == 0x000008, "Wrong alignment on UGC_Grenade_Detonate_Frag_Water_C");
static_assert(sizeof(UGC_Grenade_Detonate_Frag_Water_C) == 0x0004C8, "Wrong size on UGC_Grenade_Detonate_Frag_Water_C");
static_assert(offsetof(UGC_Grenade_Detonate_Frag_Water_C, SurfaceExplosion) == 0x0004B0, "Member 'UGC_Grenade_Detonate_Frag_Water_C::SurfaceExplosion' has a wrong offset!");
static_assert(offsetof(UGC_Grenade_Detonate_Frag_Water_C, inWaterExplosion) == 0x0004B8, "Member 'UGC_Grenade_Detonate_Frag_Water_C::inWaterExplosion' has a wrong offset!");
static_assert(offsetof(UGC_Grenade_Detonate_Frag_Water_C, inWaterExplosionDepth) == 0x0004C0, "Member 'UGC_Grenade_Detonate_Frag_Water_C::inWaterExplosionDepth' has a wrong offset!");

}

