#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hit_Melee_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Hit_Melee_Base.GC_Hit_Melee_Base_C.FindCaliberSize
// 0x0078 (0x0078 - 0x0000)
struct GC_Hit_Melee_Base_C_FindCaliberSize final
{
public:
	struct FGameplayTagContainer                  InContainer;                                       // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	uint8                                         CaliberType;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_FindFirstTagByFilterTag_OutFoundTag;      // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFirstTagByFilterTag_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_FindFirstTagByFilterTag_OutFoundTag_1;    // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFirstTagByFilterTag_ReturnValue_1;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_FindFirstTagByFilterTag_OutFoundTag_2;    // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFirstTagByFilterTag_ReturnValue_2;    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EP2AkCaliberTiers                             CallFunc_Map_Find_Value;                           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2AkCaliberTiers                             CallFunc_Map_Find_Value_1;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hit_Melee_Base_C_FindCaliberSize) == 0x000008, "Wrong alignment on GC_Hit_Melee_Base_C_FindCaliberSize");
static_assert(sizeof(GC_Hit_Melee_Base_C_FindCaliberSize) == 0x000078, "Wrong size on GC_Hit_Melee_Base_C_FindCaliberSize");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, InContainer) == 0x000000, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::InContainer' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CaliberType) == 0x000020, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CaliberType' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_OutFoundTag) == 0x000024, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_OutFoundTag' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_ReturnValue) == 0x00002C, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_OutFoundTag_1) == 0x000030, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_OutFoundTag_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_ReturnValue_1) == 0x000038, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_GetTagName_ReturnValue) == 0x00003C, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_OutFoundTag_2) == 0x000044, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_OutFoundTag_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_FindFirstTagByFilterTag_ReturnValue_2) == 0x00004C, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_FindFirstTagByFilterTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Conv_NameToString_ReturnValue) == 0x000050, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Map_Find_Value) == 0x000070, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Map_Find_ReturnValue) == 0x000071, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Map_Find_Value_1) == 0x000072, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_FindCaliberSize, CallFunc_Map_Find_ReturnValue_1) == 0x000073, "Member 'GC_Hit_Melee_Base_C_FindCaliberSize::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function GC_Hit_Melee_Base.GC_Hit_Melee_Base_C.OnExecute
// 0x0100 (0x0100 - 0x0000)
struct GC_Hit_Melee_Base_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hit_Melee_Base_C_OnExecute) == 0x000008, "Wrong alignment on GC_Hit_Melee_Base_C_OnExecute");
static_assert(sizeof(GC_Hit_Melee_Base_C_OnExecute) == 0x000100, "Wrong size on GC_Hit_Melee_Base_C_OnExecute");
static_assert(offsetof(GC_Hit_Melee_Base_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Hit_Melee_Base_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Hit_Melee_Base_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Hit_Melee_Base_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Base_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F9, "Member 'GC_Hit_Melee_Base_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");

}

