#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hurt_Bombug_Alpha

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hurt_Bombug_Alpha.GC_Hurt_Bombug_Alpha_C.GetConfig
// 0x0200 (0x0200 - 0x0000)
struct GC_Hurt_Bombug_Alpha_C_GetConfig final
{
public:
	struct FGameplayCueParameters                 Parameters;                                        // 0x0000(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FAkEventSlotConfig                     ReturnValue;                                       // 0x00F0(0x0030)(Parm, OutParm, ReturnParm, NoDestructor)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0128(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0150(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0170(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hurt_Bombug_Alpha_C_GetConfig) == 0x000008, "Wrong alignment on GC_Hurt_Bombug_Alpha_C_GetConfig");
static_assert(sizeof(GC_Hurt_Bombug_Alpha_C_GetConfig) == 0x000200, "Wrong size on GC_Hurt_Bombug_Alpha_C_GetConfig");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, Parameters) == 0x000000, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, ReturnValue) == 0x0000F0, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000120, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000124, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000128, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000140, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000148, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000150, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000170, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_Location) == 0x000190, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001A8, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001C0, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001C8, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001D0, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001D8, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001E0, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001E4, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001E8, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001F0, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0001F1, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hurt_Bombug_Alpha_C_GetConfig, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x0001F8, "Member 'GC_Hurt_Bombug_Alpha_C_GetConfig::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

