#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Stamina_Low

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_Stamina_Low.GC_Hero_Stamina_Low_C
// 0x0048 (0x12F8 - 0x12B0)
class AGC_Hero_Stamina_Low_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Looping;                                           // 0x12B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B9[0x7];                                     // 0x12B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       As_P2Hero_Character;                               // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         StaminaBreathLeft;                                 // 0x12C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CC[0x4];                                     // 0x12CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            StaminaIntervalCurve;                              // 0x12D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        RecoverThreshold;                                  // 0x12D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSwimming;                                        // 0x12E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12E1[0x3];                                     // 0x12E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stamina;                                           // 0x12E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeSeconds;                                       // 0x12E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDecreasing;                                      // 0x12F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogueArgumentType                         MovementType;                                      // 0x12F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DecrementBreath()	 // 0xae1e64;
	void ExecuteUbergraph_GC_Hero_Stamina_Low(int32 EntryPoint)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void TriggerSprintVo()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_Stamina_Low_C">();
	}
	static class AGC_Hero_Stamina_Low_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Hero_Stamina_Low_C>();
	}
};
static_assert(alignof(AGC_Hero_Stamina_Low_C) == 0x000008, "Wrong alignment on AGC_Hero_Stamina_Low_C");
static_assert(sizeof(AGC_Hero_Stamina_Low_C) == 0x0012F8, "Wrong size on AGC_Hero_Stamina_Low_C");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Hero_Stamina_Low_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, Looping) == 0x0012B8, "Member 'AGC_Hero_Stamina_Low_C::Looping' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, As_P2Hero_Character) == 0x0012C0, "Member 'AGC_Hero_Stamina_Low_C::As_P2Hero_Character' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, StaminaBreathLeft) == 0x0012C8, "Member 'AGC_Hero_Stamina_Low_C::StaminaBreathLeft' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, StaminaIntervalCurve) == 0x0012D0, "Member 'AGC_Hero_Stamina_Low_C::StaminaIntervalCurve' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, RecoverThreshold) == 0x0012D8, "Member 'AGC_Hero_Stamina_Low_C::RecoverThreshold' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, IsSwimming) == 0x0012E0, "Member 'AGC_Hero_Stamina_Low_C::IsSwimming' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, Stamina) == 0x0012E4, "Member 'AGC_Hero_Stamina_Low_C::Stamina' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, TimeSeconds) == 0x0012E8, "Member 'AGC_Hero_Stamina_Low_C::TimeSeconds' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, IsDecreasing) == 0x0012F0, "Member 'AGC_Hero_Stamina_Low_C::IsDecreasing' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Stamina_Low_C, MovementType) == 0x0012F1, "Member 'AGC_Hero_Stamina_Low_C::MovementType' has a wrong offset!");

}

