#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Slide_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_Slide_Base.GC_Hero_Slide_Base_C.ExecuteUbergraph_GC_Hero_Slide_Base
// 0x0240 (0x0240 - 0x0000)
struct GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0108(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_1;           // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput;                   // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x01C0(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_2;           // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPC_Value_ImplicitCast;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base) == 0x000008, "Wrong alignment on GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base");
static_assert(sizeof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base) == 0x000240, "Wrong size on GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, EntryPoint) == 0x000000, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_Target_1) == 0x000010, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_Parameters) == 0x000018, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_SpawnResults_1) == 0x000108, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_AsP2Base_Character) == 0x000160, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_AsP2Base_Character_1) == 0x000170, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_AsP2Base_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_GetVelocity_ReturnValue) == 0x000180, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_VSize_ReturnValue) == 0x000198, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_GetComponentByClass_ReturnValue) == 0x0001A0, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_SetRTPC_self_CastInput) == 0x0001A8, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_SetRTPC_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_Target) == 0x0001B8, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_SpawnResults) == 0x0001C0, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_AsP2Base_Character_2) == 0x000218, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_AsP2Base_Character_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_DynamicCast_bSuccess_2) == 0x000220, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000228, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_Array_AddUnique_ReturnValue) == 0x000234, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, K2Node_Event_DeltaSeconds) == 0x000238, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base, CallFunc_SetRTPC_Value_ImplicitCast) == 0x00023C, "Member 'GC_Hero_Slide_Base_C_ExecuteUbergraph_GC_Hero_Slide_Base::CallFunc_SetRTPC_Value_ImplicitCast' has a wrong offset!");

// Function GC_Hero_Slide_Base.GC_Hero_Slide_Base_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Hero_Slide_Base_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Slide_Base_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Hero_Slide_Base_C_OnLoopingEnd");
static_assert(sizeof(GC_Hero_Slide_Base_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Hero_Slide_Base_C_OnLoopingEnd");
static_assert(offsetof(GC_Hero_Slide_Base_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Hero_Slide_Base_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Hero_Slide_Base_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Hero_Slide_Base.GC_Hero_Slide_Base_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_Slide_Base_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Slide_Base_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Hero_Slide_Base_C_OnLoopingStart");
static_assert(sizeof(GC_Hero_Slide_Base_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Hero_Slide_Base_C_OnLoopingStart");
static_assert(offsetof(GC_Hero_Slide_Base_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Hero_Slide_Base_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Hero_Slide_Base_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Slide_Base_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Hero_Slide_Base_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GC_Hero_Slide_Base.GC_Hero_Slide_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_Hero_Slide_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Slide_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_Hero_Slide_Base_C_ReceiveTick");
static_assert(sizeof(GC_Hero_Slide_Base_C_ReceiveTick) == 0x000004, "Wrong size on GC_Hero_Slide_Base_C_ReceiveTick");
static_assert(offsetof(GC_Hero_Slide_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_Hero_Slide_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

