#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_BleedOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_BleedOut.GC_Hero_BleedOut_C
// 0x0038 (0x12E8 - 0x12B0)
class AGC_Hero_BleedOut_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                DecalSize;                                         // 0x12B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalPoint;                                        // 0x12D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BloodVisual()	 // 0xae1e64;
	void ExecuteUbergraph_GC_Hero_BleedOut(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnBecomeViewTarget(class AActor* Target, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void OnEndViewTarget(class AActor* Target, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void SpawnPool()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_BleedOut_C">();
	}
	static class AGC_Hero_BleedOut_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Hero_BleedOut_C>();
	}
};
static_assert(alignof(AGC_Hero_BleedOut_C) == 0x000008, "Wrong alignment on AGC_Hero_BleedOut_C");
static_assert(sizeof(AGC_Hero_BleedOut_C) == 0x0012E8, "Wrong size on AGC_Hero_BleedOut_C");
static_assert(offsetof(AGC_Hero_BleedOut_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Hero_BleedOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BleedOut_C, DecalSize) == 0x0012B8, "Member 'AGC_Hero_BleedOut_C::DecalSize' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BleedOut_C, DecalPoint) == 0x0012D0, "Member 'AGC_Hero_BleedOut_C::DecalPoint' has a wrong offset!");

}

