#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Dbno_Loop

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_Dbno_Loop.GC_Hero_Dbno_Loop_C.ExecuteUbergraph_GC_Hero_Dbno_Loop
// 0x02D8 (0x02D8 - 0x0000)
struct GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0160(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0250(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2AllyHealthStatus                           CallFunc_GetHealthStatus_ReturnValue;              // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C2[0x6];                                      // 0x02C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_2;           // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop) == 0x000008, "Wrong alignment on GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop");
static_assert(sizeof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop) == 0x0002D8, "Wrong size on GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, EntryPoint) == 0x000000, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_Target) == 0x000008, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_Target_1) == 0x000158, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_Parameters_1) == 0x000160, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_Event_SpawnResults_1) == 0x000250, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_AsP2Hero_Character) == 0x0002A8, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, CallFunc_GetHealthStatus_ReturnValue) == 0x0002B1, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::CallFunc_GetHealthStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x0002B8, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_bSuccess_1) == 0x0002C0, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_SwitchEnum_CmpSuccess) == 0x0002C1, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_AsP2Hero_Character_2) == 0x0002C8, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_AsP2Hero_Character_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, K2Node_DynamicCast_bSuccess_2) == 0x0002D0, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop, CallFunc_GetHealth_ReturnValue) == 0x0002D4, "Member 'GC_Hero_Dbno_Loop_C_ExecuteUbergraph_GC_Hero_Dbno_Loop::CallFunc_GetHealth_ReturnValue' has a wrong offset!");

// Function GC_Hero_Dbno_Loop.GC_Hero_Dbno_Loop_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_Dbno_Loop_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Dbno_Loop_C_OnApplication) == 0x000008, "Wrong alignment on GC_Hero_Dbno_Loop_C_OnApplication");
static_assert(sizeof(GC_Hero_Dbno_Loop_C_OnApplication) == 0x000150, "Wrong size on GC_Hero_Dbno_Loop_C_OnApplication");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnApplication, Target) == 0x000000, "Member 'GC_Hero_Dbno_Loop_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Hero_Dbno_Loop_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Hero_Dbno_Loop_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Hero_Dbno_Loop.GC_Hero_Dbno_Loop_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_Dbno_Loop_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Dbno_Loop_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Hero_Dbno_Loop_C_OnRemoval");
static_assert(sizeof(GC_Hero_Dbno_Loop_C_OnRemoval) == 0x000150, "Wrong size on GC_Hero_Dbno_Loop_C_OnRemoval");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnRemoval, Target) == 0x000000, "Member 'GC_Hero_Dbno_Loop_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Hero_Dbno_Loop_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Dbno_Loop_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_Hero_Dbno_Loop_C_OnRemoval::SpawnResults' has a wrong offset!");

}

