#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Stamina_Low

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_Stamina_Low.GC_Hero_Stamina_Low_C.DecrementBreath
// 0x0038 (0x0038 - 0x0000)
struct GC_Hero_Stamina_Low_C_DecrementBreath final
{
public:
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_StaminaBreathLeft_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Stamina_Low_C_DecrementBreath) == 0x000008, "Wrong alignment on GC_Hero_Stamina_Low_C_DecrementBreath");
static_assert(sizeof(GC_Hero_Stamina_Low_C_DecrementBreath) == 0x000038, "Wrong size on GC_Hero_Stamina_Low_C_DecrementBreath");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000018, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000028, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_DecrementBreath, K2Node_VariableSet_StaminaBreathLeft_ImplicitCast) == 0x000030, "Member 'GC_Hero_Stamina_Low_C_DecrementBreath::K2Node_VariableSet_StaminaBreathLeft_ImplicitCast' has a wrong offset!");

// Function GC_Hero_Stamina_Low.GC_Hero_Stamina_Low_C.ExecuteUbergraph_GC_Hero_Stamina_Low
// 0x02E0 (0x02E0 - 0x0000)
struct GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0058(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0148(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x01B8(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsSwimming_ReturnValue;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeadOrDying_ReturnValue;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_213[0x1];                                      // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPreviouslyUnderWater_ReturnValue;    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0240(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_2;               // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_InitialStartDelay_ImplicitCast; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_B_ImplicitCast;    // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low) == 0x000008, "Wrong alignment on GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low");
static_assert(sizeof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low) == 0x0002E0, "Wrong size on GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, EntryPoint) == 0x000000, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_string_Variable) == 0x000008, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_string_Variable_1) == 0x000018, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_string_Variable_2) == 0x000028, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_bool_Has_Been_Initd_Variable) == 0x000038, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_bool_IsClosed_Variable) == 0x00004C, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_bool_Has_Been_Initd_Variable_1) == 0x00004D, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Event_Target_1) == 0x000050, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Event_Parameters) == 0x000058, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Event_SpawnResults_1) == 0x000148, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001A0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Event_Target) == 0x0001B0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Event_SpawnResults) == 0x0001B8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_IsSwimming_ReturnValue) == 0x000210, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_IsSwimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_IsDeadOrDying_ReturnValue) == 0x000211, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_IsDeadOrDying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x000212, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_GetFloatAttribute_ReturnValue) == 0x000214, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_GetIsPreviouslyUnderWater_ReturnValue) == 0x000218, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_GetIsPreviouslyUnderWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_int_Variable) == 0x00021C, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_MapRangeClamped_ReturnValue) == 0x000220, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_RandomFloatInRange_ReturnValue) == 0x000228, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_GetFloatValue_ReturnValue) == 0x000230, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000238, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000240, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000248, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_SelectString_ReturnValue) == 0x000250, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_SelectString_ReturnValue_1) == 0x000260, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000270, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_Round_ReturnValue) == 0x000278, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00027C, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, K2Node_Select_Default) == 0x000280, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_SelectString_ReturnValue_2) == 0x000290, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_SelectString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, Temp_bool_IsClosed_Variable_1) == 0x0002A0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0002A1, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0002A8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x0002B8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0002C0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0002C8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_K2_SetTimerDelegate_InitialStartDelay_ImplicitCast) == 0x0002CC, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_K2_SetTimerDelegate_InitialStartDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x0002D0, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low, CallFunc_LessEqual_DoubleDouble_B_ImplicitCast) == 0x0002D8, "Member 'GC_Hero_Stamina_Low_C_ExecuteUbergraph_GC_Hero_Stamina_Low::CallFunc_LessEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function GC_Hero_Stamina_Low.GC_Hero_Stamina_Low_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Hero_Stamina_Low_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Stamina_Low_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Hero_Stamina_Low_C_OnLoopingEnd");
static_assert(sizeof(GC_Hero_Stamina_Low_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Hero_Stamina_Low_C_OnLoopingEnd");
static_assert(offsetof(GC_Hero_Stamina_Low_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Hero_Stamina_Low_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Hero_Stamina_Low_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Hero_Stamina_Low.GC_Hero_Stamina_Low_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_Stamina_Low_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Stamina_Low_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Hero_Stamina_Low_C_OnLoopingStart");
static_assert(sizeof(GC_Hero_Stamina_Low_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Hero_Stamina_Low_C_OnLoopingStart");
static_assert(offsetof(GC_Hero_Stamina_Low_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Hero_Stamina_Low_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Hero_Stamina_Low_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Stamina_Low_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Hero_Stamina_Low_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

