#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hurt_Bombug_Final

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GC_Hurt_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hurt_Bombug_Final.GC_Hurt_Bombug_Final_C
// 0x0068 (0x00F0 - 0x0088)
class UGC_Hurt_Bombug_Final_C final : public UGC_Hurt_Base_C
{
public:
	struct FAkEventSlotConfig                     LowHurt;                                           // 0x0088(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FAkEventSlotConfig                     HighHurt;                                          // 0x00B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        Threshold;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FAkEventSlotConfig GetConfig(const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hurt_Bombug_Final_C">();
	}
	static class UGC_Hurt_Bombug_Final_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_Hurt_Bombug_Final_C>();
	}
};
static_assert(alignof(UGC_Hurt_Bombug_Final_C) == 0x000008, "Wrong alignment on UGC_Hurt_Bombug_Final_C");
static_assert(sizeof(UGC_Hurt_Bombug_Final_C) == 0x0000F0, "Wrong size on UGC_Hurt_Bombug_Final_C");
static_assert(offsetof(UGC_Hurt_Bombug_Final_C, LowHurt) == 0x000088, "Member 'UGC_Hurt_Bombug_Final_C::LowHurt' has a wrong offset!");
static_assert(offsetof(UGC_Hurt_Bombug_Final_C, HighHurt) == 0x0000B8, "Member 'UGC_Hurt_Bombug_Final_C::HighHurt' has a wrong offset!");
static_assert(offsetof(UGC_Hurt_Bombug_Final_C, Threshold) == 0x0000E8, "Member 'UGC_Hurt_Bombug_Final_C::Threshold' has a wrong offset!");

}

