#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_BleedOut

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.ExecuteUbergraph_GC_Hero_BleedOut
// 0x0798 (0x0798 - 0x0000)
struct GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_4;                             // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_3;                         // 0x0108(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x01F8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_3;                             // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0258(0x0058)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x02E8(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0308(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x03F8(0x0058)(ConstParm, ContainsInstancedReference)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x04D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x04D8(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x05C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B3[0x1];                                      // 0x06B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0708(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0728(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0730(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0758(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0770(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0788(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Roll_ImplicitCast;            // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut");
static_assert(sizeof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut) == 0x000798, "Wrong size on GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, EntryPoint) == 0x000000, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Target) == 0x000008, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Target_4) == 0x000100, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Target_4' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Parameters_3) == 0x000108, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Parameters_3' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_SpawnResults_2) == 0x0001F8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Target_3) == 0x000250, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Target_3' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_SpawnResults_1) == 0x000258, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002B0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_CreateDelegate_OutputDelegate) == 0x0002B8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_MakeRotator_ReturnValue) == 0x0002C8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002E0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, Temp_object_Variable) == 0x0002E8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0002F8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Target_2) == 0x000300, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Parameters_2) == 0x000308, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_SpawnResults) == 0x0003F8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000450, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000468, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000480, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000488, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000490, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0004A0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_Add_VectorVector_ReturnValue) == 0x0004B8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Target_1) == 0x0004D0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, K2Node_Event_Parameters_1) == 0x0004D8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_LineTraceSingle_OutHit) == 0x0005C8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_LineTraceSingle_ReturnValue) == 0x0006B0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_bBlockingHit) == 0x0006B1, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_bInitialOverlap) == 0x0006B2, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_Time) == 0x0006B4, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_Distance) == 0x0006B8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_Location) == 0x0006C0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_ImpactPoint) == 0x0006D8, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_Normal) == 0x0006F0, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_ImpactNormal) == 0x000708, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_PhysMat) == 0x000720, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_HitActor) == 0x000728, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_HitComponent) == 0x000730, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_HitBoneName) == 0x000738, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_BoneName) == 0x000740, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_HitItem) == 0x000748, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_ElementIndex) == 0x00074C, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_FaceIndex) == 0x000750, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_TraceStart) == 0x000758, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_BreakHitResult_TraceEnd) == 0x000770, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000788, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_MakeRotator_Roll_ImplicitCast) == 0x000790, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_MakeRotator_Roll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000794, "Member 'GC_Hero_BleedOut_C_ExecuteUbergraph_GC_Hero_BleedOut::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_BleedOut_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BleedOut_C_OnApplication) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_OnApplication");
static_assert(sizeof(GC_Hero_BleedOut_C_OnApplication) == 0x000150, "Wrong size on GC_Hero_BleedOut_C_OnApplication");
static_assert(offsetof(GC_Hero_BleedOut_C_OnApplication, Target) == 0x000000, "Member 'GC_Hero_BleedOut_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Hero_BleedOut_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Hero_BleedOut_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Hero_BleedOut_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BleedOut_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_OnBecomeViewTarget");
static_assert(sizeof(GC_Hero_BleedOut_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_Hero_BleedOut_C_OnBecomeViewTarget");
static_assert(offsetof(GC_Hero_BleedOut_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_Hero_BleedOut_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_Hero_BleedOut_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Hero_BleedOut_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BleedOut_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_OnEndViewTarget");
static_assert(sizeof(GC_Hero_BleedOut_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_Hero_BleedOut_C_OnEndViewTarget");
static_assert(offsetof(GC_Hero_BleedOut_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_Hero_BleedOut_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_Hero_BleedOut_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Hero_BleedOut_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BleedOut_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_OnLoopingEnd");
static_assert(sizeof(GC_Hero_BleedOut_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Hero_BleedOut_C_OnLoopingEnd");
static_assert(offsetof(GC_Hero_BleedOut_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Hero_BleedOut_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Hero_BleedOut_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Hero_BleedOut.GC_Hero_BleedOut_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_BleedOut_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BleedOut_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Hero_BleedOut_C_OnLoopingStart");
static_assert(sizeof(GC_Hero_BleedOut_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Hero_BleedOut_C_OnLoopingStart");
static_assert(offsetof(GC_Hero_BleedOut_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Hero_BleedOut_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Hero_BleedOut_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_BleedOut_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Hero_BleedOut_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

