#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hit_Melee_Material

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Hit_Melee_Material.GC_Hit_Melee_Material_C.ChooseDecalMaterial
// 0x0030 (0x0030 - 0x0000)
struct GC_Hit_Melee_Material_C_ChooseDecalMaterial final
{
public:
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMaterialInstance*                      Material;                                          // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hit_Melee_Material_C_ChooseDecalMaterial) == 0x000008, "Wrong alignment on GC_Hit_Melee_Material_C_ChooseDecalMaterial");
static_assert(sizeof(GC_Hit_Melee_Material_C_ChooseDecalMaterial) == 0x000030, "Wrong size on GC_Hit_Melee_Material_C_ChooseDecalMaterial");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, SourceTags) == 0x000000, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::SourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, Material) == 0x000020, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::Material' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, CallFunc_HasTag_ReturnValue) == 0x000028, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, CallFunc_HasTag_ReturnValue_1) == 0x000029, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, CallFunc_IsValid_ReturnValue) == 0x00002A, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseDecalMaterial, CallFunc_IsValid_ReturnValue_1) == 0x00002B, "Member 'GC_Hit_Melee_Material_C_ChooseDecalMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GC_Hit_Melee_Material.GC_Hit_Melee_Material_C.ChooseEmitterTemplate
// 0x0058 (0x0058 - 0x0000)
struct GC_Hit_Melee_Material_C_ChooseEmitterTemplate final
{
public:
	struct FGameplayTagContainer                  SourceTags;                                        // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                Emitter;                                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default_2;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate) == 0x000008, "Wrong alignment on GC_Hit_Melee_Material_C_ChooseEmitterTemplate");
static_assert(sizeof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate) == 0x000058, "Wrong size on GC_Hit_Melee_Material_C_ChooseEmitterTemplate");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, SourceTags) == 0x000000, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::SourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, Emitter) == 0x000020, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::Emitter' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_HasTag_ReturnValue) == 0x000028, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_HasTag_ReturnValue_1) == 0x00002A, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, Temp_bool_Variable) == 0x00002B, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, Temp_bool_Variable_1) == 0x00002C, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_IsValid_ReturnValue_2) == 0x00002E, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, K2Node_Select_Default) == 0x000030, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, K2Node_Select_Default_1) == 0x000038, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_IsValid_ReturnValue_3) == 0x000040, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, Temp_bool_Variable_2) == 0x000041, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, K2Node_Select_Default_2) == 0x000048, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_ChooseEmitterTemplate, CallFunc_IsValid_ReturnValue_4) == 0x000050, "Member 'GC_Hit_Melee_Material_C_ChooseEmitterTemplate::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");

// Function GC_Hit_Melee_Material.GC_Hit_Melee_Material_C.OnExecute
// 0x0718 (0x0718 - 0x0000)
struct GC_Hit_Melee_Material_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               DecalRotation;                                     // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               ParticleRotation;                                  // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        ParticleRotationX_Roll_Offset;                     // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ParticleRotationX_Roll_;                           // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Rotation;                                   // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecalRotationX_Roll_;                              // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecalRotationX_Roll_Offset;                        // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DecalMaterial_0;                                   // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0168(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0190(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01B0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      CallFunc_ChooseDecalMaterial_Material;             // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_FindCaliberSize_CaliberType;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAkRtpcWrapper                         K2Node_MakeStruct_AkRtpcWrapper;                   // 0x0278(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkRtpcWrapper>                 K2Node_MakeArray_Array;                            // 0x0298(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_ChooseEmitterTemplate_Emitter;            // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x02C0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AB[0x1];                                      // 0x03AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0450(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0480(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ProjectOnToNormal_ReturnValue;     // 0x0498(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x04B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x04C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x04E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue_1;              // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0568(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0580(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x05B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x05D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_X;                          // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Y;                          // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector3f_Z;                          // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0600(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0620(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0628(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0648(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue_2;              // 0x0668(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue_3;              // 0x0680(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDecalComponent*                        CallFunc_SpawnDecalAttached_ReturnValue;           // 0x0698(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BulletHitSoundSubsystem_C*          CallFunc_GetWorldSubsystem_ReturnValue;            // 0x06B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Value_ImplicitCast;              // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              CallFunc_BreakVector3f_InVec_ImplicitCast;         // 0x06C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector_X_ImplicitCast;                // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Y_ImplicitCast;                // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_ImplicitCast;                // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_StartDelay_ImplicitCast;       // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeOut_Duration_ImplicitCast;         // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hit_Melee_Material_C_OnExecute) == 0x000008, "Wrong alignment on GC_Hit_Melee_Material_C_OnExecute");
static_assert(sizeof(GC_Hit_Melee_Material_C_OnExecute) == 0x000718, "Wrong size on GC_Hit_Melee_Material_C_OnExecute");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Hit_Melee_Material_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Hit_Melee_Material_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Hit_Melee_Material_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, DecalRotation) == 0x000100, "Member 'GC_Hit_Melee_Material_C_OnExecute::DecalRotation' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, ParticleRotation) == 0x000118, "Member 'GC_Hit_Melee_Material_C_OnExecute::ParticleRotation' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, ParticleRotationX_Roll_Offset) == 0x000130, "Member 'GC_Hit_Melee_Material_C_OnExecute::ParticleRotationX_Roll_Offset' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, ParticleRotationX_Roll_) == 0x000138, "Member 'GC_Hit_Melee_Material_C_OnExecute::ParticleRotationX_Roll_' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, Random_Rotation) == 0x000140, "Member 'GC_Hit_Melee_Material_C_OnExecute::Random_Rotation' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, DecalRotationX_Roll_) == 0x000148, "Member 'GC_Hit_Melee_Material_C_OnExecute::DecalRotationX_Roll_' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, DecalRotationX_Roll_Offset) == 0x000150, "Member 'GC_Hit_Melee_Material_C_OnExecute::DecalRotationX_Roll_Offset' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, DecalMaterial_0) == 0x000158, "Member 'GC_Hit_Melee_Material_C_OnExecute::DecalMaterial_0' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000160, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000164, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000168, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000180, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000188, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000190, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x0001D0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001E8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000200, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000208, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000210, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000218, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000220, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000224, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000228, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000230, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_DynamicCast_AsP2NPCharacter) == 0x000238, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_DynamicCast_AsP2Base_Character) == 0x000248, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_ChooseDecalMaterial_Material) == 0x000258, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_ChooseDecalMaterial_Material' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_FindCaliberSize_CaliberType) == 0x000260, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_FindCaliberSize_CaliberType' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000264, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000268, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000270, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_MakeStruct_AkRtpcWrapper) == 0x000278, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_MakeStruct_AkRtpcWrapper' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000290, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_MakeArray_Array) == 0x000298, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_HasTag_ReturnValue) == 0x0002A8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_ChooseEmitterTemplate_Emitter) == 0x0002B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_ChooseEmitterTemplate_Emitter' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_GetObjectClass_ReturnValue) == 0x0002B8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0002C0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0003A8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_bBlockingHit) == 0x0003A9, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003AA, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_Time) == 0x0003AC, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_Distance) == 0x0003B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_Location) == 0x0003B8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_ImpactPoint) == 0x0003D0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_Normal) == 0x0003E8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_ImpactNormal) == 0x000400, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_PhysMat) == 0x000418, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_HitActor) == 0x000420, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_HitComponent) == 0x000428, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_HitBoneName) == 0x000430, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_BoneName) == 0x000438, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_HitItem) == 0x000440, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_ElementIndex) == 0x000444, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_FaceIndex) == 0x000448, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_TraceStart) == 0x000450, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakHitResult_TraceEnd) == 0x000468, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000480, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Vector_ProjectOnToNormal_ReturnValue) == 0x000498, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Vector_ProjectOnToNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0004B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0004C8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0004E0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x0004F8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_RotateAngleAxis_ReturnValue) == 0x000500, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeRotFromXZ_ReturnValue_1) == 0x000518, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeRotFromXZ_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BooleanOR_ReturnValue) == 0x000530, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_RandomFloatInRange_ReturnValue) == 0x000538, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakRotator_Roll) == 0x000540, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakRotator_Pitch) == 0x000544, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakRotator_Yaw) == 0x000548, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000550, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeRotator_ReturnValue) == 0x000568, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_GetUpVector_ReturnValue) == 0x000580, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000598, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Add_VectorVector_ReturnValue) == 0x0005B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_RandomFloat_ReturnValue) == 0x0005C8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0005D0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0005D8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakVector3f_X) == 0x0005F0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakVector3f_X' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakVector3f_Y) == 0x0005F4, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakVector3f_Y' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakVector3f_Z) == 0x0005F8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakVector3f_Z' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeVector_ReturnValue) == 0x000600, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000618, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000620, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000628, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000640, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000648, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000660, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeRotFromXZ_ReturnValue_2) == 0x000668, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeRotFromXZ_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeRotFromXZ_ReturnValue_3) == 0x000680, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeRotFromXZ_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SpawnDecalAttached_ReturnValue) == 0x000698, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SpawnDecalAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x0006A0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0006A8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0006B0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0006B8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast) == 0x0006C0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, K2Node_MakeStruct_Value_ImplicitCast) == 0x0006C4, "Member 'GC_Hit_Melee_Material_C_OnExecute::K2Node_MakeStruct_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_BreakVector3f_InVec_ImplicitCast) == 0x0006C8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_BreakVector3f_InVec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeVector_X_ImplicitCast) == 0x0006D8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeVector_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeVector_Y_ImplicitCast) == 0x0006E0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeVector_Y_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_MakeVector_Z_ImplicitCast) == 0x0006E8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_MakeVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast) == 0x0006F0, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0006F8, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000700, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SetFadeOut_StartDelay_ImplicitCast) == 0x000708, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SetFadeOut_StartDelay_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SetFadeOut_Duration_ImplicitCast) == 0x00070C, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SetFadeOut_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000710, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hit_Melee_Material_C_OnExecute, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000714, "Member 'GC_Hit_Melee_Material_C_OnExecute::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function GC_Hit_Melee_Material.GC_Hit_Melee_Material_C.SpawnCascadeSystem
// 0x0058 (0x0058 - 0x0000)
struct GC_Hit_Melee_Material_C_SpawnCascadeSystem final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                SystemRef;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
