#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Land

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_Land.GC_Hero_Land_C.OnExecute
// 0x0280 (0x0280 - 0x0000)
struct GC_Hero_Land_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RawMagnitude;                                      // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0110(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0138(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0158(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAnimSpringSimData*               Temp_object_Variable;                              // 0x01F0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetImmersionHeight_ReturnValue;           // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput;                   // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput_1;                 // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAnimSpringSimData*               Temp_object_Variable_1;                            // 0x0220(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput_2;                 // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UAnimSpringSimData*               K2Node_Select_Default;                             // 0x0248(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimSpring_Scale_ImplicitCast;        // 0x0278(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Land_C_OnExecute) == 0x000008, "Wrong alignment on GC_Hero_Land_C_OnExecute");
static_assert(sizeof(GC_Hero_Land_C_OnExecute) == 0x000280, "Wrong size on GC_Hero_Land_C_OnExecute");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Hero_Land_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Hero_Land_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Hero_Land_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, RawMagnitude) == 0x0000FC, "Member 'GC_Hero_Land_C_OnExecute::RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, Temp_bool_Variable) == 0x000100, "Member 'GC_Hero_Land_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000104, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000108, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000110, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000128, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000130, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000138, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000158, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000178, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000190, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A8, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B0, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B8, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C0, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C8, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001CC, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D0, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D8, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_OnActive_ReturnValue) == 0x0001D9, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001E0, "Member 'GC_Hero_Land_C_OnExecute::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'GC_Hero_Land_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, Temp_object_Variable) == 0x0001F0, "Member 'GC_Hero_Land_C_OnExecute::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_GetImmersionHeight_ReturnValue) == 0x0001F8, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_GetImmersionHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_SetRTPC_self_CastInput) == 0x000200, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_SetRTPC_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_SetRTPC_self_CastInput_1) == 0x000210, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_SetRTPC_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, Temp_object_Variable_1) == 0x000220, "Member 'GC_Hero_Land_C_OnExecute::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000228, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_SetRTPC_self_CastInput_2) == 0x000230, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_SetRTPC_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_MapRangeClamped_ReturnValue) == 0x000240, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, K2Node_Select_Default) == 0x000248, "Member 'GC_Hero_Land_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000250, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_SelectFloat_ReturnValue) == 0x000258, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000260, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x000268, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000270, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_Land_C_OnExecute, CallFunc_PlayAnimSpring_Scale_ImplicitCast) == 0x000278, "Member 'GC_Hero_Land_C_OnExecute::CallFunc_PlayAnimSpring_Scale_ImplicitCast' has a wrong offset!");

}

