#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_LadderSlilde

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_LadderSlilde.GC_Hero_LadderSlilde_C.ExecuteUbergraph_GC_Hero_LadderSlilde
// 0x01A8 (0x01A8 - 0x0000)
struct GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0108(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IP2AkAudioInterface>   CallFunc_SetRTPC_self_CastInput;                   // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPC_Value_ImplicitCast;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde) == 0x000008, "Wrong alignment on GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde");
static_assert(sizeof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde) == 0x0001A8, "Wrong size on GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, EntryPoint) == 0x000000, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_Event_Target) == 0x000010, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_Event_Parameters) == 0x000018, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_Event_SpawnResults) == 0x000108, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_DynamicCast_AsP2Base_Character) == 0x000160, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, CallFunc_GetVelocity_ReturnValue) == 0x000170, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, CallFunc_VSize_ReturnValue) == 0x000188, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, CallFunc_SetRTPC_self_CastInput) == 0x000190, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::CallFunc_SetRTPC_self_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde, CallFunc_SetRTPC_Value_ImplicitCast) == 0x0001A0, "Member 'GC_Hero_LadderSlilde_C_ExecuteUbergraph_GC_Hero_LadderSlilde::CallFunc_SetRTPC_Value_ImplicitCast' has a wrong offset!");

// Function GC_Hero_LadderSlilde.GC_Hero_LadderSlilde_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_LadderSlilde_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_LadderSlilde_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Hero_LadderSlilde_C_OnRemoval");
static_assert(sizeof(GC_Hero_LadderSlilde_C_OnRemoval) == 0x000150, "Wrong size on GC_Hero_LadderSlilde_C_OnRemoval");
static_assert(offsetof(GC_Hero_LadderSlilde_C_OnRemoval, Target) == 0x000000, "Member 'GC_Hero_LadderSlilde_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Hero_LadderSlilde_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_LadderSlilde_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_Hero_LadderSlilde_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GC_Hero_LadderSlilde.GC_Hero_LadderSlilde_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_Hero_LadderSlilde_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_LadderSlilde_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_Hero_LadderSlilde_C_ReceiveTick");
static_assert(sizeof(GC_Hero_LadderSlilde_C_ReceiveTick) == 0x000004, "Wrong size on GC_Hero_LadderSlilde_C_ReceiveTick");
static_assert(offsetof(GC_Hero_LadderSlilde_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_Hero_LadderSlilde_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

