#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_BulletPassBy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.ExecuteUbergraph_GC_Hero_BulletPassBy
// 0x0730 (0x0730 - 0x0000)
struct GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0108(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0168(0x00F0)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0260(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0288(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x02A8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0xF];                                      // 0x0351(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0360(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue;            // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x03D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0xF];                                      // 0x0431(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeRelativeTransform_ReturnValue;        // 0x0440(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x04A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x04B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x04D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x04E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0500(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0518(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0540(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance2D_ReturnValue;            // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEffectRatio_RideSide;                  // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEffectRatio_LeftSide;                  // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEffectRatio_TopSide;                   // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x05A8(0x00F0)(ConstParm, ContainsInstancedReference)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_1;        // 0x0698(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B2[0x6];                                      // 0x06B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x06B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x06C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetEffectRatio_InYaw_ImplicitCast;        // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy) == 0x000010, "Wrong alignment on GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy");
static_assert(sizeof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy) == 0x000730, "Wrong size on GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, EntryPoint) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Target_2) == 0x000010, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Parameters_2) == 0x000018, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_SpawnResults) == 0x000108, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Target_1) == 0x000160, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Parameters_1) == 0x000168, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000258, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00025C, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000260, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000278, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000280, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000288, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0002A8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_Location) == 0x0002C8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_Normal) == 0x0002E0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0002F8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000300, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000308, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000310, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000318, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00031C, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000320, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000328, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_FindCameraComponent_ReturnValue) == 0x000330, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_MakeRotFromX_ReturnValue) == 0x000338, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_IsValid_ReturnValue_1) == 0x000350, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_MakeTransform_ReturnValue) == 0x000360, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetLocalViewActor_ReturnValue) == 0x0003C0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetLocalViewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetTransform_ReturnValue) == 0x0003D0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000430, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_MakeRelativeTransform_ReturnValue) == 0x000440, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_MakeRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Location) == 0x0004A0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Rotation) == 0x0004B8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Scale) == 0x0004D0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Location_1) == 0x0004E8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Rotation_1) == 0x000500, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakTransform_Scale_1) == 0x000518, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakRotator_Roll) == 0x000530, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakRotator_Pitch) == 0x000534, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakRotator_Yaw) == 0x000538, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000540, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Vector_Distance2D_ReturnValue) == 0x000558, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Vector_Distance2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakVector_X) == 0x000560, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakVector_Y) == 0x000568, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BreakVector_Z) == 0x000570, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_MapRangeClamped_ReturnValue) == 0x000578, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetEffectRatio_RideSide) == 0x000580, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetEffectRatio_RideSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetEffectRatio_LeftSide) == 0x000588, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetEffectRatio_LeftSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetEffectRatio_TopSide) == 0x000590, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetEffectRatio_TopSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000598, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Target) == 0x0005A0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, K2Node_Event_Parameters) == 0x0005A8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_FindCameraComponent_ReturnValue_1) == 0x000698, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_IsValid_ReturnValue_2) == 0x0006A0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0006A8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_IsValid_ReturnValue_3) == 0x0006B0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_BooleanAND_ReturnValue) == 0x0006B1, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0006B8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x0006C8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x0006D8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Less_IntInt_ReturnValue) == 0x0006DC, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0006E0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0006E8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x0006F0, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x0006F8, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000700, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_GetEffectRatio_InYaw_ImplicitCast) == 0x000708, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_GetEffectRatio_InYaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000710, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000718, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000720, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000728, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x00072C, "Member 'GC_Hero_BulletPassBy_C_ExecuteUbergraph_GC_Hero_BulletPassBy::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.GetEffectRatio
// 0x0080 (0x0080 - 0x0000)
struct GC_Hero_BulletPassBy_C_GetEffectRatio final
{
public:
	double                                        InYaw;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RideSide;                                          // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeftSide;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TopSide;                                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Yaw;                                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_GetEffectRatio) == 0x000008, "Wrong alignment on GC_Hero_BulletPassBy_C_GetEffectRatio");
static_assert(sizeof(GC_Hero_BulletPassBy_C_GetEffectRatio) == 0x000080, "Wrong size on GC_Hero_BulletPassBy_C_GetEffectRatio");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, InYaw) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::InYaw' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, Height) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::Height' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, RideSide) == 0x000010, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::RideSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, LeftSide) == 0x000018, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::LeftSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, TopSide) == 0x000020, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::TopSide' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, Scale) == 0x000028, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::Scale' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, Yaw) == 0x000030, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::Yaw' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000050, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_Abs_ReturnValue) == 0x000058, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_DegSin_ReturnValue) == 0x000060, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_GetEffectRatio, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'GC_Hero_BulletPassBy_C_GetEffectRatio::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Hero_BulletPassBy_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_Hero_BulletPassBy_C_OnBecomeViewTarget");
static_assert(sizeof(GC_Hero_BulletPassBy_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_Hero_BulletPassBy_C_OnBecomeViewTarget");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Hero_BulletPassBy_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_Hero_BulletPassBy_C_OnEndViewTarget");
static_assert(sizeof(GC_Hero_BulletPassBy_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_Hero_BulletPassBy_C_OnEndViewTarget");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.OnRecurring
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_BulletPassBy_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_OnRecurring) == 0x000008, "Wrong alignment on GC_Hero_BulletPassBy_C_OnRecurring");
static_assert(sizeof(GC_Hero_BulletPassBy_C_OnRecurring) == 0x000150, "Wrong size on GC_Hero_BulletPassBy_C_OnRecurring");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnRecurring, Target) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_OnRecurring::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnRecurring, Parameters) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_OnRecurring::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_OnRecurring, SpawnResults) == 0x0000F8, "Member 'GC_Hero_BulletPassBy_C_OnRecurring::SpawnResults' has a wrong offset!");

// Function GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C.PlayAnimSpring
// 0x0048 (0x0048 - 0x0000)
struct GC_Hero_BulletPassBy_C_PlayAnimSpring final
{
public:
	const class AActor*                           InActor;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        RightScale;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeftScale;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimSpring_Scale_ImplicitCast;        // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimSpring_Scale_ImplicitCast_1;      // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_BulletPassBy_C_PlayAnimSpring) == 0x000008, "Wrong alignment on GC_Hero_BulletPassBy_C_PlayAnimSpring");
static_assert(sizeof(GC_Hero_BulletPassBy_C_PlayAnimSpring) == 0x000048, "Wrong size on GC_Hero_BulletPassBy_C_PlayAnimSpring");
static_assert(offsetof(GC_Hero_BulletPassBy_C_PlayAnimSpring, InActor) == 0x000000, "Member 'GC_Hero_BulletPassBy_C_PlayAnimSpring::InActor' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_PlayAnimSpring, RightScale) == 0x000008, "Member 'GC_Hero_BulletPassBy_C_PlayAnimSpring::RightScale' has a wrong offset!");
static_assert(offsetof(GC_Hero_BulletPassBy_C_PlayAnimSpring, LeftScale) == 0x000010, "Member 'GC_Hero_BulletPassBy_C_PlayAnimSpring::LeftScale' has a wrong offset!");
