#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Health_Critical

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Hero_Health_Critical.GC_Hero_Health_Critical_C.ExecuteUbergraph_GC_Hero_Health_Critical
// 0x0168 (0x0168 - 0x0000)
struct GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical) == 0x000008, "Wrong alignment on GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical");
static_assert(sizeof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical) == 0x000168, "Wrong size on GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, EntryPoint) == 0x000000, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, K2Node_Event_Target) == 0x000008, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, K2Node_DynamicCast_AsP2Base_Character) == 0x000158, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'GC_Hero_Health_Critical_C_ExecuteUbergraph_GC_Hero_Health_Critical::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_Hero_Health_Critical.GC_Hero_Health_Critical_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Hero_Health_Critical_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Hero_Health_Critical_C_OnApplication) == 0x000008, "Wrong alignment on GC_Hero_Health_Critical_C_OnApplication");
static_assert(sizeof(GC_Hero_Health_Critical_C_OnApplication) == 0x000150, "Wrong size on GC_Hero_Health_Critical_C_OnApplication");
static_assert(offsetof(GC_Hero_Health_Critical_C_OnApplication, Target) == 0x000000, "Member 'GC_Hero_Health_Critical_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Hero_Health_Critical_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Hero_Health_Critical_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Hero_Health_Critical_C_OnApplication::SpawnResults' has a wrong offset!");

}

