#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Heal_Periodic_SetBy_Caller

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Heal_Periodic_SetBy_Caller.GC_Heal_Periodic_SetBy_Caller_C.ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller
// 0x0158 (0x0158 - 0x0000)
struct GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller) == 0x000008, "Wrong alignment on GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller");
static_assert(sizeof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller) == 0x000158, "Wrong size on GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller, EntryPoint) == 0x000000, "Member 'GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller, K2Node_Event_Target) == 0x000008, "Member 'GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Heal_Periodic_SetBy_Caller_C_ExecuteUbergraph_GC_Heal_Periodic_SetBy_Caller::K2Node_Event_SpawnResults' has a wrong offset!");

// Function GC_Heal_Periodic_SetBy_Caller.GC_Heal_Periodic_SetBy_Caller_C.OnEffectLevelChanged
// 0x0010 (0x0010 - 0x0000)
struct GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged");
static_assert(sizeof(GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged) == 0x000010, "Wrong size on GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_Heal_Periodic_SetBy_Caller_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");

// Function GC_Heal_Periodic_SetBy_Caller.GC_Heal_Periodic_SetBy_Caller_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_Heal_Periodic_SetBy_Caller_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Heal_Periodic_SetBy_Caller_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Heal_Periodic_SetBy_Caller_C_OnRemoval");
static_assert(sizeof(GC_Heal_Periodic_SetBy_Caller_C_OnRemoval) == 0x000150, "Wrong size on GC_Heal_Periodic_SetBy_Caller_C_OnRemoval");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_OnRemoval, Target) == 0x000000, "Member 'GC_Heal_Periodic_SetBy_Caller_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Heal_Periodic_SetBy_Caller_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Heal_Periodic_SetBy_Caller_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_Heal_Periodic_SetBy_Caller_C_OnRemoval::SpawnResults' has a wrong offset!");

}

