#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Slide_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_Slide_Base.GC_Hero_Slide_Base_C
// 0x0018 (0x12C8 - 0x12B0)
class AGC_Hero_Slide_Base_C : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystem*                         SlideEffect;                                       // 0x12B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlideSlot;                                         // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Hero_Slide_Base(int32 EntryPoint)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_Slide_Base_C">();
	}
	static class AGC_Hero_Slide_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Hero_Slide_Base_C>();
	}
};
static_assert(alignof(AGC_Hero_Slide_Base_C) == 0x000008, "Wrong alignment on AGC_Hero_Slide_Base_C");
static_assert(sizeof(AGC_Hero_Slide_Base_C) == 0x0012C8, "Wrong size on AGC_Hero_Slide_Base_C");
static_assert(offsetof(AGC_Hero_Slide_Base_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Hero_Slide_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Slide_Base_C, SlideEffect) == 0x0012B8, "Member 'AGC_Hero_Slide_Base_C::SlideEffect' has a wrong offset!");
static_assert(offsetof(AGC_Hero_Slide_Base_C, SlideSlot) == 0x0012C0, "Member 'AGC_Hero_Slide_Base_C::SlideSlot' has a wrong offset!");

}

