#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_BulletPassBy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_BulletPassBy.GC_Hero_BulletPassBy_C
// 0x0048 (0x12F8 - 0x12B0)
class AGC_Hero_BulletPassBy_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_LSide_DBD24FA04B76506638DEA0BCFC10775D;   // 0x12B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_DBD24FA04B76506638DEA0BCFC10775D; // 0x12BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BD[0x3];                                     // 0x12BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x12C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         right_RSide_8119100242C76C7EA8AF5782FA18E23C;      // 0x12C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            right__Direction_8119100242C76C7EA8AF5782FA18E23C; // 0x12CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CD[0x3];                                     // 0x12CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Right;                                             // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Left_LSide_550E93B344BE11CE48A43A92CDCA2912;       // 0x12D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Left__Direction_550E93B344BE11CE48A43A92CDCA2912;  // 0x12DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12DD[0x3];                                     // 0x12DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Left;                                              // 0x12E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x12E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        RefScale;                                          // 0x12F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Hero_BulletPassBy(int32 EntryPoint)	 // 0xae1e64;
	void GetEffectRatio(double InYaw, double Height, double* RideSide, double* LeftSide, double* TopSide)	 // 0xae1e64;
	void Left__FinishedFunc()	 // 0xae1e64;
	void Left__UpdateFunc()	 // 0xae1e64;
	void OnBecomeViewTarget(class AActor* Target, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void OnEndViewTarget(class AActor* Target, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void OnRecurring(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void PlayAnimSpring(const class AActor* InActor, double RightScale, double LeftScale)	 // 0xae1e64;
	void right__FinishedFunc()	 // 0xae1e64;
	void right__UpdateFunc()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_BulletPassBy_C">();
	}
	static class AGC_Hero_BulletPassBy_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Hero_BulletPassBy_C>();
	}
};
static_assert(alignof(AGC_Hero_BulletPassBy_C) == 0x000008, "Wrong alignment on AGC_Hero_BulletPassBy_C");
static_assert(sizeof(AGC_Hero_BulletPassBy_C) == 0x0012F8, "Wrong size on AGC_Hero_BulletPassBy_C");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Hero_BulletPassBy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Timeline_LSide_DBD24FA04B76506638DEA0BCFC10775D) == 0x0012B8, "Member 'AGC_Hero_BulletPassBy_C::Timeline_LSide_DBD24FA04B76506638DEA0BCFC10775D' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Timeline__Direction_DBD24FA04B76506638DEA0BCFC10775D) == 0x0012BC, "Member 'AGC_Hero_BulletPassBy_C::Timeline__Direction_DBD24FA04B76506638DEA0BCFC10775D' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Timeline) == 0x0012C0, "Member 'AGC_Hero_BulletPassBy_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, right_RSide_8119100242C76C7EA8AF5782FA18E23C) == 0x0012C8, "Member 'AGC_Hero_BulletPassBy_C::right_RSide_8119100242C76C7EA8AF5782FA18E23C' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, right__Direction_8119100242C76C7EA8AF5782FA18E23C) == 0x0012CC, "Member 'AGC_Hero_BulletPassBy_C::right__Direction_8119100242C76C7EA8AF5782FA18E23C' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Right) == 0x0012D0, "Member 'AGC_Hero_BulletPassBy_C::Right' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Left_LSide_550E93B344BE11CE48A43A92CDCA2912) == 0x0012D8, "Member 'AGC_Hero_BulletPassBy_C::Left_LSide_550E93B344BE11CE48A43A92CDCA2912' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Left__Direction_550E93B344BE11CE48A43A92CDCA2912) == 0x0012DC, "Member 'AGC_Hero_BulletPassBy_C::Left__Direction_550E93B344BE11CE48A43A92CDCA2912' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Left) == 0x0012E0, "Member 'AGC_Hero_BulletPassBy_C::Left' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, Mid) == 0x0012E8, "Member 'AGC_Hero_BulletPassBy_C::Mid' has a wrong offset!");
static_assert(offsetof(AGC_Hero_BulletPassBy_C, RefScale) == 0x0012F0, "Member 'AGC_Hero_BulletPassBy_C::RefScale' has a wrong offset!");

}

