#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Hero_Death

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Hero_Death.GC_Hero_Death_C
// 0x00B0 (0x0138 - 0x0088)
class UGC_Hero_Death_C final : public UP2GameplayCue_Vocal
{
public:
	struct FAkEventSlotConfig                     HeadshotConfig;                                    // 0x0088(0x0030)(Edit, BlueprintVisible, NoDestructor)
	struct FAkEventSlotConfig                     RegularConfig;                                     // 0x00B8(0x0030)(Edit, BlueprintVisible, NoDestructor)
	TMap<uint8, uint8>                            NewVar;                                            // 0x00E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	struct FAkEventSlotConfig GetConfig(const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Hero_Death_C">();
	}
	static class UGC_Hero_Death_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_Hero_Death_C>();
	}
};
static_assert(alignof(UGC_Hero_Death_C) == 0x000008, "Wrong alignment on UGC_Hero_Death_C");
static_assert(sizeof(UGC_Hero_Death_C) == 0x000138, "Wrong size on UGC_Hero_Death_C");
static_assert(offsetof(UGC_Hero_Death_C, HeadshotConfig) == 0x000088, "Member 'UGC_Hero_Death_C::HeadshotConfig' has a wrong offset!");
static_assert(offsetof(UGC_Hero_Death_C, RegularConfig) == 0x0000B8, "Member 'UGC_Hero_Death_C::RegularConfig' has a wrong offset!");
static_assert(offsetof(UGC_Hero_Death_C, NewVar) == 0x0000E8, "Member 'UGC_Hero_Death_C::NewVar' has a wrong offset!");

}

