#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Inventory_DetachItem

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_Inventory_DetachItem.GC_Inventory_DetachItem_C.OnExecute
// 0x0208 (0x0208 - 0x0000)
struct GC_Inventory_DetachItem_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0118(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2Item*                                K2Node_DynamicCast_AsP2Item;                       // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x01F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Inventory_DetachItem_C_OnExecute) == 0x000008, "Wrong alignment on GC_Inventory_DetachItem_C_OnExecute");
static_assert(sizeof(GC_Inventory_DetachItem_C_OnExecute) == 0x000208, "Wrong size on GC_Inventory_DetachItem_C_OnExecute");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Inventory_DetachItem_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Inventory_DetachItem_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Inventory_DetachItem_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_Inventory_DetachItem_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00010C, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000110, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000118, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000130, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000138, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000198, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B0, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B8, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C0, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C8, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D0, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001D4, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D8, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001E0, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_PostEvent_ReturnValue) == 0x0001E4, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, K2Node_DynamicCast_AsP2Item) == 0x0001E8, "Member 'GC_Inventory_DetachItem_C_OnExecute::K2Node_DynamicCast_AsP2Item' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'GC_Inventory_DetachItem_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0001F1, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_GetItemData_ReturnValue) == 0x0001F8, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_DetachItem_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000200, "Member 'GC_Inventory_DetachItem_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

