#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Impact

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Impact.GC_Impact_C.OnExecute
// 0x0448 (0x0448 - 0x0000)
struct GC_Impact_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Hit_Severity;                                      // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogueArgumentType                         Dialogue_Argument_Type;                            // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0118(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x01F8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x1];                                      // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0360(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x2];                                      // 0x03BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_3;                            // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostLocalOnlyEvent_PlayingID;             // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Impact_C_OnExecute) == 0x000008, "Wrong alignment on GC_Impact_C_OnExecute");
static_assert(sizeof(GC_Impact_C_OnExecute) == 0x000448, "Wrong size on GC_Impact_C_OnExecute");
static_assert(offsetof(GC_Impact_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Impact_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Impact_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Impact_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Hit_Severity) == 0x0000FC, "Member 'GC_Impact_C_OnExecute::Hit_Severity' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Dialogue_Argument_Type) == 0x000100, "Member 'GC_Impact_C_OnExecute::Dialogue_Argument_Type' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_int_Variable) == 0x000104, "Member 'GC_Impact_C_OnExecute::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000108, "Member 'GC_Impact_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00010C, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000110, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000118, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000130, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000138, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000198, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B8, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C8, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001D4, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D8, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001E0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_DynamicCast_AsP2Base_Character) == 0x0001E8, "Member 'GC_Impact_C_OnExecute::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'GC_Impact_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_HasTag_ReturnValue) == 0x0001F1, "Member 'GC_Impact_C_OnExecute::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0001F8, "Member 'GC_Impact_C_OnExecute::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002E0, "Member 'GC_Impact_C_OnExecute::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_bBlockingHit) == 0x0002E1, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002E2, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_Time) == 0x0002E4, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_Distance) == 0x0002E8, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_Location) == 0x0002F0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_ImpactPoint) == 0x000308, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_Normal) == 0x000320, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_ImpactNormal) == 0x000338, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_PhysMat) == 0x000350, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_HitActor) == 0x000358, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_HitComponent) == 0x000360, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_HitBoneName) == 0x000368, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_BoneName) == 0x000370, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_HitItem) == 0x000378, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_ElementIndex) == 0x00037C, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_FaceIndex) == 0x000380, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_TraceStart) == 0x000388, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_BreakHitResult_TraceEnd) == 0x0003A0, "Member 'GC_Impact_C_OnExecute::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_bool_Variable) == 0x0003B8, "Member 'GC_Impact_C_OnExecute::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_ObjectIsA_ReturnValue) == 0x0003B9, "Member 'GC_Impact_C_OnExecute::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_int_Variable_1) == 0x0003BC, "Member 'GC_Impact_C_OnExecute::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_int_Variable_2) == 0x0003C0, "Member 'GC_Impact_C_OnExecute::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x0003C4, "Member 'GC_Impact_C_OnExecute::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_Select_Default) == 0x0003C8, "Member 'GC_Impact_C_OnExecute::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_int_Variable_3) == 0x0003CC, "Member 'GC_Impact_C_OnExecute::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_string_Variable) == 0x0003D0, "Member 'GC_Impact_C_OnExecute::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_string_Variable_1) == 0x0003E0, "Member 'GC_Impact_C_OnExecute::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_string_Variable_2) == 0x0003F0, "Member 'GC_Impact_C_OnExecute::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_string_Variable_3) == 0x000400, "Member 'GC_Impact_C_OnExecute::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_bool_Variable_1) == 0x000410, "Member 'GC_Impact_C_OnExecute::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_Select_Default_1) == 0x000418, "Member 'GC_Impact_C_OnExecute::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_int_Variable_4) == 0x000428, "Member 'GC_Impact_C_OnExecute::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, Temp_bool_Variable_2) == 0x00042C, "Member 'GC_Impact_C_OnExecute::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_Select_Default_2) == 0x000430, "Member 'GC_Impact_C_OnExecute::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, K2Node_Select_Default_3) == 0x000434, "Member 'GC_Impact_C_OnExecute::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_PostLocalOnlyEvent_PlayingID) == 0x000438, "Member 'GC_Impact_C_OnExecute::CallFunc_PostLocalOnlyEvent_PlayingID' has a wrong offset!");
static_assert(offsetof(GC_Impact_C_OnExecute, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000440, "Member 'GC_Impact_C_OnExecute::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

