#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Inventory_TransferItemContainer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_Inventory_TransferItemContainer.GC_Inventory_TransferItemContainer_C.GetItemData
// 0x0038 (0x0038 - 0x0000)
struct GC_Inventory_TransferItemContainer_C_GetItemData final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ItemData*                            OutItemData;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2Item*                                K2Node_DynamicCast_AsP2Item;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemData*                            K2Node_DynamicCast_AsP2Item_Data;                  // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ItemData*                      CallFunc_GetItemData_ReturnValue;                  // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Inventory_TransferItemContainer_C_GetItemData) == 0x000008, "Wrong alignment on GC_Inventory_TransferItemContainer_C_GetItemData");
static_assert(sizeof(GC_Inventory_TransferItemContainer_C_GetItemData) == 0x000038, "Wrong size on GC_Inventory_TransferItemContainer_C_GetItemData");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, InObject) == 0x000000, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::InObject' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, OutItemData) == 0x000008, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::OutItemData' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, K2Node_DynamicCast_AsP2Item) == 0x000010, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::K2Node_DynamicCast_AsP2Item' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, K2Node_DynamicCast_AsP2Item_Data) == 0x000020, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::K2Node_DynamicCast_AsP2Item_Data' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_GetItemData, CallFunc_GetItemData_ReturnValue) == 0x000030, "Member 'GC_Inventory_TransferItemContainer_C_GetItemData::CallFunc_GetItemData_ReturnValue' has a wrong offset!");

// Function GC_Inventory_TransferItemContainer.GC_Inventory_TransferItemContainer_C.OnExecute
// 0x0200 (0x0200 - 0x0000)
struct GC_Inventory_TransferItemContainer_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0118(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0140(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0160(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2ItemData*                            CallFunc_GetItemData_OutItemData;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Select_Switch_Switch;                     // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Inventory_TransferItemContainer_C_OnExecute) == 0x000008, "Wrong alignment on GC_Inventory_TransferItemContainer_C_OnExecute");
static_assert(sizeof(GC_Inventory_TransferItemContainer_C_OnExecute) == 0x000200, "Wrong size on GC_Inventory_TransferItemContainer_C_OnExecute");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00010C, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000110, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000118, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000130, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000138, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000140, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000160, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000180, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000198, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001B0, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001B8, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001C0, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001C8, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001D0, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001D4, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001D8, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001E0, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_PostEvent_ReturnValue) == 0x0001E4, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_GetItemData_OutItemData) == 0x0001E8, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_GetItemData_OutItemData' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0001F0, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x0001F1, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_OnExecute, CallFunc_Select_Switch_Switch) == 0x0001F4, "Member 'GC_Inventory_TransferItemContainer_C_OnExecute::CallFunc_Select_Switch_Switch' has a wrong offset!");

// Function GC_Inventory_TransferItemContainer.GC_Inventory_TransferItemContainer_C.Select Switch
// 0x0050 (0x0050 - 0x0000)
struct GC_Inventory_TransferItemContainer_C_Select_Switch final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  OptionalTags;                                      // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   SWITCH;                                            // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_3;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_4;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_5;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_6;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_2;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_3;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_4;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_5;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_6;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_7;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_8;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_9;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_10;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_11;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_12;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_13;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_14;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_15;            // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_16;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_17;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Inventory_TransferItemContainer_C_Select_Switch) == 0x000008, "Wrong alignment on GC_Inventory_TransferItemContainer_C_Select_Switch");
static_assert(sizeof(GC_Inventory_TransferItemContainer_C_Select_Switch) == 0x000050, "Wrong size on GC_Inventory_TransferItemContainer_C_Select_Switch");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, Tag) == 0x000000, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::Tag' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, OptionalTags) == 0x000008, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::OptionalTags' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, SWITCH) == 0x000028, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::SWITCH' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue) == 0x000030, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_1) == 0x000031, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_2) == 0x000032, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_3) == 0x000033, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_4) == 0x000034, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_5) == 0x000036, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesTag_ReturnValue_6) == 0x000037, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue) == 0x000038, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_1) == 0x000039, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_2) == 0x00003A, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_3) == 0x00003B, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_4) == 0x00003C, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_5) == 0x00003D, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_6) == 0x00003E, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_7) == 0x00003F, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_8) == 0x000040, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_9) == 0x000041, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_10) == 0x000042, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_11) == 0x000043, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_12) == 0x000044, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_13) == 0x000045, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_14) == 0x000046, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_15) == 0x000047, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_16) == 0x000048, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(GC_Inventory_TransferItemContainer_C_Select_Switch, CallFunc_MatchesAnyTags_ReturnValue_17) == 0x000049, "Member 'GC_Inventory_TransferItemContainer_C_Select_Switch::CallFunc_MatchesAnyTags_ReturnValue_17' has a wrong offset!");

}

