#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Laps_Trigger_Throwable

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GC_Laps_Trigger_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Laps_Trigger_Throwable.GC_Laps_Trigger_Throwable_C
// 0x0038 (0x04E0 - 0x04A8)
class UGC_Laps_Trigger_Throwable_C final : public UGC_Laps_Trigger_Base_C
{
public:
	class UAkAudioEvent*                          ThrowableDestroyEvent;                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   ExplosiveThrowable;                                // 0x04B0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   NonExplosiveThrowable;                             // 0x04C0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   Deployable;                                        // 0x04D0(0x0010)(Edit, BlueprintVisible)

public:
	void SpawnDestructionParticles(const class UObject* WorldContextObject, class UNiagaraSystem* SystemTemplate, const struct FVector& Location, const struct FRotator& Rotation)	 // 0xae1e64;

	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Laps_Trigger_Throwable_C">();
	}
	static class UGC_Laps_Trigger_Throwable_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_Laps_Trigger_Throwable_C>();
	}
};
static_assert(alignof(UGC_Laps_Trigger_Throwable_C) == 0x000008, "Wrong alignment on UGC_Laps_Trigger_Throwable_C");
static_assert(sizeof(UGC_Laps_Trigger_Throwable_C) == 0x0004E0, "Wrong size on UGC_Laps_Trigger_Throwable_C");
static_assert(offsetof(UGC_Laps_Trigger_Throwable_C, ThrowableDestroyEvent) == 0x0004A8, "Member 'UGC_Laps_Trigger_Throwable_C::ThrowableDestroyEvent' has a wrong offset!");
static_assert(offsetof(UGC_Laps_Trigger_Throwable_C, ExplosiveThrowable) == 0x0004B0, "Member 'UGC_Laps_Trigger_Throwable_C::ExplosiveThrowable' has a wrong offset!");
static_assert(offsetof(UGC_Laps_Trigger_Throwable_C, NonExplosiveThrowable) == 0x0004C0, "Member 'UGC_Laps_Trigger_Throwable_C::NonExplosiveThrowable' has a wrong offset!");
static_assert(offsetof(UGC_Laps_Trigger_Throwable_C, Deployable) == 0x0004D0, "Member 'UGC_Laps_Trigger_Throwable_C::Deployable' has a wrong offset!");

}

