#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PlasmaGenerator_Start

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_PlasmaGenerator_Start.GC_PlasmaGenerator_Start_C.DestroyEffects
// 0x0002 (0x0002 - 0x0000)
struct GC_PlasmaGenerator_Start_C_DestroyEffects final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PlasmaGenerator_Start_C_DestroyEffects) == 0x000001, "Wrong alignment on GC_PlasmaGenerator_Start_C_DestroyEffects");
static_assert(sizeof(GC_PlasmaGenerator_Start_C_DestroyEffects) == 0x000002, "Wrong size on GC_PlasmaGenerator_Start_C_DestroyEffects");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_DestroyEffects, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GC_PlasmaGenerator_Start_C_DestroyEffects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_DestroyEffects, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GC_PlasmaGenerator_Start_C_DestroyEffects::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GC_PlasmaGenerator_Start.GC_PlasmaGenerator_Start_C.OnRemove
// 0x0100 (0x0100 - 0x0000)
struct GC_PlasmaGenerator_Start_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PlasmaGenerator_Start_C_OnRemove) == 0x000008, "Wrong alignment on GC_PlasmaGenerator_Start_C_OnRemove");
static_assert(sizeof(GC_PlasmaGenerator_Start_C_OnRemove) == 0x000100, "Wrong size on GC_PlasmaGenerator_Start_C_OnRemove");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_PlasmaGenerator_Start_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_OnRemove, Parameters) == 0x000008, "Member 'GC_PlasmaGenerator_Start_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GC_PlasmaGenerator_Start_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GC_PlasmaGenerator_Start.GC_PlasmaGenerator_Start_C.WhileActive
// 0x0220 (0x0220 - 0x0000)
struct GC_PlasmaGenerator_Start_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Usable*                              K2Node_DynamicCast_AsP2Usable;                     // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetMesh3P_ReturnValue;                    // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetMesh1P_ReturnValue;                    // 0x0200(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20B[0x5];                                      // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PlasmaGenerator_Start_C_WhileActive) == 0x000008, "Wrong alignment on GC_PlasmaGenerator_Start_C_WhileActive");
static_assert(sizeof(GC_PlasmaGenerator_Start_C_WhileActive) == 0x000220, "Wrong size on GC_PlasmaGenerator_Start_C_WhileActive");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, Parameters) == 0x000008, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_Normal) == 0x000188, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, K2Node_DynamicCast_AsP2Usable) == 0x0001D8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::K2Node_DynamicCast_AsP2Usable' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_IsValid_ReturnValue) == 0x0001E1, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_GetMesh3P_ReturnValue) == 0x0001E8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_IsValid_ReturnValue_1) == 0x0001F0, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_IsVisible_ReturnValue) == 0x0001F1, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0001F8, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_GetMesh1P_ReturnValue) == 0x000200, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_GetMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_IsValid_ReturnValue_2) == 0x000208, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000209, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_IsVisible_ReturnValue_1) == 0x00020A, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x000210, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PlasmaGenerator_Start_C_WhileActive, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000218, "Member 'GC_PlasmaGenerator_Start_C_WhileActive::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

