#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PLSD_VO_Instant_Base

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GC_PLSD_VO_Instant_Base.GC_PLSD_VO_Instant_Base_C.OnAkEventEnd
// 0x00B0 (0x00B0 - 0x0000)
struct GC_PLSD_VO_Instant_Base_C_OnAkEventEnd final
{
public:
	EAkCallbackType                               CallbackType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkCallbackInfo*                        CallbackInfo;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2VerbMessage                         Message;                                           // 0x0010(0x0098)(Edit, BlueprintVisible)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd) == 0x000008, "Wrong alignment on GC_PLSD_VO_Instant_Base_C_OnAkEventEnd");
static_assert(sizeof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd) == 0x0000B0, "Wrong size on GC_PLSD_VO_Instant_Base_C_OnAkEventEnd");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd, CallbackType) == 0x000000, "Member 'GC_PLSD_VO_Instant_Base_C_OnAkEventEnd::CallbackType' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd, CallbackInfo) == 0x000008, "Member 'GC_PLSD_VO_Instant_Base_C_OnAkEventEnd::CallbackInfo' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd, Message) == 0x000010, "Member 'GC_PLSD_VO_Instant_Base_C_OnAkEventEnd::Message' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnAkEventEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A8, "Member 'GC_PLSD_VO_Instant_Base_C_OnAkEventEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function GC_PLSD_VO_Instant_Base.GC_PLSD_VO_Instant_Base_C.OnExecute
// 0x0348 (0x0348 - 0x0000)
struct GC_PLSD_VO_Instant_Base_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2VerbMessage                         Message;                                           // 0x0100(0x0098)(Edit, BlueprintVisible)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01A0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01C8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01E8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0278(0x0020)()
	struct FP2VerbMessage                         K2Node_MakeStruct_P2VerbMessage;                   // 0x0298(0x0098)()
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> K2Node_CreateDelegate_OutputDelegate; // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PLSD_VO_Instant_Base_C_OnExecute) == 0x000008, "Wrong alignment on GC_PLSD_VO_Instant_Base_C_OnExecute");
static_assert(sizeof(GC_PLSD_VO_Instant_Base_C_OnExecute) == 0x000348, "Wrong size on GC_PLSD_VO_Instant_Base_C_OnExecute");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, Message) == 0x000100, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::Message' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000198, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00019C, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001A0, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001B8, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001C0, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001C8, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001E8, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000208, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000220, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000238, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000240, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000248, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000250, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000258, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00025C, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000260, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000268, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000270, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000278, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, K2Node_MakeStruct_P2VerbMessage) == 0x000298, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::K2Node_MakeStruct_P2VerbMessage' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, K2Node_CreateDelegate_OutputDelegate) == 0x000330, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000340, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PLSD_VO_Instant_Base_C_OnExecute, CallFunc_PostEvent_ReturnValue) == 0x000344, "Member 'GC_PLSD_VO_Instant_Base_C_OnExecute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

