#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PlasmaGenerator_Start

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PlasmaGenerator_Start.GC_PlasmaGenerator_Start_C
// 0x0018 (0x0318 - 0x0300)
class AGC_PlasmaGenerator_Start_C final : public AP2GameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SystemFPP;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SystemTPP;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void DestroyEffects()	 // 0xae1e64;
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_PlasmaGenerator_Start_C">();
	}
	static class AGC_PlasmaGenerator_Start_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_PlasmaGenerator_Start_C>();
	}
};
static_assert(alignof(AGC_PlasmaGenerator_Start_C) == 0x000008, "Wrong alignment on AGC_PlasmaGenerator_Start_C");
static_assert(sizeof(AGC_PlasmaGenerator_Start_C) == 0x000318, "Wrong size on AGC_PlasmaGenerator_Start_C");
static_assert(offsetof(AGC_PlasmaGenerator_Start_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_PlasmaGenerator_Start_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PlasmaGenerator_Start_C, SystemFPP) == 0x000308, "Member 'AGC_PlasmaGenerator_Start_C::SystemFPP' has a wrong offset!");
static_assert(offsetof(AGC_PlasmaGenerator_Start_C, SystemTPP) == 0x000310, "Member 'AGC_PlasmaGenerator_Start_C::SystemTPP' has a wrong offset!");

}

