#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_RaidMessage_CallInExfil_Available

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_RaidMessage_CallInExfil_Available.GC_RaidMessage_CallInExfil_Available_C.OnExecute
// 0x0130 (0x0130 - 0x0000)
struct GC_RaidMessage_CallInExfil_Available_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(GC_RaidMessage_CallInExfil_Available_C_OnExecute) == 0x000008, "Wrong alignment on GC_RaidMessage_CallInExfil_Available_C_OnExecute");
static_assert(sizeof(GC_RaidMessage_CallInExfil_Available_C_OnExecute) == 0x000130, "Wrong size on GC_RaidMessage_CallInExfil_Available_C_OnExecute");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, Parameters) == 0x000008, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, K2Node_MakeArray_Array) == 0x000100, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x000110, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_RaidMessage_CallInExfil_Available_C_OnExecute, CallFunc_Format_ReturnValue) == 0x000118, "Member 'GC_RaidMessage_CallInExfil_Available_C_OnExecute::CallFunc_Format_ReturnValue' has a wrong offset!");

}

