#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_RaidMessage_CallInExfil_Available

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_RaidMessage_CallInExfil_Available.GC_RaidMessage_CallInExfil_Available_C
// 0x0048 (0x04F0 - 0x04A8)
class UGC_RaidMessage_CallInExfil_Available_C : public UP2GameplayCueNotify_Burst
{
public:
	class FText                                   Zone;                                              // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Notification;                                      // 0x04C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Location;                                          // 0x04D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_RaidMessage_CallInExfil_Available_C">();
	}
	static class UGC_RaidMessage_CallInExfil_Available_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_RaidMessage_CallInExfil_Available_C>();
	}
};
static_assert(alignof(UGC_RaidMessage_CallInExfil_Available_C) == 0x000008, "Wrong alignment on UGC_RaidMessage_CallInExfil_Available_C");
static_assert(sizeof(UGC_RaidMessage_CallInExfil_Available_C) == 0x0004F0, "Wrong size on UGC_RaidMessage_CallInExfil_Available_C");
static_assert(offsetof(UGC_RaidMessage_CallInExfil_Available_C, Zone) == 0x0004A8, "Member 'UGC_RaidMessage_CallInExfil_Available_C::Zone' has a wrong offset!");
static_assert(offsetof(UGC_RaidMessage_CallInExfil_Available_C, Notification) == 0x0004C0, "Member 'UGC_RaidMessage_CallInExfil_Available_C::Notification' has a wrong offset!");
static_assert(offsetof(UGC_RaidMessage_CallInExfil_Available_C, Location) == 0x0004D8, "Member 'UGC_RaidMessage_CallInExfil_Available_C::Location' has a wrong offset!");

}

