#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_TimeoutFadeIn

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_TimeoutFadeIn.GC_Spectre_TimeoutFadeIn_C.ExecuteUbergraph_GC_Spectre_TimeoutFadeIn
// 0x03B0 (0x03B0 - 0x0000)
struct GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0160(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0250(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x02C0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x02E8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0308(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0328(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0340(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter_1;              // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn");
static_assert(sizeof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn) == 0x0003B0, "Wrong size on GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, EntryPoint) == 0x000000, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_Target) == 0x000008, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_Target_1) == 0x000158, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_Parameters_1) == 0x000160, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_Event_SpawnResults_1) == 0x000250, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_DynamicCast_AsP2NPCharacter) == 0x0002A8, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_DynamicCast_bSuccess) == 0x0002B0, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0002B4, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0002B8, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0002C0, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0002D8, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0002E0, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0002E8, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000308, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_Location) == 0x000328, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_Normal) == 0x000340, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000358, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000360, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000368, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000370, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000378, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00037C, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000380, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000388, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_PostEventAtLocation_ReturnValue) == 0x00038C, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000390, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_DynamicCast_AsP2NPCharacter_1) == 0x000398, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_DynamicCast_AsP2NPCharacter_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, K2Node_DynamicCast_bSuccess_1) == 0x0003A0, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0003A8, "Member 'GC_Spectre_TimeoutFadeIn_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeIn::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GC_Spectre_TimeoutFadeIn.GC_Spectre_TimeoutFadeIn_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_TimeoutFadeIn_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_TimeoutFadeIn_C_OnApplication) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeIn_C_OnApplication");
static_assert(sizeof(GC_Spectre_TimeoutFadeIn_C_OnApplication) == 0x000150, "Wrong size on GC_Spectre_TimeoutFadeIn_C_OnApplication");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnApplication, Target) == 0x000000, "Member 'GC_Spectre_TimeoutFadeIn_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Spectre_TimeoutFadeIn_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_TimeoutFadeIn_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Spectre_TimeoutFadeIn.GC_Spectre_TimeoutFadeIn_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_TimeoutFadeIn_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_TimeoutFadeIn_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeIn_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_TimeoutFadeIn_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_TimeoutFadeIn_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_TimeoutFadeIn_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_TimeoutFadeIn_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeIn_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_TimeoutFadeIn_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

