#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Concussed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GC_StatusEffect_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C
// 0x0100 (0x1BA0 - 0x1AA0)
class AGC_StatusEffect_Concussed_C final : public AGC_StatusEffect_Base_C
{
public:
	uint8                                         Pad_1A94[0x4];                                     // 0x1A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_StatusEffect_Concussed_C;        // 0x1A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x1AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x1AA8(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCurveFloat*                            EffectCurve;                                       // 0x1B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_StatusEffect_Concussed(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnBecomeViewTarget(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0)	 // 0xae1e64;
	void OnEffectLevelChanged(bool Update_Status_Icon, class AActor* TargetActor)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_StatusEffect_Concussed_C">();
	}
	static class AGC_StatusEffect_Concussed_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_StatusEffect_Concussed_C>();
	}
};
static_assert(alignof(AGC_StatusEffect_Concussed_C) == 0x000010, "Wrong alignment on AGC_StatusEffect_Concussed_C");
static_assert(sizeof(AGC_StatusEffect_Concussed_C) == 0x001BA0, "Wrong size on AGC_StatusEffect_Concussed_C");
static_assert(offsetof(AGC_StatusEffect_Concussed_C, UberGraphFrame_GC_StatusEffect_Concussed_C) == 0x001A98, "Member 'AGC_StatusEffect_Concussed_C::UberGraphFrame_GC_StatusEffect_Concussed_C' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Concussed_C, Target) == 0x001AA0, "Member 'AGC_StatusEffect_Concussed_C::Target' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Concussed_C, Parameters) == 0x001AA8, "Member 'AGC_StatusEffect_Concussed_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Concussed_C, EffectCurve) == 0x001B98, "Member 'AGC_StatusEffect_Concussed_C::EffectCurve' has a wrong offset!");

}

