#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.ChangeLevel
// 0x0008 (0x0008 - 0x0000)
struct GC_StatusEffect_Base_C_ChangeLevel final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_ChangeLevel) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_ChangeLevel");
static_assert(sizeof(GC_StatusEffect_Base_C_ChangeLevel) == 0x000008, "Wrong size on GC_StatusEffect_Base_C_ChangeLevel");
static_assert(offsetof(GC_StatusEffect_Base_C_ChangeLevel, TargetActor) == 0x000000, "Member 'GC_StatusEffect_Base_C_ChangeLevel::TargetActor' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.ExecuteUbergraph_GC_StatusEffect_Base
// 0x0958 (0x0958 - 0x0000)
struct GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_6;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_5;                         // 0x0018(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_4;                       // 0x0108(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsLocal_Local;                            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_5;                             // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_4;                         // 0x0170(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_3;                       // 0x0260(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsLocal_Local_1;                          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel, int32 NewStackCount)> K2Node_CreateDelegate_OutputDelegate;       // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_CustomEvent_Actor;                          // 0x0308(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_4;                             // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_3;                         // 0x0318(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_3;                             // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0410(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x0500(0x0058)(ConstParm, ContainsInstancedReference)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x0558(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0560(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0572(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_573[0x5];                                      // 0x0573(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0580(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0670(0x0058)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x06D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x06D8(0x00F0)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x07D0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x07E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x07F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x07F8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0818(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0838(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0850(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0868(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0870(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0878(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0880(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0888(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0890(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitStatusEffectLevelChange* CallFunc_WaitStatusEffectLevelChange_ReturnValue; // 0x08A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x08B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_1;        // 0x08B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x08C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x08D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x08E0(0x0058)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_Alpha_ImplicitCast;                  // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base");
static_assert(sizeof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base) == 0x000958, "Wrong size on GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, Temp_int_Variable) == 0x000008, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, Temp_int_Variable_1) == 0x00000C, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_6) == 0x000010, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_6' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters_5) == 0x000018, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters_5' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_SpawnResults_4) == 0x000108, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_SpawnResults_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsLocal_Local) == 0x000160, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsLocal_Local' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_5) == 0x000168, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_5' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters_4) == 0x000170, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_SpawnResults_3) == 0x000260, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_SpawnResults_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsLocal_Local_1) == 0x0002B8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsLocal_Local_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_1) == 0x0002B9, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_CustomEvent_NewLevel) == 0x0002BC, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_CustomEvent_NewStackCount) == 0x0002C0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_CustomEvent_TargetActor) == 0x0002C8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_2) == 0x0002D0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D1, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0002D8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0002E0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x0002F0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_Lerp_ReturnValue) == 0x0002F8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_CustomEvent_Actor) == 0x000308, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_4) == 0x000310, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters_3) == 0x000318, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_3) == 0x000408, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters_2) == 0x000410, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_SpawnResults_2) == 0x000500, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_FindCameraComponent_ReturnValue) == 0x000558, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000560, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_4) == 0x000570, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BooleanAND_ReturnValue) == 0x000571, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_5) == 0x000572, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_2) == 0x000578, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters_1) == 0x000580, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_SpawnResults_1) == 0x000670, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0006C8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target_1) == 0x0006D0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Parameters) == 0x0006D8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0007C8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0007CC, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0007D0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0007E8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0007F0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0007F8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000818, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_Location) == 0x000838, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_Normal) == 0x000850, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000868, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000870, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000878, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000880, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000888, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00088C, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000890, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000898, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_WaitStatusEffectLevelChange_ReturnValue) == 0x0008A0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_WaitStatusEffectLevelChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_6) == 0x0008A8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0008B0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_FindCameraComponent_ReturnValue_1) == 0x0008B8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x0008C0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_IsValid_ReturnValue_7) == 0x0008D0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_Target) == 0x0008D8, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, K2Node_Event_SpawnResults) == 0x0008E0, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000938, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_Lerp_Alpha_ImplicitCast) == 0x000940, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_Lerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000948, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x00094C, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000950, "Member 'GC_StatusEffect_Base_C_ExecuteUbergraph_GC_StatusEffect_Base::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.LevelChange_6AB98541438E41978C4DA49777E67084
// 0x0008 (0x0008 - 0x0000)
struct GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084 final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084) == 0x000004, "Wrong alignment on GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084");
static_assert(sizeof(GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084) == 0x000008, "Wrong size on GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084");
static_assert(offsetof(GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084, NewLevel) == 0x000000, "Member 'GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084::NewLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084, NewStackCount) == 0x000004, "Member 'GC_StatusEffect_Base_C_LevelChange_6AB98541438E41978C4DA49777E67084::NewStackCount' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Base_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_Base_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_Base_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_Base_C_OnApplication, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnApplication, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Base_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Base_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_Base_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Base_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_Base_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnEffectLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct GC_StatusEffect_Base_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_Base_C_OnEffectLevelChanged) == 0x000018, "Wrong size on GC_StatusEffect_Base_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_Base_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnEffectLevelChanged, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_Base_C_OnEffectLevelChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Base_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnEndViewTarget");
static_assert(sizeof(GC_StatusEffect_Base_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Base_C_OnEndViewTarget");
static_assert(offsetof(GC_StatusEffect_Base_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_StatusEffect_Base_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnLoopingEnd");
static_assert(sizeof(GC_StatusEffect_Base_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_StatusEffect_Base_C_OnLoopingEnd");
static_assert(offsetof(GC_StatusEffect_Base_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Base_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnLoopingStart");
static_assert(sizeof(GC_StatusEffect_Base_C_OnLoopingStart) == 0x000150, "Wrong size on GC_StatusEffect_Base_C_OnLoopingStart");
static_assert(offsetof(GC_StatusEffect_Base_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Base_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnRecurring
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Base_C_OnRecurring final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnRecurring) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnRecurring");
static_assert(sizeof(GC_StatusEffect_Base_C_OnRecurring) == 0x000150, "Wrong size on GC_StatusEffect_Base_C_OnRecurring");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRecurring, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnRecurring::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRecurring, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnRecurring::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRecurring, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Base_C_OnRecurring::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Base_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Base_C_OnRemoval) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_OnRemoval");
static_assert(sizeof(GC_StatusEffect_Base_C_OnRemoval) == 0x000150, "Wrong size on GC_StatusEffect_Base_C_OnRemoval");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRemoval, Target) == 0x000000, "Member 'GC_StatusEffect_Base_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_StatusEffect_Base_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Base_C_OnRemoval::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.PlayMontage
// 0x0030 (0x0030 - 0x0000)
struct GC_StatusEffect_Base_C_PlayMontage final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentTarget;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilitySystemComponent*              CallFunc_GetP2AbilitySystemComponent_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MontagePlayFromTag_ReturnValue;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_PlayMontage) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_PlayMontage");
static_assert(sizeof(GC_StatusEffect_Base_C_PlayMontage) == 0x000030, "Wrong size on GC_StatusEffect_Base_C_PlayMontage");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, TargetActor) == 0x000000, "Member 'GC_StatusEffect_Base_C_PlayMontage::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CurrentTarget) == 0x000008, "Member 'GC_StatusEffect_Base_C_PlayMontage::CurrentTarget' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, K2Node_DynamicCast_AsP2Hero_Character) == 0x000010, "Member 'GC_StatusEffect_Base_C_PlayMontage::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GC_StatusEffect_Base_C_PlayMontage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CallFunc_GetP2AbilitySystemComponent_ReturnValue) == 0x000020, "Member 'GC_StatusEffect_Base_C_PlayMontage::CallFunc_GetP2AbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'GC_StatusEffect_Base_C_PlayMontage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'GC_StatusEffect_Base_C_PlayMontage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CallFunc_IsGameplayTagValid_ReturnValue) == 0x00002A, "Member 'GC_StatusEffect_Base_C_PlayMontage::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_PlayMontage, CallFunc_MontagePlayFromTag_ReturnValue) == 0x00002C, "Member 'GC_StatusEffect_Base_C_PlayMontage::CallFunc_MontagePlayFromTag_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.Remove Status Effect Icon with HUD
// 0x0040 (0x0040 - 0x0000)
struct GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD final
{
public:
	class AP2HUD*                                 InP2HUD;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_HudMain_Top_C*                       K2Node_DynamicCast_AsW_Hud_Main_Top;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD");
static_assert(sizeof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD) == 0x000040, "Wrong size on GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, InP2HUD) == 0x000000, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::InP2HUD' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, K2Node_DynamicCast_AsP2Player_Controller) == 0x000010, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, CallFunc_Conv_StringToName_ReturnValue) == 0x00001C, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, CallFunc_GetWidget_ReturnValue) == 0x000028, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, K2Node_DynamicCast_AsW_Hud_Main_Top) == 0x000030, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::K2Node_DynamicCast_AsW_Hud_Main_Top' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'GC_StatusEffect_Base_C_Remove_Status_Effect_Icon_with_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Base.GC_StatusEffect_Base_C.RemoveStatusEffectIcon
// 0x0050 (0x0050 - 0x0000)
struct GC_StatusEffect_Base_C_RemoveStatusEffectIcon final
{
public:
	class AActor*                                 InTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_HudMain_Top_C*                       K2Node_DynamicCast_AsW_Hud_Main_Top;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2HUD* InP2HUD)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Base_C_RemoveStatusEffectIcon) == 0x000008, "Wrong alignment on GC_StatusEffect_Base_C_RemoveStatusEffectIcon");
static_assert(sizeof(GC_StatusEffect_Base_C_RemoveStatusEffectIcon) == 0x000050, "Wrong size on GC_StatusEffect_Base_C_RemoveStatusEffectIcon");
static_assert(offsetof(GC_StatusEffect_Base_C_RemoveStatusEffectIcon, InTarget) == 0x000000, "Member 'GC_StatusEffect_Base_C_RemoveStatusEffectIcon::InTarget' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Base_C_RemoveStatusEffectIcon, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'GC_StatusEffect_Base_C_RemoveStatusEffectIcon::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
