#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_DimensionalImprisonment

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "S_PreDimensionalPrisonComponentSettings_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_DimensionalImprisonment.GC_Spectre_DimensionalImprisonment_C.ExecuteUbergraph_GC_Spectre_DimensionalImprisonment
// 0x0818 (0x0818 - 0x0000)
struct GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0160(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x01E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x01F8(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x02E8(0x0058)(ConstParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_1;           // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0388(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_1;                  // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_2;                  // 0x0398(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_3;                  // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue;                    // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue_1;                  // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_4;                  // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_5;                  // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_6;                  // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue_1;            // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_3;        // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_3;                             // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0420(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_3;                       // 0x0510(0x0058)(ConstParm, ContainsInstancedReference)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1; // 0x0568(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_2;           // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0589(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58A[0x6];                                      // 0x058A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_7;                  // 0x0590(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_8;                  // 0x0598(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x05A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_4;        // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_9;                  // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_1;         // 0x05C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_10;                 // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_5;        // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue_2;            // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_3;           // 0x0600(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_11;                 // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_2;         // 0x0618(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_12;                 // 0x0630(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue_13;                 // 0x0638(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_6;        // 0x0640(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue_2;                  // 0x0648(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue_3;                  // 0x0658(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children_3;         // 0x0660(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_7;        // 0x0670(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue_3;            // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67D[0x3];                                      // 0x067D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component;          // 0x0690(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreDimensionalPrisonComponentSettings K2Node_MakeStruct_S_PreDimensionalPrisonComponentSettings; // 0x06A0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_1;        // 0x06C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PreDimensionalPrisonComponentSettings K2Node_MakeStruct_S_PreDimensionalPrisonComponentSettings_1; // 0x06D0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x3];                                      // 0x06E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x3];                                      // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x3];                                      // 0x06F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x0718(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_3;                         // 0x0720(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_2;        // 0x0728(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_DynamicCast_AsPrimitive_Component_3;        // 0x0738(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreDimensionalPrisonComponentSettings K2Node_MakeStruct_S_PreDimensionalPrisonComponentSettings_2; // 0x0748(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_PreDimensionalPrisonComponentSettings K2Node_MakeStruct_S_PreDimensionalPrisonComponentSettings_3; // 0x0758(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76D[0x3];                                      // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0780(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795[0x3];                                      // 0x0795(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PreDimensionalPrisonComponentSettings CallFunc_Array_Get_Item_4;                       // 0x07A0(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x07B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x07B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C2[0x2];                                      // 0x07C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_PreDimensionalPrisonComponentSettings CallFunc_Array_Get_Item_5;                       // 0x07C8(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_PreDimensionalPrisonComponentSettings CallFunc_Array_Get_Item_6;                       // 0x07D8(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x07E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EA[0x2];                                      // 0x07EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1[0x3];                                      // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PreDimensionalPrisonComponentSettings CallFunc_Array_Get_Item_7;                       // 0x0800(0x0010)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0815(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment) == 0x000008, "Wrong alignment on GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment");
static_assert(sizeof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment) == 0x000818, "Wrong size on GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, EntryPoint) == 0x000000, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, Temp_int_Array_Index_Variable) == 0x000004, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Target_1) == 0x000008, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Target) == 0x000158, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_SpawnResults) == 0x000160, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001B8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x0001C8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsValid_ReturnValue) == 0x0001D1, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001D8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0001E0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Target_2) == 0x0001F0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Parameters_1) == 0x0001F8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_SpawnResults_2) == 0x0002E8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, Temp_int_Loop_Counter_Variable) == 0x000340, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x000348, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_2) == 0x000358, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Add_IntInt_ReturnValue) == 0x00035C, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000360, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Base_Character) == 0x000368, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_3) == 0x000370, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Base_Character_1) == 0x000378, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Base_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_4) == 0x000380, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue) == 0x000388, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_1) == 0x000390, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_2) == 0x000398, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_3) == 0x0003A0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0003A8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh1P_ReturnValue) == 0x0003B0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsValid_ReturnValue_1) == 0x0003B8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh1P_ReturnValue_1) == 0x0003C0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh1P_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsLocallyViewed_ReturnValue) == 0x0003C8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0003D0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_4) == 0x0003D8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_5) == 0x0003E0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x0003E8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsValid_ReturnValue_2) == 0x0003F0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_6) == 0x0003F8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsLocallyViewed_ReturnValue_1) == 0x000400, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsLocallyViewed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_3) == 0x000408, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, Temp_bool_Variable) == 0x000410, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Target_3) == 0x000418, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Target_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_Parameters_2) == 0x000420, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_Event_SpawnResults_3) == 0x000510, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_Event_SpawnResults_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1) == 0x000568, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_5) == 0x000578, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Base_Character_2) == 0x000580, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Base_Character_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_6) == 0x000588, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000589, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_7) == 0x000590, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_8) == 0x000598, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetChildrenComponents_Children) == 0x0005A0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_4) == 0x0005B0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Array_Length_ReturnValue) == 0x0005B8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsValid_ReturnValue_3) == 0x0005BC, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_9) == 0x0005C0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetChildrenComponents_Children_1) == 0x0005C8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetChildrenComponents_Children_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Array_Length_ReturnValue_1) == 0x0005D8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_10) == 0x0005E0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Less_IntInt_ReturnValue) == 0x0005E8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_5) == 0x0005F0, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsLocallyViewed_ReturnValue_2) == 0x0005F8, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsLocallyViewed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_AsP2Base_Character_3) == 0x000600, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_AsP2Base_Character_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, K2Node_DynamicCast_bSuccess_7) == 0x000608, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_11) == 0x000610, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetChildrenComponents_Children_2) == 0x000618, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetChildrenComponents_Children_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Array_Length_ReturnValue_2) == 0x000628, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_12) == 0x000630, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh3P_ReturnValue_13) == 0x000638, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh3P_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_6) == 0x000640, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh1P_ReturnValue_2) == 0x000648, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh1P_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsValid_ReturnValue_4) == 0x000650, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetMesh1P_ReturnValue_3) == 0x000658, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetMesh1P_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_GetChildrenComponents_Children_3) == 0x000660, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_GetChildrenComponents_Children_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_SpawnSystemAttached_ReturnValue_7) == 0x000670, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_SpawnSystemAttached_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_Array_Length_ReturnValue_3) == 0x000678, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, CallFunc_IsLocallyViewed_ReturnValue_3) == 0x00067C, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::CallFunc_IsLocallyViewed_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, Temp_int_Array_Index_Variable_1) == 0x000680, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment, Temp_int_Array_Index_Variable_2) == 0x000684, "Member 'GC_Spectre_DimensionalImprisonment_C_ExecuteUbergraph_GC_Spectre_DimensionalImprisonment::Temp_int_Array_Index_Variable_2' has a wrong offset!");
