#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SwimmingLeaveUnderwater

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C
// 0x0038 (0x07F8 - 0x07C0)
class AGC_SwimmingLeaveUnderwater_C final : public AP2GameplayCueNotify_BurstLatent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         WaterEffectPP_Time_63F6CBCF4B6D6961525816BAF532F8C3; // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            WaterEffectPP__Direction_63F6CBCF4B6D6961525816BAF532F8C3; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CD[0x3];                                      // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     WaterEffectPP;                                     // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PPMaterial;                                        // 0x07E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CameraComponent;                                   // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   PPParameterName;                                   // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_SwimmingLeaveUnderwater(int32 EntryPoint)	 // 0xae1e64;
	void HidePP()	 // 0xae1e64;
	void K2_OnBecomeViewTarget(class APlayerController* PC)	 // 0xae1e64;
	void K2_OnEndViewTarget(class APlayerController* PC)	 // 0xae1e64;
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void ShowPP(const class AActor* Actor)	 // 0xae1e64;
	void WaterEffectPP__FinishedFunc()	 // 0xae1e64;
	void WaterEffectPP__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_SwimmingLeaveUnderwater_C">();
	}
	static class AGC_SwimmingLeaveUnderwater_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_SwimmingLeaveUnderwater_C>();
	}
};
static_assert(alignof(AGC_SwimmingLeaveUnderwater_C) == 0x000008, "Wrong alignment on AGC_SwimmingLeaveUnderwater_C");
static_assert(sizeof(AGC_SwimmingLeaveUnderwater_C) == 0x0007F8, "Wrong size on AGC_SwimmingLeaveUnderwater_C");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, UberGraphFrame) == 0x0007C0, "Member 'AGC_SwimmingLeaveUnderwater_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, WaterEffectPP_Time_63F6CBCF4B6D6961525816BAF532F8C3) == 0x0007C8, "Member 'AGC_SwimmingLeaveUnderwater_C::WaterEffectPP_Time_63F6CBCF4B6D6961525816BAF532F8C3' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, WaterEffectPP__Direction_63F6CBCF4B6D6961525816BAF532F8C3) == 0x0007CC, "Member 'AGC_SwimmingLeaveUnderwater_C::WaterEffectPP__Direction_63F6CBCF4B6D6961525816BAF532F8C3' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, WaterEffectPP) == 0x0007D0, "Member 'AGC_SwimmingLeaveUnderwater_C::WaterEffectPP' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, Mid) == 0x0007D8, "Member 'AGC_SwimmingLeaveUnderwater_C::Mid' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, PPMaterial) == 0x0007E0, "Member 'AGC_SwimmingLeaveUnderwater_C::PPMaterial' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, CameraComponent) == 0x0007E8, "Member 'AGC_SwimmingLeaveUnderwater_C::CameraComponent' has a wrong offset!");
static_assert(offsetof(AGC_SwimmingLeaveUnderwater_C, PPParameterName) == 0x0007F0, "Member 'AGC_SwimmingLeaveUnderwater_C::PPParameterName' has a wrong offset!");

}

