#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_Immolate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Spectre_Immolate.GC_Spectre_Immolate_C
// 0x0020 (0x12D0 - 0x12B0)
class AGC_Spectre_Immolate_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_NewTrack_0_242304D44155A40FA44ADA938F8BC755; // 0x12B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_242304D44155A40FA44ADA938F8BC755; // 0x12BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BD[0x3];                                     // 0x12BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x12C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x12C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Spectre_Immolate(int32 EntryPoint)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Spectre_Immolate_C">();
	}
	static class AGC_Spectre_Immolate_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Spectre_Immolate_C>();
	}
};
static_assert(alignof(AGC_Spectre_Immolate_C) == 0x000008, "Wrong alignment on AGC_Spectre_Immolate_C");
static_assert(sizeof(AGC_Spectre_Immolate_C) == 0x0012D0, "Wrong size on AGC_Spectre_Immolate_C");
static_assert(offsetof(AGC_Spectre_Immolate_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Spectre_Immolate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_Immolate_C, Timeline_NewTrack_0_242304D44155A40FA44ADA938F8BC755) == 0x0012B8, "Member 'AGC_Spectre_Immolate_C::Timeline_NewTrack_0_242304D44155A40FA44ADA938F8BC755' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_Immolate_C, Timeline__Direction_242304D44155A40FA44ADA938F8BC755) == 0x0012BC, "Member 'AGC_Spectre_Immolate_C::Timeline__Direction_242304D44155A40FA44ADA938F8BC755' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_Immolate_C, Timeline) == 0x0012C0, "Member 'AGC_Spectre_Immolate_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_Immolate_C, Intensity) == 0x0012C8, "Member 'AGC_Spectre_Immolate_C::Intensity' has a wrong offset!");

}

