#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Concussed

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C.ExecuteUbergraph_GC_StatusEffect_Concussed
// 0x03A0 (0x03A0 - 0x0000)
struct GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0160(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0250(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x02B0(0x00F0)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed) == 0x000008, "Wrong alignment on GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed");
static_assert(sizeof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed) == 0x0003A0, "Wrong size on GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Target) == 0x000008, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Parameters) == 0x000010, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Target_2) == 0x000158, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Parameters_2) == 0x000160, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_SpawnResults_1) == 0x000250, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Target_1) == 0x0002A8, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed, K2Node_Event_Parameters_1) == 0x0002B0, "Member 'GC_StatusEffect_Concussed_C_ExecuteUbergraph_GC_StatusEffect_Concussed::K2Node_Event_Parameters_1' has a wrong offset!");

// Function GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Concussed_C_OnApplication final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Concussed_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_Concussed_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_Concussed_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_Concussed_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnApplication, Target_0) == 0x000000, "Member 'GC_StatusEffect_Concussed_C_OnApplication::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnApplication, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Concussed_C_OnApplication::Parameters_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Concussed_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Concussed_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Concussed_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Concussed_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_Concussed_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Concussed_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnBecomeViewTarget, Target_0) == 0x000000, "Member 'GC_StatusEffect_Concussed_C_OnBecomeViewTarget::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnBecomeViewTarget, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Concussed_C_OnBecomeViewTarget::Parameters_0' has a wrong offset!");

// Function GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C.OnEffectLevelChanged
// 0x0020 (0x0020 - 0x0000)
struct GC_StatusEffect_Concussed_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_Concussed_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged) == 0x000020, "Wrong size on GC_StatusEffect_Concussed_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_Concussed_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_Concussed_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_Concussed_C_OnEffectLevelChanged::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnEffectLevelChanged, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'GC_StatusEffect_Concussed_C_OnEffectLevelChanged::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_StatusEffect_Concussed.GC_StatusEffect_Concussed_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Concussed_C_OnLoopingStart final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Concussed_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_StatusEffect_Concussed_C_OnLoopingStart");
static_assert(sizeof(GC_StatusEffect_Concussed_C_OnLoopingStart) == 0x000150, "Wrong size on GC_StatusEffect_Concussed_C_OnLoopingStart");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnLoopingStart, Target_0) == 0x000000, "Member 'GC_StatusEffect_Concussed_C_OnLoopingStart::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnLoopingStart, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Concussed_C_OnLoopingStart::Parameters_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Concussed_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Concussed_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

