#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Stun_Large

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Stun_Large.GC_Stun_Large_C.OnActive
// 0x0108 (0x0108 - 0x0000)
struct GC_Stun_Large_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostLocalRemoteEvents_PlayingID;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Stun_Large_C_OnActive) == 0x000008, "Wrong alignment on GC_Stun_Large_C_OnActive");
static_assert(sizeof(GC_Stun_Large_C_OnActive) == 0x000108, "Wrong size on GC_Stun_Large_C_OnActive");
static_assert(offsetof(GC_Stun_Large_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Stun_Large_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Stun_Large_C_OnActive, Parameters) == 0x000008, "Member 'GC_Stun_Large_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Stun_Large_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_Stun_Large_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Stun_Large_C_OnActive, CallFunc_PostLocalRemoteEvents_PlayingID) == 0x0000FC, "Member 'GC_Stun_Large_C_OnActive::CallFunc_PostLocalRemoteEvents_PlayingID' has a wrong offset!");
static_assert(offsetof(GC_Stun_Large_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x000100, "Member 'GC_Stun_Large_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

}

