#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SwimmingLeaveUnderwater

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C.ExecuteUbergraph_GC_SwimmingLeaveUnderwater
// 0x0060 (0x0060 - 0x0000)
struct GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_CustomEvent_Actor;                          // 0x0020(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PC_1;                                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PC;                                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater) == 0x000008, "Wrong alignment on GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater");
static_assert(sizeof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater) == 0x000060, "Wrong size on GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, EntryPoint) == 0x000000, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000008, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, K2Node_CustomEvent_Actor) == 0x000020, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_FindCameraComponent_ReturnValue) == 0x000028, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000040, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, K2Node_Event_PC_1) == 0x000050, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::K2Node_Event_PC_1' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater, K2Node_Event_PC) == 0x000058, "Member 'GC_SwimmingLeaveUnderwater_C_ExecuteUbergraph_GC_SwimmingLeaveUnderwater::K2Node_Event_PC' has a wrong offset!");

// Function GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C.K2_OnBecomeViewTarget
// 0x0008 (0x0008 - 0x0000)
struct GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget");
static_assert(sizeof(GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget) == 0x000008, "Wrong size on GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget, PC) == 0x000000, "Member 'GC_SwimmingLeaveUnderwater_C_K2_OnBecomeViewTarget::PC' has a wrong offset!");

// Function GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C.K2_OnEndViewTarget
// 0x0008 (0x0008 - 0x0000)
struct GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget final
{
public:
	class APlayerController*                      PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget");
static_assert(sizeof(GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget) == 0x000008, "Wrong size on GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget, PC) == 0x000000, "Member 'GC_SwimmingLeaveUnderwater_C_K2_OnEndViewTarget::PC' has a wrong offset!");

// Function GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C.OnExecute
// 0x0100 (0x0100 - 0x0000)
struct GC_SwimmingLeaveUnderwater_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SwimmingLeaveUnderwater_C_OnExecute) == 0x000008, "Wrong alignment on GC_SwimmingLeaveUnderwater_C_OnExecute");
static_assert(sizeof(GC_SwimmingLeaveUnderwater_C_OnExecute) == 0x000100, "Wrong size on GC_SwimmingLeaveUnderwater_C_OnExecute");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_SwimmingLeaveUnderwater_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_OnExecute, Parameters) == 0x000008, "Member 'GC_SwimmingLeaveUnderwater_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_SwimmingLeaveUnderwater_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F9, "Member 'GC_SwimmingLeaveUnderwater_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");

// Function GC_SwimmingLeaveUnderwater.GC_SwimmingLeaveUnderwater_C.ShowPP
// 0x0008 (0x0008 - 0x0000)
struct GC_SwimmingLeaveUnderwater_C_ShowPP final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SwimmingLeaveUnderwater_C_ShowPP) == 0x000008, "Wrong alignment on GC_SwimmingLeaveUnderwater_C_ShowPP");
static_assert(sizeof(GC_SwimmingLeaveUnderwater_C_ShowPP) == 0x000008, "Wrong size on GC_SwimmingLeaveUnderwater_C_ShowPP");
static_assert(offsetof(GC_SwimmingLeaveUnderwater_C_ShowPP, Actor) == 0x000000, "Member 'GC_SwimmingLeaveUnderwater_C_ShowPP::Actor' has a wrong offset!");

}

