#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Injury_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.ExecuteUbergraph_GC_StatusEffect_Injury_Base
// 0x04E8 (0x04E8 - 0x0000)
struct GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag_3;                          // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCount_3;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 NewCount)> K2Node_CreateDelegate_OutputDelegate; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_2;                          // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCount_2;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 NewCount)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x005C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCount_1;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 NewCount)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x008C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCount;                       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& Tag, int32 NewCount)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_WaitGameplayTagChange_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_2;                             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x00D0(0x00F0)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const struct FGameplayTag& Tag, int32 NewCount)> K2Node_CreateDelegate_OutputDelegate_4; // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character_1;           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x01E8(0x00F0)(ConstParm, ContainsInstancedReference)
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_Array_Get_Item;                           // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_WaitGameplayTagChange_ReturnValue_1;      // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_WaitGameplayTagChange_ReturnValue_2;      // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_WaitGameplayTagChange_ReturnValue_3;      // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AbilityAsync_WaitGameplayTagChange*  CallFunc_WaitGameplayTagChange_ReturnValue_4;      // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_2;     // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_3;     // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_317[0x1];                                      // 0x0317(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x0324(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0338(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0428(0x0058)(ConstParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_4;                          // 0x0484(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewCount_4;                     // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue;         // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_1;       // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_2;       // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_3;       // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_2;                       // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_B_ImplicitCast;                      // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_B_ImplicitCast_1;                    // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast_1;                    // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base) == 0x000008, "Wrong alignment on GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base) == 0x0004E8, "Wrong size on GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_DynamicCast_AsP2Base_Character) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_Tag_3) == 0x000014, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_Tag_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_NewCount_3) == 0x00001C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_NewCount_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Variable) == 0x000030, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_struct_Variable) == 0x000034, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_Tag_2) == 0x00003C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_Tag_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_NewCount_2) == 0x000044, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_NewCount_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Variable_1) == 0x000058, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_struct_Variable_1) == 0x00005C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_Tag_1) == 0x000064, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_NewCount_1) == 0x00006C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_NewCount_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Variable_2) == 0x000080, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_struct_Variable_2) == 0x000084, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_Tag) == 0x00008C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_NewCount) == 0x000094, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_NewCount' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000098, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Variable_3) == 0x0000A8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_struct_Variable_3) == 0x0000AC, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000B4, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000B5, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_WaitGameplayTagChange_ReturnValue) == 0x0000B8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_WaitGameplayTagChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_IsValid_ReturnValue) == 0x0000C4, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Target_2) == 0x0000C8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Parameters_2) == 0x0000D0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001C0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_DynamicCast_AsP2Base_Character_1) == 0x0001D0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_DynamicCast_AsP2Base_Character_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Target_1) == 0x0001E0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Parameters_1) == 0x0001E8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Get_Item) == 0x0002D8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Length_ReturnValue) == 0x0002E0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_WaitGameplayTagChange_ReturnValue_1) == 0x0002E8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_WaitGameplayTagChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_WaitGameplayTagChange_ReturnValue_2) == 0x0002F0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_WaitGameplayTagChange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_IsValid_ReturnValue_1) == 0x0002F8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_IsValid_ReturnValue_2) == 0x0002F9, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Add_ReturnValue) == 0x0002FC, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_WaitGameplayTagChange_ReturnValue_3) == 0x000300, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_WaitGameplayTagChange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_WaitGameplayTagChange_ReturnValue_4) == 0x000308, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_WaitGameplayTagChange_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_IsValid_ReturnValue_3) == 0x000310, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_IsValid_ReturnValue_4) == 0x000311, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000312, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x000313, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_BooleanOR_ReturnValue) == 0x000314, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_EqualEqual_GameplayTag_ReturnValue_2) == 0x000315, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_EqualEqual_GameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_EqualEqual_GameplayTag_ReturnValue_3) == 0x000316, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_EqualEqual_GameplayTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Add_ReturnValue_1) == 0x000318, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Add_ReturnValue_2) == 0x00031C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Add_ReturnValue_3) == 0x000320, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_struct_Variable_4) == 0x000324, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Variable_4) == 0x00032C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Target) == 0x000330, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_Parameters) == 0x000338, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_Event_SpawnResults) == 0x000428, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Array_Add_ReturnValue_4) == 0x000480, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_Tag_4) == 0x000484, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_Tag_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, K2Node_CustomEvent_NewCount_4) == 0x00048C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::K2Node_CustomEvent_NewCount_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, Temp_int_Loop_Counter_Variable) == 0x000490, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_GetStatusEffectLevel_ReturnValue) == 0x000494, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_GetStatusEffectLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_GetStatusEffectLevel_ReturnValue_1) == 0x000498, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_GetStatusEffectLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_GetStatusEffectLevel_ReturnValue_2) == 0x00049C, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_GetStatusEffectLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_ReturnValue) == 0x0004A0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_GetStatusEffectLevel_ReturnValue_3) == 0x0004A8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_GetStatusEffectLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Less_IntInt_ReturnValue) == 0x0004AC, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_ReturnValue_1) == 0x0004B0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_ReturnValue_2) == 0x0004B8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Add_IntInt_ReturnValue) == 0x0004C0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0004C4, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_B_ImplicitCast) == 0x0004C8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_A_ImplicitCast) == 0x0004D0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_B_ImplicitCast_1) == 0x0004D8, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base, CallFunc_FMax_A_ImplicitCast_1) == 0x0004E0, "Member 'GC_StatusEffect_Injury_Base_C_ExecuteUbergraph_GC_StatusEffect_Injury_Base::CallFunc_FMax_A_ImplicitCast_1' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Injury_Base_C_OnApplication final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_Injury_Base_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_Injury_Base_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnApplication, Target_0) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_OnApplication::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnApplication, Parameters) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Injury_Base_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget, Target_0) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Injury_Base_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Injury_Base_C_OnEndViewTarget");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Injury_Base_C_OnEndViewTarget");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnEndViewTarget, Target_0) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_OnEndViewTarget::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.TagChange_07B8676D403BADE643A33D8A182C9FAA
// 0x000C (0x000C - 0x0000)
struct GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA) == 0x000004, "Wrong alignment on GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA) == 0x00000C, "Wrong size on GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA, Tag) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA::Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA, NewCount) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_07B8676D403BADE643A33D8A182C9FAA::NewCount' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06
// 0x000C (0x000C - 0x0000)
struct GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06) == 0x000004, "Wrong alignment on GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06) == 0x00000C, "Wrong size on GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06, Tag) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06::Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06, NewCount) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06::NewCount' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.TagChange_7F9CE9B04F3477C2593340B41AAC5970
// 0x000C (0x000C - 0x0000)
struct GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970) == 0x000004, "Wrong alignment on GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970) == 0x00000C, "Wrong size on GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970, Tag) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970::Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970, NewCount) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_7F9CE9B04F3477C2593340B41AAC5970::NewCount' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.TagChange_8BCA521F44803E3125DB10A8B881E657
// 0x000C (0x000C - 0x0000)
struct GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657) == 0x000004, "Wrong alignment on GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657) == 0x00000C, "Wrong size on GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657, Tag) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657::Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657, NewCount) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_8BCA521F44803E3125DB10A8B881E657::NewCount' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.TagChange_B6AB58FD423B620F31BE19B5D9D1F654
// 0x000C (0x000C - 0x0000)
struct GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654) == 0x000004, "Wrong alignment on GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654) == 0x00000C, "Wrong size on GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654, Tag) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654::Tag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654, NewCount) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_TagChange_B6AB58FD423B620F31BE19B5D9D1F654::NewCount' has a wrong offset!");

// Function GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C.UpdatePP
// 0x0040 (0x0040 - 0x0000)
struct GC_StatusEffect_Injury_Base_C_UpdatePP final
{
public:
	class AActor*                                 InTargetActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Torso;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Legs;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arms;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_1;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_2;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStatusEffectLevel_ReturnValue_3;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_A_ImplicitCast;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Injury_Base_C_UpdatePP) == 0x000008, "Wrong alignment on GC_StatusEffect_Injury_Base_C_UpdatePP");
static_assert(sizeof(GC_StatusEffect_Injury_Base_C_UpdatePP) == 0x000040, "Wrong size on GC_StatusEffect_Injury_Base_C_UpdatePP");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_UpdatePP, InTargetActor) == 0x000000, "Member 'GC_StatusEffect_Injury_Base_C_UpdatePP::InTargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_UpdatePP, Torso) == 0x000008, "Member 'GC_StatusEffect_Injury_Base_C_UpdatePP::Torso' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Injury_Base_C_UpdatePP, Legs) == 0x00000C, "Member 'GC_StatusEffect_Injury_Base_C_UpdatePP::Legs' has a wrong offset!");
