#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_EMP

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_EMP.GC_StatusEffect_EMP_C.ExecuteUbergraph_GC_StatusEffect_EMP
// 0x02B0 (0x02B0 - 0x0000)
struct GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0160(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0250(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsLocal_Local;                            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocal_Local_1;                          // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP) == 0x000008, "Wrong alignment on GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP");
static_assert(sizeof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP) == 0x0002B0, "Wrong size on GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_Target_1) == 0x000008, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_Parameters_1) == 0x000010, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_Target) == 0x000158, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_Parameters) == 0x000160, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, K2Node_Event_SpawnResults) == 0x000250, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, CallFunc_IsLocal_Local) == 0x0002A8, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::CallFunc_IsLocal_Local' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, CallFunc_IsLocal_Local_1) == 0x0002A9, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::CallFunc_IsLocal_Local_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP, CallFunc_IsValid_ReturnValue) == 0x0002AA, "Member 'GC_StatusEffect_EMP_C_ExecuteUbergraph_GC_StatusEffect_EMP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_EMP.GC_StatusEffect_EMP_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_EMP_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_EMP_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_EMP_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_EMP_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_EMP_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnApplication, Target) == 0x000000, "Member 'GC_StatusEffect_EMP_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnApplication, Parameters) == 0x000008, "Member 'GC_StatusEffect_EMP_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_EMP_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_EMP.GC_StatusEffect_EMP_C.OnEffectLevelChanged
// 0x0050 (0x0050 - 0x0000)
struct GC_StatusEffect_EMP_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_EMP_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_EMP_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_EMP_C_OnEffectLevelChanged) == 0x000050, "Wrong size on GC_StatusEffect_EMP_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000021, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000044, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnEffectLevelChanged, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x000048, "Member 'GC_StatusEffect_EMP_C_OnEffectLevelChanged::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function GC_StatusEffect_EMP.GC_StatusEffect_EMP_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_EMP_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_EMP_C_OnRemoval) == 0x000008, "Wrong alignment on GC_StatusEffect_EMP_C_OnRemoval");
static_assert(sizeof(GC_StatusEffect_EMP_C_OnRemoval) == 0x000150, "Wrong size on GC_StatusEffect_EMP_C_OnRemoval");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnRemoval, Target) == 0x000000, "Member 'GC_StatusEffect_EMP_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_StatusEffect_EMP_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_EMP_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_EMP_C_OnRemoval::SpawnResults' has a wrong offset!");

}

