#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_DimensionalImprisonment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_PreDimensionalPrisonComponentSettings_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Spectre_DimensionalImprisonment.GC_Spectre_DimensionalImprisonment_C
// 0x0030 (0x12E0 - 0x12B0)
class AGC_Spectre_DimensionalImprisonment_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FirstPersonParticles;                              // 0x12B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ThirdPersonParticles;                              // 0x12C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_PreDimensionalPrisonComponentSettings> ComponentSettings;                       // 0x12D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_GC_Spectre_DimensionalImprisonment(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Spectre_DimensionalImprisonment_C">();
	}
	static class AGC_Spectre_DimensionalImprisonment_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Spectre_DimensionalImprisonment_C>();
	}
};
static_assert(alignof(AGC_Spectre_DimensionalImprisonment_C) == 0x000008, "Wrong alignment on AGC_Spectre_DimensionalImprisonment_C");
static_assert(sizeof(AGC_Spectre_DimensionalImprisonment_C) == 0x0012E0, "Wrong size on AGC_Spectre_DimensionalImprisonment_C");
static_assert(offsetof(AGC_Spectre_DimensionalImprisonment_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Spectre_DimensionalImprisonment_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_DimensionalImprisonment_C, FirstPersonParticles) == 0x0012B8, "Member 'AGC_Spectre_DimensionalImprisonment_C::FirstPersonParticles' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_DimensionalImprisonment_C, Mid) == 0x0012C0, "Member 'AGC_Spectre_DimensionalImprisonment_C::Mid' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_DimensionalImprisonment_C, ThirdPersonParticles) == 0x0012C8, "Member 'AGC_Spectre_DimensionalImprisonment_C::ThirdPersonParticles' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_DimensionalImprisonment_C, ComponentSettings) == 0x0012D0, "Member 'AGC_Spectre_DimensionalImprisonment_C::ComponentSettings' has a wrong offset!");

}

