#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Stun_Small

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_Stun_Small.GC_Stun_Small_C.OnActive
// 0x0140 (0x0140 - 0x0000)
struct GC_Stun_Small_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0114(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Stun_Small_C_OnActive) == 0x000008, "Wrong alignment on GC_Stun_Small_C_OnActive");
static_assert(sizeof(GC_Stun_Small_C_OnActive) == 0x000140, "Wrong size on GC_Stun_Small_C_OnActive");
static_assert(offsetof(GC_Stun_Small_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Stun_Small_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, Parameters) == 0x000008, "Member 'GC_Stun_Small_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_Stun_Small_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, Temp_name_Variable) == 0x0000FC, "Member 'GC_Stun_Small_C_OnActive::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x000104, "Member 'GC_Stun_Small_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, K2Node_DynamicCast_AsPawn) == 0x000108, "Member 'GC_Stun_Small_C_OnActive::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'GC_Stun_Small_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, Temp_delegate_Variable) == 0x000114, "Member 'GC_Stun_Small_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, CallFunc_IsLocallyViewed_ReturnValue) == 0x000124, "Member 'GC_Stun_Small_C_OnActive::CallFunc_IsLocallyViewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, CallFunc_PostEvent_ReturnValue) == 0x000128, "Member 'GC_Stun_Small_C_OnActive::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, Temp_name_Variable_1) == 0x00012C, "Member 'GC_Stun_Small_C_OnActive::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, Temp_bool_Variable) == 0x000134, "Member 'GC_Stun_Small_C_OnActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Stun_Small_C_OnActive, K2Node_Select_Default) == 0x000138, "Member 'GC_Stun_Small_C_OnActive::K2Node_Select_Default' has a wrong offset!");

}

