#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StunGrenade

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_StunGrenade.GC_StunGrenade_C.ExecuteUbergraph_GC_StunGrenade
// 0x0308 (0x0308 - 0x0000)
struct GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0160(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x01C0(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x02B0(0x0058)(ConstParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade) == 0x000008, "Wrong alignment on GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade");
static_assert(sizeof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade) == 0x000308, "Wrong size on GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, EntryPoint) == 0x000000, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_Target_2) == 0x000008, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_Parameters_1) == 0x000010, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_SpawnResults_2) == 0x000100, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_Target_1) == 0x000158, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_SpawnResults_1) == 0x000160, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_Target) == 0x0001B8, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_Parameters) == 0x0001C0, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade, K2Node_Event_SpawnResults) == 0x0002B0, "Member 'GC_StunGrenade_C_ExecuteUbergraph_GC_StunGrenade::K2Node_Event_SpawnResults' has a wrong offset!");

// Function GC_StunGrenade.GC_StunGrenade_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StunGrenade_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StunGrenade_C_OnApplication) == 0x000008, "Wrong alignment on GC_StunGrenade_C_OnApplication");
static_assert(sizeof(GC_StunGrenade_C_OnApplication) == 0x000150, "Wrong size on GC_StunGrenade_C_OnApplication");
static_assert(offsetof(GC_StunGrenade_C_OnApplication, Target) == 0x000000, "Member 'GC_StunGrenade_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_OnApplication, Parameters) == 0x000008, "Member 'GC_StunGrenade_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StunGrenade_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StunGrenade.GC_StunGrenade_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_StunGrenade_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StunGrenade_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_StunGrenade_C_OnLoopingEnd");
static_assert(sizeof(GC_StunGrenade_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_StunGrenade_C_OnLoopingEnd");
static_assert(offsetof(GC_StunGrenade_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_StunGrenade_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_StunGrenade_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_StunGrenade.GC_StunGrenade_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_StunGrenade_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StunGrenade_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_StunGrenade_C_OnLoopingStart");
static_assert(sizeof(GC_StunGrenade_C_OnLoopingStart) == 0x000150, "Wrong size on GC_StunGrenade_C_OnLoopingStart");
static_assert(offsetof(GC_StunGrenade_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_StunGrenade_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_StunGrenade_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StunGrenade_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_StunGrenade_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GC_StunGrenade.GC_StunGrenade_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_StunGrenade_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StunGrenade_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_StunGrenade_C_ReceiveTick");
static_assert(sizeof(GC_StunGrenade_C_ReceiveTick) == 0x000004, "Wrong size on GC_StunGrenade_C_ReceiveTick");
static_assert(offsetof(GC_StunGrenade_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_StunGrenade_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

