#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_PsiWave_Splash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Spectre_PsiWave_Splash.GC_Spectre_PsiWave_Splash_C
// 0x0030 (0x12E0 - 0x12B0)
class AGC_Spectre_PsiWave_Splash_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Progress_984C86B2445B3633D3C53AA64509255D; // 0x12B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_984C86B2445B3633D3C53AA64509255D; // 0x12BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BD[0x3];                                     // 0x12BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x12C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Progress_EC027F4940D514A37BB3459CC5A63B03; // 0x12C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_EC027F4940D514A37BB3459CC5A63B03; // 0x12CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12CD[0x3];                                     // 0x12CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x12D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI;                                               // 0x12D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Spectre_PsiWave_Splash(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void Timeline_0__FinishedFunc()	 // 0xae1e64;
	void Timeline_0__UpdateFunc()	 // 0xae1e64;
	void Timeline__FinishedFunc()	 // 0xae1e64;
	void Timeline__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Spectre_PsiWave_Splash_C">();
	}
	static class AGC_Spectre_PsiWave_Splash_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_Spectre_PsiWave_Splash_C>();
	}
};
static_assert(alignof(AGC_Spectre_PsiWave_Splash_C) == 0x000008, "Wrong alignment on AGC_Spectre_PsiWave_Splash_C");
static_assert(sizeof(AGC_Spectre_PsiWave_Splash_C) == 0x0012E0, "Wrong size on AGC_Spectre_PsiWave_Splash_C");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_Spectre_PsiWave_Splash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline_0_Progress_984C86B2445B3633D3C53AA64509255D) == 0x0012B8, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline_0_Progress_984C86B2445B3633D3C53AA64509255D' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline_0__Direction_984C86B2445B3633D3C53AA64509255D) == 0x0012BC, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline_0__Direction_984C86B2445B3633D3C53AA64509255D' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline_0) == 0x0012C0, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline_Progress_EC027F4940D514A37BB3459CC5A63B03) == 0x0012C8, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline_Progress_EC027F4940D514A37BB3459CC5A63B03' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline__Direction_EC027F4940D514A37BB3459CC5A63B03) == 0x0012CC, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline__Direction_EC027F4940D514A37BB3459CC5A63B03' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, Timeline) == 0x0012D0, "Member 'AGC_Spectre_PsiWave_Splash_C::Timeline' has a wrong offset!");
static_assert(offsetof(AGC_Spectre_PsiWave_Splash_C, DMI) == 0x0012D8, "Member 'AGC_Spectre_PsiWave_Splash_C::DMI' has a wrong offset!");

}

