#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SpectreEMP_TEMP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SpectreEMP_TEMP.GC_SpectreEMP_TEMP_C
// 0x0020 (0x12D0 - 0x12B0)
class AGC_SpectreEMP_TEMP_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x12B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            EffectCurve;                                       // 0x12C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_SpectreEMP_TEMP(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingEnd(class AActor* Target, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_SpectreEMP_TEMP_C">();
	}
	static class AGC_SpectreEMP_TEMP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_SpectreEMP_TEMP_C>();
	}
};
static_assert(alignof(AGC_SpectreEMP_TEMP_C) == 0x000008, "Wrong alignment on AGC_SpectreEMP_TEMP_C");
static_assert(sizeof(AGC_SpectreEMP_TEMP_C) == 0x0012D0, "Wrong size on AGC_SpectreEMP_TEMP_C");
static_assert(offsetof(AGC_SpectreEMP_TEMP_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_SpectreEMP_TEMP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_SpectreEMP_TEMP_C, Mid) == 0x0012B8, "Member 'AGC_SpectreEMP_TEMP_C::Mid' has a wrong offset!");
static_assert(offsetof(AGC_SpectreEMP_TEMP_C, StartTime) == 0x0012C0, "Member 'AGC_SpectreEMP_TEMP_C::StartTime' has a wrong offset!");
static_assert(offsetof(AGC_SpectreEMP_TEMP_C, EffectCurve) == 0x0012C8, "Member 'AGC_SpectreEMP_TEMP_C::EffectCurve' has a wrong offset!");

}

