#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_Immolate_Death

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_Immolate_Death.GC_Spectre_Immolate_Death_C.ExecuteUbergraph_GC_Spectre_Immolate_Death
// 0x0200 (0x0200 - 0x0000)
struct GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0160(0x0058)(ConstParm, ContainsInstancedReference)
	class ABP_Spectre_Boss_C*                     K2Node_DynamicCast_AsBP_Spectre_Boss;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Spectre_Boss_C*                     K2Node_DynamicCast_AsBP_Spectre_Boss_1;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x01D4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x01E4(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death");
static_assert(sizeof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death) == 0x000200, "Wrong size on GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, EntryPoint) == 0x000000, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_Event_Target_1) == 0x000008, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_Event_Target) == 0x000158, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_Event_SpawnResults) == 0x000160, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_DynamicCast_AsBP_Spectre_Boss) == 0x0001B8, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_DynamicCast_AsBP_Spectre_Boss' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_DynamicCast_AsBP_Spectre_Boss_1) == 0x0001C8, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_DynamicCast_AsBP_Spectre_Boss_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, Temp_delegate_Variable) == 0x0001D4, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, Temp_delegate_Variable_1) == 0x0001E4, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, CallFunc_PostEvent_ReturnValue) == 0x0001F4, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, Temp_bool_IsClosed_Variable) == 0x0001F8, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death, CallFunc_PostEvent_ReturnValue_1) == 0x0001FC, "Member 'GC_Spectre_Immolate_Death_C_ExecuteUbergraph_GC_Spectre_Immolate_Death::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function GC_Spectre_Immolate_Death.GC_Spectre_Immolate_Death_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Spectre_Immolate_Death_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Immolate_Death_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_Death_C_OnLoopingEnd");
static_assert(sizeof(GC_Spectre_Immolate_Death_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Spectre_Immolate_Death_C_OnLoopingEnd");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Spectre_Immolate_Death_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Spectre_Immolate_Death_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Spectre_Immolate_Death.GC_Spectre_Immolate_Death_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_Immolate_Death_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Immolate_Death_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_Death_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_Immolate_Death_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_Immolate_Death_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_Immolate_Death_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_Immolate_Death_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_Death_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_Immolate_Death_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

