#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_Immolate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_Immolate.GC_Spectre_Immolate_C.ExecuteUbergraph_GC_Spectre_Immolate
// 0x0268 (0x0268 - 0x0000)
struct GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class ABP_Spectre_Boss_C*                     K2Node_DynamicCast_AsBP_Spectre_Boss;              // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveBossStage_ReturnValue;           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target;                               // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0190(0x0058)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Spectre_Boss_C*                     K2Node_DynamicCast_AsBP_Spectre_Boss_1;            // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_2; // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_3; // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0204(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0214(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1; // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast_1;        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate");
static_assert(sizeof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate) == 0x000268, "Wrong size on GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, EntryPoint) == 0x000000, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_Event_Target_1) == 0x000008, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_AsBP_Spectre_Boss) == 0x000158, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_AsBP_Spectre_Boss' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_Array_Get_Item) == 0x000168, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x000170, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue) == 0x00017C, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1) == 0x000180, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_GetActiveBossStage_ReturnValue) == 0x000184, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_GetActiveBossStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_Event_Target) == 0x000188, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_Event_SpawnResults) == 0x000190, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001E8, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_AsBP_Spectre_Boss_1) == 0x0001F0, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_AsBP_Spectre_Boss_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, K2Node_DynamicCast_bSuccess_2) == 0x0001F8, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_2) == 0x0001FC, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_3) == 0x000200, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_GetCustomPrimitiveDataIndexForScalarParameter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, Temp_delegate_Variable) == 0x000204, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, Temp_delegate_Variable_1) == 0x000214, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, Temp_bool_Has_Been_Initd_Variable) == 0x000224, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_PostEvent_ReturnValue) == 0x000228, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, Temp_bool_IsClosed_Variable) == 0x00022C, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000230, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_PostEvent_ReturnValue_1) == 0x000238, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x00023C, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast) == 0x000240, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000244, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000248, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000250, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x000258, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1) == 0x00025C, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate, CallFunc_SetRTPCValue_Value_ImplicitCast_1) == 0x000260, "Member 'GC_Spectre_Immolate_C_ExecuteUbergraph_GC_Spectre_Immolate::CallFunc_SetRTPCValue_Value_ImplicitCast_1' has a wrong offset!");

// Function GC_Spectre_Immolate.GC_Spectre_Immolate_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Spectre_Immolate_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Immolate_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_C_OnLoopingEnd");
static_assert(sizeof(GC_Spectre_Immolate_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Spectre_Immolate_C_OnLoopingEnd");
static_assert(offsetof(GC_Spectre_Immolate_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Spectre_Immolate_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Spectre_Immolate_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Spectre_Immolate.GC_Spectre_Immolate_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_Immolate_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Immolate_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_Immolate_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_Immolate_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_Immolate_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_Immolate_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_Immolate_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_Immolate_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Immolate_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_Immolate_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

