#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_EMP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GC_StatusEffect_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_StatusEffect_EMP.GC_StatusEffect_EMP_C
// 0x0020 (0x1AC0 - 0x1AA0)
class AGC_StatusEffect_EMP_C final : public AGC_StatusEffect_Base_C
{
public:
	uint8                                         Pad_1A94[0x4];                                     // 0x1A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_StatusEffect_EMP_C;              // 0x1A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Transition_Lerp_0AB473A14BA4DB6D39DBF5B2A79C6DDD;  // 0x1AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Transition__Direction_0AB473A14BA4DB6D39DBF5B2A79C6DDD; // 0x1AA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA5[0x3];                                     // 0x1AA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Transition;                                        // 0x1AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          lvl3;                                              // 0x1AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_StatusEffect_EMP(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnEffectLevelChanged(bool Update_Status_Icon, class AActor* TargetActor)	 // 0xae1e64;
	void OnRemoval(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void Transition__FinishedFunc()	 // 0xae1e64;
	void Transition__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_StatusEffect_EMP_C">();
	}
	static class AGC_StatusEffect_EMP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_StatusEffect_EMP_C>();
	}
};
static_assert(alignof(AGC_StatusEffect_EMP_C) == 0x000010, "Wrong alignment on AGC_StatusEffect_EMP_C");
static_assert(sizeof(AGC_StatusEffect_EMP_C) == 0x001AC0, "Wrong size on AGC_StatusEffect_EMP_C");
static_assert(offsetof(AGC_StatusEffect_EMP_C, UberGraphFrame_GC_StatusEffect_EMP_C) == 0x001A98, "Member 'AGC_StatusEffect_EMP_C::UberGraphFrame_GC_StatusEffect_EMP_C' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_EMP_C, Transition_Lerp_0AB473A14BA4DB6D39DBF5B2A79C6DDD) == 0x001AA0, "Member 'AGC_StatusEffect_EMP_C::Transition_Lerp_0AB473A14BA4DB6D39DBF5B2A79C6DDD' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_EMP_C, Transition__Direction_0AB473A14BA4DB6D39DBF5B2A79C6DDD) == 0x001AA4, "Member 'AGC_StatusEffect_EMP_C::Transition__Direction_0AB473A14BA4DB6D39DBF5B2A79C6DDD' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_EMP_C, Transition) == 0x001AA8, "Member 'AGC_StatusEffect_EMP_C::Transition' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_EMP_C, lvl3) == 0x001AB0, "Member 'AGC_StatusEffect_EMP_C::lvl3' has a wrong offset!");

}

