#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_LoosingBreath_Choking

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_LoosingBreath_Choking.GC_StatusEffect_LoosingBreath_Choking_C.ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking
// 0x0220 (0x0220 - 0x0000)
struct GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0110(0x00F0)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAirAlpha_ReturnValue;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking) == 0x000008, "Wrong alignment on GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking");
static_assert(sizeof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking) == 0x000220, "Wrong size on GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, K2Node_Event_Target_1) == 0x000008, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, K2Node_Event_Parameters_1) == 0x000010, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, K2Node_Event_Target) == 0x000108, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, K2Node_Event_Parameters) == 0x000110, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_IsValid_ReturnValue_1) == 0x000200, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_GetAirAlpha_ReturnValue) == 0x000204, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_GetAirAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000208, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000210, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000218, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ExecuteUbergraph_GC_StatusEffect_LoosingBreath_Choking::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_StatusEffect_LoosingBreath_Choking.GC_StatusEffect_LoosingBreath_Choking_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_LoosingBreath_Choking.GC_StatusEffect_LoosingBreath_Choking_C.OnEffectLevelChanged
// 0x0010 (0x0010 - 0x0000)
struct GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged) == 0x000010, "Wrong size on GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");

// Function GC_StatusEffect_LoosingBreath_Choking.GC_StatusEffect_LoosingBreath_Choking_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget");
static_assert(sizeof(GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_LoosingBreath_Choking.GC_StatusEffect_LoosingBreath_Choking_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick");
static_assert(sizeof(GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick) == 0x000004, "Wrong size on GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick");
static_assert(offsetof(GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_StatusEffect_LoosingBreath_Choking_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

