#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Blinding

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C.ExecuteUbergraph_GC_StatusEffect_Blinding
// 0x0580 (0x0580 - 0x0000)
struct GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AsyncLastRenderedFrame*              CallFunc_GetLastRenderedFrame_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x0020(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0110(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0170(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0198(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01B8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue;            // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorEyesViewPoint_OutLocation;        // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetActorEyesViewPoint_OutRotation;        // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0310(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0408(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x04F8(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetLocalViewActor_ReturnValue_1;          // 0x0550(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UP2GameUserSettings*                    K2Node_DynamicCast_AsP2Game_User_Settings;         // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x3];                                      // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x057C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding) == 0x000008, "Wrong alignment on GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding");
static_assert(sizeof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding) == 0x000580, "Wrong size on GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetLastRenderedFrame_ReturnValue) == 0x000008, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetLastRenderedFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Target_2) == 0x000018, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Parameters_2) == 0x000020, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_SpawnResults_1) == 0x000110, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000168, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00016C, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000170, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000188, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000190, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000198, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001B8, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_Location) == 0x0001D8, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001F0, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000208, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000210, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000218, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000220, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000228, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00022C, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000230, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000238, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000240, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetLocalViewActor_ReturnValue) == 0x000258, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetLocalViewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000260, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetActorEyesViewPoint_OutLocation) == 0x000268, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetActorEyesViewPoint_OutLocation' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetActorEyesViewPoint_OutRotation) == 0x000280, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetActorEyesViewPoint_OutRotation' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000298, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_CreateDelegate_OutputDelegate) == 0x0002B0, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002C0, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Normal_ReturnValue) == 0x0002D8, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002F0, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002F8, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_IsValid_ReturnValue_1) == 0x0002F9, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetTimeRange_MinTime) == 0x0002FC, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetTimeRange_MaxTime) == 0x000300, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Target_1) == 0x000308, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Parameters_1) == 0x000310, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Target) == 0x000400, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_Parameters) == 0x000408, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_Event_SpawnResults) == 0x0004F8, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetLocalViewActor_ReturnValue_1) == 0x000550, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetLocalViewActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000558, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_GetGameUserSettings_ReturnValue) == 0x000560, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000568, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_DynamicCast_AsP2Game_User_Settings) == 0x000570, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_DynamicCast_AsP2Game_User_Settings' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, K2Node_DynamicCast_bSuccess) == 0x000578, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00057C, "Member 'GC_StatusEffect_Blinding_C_ExecuteUbergraph_GC_StatusEffect_Blinding::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Blinding_C_OnApplication final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Blinding_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_Blinding_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_Blinding_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_Blinding_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnApplication, Target_0) == 0x000000, "Member 'GC_StatusEffect_Blinding_C_OnApplication::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnApplication, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Blinding_C_OnApplication::Parameters_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Blinding_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Blinding_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Blinding_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Blinding_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_Blinding_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Blinding_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnBecomeViewTarget, Target_0) == 0x000000, "Member 'GC_StatusEffect_Blinding_C_OnBecomeViewTarget::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnBecomeViewTarget, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Blinding_C_OnBecomeViewTarget::Parameters_0' has a wrong offset!");

// Function GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C.OnEffectLevelChanged
// 0x0020 (0x0020 - 0x0000)
struct GC_StatusEffect_Blinding_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_Blinding_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged) == 0x000020, "Wrong size on GC_StatusEffect_Blinding_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_Blinding_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_Blinding_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_Blinding_C_OnEffectLevelChanged::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnEffectLevelChanged, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'GC_StatusEffect_Blinding_C_OnEffectLevelChanged::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Blinding_C_OnLoopingStart final
{
public:
	class AActor*                                 Target_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters_0;                                      // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Blinding_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_StatusEffect_Blinding_C_OnLoopingStart");
static_assert(sizeof(GC_StatusEffect_Blinding_C_OnLoopingStart) == 0x000150, "Wrong size on GC_StatusEffect_Blinding_C_OnLoopingStart");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnLoopingStart, Target_0) == 0x000000, "Member 'GC_StatusEffect_Blinding_C_OnLoopingStart::Target_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnLoopingStart, Parameters_0) == 0x000008, "Member 'GC_StatusEffect_Blinding_C_OnLoopingStart::Parameters_0' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Blinding_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Blinding_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

