#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_PsiWave_Splash

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_PsiWave_Splash.GC_Spectre_PsiWave_Splash_C.ExecuteUbergraph_GC_Spectre_PsiWave_Splash
// 0x0310 (0x0310 - 0x0000)
struct GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_1;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_1;        // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_2;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0188(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0278(0x0058)(ConstParm, ContainsInstancedReference)
	class UP2CameraComponent*                     CallFunc_FindCameraComponent_ReturnValue_2;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput_1; // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash) == 0x000008, "Wrong alignment on GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash");
static_assert(sizeof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash) == 0x000310, "Wrong size on GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, EntryPoint) == 0x000000, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_Target) == 0x000008, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000158, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_FindCameraComponent_ReturnValue) == 0x000160, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_FindCameraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_GetLocalPlayerPawn_ReturnValue_1) == 0x000168, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_GetLocalPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_FindCameraComponent_ReturnValue_1) == 0x000170, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_FindCameraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_GetLocalPlayerPawn_ReturnValue_2) == 0x000178, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_GetLocalPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_Target_1) == 0x000180, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_Parameters_1) == 0x000188, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, K2Node_Event_SpawnResults_1) == 0x000278, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_FindCameraComponent_ReturnValue_2) == 0x0002D0, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_FindCameraComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002D8, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0002E0, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_RemoveBlendable_InBlendableObject_CastInput_1) == 0x0002F0, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_RemoveBlendable_InBlendableObject_CastInput_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000300, "Member 'GC_Spectre_PsiWave_Splash_C_ExecuteUbergraph_GC_Spectre_PsiWave_Splash::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function GC_Spectre_PsiWave_Splash.GC_Spectre_PsiWave_Splash_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_PsiWave_Splash_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_PsiWave_Splash_C_OnApplication) == 0x000008, "Wrong alignment on GC_Spectre_PsiWave_Splash_C_OnApplication");
static_assert(sizeof(GC_Spectre_PsiWave_Splash_C_OnApplication) == 0x000150, "Wrong size on GC_Spectre_PsiWave_Splash_C_OnApplication");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnApplication, Target) == 0x000000, "Member 'GC_Spectre_PsiWave_Splash_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Spectre_PsiWave_Splash_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_PsiWave_Splash_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Spectre_PsiWave_Splash.GC_Spectre_PsiWave_Splash_C.OnRemoval
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_PsiWave_Splash_C_OnRemoval final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_PsiWave_Splash_C_OnRemoval) == 0x000008, "Wrong alignment on GC_Spectre_PsiWave_Splash_C_OnRemoval");
static_assert(sizeof(GC_Spectre_PsiWave_Splash_C_OnRemoval) == 0x000150, "Wrong size on GC_Spectre_PsiWave_Splash_C_OnRemoval");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnRemoval, Target) == 0x000000, "Member 'GC_Spectre_PsiWave_Splash_C_OnRemoval::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnRemoval, Parameters) == 0x000008, "Member 'GC_Spectre_PsiWave_Splash_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_PsiWave_Splash_C_OnRemoval, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_PsiWave_Splash_C_OnRemoval::SpawnResults' has a wrong offset!");

}

