#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SlottedWeapon_BeamRifle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_SlottedWeapon_BeamRifle.GC_SlottedWeapon_BeamRifle_C
// 0x0098 (0x0398 - 0x0300)
class AGC_SlottedWeapon_BeamRifle_C final : public AP2GameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         StaticMeshCompRef_FPP;                             // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeAlpha;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeAlphaInterpspeed;                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CooldownSpeed;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OverheatCooldownSpeed;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActivated;                                        // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         StaticMeshCompRef_TPP;                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 BarrelMeshString;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        BatteryLevel;                                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       Hero;                                              // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkelMeshCompRef_FPP;                               // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkelMeshCompRef_TPP;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2Weapon*                              Weapon;                                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraTPP;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraFPP;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeAlphaUpdate;                                 // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_SlottedWeapon_BeamRifle(int32 EntryPoint)	 // 0xae1e64;
	void InitializeCue(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;
	void SetStaticMeshRef(class UMeshComponent* StaticMeshRef, bool Fpp)	 // 0xae1e64;
	void ShouldCreateNiagaraComponent(class UNiagaraComponent* InComponent, class UMeshComponent* InMeshComponent, bool* IsValid)	 // 0xae1e64;
	void UpdateChargeAlpha(class UP2Weapon* In_Weapon)	 // 0xae1e64;
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_SlottedWeapon_BeamRifle_C">();
	}
	static class AGC_SlottedWeapon_BeamRifle_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_SlottedWeapon_BeamRifle_C>();
	}
};
static_assert(alignof(AGC_SlottedWeapon_BeamRifle_C) == 0x000008, "Wrong alignment on AGC_SlottedWeapon_BeamRifle_C");
static_assert(sizeof(AGC_SlottedWeapon_BeamRifle_C) == 0x000398, "Wrong size on AGC_SlottedWeapon_BeamRifle_C");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, UberGraphFrame) == 0x000300, "Member 'AGC_SlottedWeapon_BeamRifle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_SlottedWeapon_BeamRifle_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, StaticMeshCompRef_FPP) == 0x000310, "Member 'AGC_SlottedWeapon_BeamRifle_C::StaticMeshCompRef_FPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, ChargeAlpha) == 0x000318, "Member 'AGC_SlottedWeapon_BeamRifle_C::ChargeAlpha' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, ChargeAlphaInterpspeed) == 0x000320, "Member 'AGC_SlottedWeapon_BeamRifle_C::ChargeAlphaInterpspeed' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, CooldownSpeed) == 0x000328, "Member 'AGC_SlottedWeapon_BeamRifle_C::CooldownSpeed' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, OverheatCooldownSpeed) == 0x000330, "Member 'AGC_SlottedWeapon_BeamRifle_C::OverheatCooldownSpeed' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, bActivated) == 0x000338, "Member 'AGC_SlottedWeapon_BeamRifle_C::bActivated' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, StaticMeshCompRef_TPP) == 0x000340, "Member 'AGC_SlottedWeapon_BeamRifle_C::StaticMeshCompRef_TPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, BarrelMeshString) == 0x000348, "Member 'AGC_SlottedWeapon_BeamRifle_C::BarrelMeshString' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, BatteryLevel) == 0x000358, "Member 'AGC_SlottedWeapon_BeamRifle_C::BatteryLevel' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, Hero) == 0x000360, "Member 'AGC_SlottedWeapon_BeamRifle_C::Hero' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, SkelMeshCompRef_FPP) == 0x000368, "Member 'AGC_SlottedWeapon_BeamRifle_C::SkelMeshCompRef_FPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, SkelMeshCompRef_TPP) == 0x000370, "Member 'AGC_SlottedWeapon_BeamRifle_C::SkelMeshCompRef_TPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, Weapon) == 0x000378, "Member 'AGC_SlottedWeapon_BeamRifle_C::Weapon' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, NiagaraTPP) == 0x000380, "Member 'AGC_SlottedWeapon_BeamRifle_C::NiagaraTPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, NiagaraFPP) == 0x000388, "Member 'AGC_SlottedWeapon_BeamRifle_C::NiagaraFPP' has a wrong offset!");
static_assert(offsetof(AGC_SlottedWeapon_BeamRifle_C, ChargeAlphaUpdate) == 0x000390, "Member 'AGC_SlottedWeapon_BeamRifle_C::ChargeAlphaUpdate' has a wrong offset!");

}

