#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SpectreTankThrow_PreTension

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_SpectreTankThrow_PreTension.GC_SpectreTankThrow_PreTension_C.OnExecute
// 0x01D8 (0x01D8 - 0x0000)
struct GC_SpectreTankThrow_PreTension_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SpectreTankThrow_PreTension_C_OnExecute) == 0x000008, "Wrong alignment on GC_SpectreTankThrow_PreTension_C_OnExecute");
static_assert(sizeof(GC_SpectreTankThrow_PreTension_C_OnExecute) == 0x0001D8, "Wrong size on GC_SpectreTankThrow_PreTension_C_OnExecute");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, Parameters) == 0x000008, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F9, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000188, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_SpectreTankThrow_PreTension_C_OnExecute, CallFunc_PostEventAtLocation_ReturnValue) == 0x0001D4, "Member 'GC_SpectreTankThrow_PreTension_C_OnExecute::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

