#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Blinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GC_StatusEffect_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_StatusEffect_Blinding.GC_StatusEffect_Blinding_C
// 0x0110 (0x1BB0 - 0x1AA0)
class AGC_StatusEffect_Blinding_C final : public AGC_StatusEffect_Base_C
{
public:
	uint8                                         Pad_1A94[0x4];                                     // 0x1A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_StatusEffect_Blinding_C;         // 0x1A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         RTAnimation_Animation_E702860842A3D14A21400ABD42974B9F; // 0x1AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RTAnimation__Direction_E702860842A3D14A21400ABD42974B9F; // 0x1AA4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA5[0x3];                                     // 0x1AA5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RTAnimation;                                       // 0x1AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x1AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x1AB8(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCurveFloat*                            EffectCurve;                                       // 0x1BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Complete_298639ED45B63C21DC7F978ED1F33C57()	 // 0xae1e64;
	void ExecuteUbergraph_GC_StatusEffect_Blinding(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnBecomeViewTarget(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0)	 // 0xae1e64;
	void OnEffectLevelChanged(bool Update_Status_Icon, class AActor* TargetActor)	 // 0xae1e64;
	void OnLoopingStart(class AActor* Target_0, const struct FGameplayCueParameters& Parameters_0, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void RTAnimation__FinishedFunc()	 // 0xae1e64;
	void RTAnimation__UpdateFunc()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_StatusEffect_Blinding_C">();
	}
	static class AGC_StatusEffect_Blinding_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_StatusEffect_Blinding_C>();
	}
};
static_assert(alignof(AGC_StatusEffect_Blinding_C) == 0x000010, "Wrong alignment on AGC_StatusEffect_Blinding_C");
static_assert(sizeof(AGC_StatusEffect_Blinding_C) == 0x001BB0, "Wrong size on AGC_StatusEffect_Blinding_C");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, UberGraphFrame_GC_StatusEffect_Blinding_C) == 0x001A98, "Member 'AGC_StatusEffect_Blinding_C::UberGraphFrame_GC_StatusEffect_Blinding_C' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, RTAnimation_Animation_E702860842A3D14A21400ABD42974B9F) == 0x001AA0, "Member 'AGC_StatusEffect_Blinding_C::RTAnimation_Animation_E702860842A3D14A21400ABD42974B9F' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, RTAnimation__Direction_E702860842A3D14A21400ABD42974B9F) == 0x001AA4, "Member 'AGC_StatusEffect_Blinding_C::RTAnimation__Direction_E702860842A3D14A21400ABD42974B9F' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, RTAnimation) == 0x001AA8, "Member 'AGC_StatusEffect_Blinding_C::RTAnimation' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, Target) == 0x001AB0, "Member 'AGC_StatusEffect_Blinding_C::Target' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, Parameters) == 0x001AB8, "Member 'AGC_StatusEffect_Blinding_C::Parameters' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Blinding_C, EffectCurve) == 0x001BA8, "Member 'AGC_StatusEffect_Blinding_C::EffectCurve' has a wrong offset!");

}

