#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Burning

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.ExecuteUbergraph_GC_StatusEffect_Burning
// 0x0600 (0x0600 - 0x0000)
struct GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewStackCount;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel, int32 NewStackCount)> K2Node_CreateDelegate_OutputDelegate;       // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_4;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_3;                         // 0x0030(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x0120(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_3;                             // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0180(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_2;                         // 0x01E0(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_1;                             // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x02D8(0x00F0)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x03D0(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x04C0(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0520(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0538(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0540(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0548(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0568(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0588(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x05A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x05B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x05D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EA[0x6];                                      // 0x05EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityAsync_WaitStatusEffectLevelChange* CallFunc_WaitStatusEffectLevelChange_ReturnValue; // 0x05F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning");
static_assert(sizeof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning) == 0x000600, "Wrong size on GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, EntryPoint) == 0x000000, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_CustomEvent_NewLevel) == 0x000004, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_CustomEvent_NewStackCount) == 0x000008, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_CustomEvent_NewStackCount' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, Temp_int_Variable) == 0x00001C, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, Temp_int_Variable_1) == 0x000020, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Target_4) == 0x000028, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Target_4' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Parameters_3) == 0x000030, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Parameters_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_SpawnResults_2) == 0x000120, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Target_3) == 0x000178, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Target_3' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_SpawnResults_1) == 0x000180, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Target_2) == 0x0001D8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Parameters_2) == 0x0001E0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Parameters_2' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Target_1) == 0x0002D0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Parameters_1) == 0x0002D8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Target) == 0x0003C8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_Parameters) == 0x0003D0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, K2Node_Event_SpawnResults) == 0x0004C0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000518, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x00051C, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000520, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000538, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000540, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000548, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000568, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_Location) == 0x000588, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_Normal) == 0x0005A0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0005B8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0005C0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0005C8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0005D0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0005D8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0005DC, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0005E0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0005E8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_HasAuthority_ReturnValue) == 0x0005E9, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_WaitStatusEffectLevelChange_ReturnValue) == 0x0005F0, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_WaitStatusEffectLevelChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning, CallFunc_IsValid_ReturnValue) == 0x0005F8, "Member 'GC_StatusEffect_Burning_C_ExecuteUbergraph_GC_StatusEffect_Burning::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.LevelChange_EA5CF822453D6BA3BA474482484F2B7B
// 0x0008 (0x0008 - 0x0000)
struct GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewStackCount;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B) == 0x000004, "Wrong alignment on GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B");
static_assert(sizeof(GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B) == 0x000008, "Wrong size on GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B");
static_assert(offsetof(GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B, NewLevel) == 0x000000, "Member 'GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B::NewLevel' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B, NewStackCount) == 0x000004, "Member 'GC_StatusEffect_Burning_C_LevelChange_EA5CF822453D6BA3BA474482484F2B7B::NewStackCount' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Burning_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnApplication) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnApplication");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnApplication) == 0x000150, "Wrong size on GC_StatusEffect_Burning_C_OnApplication");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnApplication, Target) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnApplication, Parameters) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Burning_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnBecomeViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Burning_C_OnBecomeViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnBecomeViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnBecomeViewTarget");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnBecomeViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Burning_C_OnBecomeViewTarget");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnBecomeViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnBecomeViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnBecomeViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnBecomeViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnEffectLevelChanged
// 0x0018 (0x0018 - 0x0000)
struct GC_StatusEffect_Burning_C_OnEffectLevelChanged final
{
public:
	bool                                          Update_Status_Icon;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnEffectLevelChanged) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnEffectLevelChanged");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnEffectLevelChanged) == 0x000018, "Wrong size on GC_StatusEffect_Burning_C_OnEffectLevelChanged");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnEffectLevelChanged, Update_Status_Icon) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnEffectLevelChanged::Update_Status_Icon' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnEffectLevelChanged, TargetActor) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnEffectLevelChanged::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnEffectLevelChanged, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'GC_StatusEffect_Burning_C_OnEffectLevelChanged::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnEndViewTarget
// 0x00F8 (0x00F8 - 0x0000)
struct GC_StatusEffect_Burning_C_OnEndViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnEndViewTarget) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnEndViewTarget");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnEndViewTarget) == 0x0000F8, "Wrong size on GC_StatusEffect_Burning_C_OnEndViewTarget");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnEndViewTarget, Target) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnEndViewTarget::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnEndViewTarget, Parameters) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnEndViewTarget::Parameters' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_StatusEffect_Burning_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnLoopingEnd");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_StatusEffect_Burning_C_OnLoopingEnd");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_StatusEffect_Burning_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_OnLoopingStart");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnLoopingStart) == 0x000150, "Wrong size on GC_StatusEffect_Burning_C_OnLoopingStart");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_StatusEffect_Burning_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_StatusEffect_Burning_C_OnLoopingStart::SpawnResults' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.SetHero
// 0x0018 (0x0018 - 0x0000)
struct GC_StatusEffect_Burning_C_SetHero final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2BaseCharacter*                       K2Node_DynamicCast_AsP2Base_Character;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_SetHero) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_SetHero");
static_assert(sizeof(GC_StatusEffect_Burning_C_SetHero) == 0x000018, "Wrong size on GC_StatusEffect_Burning_C_SetHero");
static_assert(offsetof(GC_StatusEffect_Burning_C_SetHero, TargetActor) == 0x000000, "Member 'GC_StatusEffect_Burning_C_SetHero::TargetActor' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_SetHero, K2Node_DynamicCast_AsP2Base_Character) == 0x000008, "Member 'GC_StatusEffect_Burning_C_SetHero::K2Node_DynamicCast_AsP2Base_Character' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_SetHero, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GC_StatusEffect_Burning_C_SetHero::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_SetHero, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'GC_StatusEffect_Burning_C_SetHero::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.UpdateFPP
// 0x0040 (0x0040 - 0x0000)
struct GC_StatusEffect_Burning_C_UpdateFPP final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh1P_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_UpdateFPP) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_UpdateFPP");
static_assert(sizeof(GC_StatusEffect_Burning_C_UpdateFPP) == 0x000040, "Wrong size on GC_StatusEffect_Burning_C_UpdateFPP");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, Active) == 0x000000, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::Active' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, Temp_object_Variable) == 0x000008, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, Temp_object_Variable_1) == 0x000010, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, Temp_bool_Variable) == 0x000018, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, CallFunc_Greater_IntInt_ReturnValue) == 0x000019, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, K2Node_Select_Default) == 0x000020, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, CallFunc_GetMesh1P_ReturnValue) == 0x000028, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::CallFunc_GetMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateFPP, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000038, "Member 'GC_StatusEffect_Burning_C_UpdateFPP::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.UpdateTPP
// 0x0038 (0x0038 - 0x0000)
struct GC_StatusEffect_Burning_C_UpdateTPP final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetMesh3P_ReturnValue;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_UpdateTPP) == 0x000008, "Wrong alignment on GC_StatusEffect_Burning_C_UpdateTPP");
static_assert(sizeof(GC_StatusEffect_Burning_C_UpdateTPP) == 0x000038, "Wrong size on GC_StatusEffect_Burning_C_UpdateTPP");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, Active) == 0x000000, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::Active' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, Temp_object_Variable) == 0x000008, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, Temp_object_Variable_1) == 0x000010, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, Temp_bool_Variable) == 0x000018, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, CallFunc_Greater_IntInt_ReturnValue) == 0x000019, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00001A, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, K2Node_Select_Default) == 0x000020, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, CallFunc_GetMesh3P_ReturnValue) == 0x000028, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_StatusEffect_Burning_C_UpdateTPP, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000030, "Member 'GC_StatusEffect_Burning_C_UpdateTPP::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GC_StatusEffect_Burning.GC_StatusEffect_Burning_C.OnStatusEffectDamage
// 0x0001 (0x0001 - 0x0000)
struct GC_StatusEffect_Burning_C_OnStatusEffectDamage final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_StatusEffect_Burning_C_OnStatusEffectDamage) == 0x000001, "Wrong alignment on GC_StatusEffect_Burning_C_OnStatusEffectDamage");
static_assert(sizeof(GC_StatusEffect_Burning_C_OnStatusEffectDamage) == 0x000001, "Wrong size on GC_StatusEffect_Burning_C_OnStatusEffectDamage");
static_assert(offsetof(GC_StatusEffect_Burning_C_OnStatusEffectDamage, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GC_StatusEffect_Burning_C_OnStatusEffectDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

