#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_StatusEffect_Injury_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GC_StatusEffect_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_StatusEffect_Injury_Base.GC_StatusEffect_Injury_Base_C
// 0x0020 (0x1AC0 - 0x1AA0)
class AGC_StatusEffect_Injury_Base_C : public AGC_StatusEffect_Base_C
{
public:
	uint8                                         Pad_1A94[0x4];                                     // 0x1A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_GC_StatusEffect_Injury_Base_C;      // 0x1A98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UP2AbilityAsync_WaitGameplayTagChange*> AsyncActions;                               // 0x1AA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Target;                                            // 0x1AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_StatusEffect_Injury_Base(int32 EntryPoint)	 // 0xae1e64;
	void OnApplication(class AActor* Target_0, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void OnBecomeViewTarget(class AActor* Target_0, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void OnEndViewTarget(class AActor* Target_0, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void TagChange_07B8676D403BADE643A33D8A182C9FAA(const struct FGameplayTag& Tag, int32 NewCount)	 // 0xae1e64;
	void TagChange_5EE38DCB407A5DDE1C0E0486FBC78E06(const struct FGameplayTag& Tag, int32 NewCount)	 // 0xae1e64;
	void TagChange_7F9CE9B04F3477C2593340B41AAC5970(const struct FGameplayTag& Tag, int32 NewCount)	 // 0xae1e64;
	void TagChange_8BCA521F44803E3125DB10A8B881E657(const struct FGameplayTag& Tag, int32 NewCount)	 // 0xae1e64;
	void TagChange_B6AB58FD423B620F31BE19B5D9D1F654(const struct FGameplayTag& Tag, int32 NewCount)	 // 0xae1e64;
	void UpdatePP(class AActor* InTargetActor)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_StatusEffect_Injury_Base_C">();
	}
	static class AGC_StatusEffect_Injury_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_StatusEffect_Injury_Base_C>();
	}
};
static_assert(alignof(AGC_StatusEffect_Injury_Base_C) == 0x000010, "Wrong alignment on AGC_StatusEffect_Injury_Base_C");
static_assert(sizeof(AGC_StatusEffect_Injury_Base_C) == 0x001AC0, "Wrong size on AGC_StatusEffect_Injury_Base_C");
static_assert(offsetof(AGC_StatusEffect_Injury_Base_C, UberGraphFrame_GC_StatusEffect_Injury_Base_C) == 0x001A98, "Member 'AGC_StatusEffect_Injury_Base_C::UberGraphFrame_GC_StatusEffect_Injury_Base_C' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Injury_Base_C, AsyncActions) == 0x001AA0, "Member 'AGC_StatusEffect_Injury_Base_C::AsyncActions' has a wrong offset!");
static_assert(offsetof(AGC_StatusEffect_Injury_Base_C, Target) == 0x001AB0, "Member 'AGC_StatusEffect_Injury_Base_C::Target' has a wrong offset!");

}

