#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_Electrocute

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_Electrocute.GC_Spectre_Electrocute_C.ExecuteUbergraph_GC_Spectre_Electrocute
// 0x0248 (0x0248 - 0x0000)
struct GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0020(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0110(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0170(0x0058)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0230(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute) == 0x000008, "Wrong alignment on GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute");
static_assert(sizeof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute) == 0x000248, "Wrong size on GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, EntryPoint) == 0x000000, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, Temp_delegate_Variable) == 0x000004, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_Event_Target_1) == 0x000018, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_Event_Parameters) == 0x000020, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_Event_SpawnResults_1) == 0x000110, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_Event_Target) == 0x000168, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_Event_SpawnResults) == 0x000170, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001D0, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_IsLocallyControlled_ReturnValue) == 0x0001D9, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001E0, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x0001E8, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x0001F1, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0001F8, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000200, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_PostEvent_ReturnValue) == 0x000210, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000218, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x000220, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, Temp_delegate_Variable_1) == 0x000230, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute, CallFunc_PostEvent_ReturnValue_1) == 0x000240, "Member 'GC_Spectre_Electrocute_C_ExecuteUbergraph_GC_Spectre_Electrocute::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function GC_Spectre_Electrocute.GC_Spectre_Electrocute_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Spectre_Electrocute_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Electrocute_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Spectre_Electrocute_C_OnLoopingEnd");
static_assert(sizeof(GC_Spectre_Electrocute_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Spectre_Electrocute_C_OnLoopingEnd");
static_assert(offsetof(GC_Spectre_Electrocute_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Spectre_Electrocute_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Spectre_Electrocute_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Spectre_Electrocute.GC_Spectre_Electrocute_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_Electrocute_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Electrocute_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_Electrocute_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_Electrocute_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_Electrocute_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_Electrocute_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_Electrocute_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_Electrocute_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Electrocute_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_Electrocute_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

