#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Stun_Large_Land

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Stun_Large_Land.GC_Stun_Large_Land_C
// 0x0060 (0x00A0 - 0x0040)
class UGC_Stun_Large_Land_C final : public UGameplayCueNotify_Static
{
public:
	class UNiagaraSystem*                         DefaultLandSystem;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UPhysicalMaterial*, class UNiagaraSystem*> LandSystemMap;                             // 0x0048(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraSystem*                         WaterLandSystem;                                   // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters) const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_Stun_Large_Land_C">();
	}
	static class UGC_Stun_Large_Land_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGC_Stun_Large_Land_C>();
	}
};
static_assert(alignof(UGC_Stun_Large_Land_C) == 0x000008, "Wrong alignment on UGC_Stun_Large_Land_C");
static_assert(sizeof(UGC_Stun_Large_Land_C) == 0x0000A0, "Wrong size on UGC_Stun_Large_Land_C");
static_assert(offsetof(UGC_Stun_Large_Land_C, DefaultLandSystem) == 0x000040, "Member 'UGC_Stun_Large_Land_C::DefaultLandSystem' has a wrong offset!");
static_assert(offsetof(UGC_Stun_Large_Land_C, LandSystemMap) == 0x000048, "Member 'UGC_Stun_Large_Land_C::LandSystemMap' has a wrong offset!");
static_assert(offsetof(UGC_Stun_Large_Land_C, WaterLandSystem) == 0x000098, "Member 'UGC_Stun_Large_Land_C::WaterLandSystem' has a wrong offset!");

}

