#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_TimeoutFadeOut

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_TimeoutFadeOut.GC_Spectre_TimeoutFadeOut_C.ExecuteUbergraph_GC_Spectre_TimeoutFadeOut
// 0x0418 (0x0418 - 0x0000)
struct GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0010(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target_2;                             // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0070(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_2;                       // 0x0160(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter;                // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01D0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01F8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0218(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter_1;              // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x02C0(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x03B0(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2NPCharacter*                         K2Node_DynamicCast_AsP2NPCharacter_2;              // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut");
static_assert(sizeof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut) == 0x000418, "Wrong size on GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, EntryPoint) == 0x000000, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_Target) == 0x000008, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_SpawnResults) == 0x000010, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_Target_2) == 0x000068, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_Target_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_Parameters_1) == 0x000070, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_SpawnResults_2) == 0x000160, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_SpawnResults_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_AsP2NPCharacter) == 0x0001B8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_AsP2NPCharacter' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001C4, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001C8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001D0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001E8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001F0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001F8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000218, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_Location) == 0x000238, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_Normal) == 0x000250, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000268, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000270, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000278, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000280, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000288, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x00028C, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000290, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000298, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0002A0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_AsP2NPCharacter_1) == 0x0002A8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_AsP2NPCharacter_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_bSuccess_1) == 0x0002B0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_Target_1) == 0x0002B8, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_Parameters) == 0x0002C0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_Event_SpawnResults_1) == 0x0003B0, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_AsP2NPCharacter_2) == 0x000408, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_AsP2NPCharacter_2' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut, K2Node_DynamicCast_bSuccess_2) == 0x000410, "Member 'GC_Spectre_TimeoutFadeOut_C_ExecuteUbergraph_GC_Spectre_TimeoutFadeOut::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function GC_Spectre_TimeoutFadeOut.GC_Spectre_TimeoutFadeOut_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_TimeoutFadeOut_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_TimeoutFadeOut_C_OnApplication) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeOut_C_OnApplication");
static_assert(sizeof(GC_Spectre_TimeoutFadeOut_C_OnApplication) == 0x000150, "Wrong size on GC_Spectre_TimeoutFadeOut_C_OnApplication");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnApplication, Target) == 0x000000, "Member 'GC_Spectre_TimeoutFadeOut_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnApplication, Parameters) == 0x000008, "Member 'GC_Spectre_TimeoutFadeOut_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_TimeoutFadeOut_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_Spectre_TimeoutFadeOut.GC_Spectre_TimeoutFadeOut_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd");
static_assert(sizeof(GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Spectre_TimeoutFadeOut_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Spectre_TimeoutFadeOut.GC_Spectre_TimeoutFadeOut_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_TimeoutFadeOut_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_TimeoutFadeOut_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_TimeoutFadeOut_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_TimeoutFadeOut_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_TimeoutFadeOut_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_TimeoutFadeOut_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_TimeoutFadeOut_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_TimeoutFadeOut_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_TimeoutFadeOut_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

