#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SplitTimeline_Start

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_SplitTimeline_Start.GC_SplitTimeline_Start_C.OnExecute
// 0x0218 (0x0218 - 0x0000)
struct GC_SplitTimeline_Start_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0108(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0130(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0150(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FTrunc64_ReturnValue;                     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_Int64Int64_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue_1;      // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_Int64ToDouble_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x01F0(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc64_A_ImplicitCast;                  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SplitTimeline_Start_C_OnExecute) == 0x000008, "Wrong alignment on GC_SplitTimeline_Start_C_OnExecute");
static_assert(sizeof(GC_SplitTimeline_Start_C_OnExecute) == 0x000218, "Wrong size on GC_SplitTimeline_Start_C_OnExecute");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_SplitTimeline_Start_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, Parameters) == 0x000008, "Member 'GC_SplitTimeline_Start_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, ReturnValue) == 0x0000F8, "Member 'GC_SplitTimeline_Start_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000FC, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000100, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000108, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000120, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000128, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000130, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000150, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000170, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000188, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001A0, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A8, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001B0, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B8, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001C0, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001C4, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C8, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001D0, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0001D1, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_FTrunc64_ReturnValue) == 0x0001D8, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_FTrunc64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_GreaterEqual_Int64Int64_ReturnValue) == 0x0001E0, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_GreaterEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x0001E1, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_EqualEqual_Int64Int64_ReturnValue_1) == 0x0001E2, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_EqualEqual_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_Conv_Int64ToDouble_ReturnValue) == 0x0001E8, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_Conv_Int64ToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, Temp_delegate_Variable) == 0x0001F0, "Member 'GC_SplitTimeline_Start_C_OnExecute::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_PostEvent_ReturnValue) == 0x000200, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_FTrunc64_A_ImplicitCast) == 0x000208, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_FTrunc64_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_SplitTimeline_Start_C_OnExecute, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000210, "Member 'GC_SplitTimeline_Start_C_OnExecute::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");

}

