#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_SlottedWeapon_AssaultRailgun

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun
// 0x00A0 (0x00A0 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_CustomEvent_StaticMeshRef;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FPP;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_DynamicCast_AsSkeletal_Mesh_Component_1;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateMaterialParameters_Delta_Seconds_ImplicitCast; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun) == 0x0000A0, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, EntryPoint) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_CustomEvent_StaticMeshRef) == 0x000010, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_CustomEvent_StaticMeshRef' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_CustomEvent_FPP) == 0x000018, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_CustomEvent_FPP' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_AsSkeletal_Mesh_Component) == 0x000020, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_AsSkeletal_Mesh_Component' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_AsSkeletal_Mesh_Component_1) == 0x000030, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_AsSkeletal_Mesh_Component_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_IsValid_ReturnValue_1) == 0x00003A, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_GetChildrenComponents_Children) == 0x000040, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, Temp_int_Array_Index_Variable) == 0x000054, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Array_Get_Item) == 0x000060, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_AsMesh_Component) == 0x000068, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_GetDisplayName_ReturnValue) == 0x000078, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Contains_ReturnValue) == 0x000088, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun, CallFunc_UpdateMaterialParameters_Delta_Seconds_ImplicitCast) == 0x000098, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ExecuteUbergraph_GC_SlottedWeapon_AssaultRailgun::CallFunc_UpdateMaterialParameters_Delta_Seconds_ImplicitCast' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.InitializeCue
// 0x0220 (0x0220 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_InitializeCue final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0100(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0128(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0148(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetMesh1P_ReturnValue;                    // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2Weapon*                              K2Node_DynamicCast_AsP2Weapon;                     // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCreateNiagaraComponent_IsValid;     // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetMesh3P_ReturnValue;                    // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue_1; // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCreateNiagaraComponent_IsValid_1;   // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_InitializeCue");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue) == 0x000220, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_InitializeCue");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, MyTarget) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, Parameters) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000FC, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000100, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000118, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000120, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000128, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000148, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_Location) == 0x000168, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_Normal) == 0x000180, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000198, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001A0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x0001A8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001B0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001B8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001BC, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001C0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001C8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_GetMesh1P_ReturnValue) == 0x0001D0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_GetMesh1P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, K2Node_DynamicCast_AsP2Weapon) == 0x0001D8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::K2Node_DynamicCast_AsP2Weapon' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_ShouldCreateNiagaraComponent_IsValid) == 0x0001E1, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_ShouldCreateNiagaraComponent_IsValid' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue) == 0x0001E8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_GetOwner_ReturnValue) == 0x0001F0, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_GetMesh3P_ReturnValue) == 0x0001F8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_GetMesh3P_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, K2Node_DynamicCast_AsP2Hero_Character) == 0x000200, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, K2Node_DynamicCast_bSuccess_1) == 0x000208, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue_1) == 0x000210, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_SpawnPerspectiveSystemAttachedToHero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_InitializeCue, CallFunc_ShouldCreateNiagaraComponent_IsValid_1) == 0x000218, "Member 'GC_SlottedWeapon_AssaultRailgun_C_InitializeCue::CallFunc_ShouldCreateNiagaraComponent_IsValid_1' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.OnActive
// 0x0100 (0x0100 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_OnActive) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_OnActive");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_OnActive) == 0x000100, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_OnActive");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_OnActive, MyTarget) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_OnActive, Parameters) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000F9, "Member 'GC_SlottedWeapon_AssaultRailgun_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick) == 0x000004, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.SetStaticMeshRef
// 0x0010 (0x0010 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef final
{
public:
	class UMeshComponent*                         StaticMeshRef;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Fpp;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef) == 0x000010, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef, StaticMeshRef) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef::StaticMeshRef' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef, Fpp) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_SetStaticMeshRef::Fpp' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.ShouldCreateNiagaraComponent
// 0x0018 (0x0018 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent final
{
public:
	class UNiagaraComponent*                      InComponent;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         InMeshComponent;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent) == 0x000018, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, InComponent) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::InComponent' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, InMeshComponent) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::InMeshComponent' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, IsValid) == 0x000010, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::IsValid' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'GC_SlottedWeapon_AssaultRailgun_C_ShouldCreateNiagaraComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.UpdateChargeAlpha
// 0x0028 (0x0028 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha final
{
public:
	class UP2Weapon*                              In_Weapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Delta_Time;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargeAlpha_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_ChargeAlpha_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha) == 0x000028, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, In_Weapon) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::In_Weapon' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, Delta_Time) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::Delta_Time' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, CallFunc_GetChargeAlpha_ReturnValue) == 0x000010, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::CallFunc_GetChargeAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000014, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000015, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, K2Node_VariableSet_ChargeAlpha_ImplicitCast) == 0x000018, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::K2Node_VariableSet_ChargeAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateChargeAlpha::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.UpdateMaterialParameters
// 0x0028 (0x0028 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters final
{
public:
	double                                        Delta_Seconds;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetChargeAlpha_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_ChargeAlpha_ImplicitCast;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast; // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1; // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters) == 0x000028, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, Delta_Seconds) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000A, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_IsValid_ReturnValue_2) == 0x00000B, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_GetChargeAlpha_ReturnValue) == 0x00000C, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_GetChargeAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, K2Node_VariableSet_ChargeAlpha_ImplicitCast) == 0x000018, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::K2Node_VariableSet_ChargeAlpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast) == 0x000020, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters, CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1) == 0x000024, "Member 'GC_SlottedWeapon_AssaultRailgun_C_UpdateMaterialParameters::CallFunc_SetScalarParameterValueOnMaterials_ParameterValue_ImplicitCast_1' has a wrong offset!");

// Function GC_SlottedWeapon_AssaultRailgun.GC_SlottedWeapon_AssaultRailgun_C.WhileActive
// 0x0100 (0x0100 - 0x0000)
struct GC_SlottedWeapon_AssaultRailgun_C_WhileActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WhileActive_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_SlottedWeapon_AssaultRailgun_C_WhileActive) == 0x000008, "Wrong alignment on GC_SlottedWeapon_AssaultRailgun_C_WhileActive");
static_assert(sizeof(GC_SlottedWeapon_AssaultRailgun_C_WhileActive) == 0x000100, "Wrong size on GC_SlottedWeapon_AssaultRailgun_C_WhileActive");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_WhileActive, MyTarget) == 0x000000, "Member 'GC_SlottedWeapon_AssaultRailgun_C_WhileActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_WhileActive, Parameters) == 0x000008, "Member 'GC_SlottedWeapon_AssaultRailgun_C_WhileActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_SlottedWeapon_AssaultRailgun_C_WhileActive, ReturnValue) == 0x0000F8, "Member 'GC_SlottedWeapon_AssaultRailgun_C_WhileActive::ReturnValue' has a wrong offset!");
