#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Spectre_Afraid

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function GC_Spectre_Afraid.GC_Spectre_Afraid_C.ExecuteUbergraph_GC_Spectre_Afraid
// 0x0200 (0x0200 - 0x0000)
struct GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target_1;                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults_1;                       // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Target;                               // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0160(0x0058)(ConstParm, ContainsInstancedReference)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character_1;           // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBlendableInterface>   CallFunc_RemoveBlendable_InBlendableObject_CastInput; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid) == 0x000008, "Wrong alignment on GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid");
static_assert(sizeof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid) == 0x000200, "Wrong size on GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, EntryPoint) == 0x000000, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_Event_Target_1) == 0x000008, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_Event_Target_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_Event_Parameters) == 0x000010, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_Event_SpawnResults_1) == 0x000100, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_Event_SpawnResults_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_Event_Target) == 0x000158, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_Event_SpawnResults) == 0x000160, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_DynamicCast_AsP2Hero_Character) == 0x0001B8, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_DynamicCast_AsP2Hero_Character_1) == 0x0001C8, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_DynamicCast_AsP2Hero_Character_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, CallFunc_IsValid_ReturnValue) == 0x0001D1, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x0001D8, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001E8, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid, CallFunc_RemoveBlendable_InBlendableObject_CastInput) == 0x0001F0, "Member 'GC_Spectre_Afraid_C_ExecuteUbergraph_GC_Spectre_Afraid::CallFunc_RemoveBlendable_InBlendableObject_CastInput' has a wrong offset!");

// Function GC_Spectre_Afraid.GC_Spectre_Afraid_C.OnLoopingEnd
// 0x0060 (0x0060 - 0x0000)
struct GC_Spectre_Afraid_C_OnLoopingEnd final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x0008(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Afraid_C_OnLoopingEnd) == 0x000008, "Wrong alignment on GC_Spectre_Afraid_C_OnLoopingEnd");
static_assert(sizeof(GC_Spectre_Afraid_C_OnLoopingEnd) == 0x000060, "Wrong size on GC_Spectre_Afraid_C_OnLoopingEnd");
static_assert(offsetof(GC_Spectre_Afraid_C_OnLoopingEnd, Target) == 0x000000, "Member 'GC_Spectre_Afraid_C_OnLoopingEnd::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_OnLoopingEnd, SpawnResults) == 0x000008, "Member 'GC_Spectre_Afraid_C_OnLoopingEnd::SpawnResults' has a wrong offset!");

// Function GC_Spectre_Afraid.GC_Spectre_Afraid_C.OnLoopingStart
// 0x0150 (0x0150 - 0x0000)
struct GC_Spectre_Afraid_C_OnLoopingStart final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_Spectre_Afraid_C_OnLoopingStart) == 0x000008, "Wrong alignment on GC_Spectre_Afraid_C_OnLoopingStart");
static_assert(sizeof(GC_Spectre_Afraid_C_OnLoopingStart) == 0x000150, "Wrong size on GC_Spectre_Afraid_C_OnLoopingStart");
static_assert(offsetof(GC_Spectre_Afraid_C_OnLoopingStart, Target) == 0x000000, "Member 'GC_Spectre_Afraid_C_OnLoopingStart::Target' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GC_Spectre_Afraid_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Spectre_Afraid_C_OnLoopingStart, SpawnResults) == 0x0000F8, "Member 'GC_Spectre_Afraid_C_OnLoopingStart::SpawnResults' has a wrong offset!");

}

