#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_WeaponFire_Base

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_WeaponFire_Base.GC_WeaponFire_Base_C
// 0x0018 (0x0790 - 0x0778)
class AGC_WeaponFire_Base_C : public AP2GameplayCue_FireWeapon
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueTag                        ShellDropCueTag;                                   // 0x0780(0x0008)(Edit, BlueprintVisible, NoDestructor)
	double                                        ShellDrop_SFX_Y_Offset;                            // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters)	 // 0xae1e64;
	void PostShellDropSFX(const struct FGameplayCueParameters& InParams)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_WeaponFire_Base_C">();
	}
	static class AGC_WeaponFire_Base_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_WeaponFire_Base_C>();
	}
};
static_assert(alignof(AGC_WeaponFire_Base_C) == 0x000008, "Wrong alignment on AGC_WeaponFire_Base_C");
static_assert(sizeof(AGC_WeaponFire_Base_C) == 0x000790, "Wrong size on AGC_WeaponFire_Base_C");
static_assert(offsetof(AGC_WeaponFire_Base_C, DefaultSceneRoot) == 0x000778, "Member 'AGC_WeaponFire_Base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_WeaponFire_Base_C, ShellDropCueTag) == 0x000780, "Member 'AGC_WeaponFire_Base_C::ShellDropCueTag' has a wrong offset!");
static_assert(offsetof(AGC_WeaponFire_Base_C, ShellDrop_SFX_Y_Offset) == 0x000788, "Member 'AGC_WeaponFire_Base_C::ShellDrop_SFX_Y_Offset' has a wrong offset!");

}

