#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_WaterIllusion_Audio

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_WaterIllusion_Audio.GC_WaterIllusion_Audio_C.ExecuteUbergraph_GC_WaterIllusion_Audio
// 0x0260 (0x0260 - 0x0000)
struct GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Target;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00F0)(ConstParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       K2Node_Event_SpawnResults;                         // 0x0100(0x0058)(ConstParm, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0168(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0190(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01B0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetInvLerpFromAbilityStartToSubmersion_InvLerp; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_AbilityStartTime_ImplicitCast;  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio) == 0x000008, "Wrong alignment on GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio");
static_assert(sizeof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio) == 0x000260, "Wrong size on GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, EntryPoint) == 0x000000, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, K2Node_Event_Target) == 0x000008, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::K2Node_Event_Target' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, K2Node_Event_Parameters) == 0x000010, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, K2Node_Event_SpawnResults) == 0x000100, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::K2Node_Event_SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, K2Node_Event_DeltaSeconds) == 0x000158, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x00015C, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000160, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000168, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000180, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000188, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000190, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001B0, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_Location) == 0x0001D0, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001E8, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000200, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000208, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000210, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000218, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000220, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000224, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000228, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000230, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_FTrunc_ReturnValue) == 0x000234, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_GetInvLerpFromAbilityStartToSubmersion_InvLerp) == 0x000238, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_GetInvLerpFromAbilityStartToSubmersion_InvLerp' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000240, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_FTrunc_A_ImplicitCast) == 0x000248, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, K2Node_VariableSet_AbilityStartTime_ImplicitCast) == 0x000250, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::K2Node_VariableSet_AbilityStartTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x000258, "Member 'GC_WaterIllusion_Audio_C_ExecuteUbergraph_GC_WaterIllusion_Audio::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");

// Function GC_WaterIllusion_Audio.GC_WaterIllusion_Audio_C.GetInvLerpFromAbilityStartToSubmersion
// 0x0080 (0x0080 - 0x0000)
struct GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion final
{
public:
	double                                        InvLerp;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         current_frame;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpectreRaidSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetWaterIllusionActor_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_WaterIllusion_C*                    K2Node_DynamicCast_AsBP_Water_Illusion;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSubmersionFrame_SubmersionFrame; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetServerWorldTimeSeconds_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NormalizeToRange_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion) == 0x000008, "Wrong alignment on GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion");
static_assert(sizeof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion) == 0x000080, "Wrong size on GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, InvLerp) == 0x000000, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::InvLerp' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, current_frame) == 0x000008, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::current_frame' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000010, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetWaterIllusionActor_ReturnValue) == 0x000018, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetWaterIllusionActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, K2Node_DynamicCast_AsBP_Water_Illusion) == 0x000020, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::K2Node_DynamicCast_AsBP_Water_Illusion' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetPlayerSubmersionFrame_SubmersionFrame) == 0x000040, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetPlayerSubmersionFrame_SubmersionFrame' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion) == 0x000044, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetPlayerSubmersionFrame_FramesUntilSubmersion' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_GetServerWorldTimeSeconds_ReturnValue) == 0x000048, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_GetServerWorldTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000058, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_NormalizeToRange_ReturnValue) == 0x000070, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion, CallFunc_FClamp_ReturnValue) == 0x000078, "Member 'GC_WaterIllusion_Audio_C_GetInvLerpFromAbilityStartToSubmersion::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function GC_WaterIllusion_Audio.GC_WaterIllusion_Audio_C.OnApplication
// 0x0150 (0x0150 - 0x0000)
struct GC_WaterIllusion_Audio_C_OnApplication final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GC_WaterIllusion_Audio_C_OnApplication) == 0x000008, "Wrong alignment on GC_WaterIllusion_Audio_C_OnApplication");
static_assert(sizeof(GC_WaterIllusion_Audio_C_OnApplication) == 0x000150, "Wrong size on GC_WaterIllusion_Audio_C_OnApplication");
static_assert(offsetof(GC_WaterIllusion_Audio_C_OnApplication, Target) == 0x000000, "Member 'GC_WaterIllusion_Audio_C_OnApplication::Target' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_OnApplication, Parameters) == 0x000008, "Member 'GC_WaterIllusion_Audio_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GC_WaterIllusion_Audio_C_OnApplication, SpawnResults) == 0x0000F8, "Member 'GC_WaterIllusion_Audio_C_OnApplication::SpawnResults' has a wrong offset!");

// Function GC_WaterIllusion_Audio.GC_WaterIllusion_Audio_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_WaterIllusion_Audio_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_WaterIllusion_Audio_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_WaterIllusion_Audio_C_ReceiveTick");
static_assert(sizeof(GC_WaterIllusion_Audio_C_ReceiveTick) == 0x000004, "Wrong size on GC_WaterIllusion_Audio_C_ReceiveTick");
static_assert(offsetof(GC_WaterIllusion_Audio_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_WaterIllusion_Audio_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

