#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Weapon_KickUpDust_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_Weapon_KickUpDust_Base.GC_Weapon_KickUpDust_Base_C.OnBurst
// 0x03A8 (0x03A8 - 0x0000)
struct GC_Weapon_KickUpDust_Base_C_OnBurst final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FP2GameplayCueNotify_SpawnResult       SpawnResults;                                      // 0x00F8(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0158(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0180(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01A0(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x02A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Weapon_KickUpDust_Base_C_OnBurst) == 0x000008, "Wrong alignment on GC_Weapon_KickUpDust_Base_C_OnBurst");
static_assert(sizeof(GC_Weapon_KickUpDust_Base_C_OnBurst) == 0x0003A8, "Wrong size on GC_Weapon_KickUpDust_Base_C_OnBurst");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, Target) == 0x000000, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::Target' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, Parameters) == 0x000008, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, SpawnResults) == 0x0000F8, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::SpawnResults' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x000150, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x000154, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000158, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000170, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000178, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000180, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001A0, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_Location) == 0x0001C0, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_Normal) == 0x0001D8, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_Instigator) == 0x0001F0, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x0001F8, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000200, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000208, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000210, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000214, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000218, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x000220, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Array_Length_ReturnValue) == 0x000224, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000228, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, Temp_int_Array_Index_Variable) == 0x000240, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000248, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Array_Get_Item) == 0x000260, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x000268, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Normal_ReturnValue) == 0x000280, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, Temp_int_Loop_Counter_Variable) == 0x000298, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0002A0, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002B8, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Less_IntInt_ReturnValue) == 0x0003A0, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Weapon_KickUpDust_Base_C_OnBurst, CallFunc_Add_IntInt_ReturnValue) == 0x0003A4, "Member 'GC_Weapon_KickUpDust_Base_C_OnBurst::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

