#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_WorldMap_Toggle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function GC_WorldMap_Toggle.GC_WorldMap_Toggle_C.OnActive
// 0x0118 (0x0118 - 0x0000)
struct GC_WorldMap_Toggle_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_WorldMap_Toggle_C_OnActive) == 0x000008, "Wrong alignment on GC_WorldMap_Toggle_C_OnActive");
static_assert(sizeof(GC_WorldMap_Toggle_C_OnActive) == 0x000118, "Wrong size on GC_WorldMap_Toggle_C_OnActive");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, MyTarget) == 0x000000, "Member 'GC_WorldMap_Toggle_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, Parameters) == 0x000008, "Member 'GC_WorldMap_Toggle_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, ReturnValue) == 0x0000F8, "Member 'GC_WorldMap_Toggle_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_WorldMap_Toggle_C_OnActive::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x00010C, "Member 'GC_WorldMap_Toggle_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnActive, CallFunc_PostEvent_ReturnValue) == 0x000110, "Member 'GC_WorldMap_Toggle_C_OnActive::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function GC_WorldMap_Toggle.GC_WorldMap_Toggle_C.OnRemove
// 0x0118 (0x0118 - 0x0000)
struct GC_WorldMap_Toggle_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00F8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x00FC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnRemove_ReturnValue;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_WorldMap_Toggle_C_OnRemove) == 0x000008, "Wrong alignment on GC_WorldMap_Toggle_C_OnRemove");
static_assert(sizeof(GC_WorldMap_Toggle_C_OnRemove) == 0x000118, "Wrong size on GC_WorldMap_Toggle_C_OnRemove");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_WorldMap_Toggle_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, Parameters) == 0x000008, "Member 'GC_WorldMap_Toggle_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, ReturnValue) == 0x0000F8, "Member 'GC_WorldMap_Toggle_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, Temp_delegate_Variable) == 0x0000FC, "Member 'GC_WorldMap_Toggle_C_OnRemove::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, CallFunc_OnRemove_ReturnValue) == 0x00010C, "Member 'GC_WorldMap_Toggle_C_OnRemove::CallFunc_OnRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_WorldMap_Toggle_C_OnRemove, CallFunc_PostEvent_ReturnValue) == 0x000110, "Member 'GC_WorldMap_Toggle_C_OnRemove::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

