#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_WaterIllusion_Audio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_WaterIllusion_Audio.GC_WaterIllusion_Audio_C
// 0x0020 (0x12D0 - 0x12B0)
class AGC_WaterIllusion_Audio_C final : public AP2GameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x12B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         AbilityStartFrame;                                 // 0x12B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12BC[0x4];                                     // 0x12BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AbilityStartTime;                                  // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterIllusionFPS;                                  // 0x12C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_WaterIllusion_Audio(int32 EntryPoint)	 // 0xae1e64;
	void GetInvLerpFromAbilityStartToSubmersion(double* InvLerp)	 // 0xae1e64;
	void OnApplication(class AActor* Target, const struct FGameplayCueParameters& Parameters, const struct FP2GameplayCueNotify_SpawnResult& SpawnResults)	 // 0xae1e64;
	void ReceiveTick(float DeltaSeconds)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"GC_WaterIllusion_Audio_C">();
	}
	static class AGC_WaterIllusion_Audio_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AGC_WaterIllusion_Audio_C>();
	}
};
static_assert(alignof(AGC_WaterIllusion_Audio_C) == 0x000008, "Wrong alignment on AGC_WaterIllusion_Audio_C");
static_assert(sizeof(AGC_WaterIllusion_Audio_C) == 0x0012D0, "Wrong size on AGC_WaterIllusion_Audio_C");
static_assert(offsetof(AGC_WaterIllusion_Audio_C, UberGraphFrame) == 0x0012B0, "Member 'AGC_WaterIllusion_Audio_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_WaterIllusion_Audio_C, AbilityStartFrame) == 0x0012B8, "Member 'AGC_WaterIllusion_Audio_C::AbilityStartFrame' has a wrong offset!");
static_assert(offsetof(AGC_WaterIllusion_Audio_C, AbilityStartTime) == 0x0012C0, "Member 'AGC_WaterIllusion_Audio_C::AbilityStartTime' has a wrong offset!");
static_assert(offsetof(AGC_WaterIllusion_Audio_C, WaterIllusionFPS) == 0x0012C8, "Member 'AGC_WaterIllusion_Audio_C::WaterIllusionFPS' has a wrong offset!");

}

