#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingExtras

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshBasicEditFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptExtraLibrary_MeshBasicEditFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* AppendMeshesWithRemapMaterial(const TArray<class UDynamicMesh*>& Meshes, const TArray<struct FGeometryScriptExtraMeshMaterialSet>& MaterialSets, const TArray<struct FTransform>& AppendTransform, struct FGeometryScriptExtraMeshMaterialSet* OutCombinedMaterialSet, class UGeometryScriptDebug* Debug)	 // 0x4409354;
	static class UDynamicMesh* AppendMeshWithRemapMaterial(class UDynamicMesh* TargetMesh, class UDynamicMesh* AppendMesh, const struct FGeometryScriptExtraMeshMaterialSet& TargetMaterialSet, const struct FGeometryScriptExtraMeshMaterialSet& AppendMaterialSet, struct FGeometryScriptExtraMeshMaterialSet* OutCombinedMaterialSet, const struct FTransform& AppendTransform, class UGeometryScriptDebug* Debug)	 // 0x4408c5c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptExtraLibrary_MeshBasicEditFunctions">();
	}
	static class UGeometryScriptExtraLibrary_MeshBasicEditFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptExtraLibrary_MeshBasicEditFunctions>();
	}
};
static_assert(alignof(UGeometryScriptExtraLibrary_MeshBasicEditFunctions) == 0x000008, "Wrong alignment on UGeometryScriptExtraLibrary_MeshBasicEditFunctions");
static_assert(sizeof(UGeometryScriptExtraLibrary_MeshBasicEditFunctions) == 0x000028, "Wrong size on UGeometryScriptExtraLibrary_MeshBasicEditFunctions");

// Class GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshBooleanFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptExtraLibrary_MeshBooleanFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ApplyMeshTrim(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* ToolMesh, const struct FTransform& ToolTransform, const struct FGeometryScriptExtraMeshBooleanOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x4409a24;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptExtraLibrary_MeshBooleanFunctions">();
	}
	static class UGeometryScriptExtraLibrary_MeshBooleanFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptExtraLibrary_MeshBooleanFunctions>();
	}
};
static_assert(alignof(UGeometryScriptExtraLibrary_MeshBooleanFunctions) == 0x000008, "Wrong alignment on UGeometryScriptExtraLibrary_MeshBooleanFunctions");
static_assert(sizeof(UGeometryScriptExtraLibrary_MeshBooleanFunctions) == 0x000028, "Wrong size on UGeometryScriptExtraLibrary_MeshBooleanFunctions");

// Class GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshDeformFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptExtraLibrary_MeshDeformFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ApplyCylindricalDeform(class UDynamicMesh* TargetMesh, const struct FGeometryScriptExtraCylindricalDeformOptions& OPTIONS, const struct FTransform& CylinderFrame, float CylinderRadius, float CylinderHeight, class UGeometryScriptDebug* Debug)	 // 0x4409620;
	static class UDynamicMesh* ApplyPressDeform(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* ToolMesh, const struct FTransform& ToolTransform, const struct FGeometryScriptPressDeformOptions& OPTIONS, const class USkeleton* TargetSkeleton, class UGeometryScriptDebug* Debug)	 // 0x4409ec8;
	static class UDynamicMesh* ApplySqueezeDeform(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* ToolMesh, const struct FTransform& ToolTransform, const struct FGeometryScriptSqueezeDeformOptions& OPTIONS, bool GenerateDebugMesh, TArray<struct FGeometryScriptingExtrasDebugMeshInfo>* OutDebugMeshes, const class USkeleton* TargetSkeleton, class UGeometryScriptDebug* Debug)	 // 0x440a418;
	static class UDynamicMesh* ApplyWrapDeform(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* ToolMesh, const struct FTransform& ToolTransform, const struct FGeometryScriptWrapDeformOptions& OPTIONS, const class USkeleton* TargetSkeleton, class UGeometryScriptDebug* Debug)	 // 0x440ab3c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptExtraLibrary_MeshDeformFunctions">();
	}
	static class UGeometryScriptExtraLibrary_MeshDeformFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptExtraLibrary_MeshDeformFunctions>();
	}
};
static_assert(alignof(UGeometryScriptExtraLibrary_MeshDeformFunctions) == 0x000008, "Wrong alignment on UGeometryScriptExtraLibrary_MeshDeformFunctions");
static_assert(sizeof(UGeometryScriptExtraLibrary_MeshDeformFunctions) == 0x000028, "Wrong size on UGeometryScriptExtraLibrary_MeshDeformFunctions");

}

