#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingExtras

#include "Basic.hpp"

#include "GeometryScriptingExtras_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshBasicEditFunctions.AppendMeshesWithRemapMaterial
// 0x0050 (0x0050 - 0x0000)
struct GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial final
{
public:
	TArray<class UDynamicMesh*>                   Meshes;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FGeometryScriptExtraMeshMaterialSet> MaterialSets;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     AppendTransform;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraMeshMaterialSet    OutCombinedMaterialSet;                            // 0x0030(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial) == 0x000008, "Wrong alignment on GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial) == 0x000050, "Wrong size on GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, Meshes) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::Meshes' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, MaterialSets) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::MaterialSets' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, AppendTransform) == 0x000020, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::AppendTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, OutCombinedMaterialSet) == 0x000030, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::OutCombinedMaterialSet' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, Debug) == 0x000040, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial, ReturnValue) == 0x000048, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshesWithRemapMaterial::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshBasicEditFunctions.AppendMeshWithRemapMaterial
// 0x00B0 (0x00B0 - 0x0000)
struct GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           AppendMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraMeshMaterialSet    TargetMaterialSet;                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraMeshMaterialSet    AppendMaterialSet;                                 // 0x0020(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraMeshMaterialSet    OutCombinedMaterialSet;                            // 0x0030(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FTransform                             AppendTransform;                                   // 0x0040(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x00A0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial) == 0x0000B0, "Wrong size on GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, AppendMesh) == 0x000008, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::AppendMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, TargetMaterialSet) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::TargetMaterialSet' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, AppendMaterialSet) == 0x000020, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::AppendMaterialSet' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, OutCombinedMaterialSet) == 0x000030, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::OutCombinedMaterialSet' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, AppendTransform) == 0x000040, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::AppendTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, Debug) == 0x0000A0, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial, ReturnValue) == 0x0000A8, "Member 'GeometryScriptExtraLibrary_MeshBasicEditFunctions_AppendMeshWithRemapMaterial::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshBooleanFunctions.ApplyMeshTrim
// 0x0100 (0x0100 - 0x0000)
struct GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ToolMesh;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToolTransform;                                     // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraMeshBooleanOptions OPTIONS;                                           // 0x00E0(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x00F0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x00F8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim) == 0x000100, "Wrong size on GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, TargetTransform) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::TargetTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, ToolMesh) == 0x000070, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::ToolMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, ToolTransform) == 0x000080, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::ToolTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, OPTIONS) == 0x0000E0, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::OPTIONS' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, Debug) == 0x0000F0, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim, ReturnValue) == 0x0000F8, "Member 'GeometryScriptExtraLibrary_MeshBooleanFunctions_ApplyMeshTrim::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshDeformFunctions.ApplyCylindricalDeform
// 0x00A0 (0x00A0 - 0x0000)
struct GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptExtraCylindricalDeformOptions OPTIONS;                                     // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             CylinderFrame;                                     // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CylinderRadius;                                    // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CylinderHeight;                                    // 0x0084(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform) == 0x0000A0, "Wrong size on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, OPTIONS) == 0x000008, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::OPTIONS' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, CylinderFrame) == 0x000020, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::CylinderFrame' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, CylinderRadius) == 0x000080, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::CylinderRadius' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, CylinderHeight) == 0x000084, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::CylinderHeight' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, Debug) == 0x000088, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform, ReturnValue) == 0x000090, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyCylindricalDeform::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshDeformFunctions.ApplyPressDeform
// 0x01F0 (0x01F0 - 0x0000)
struct GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ToolMesh;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToolTransform;                                     // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptPressDeformOptions      OPTIONS;                                           // 0x00E0(0x00F0)(Parm, NativeAccessSpecifierPublic)
	const class USkeleton*                        TargetSkeleton;                                    // 0x01D0(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x01D8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x01E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform) == 0x0001F0, "Wrong size on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, TargetTransform) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::TargetTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, ToolMesh) == 0x000070, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::ToolMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, ToolTransform) == 0x000080, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::ToolTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, OPTIONS) == 0x0000E0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::OPTIONS' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, TargetSkeleton) == 0x0001D0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::TargetSkeleton' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, Debug) == 0x0001D8, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform, ReturnValue) == 0x0001E0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyPressDeform::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshDeformFunctions.ApplySqueezeDeform
// 0x0210 (0x0210 - 0x0000)
struct GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ToolMesh;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToolTransform;                                     // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSqueezeDeformOptions    OPTIONS;                                           // 0x00E0(0x0100)(Parm, NativeAccessSpecifierPublic)
	bool                                          GenerateDebugMesh;                                 // 0x01E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeometryScriptingExtrasDebugMeshInfo> OutDebugMeshes;                             // 0x01E8(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class USkeleton*                        TargetSkeleton;                                    // 0x01F8(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0200(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0208(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform) == 0x000210, "Wrong size on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, TargetTransform) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::TargetTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, ToolMesh) == 0x000070, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::ToolMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, ToolTransform) == 0x000080, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::ToolTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, OPTIONS) == 0x0000E0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::OPTIONS' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, GenerateDebugMesh) == 0x0001E0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::GenerateDebugMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, OutDebugMeshes) == 0x0001E8, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::OutDebugMeshes' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, TargetSkeleton) == 0x0001F8, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::TargetSkeleton' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, Debug) == 0x000200, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform, ReturnValue) == 0x000208, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplySqueezeDeform::ReturnValue' has a wrong offset!");

// Function GeometryScriptingExtras.GeometryScriptExtraLibrary_MeshDeformFunctions.ApplyWrapDeform
// 0x0220 (0x0220 - 0x0000)
struct GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ToolMesh;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ToolTransform;                                     // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptWrapDeformOptions       OPTIONS;                                           // 0x00E0(0x0120)(Parm, NativeAccessSpecifierPublic)
	const class USkeleton*                        TargetSkeleton;                                    // 0x0200(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0208(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0210(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform) == 0x000010, "Wrong alignment on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform");
static_assert(sizeof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform) == 0x000220, "Wrong size on GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, TargetMesh) == 0x000000, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, TargetTransform) == 0x000010, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::TargetTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, ToolMesh) == 0x000070, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::ToolMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, ToolTransform) == 0x000080, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::ToolTransform' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, OPTIONS) == 0x0000E0, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::OPTIONS' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, TargetSkeleton) == 0x000200, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::TargetSkeleton' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, Debug) == 0x000208, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform, ReturnValue) == 0x000210, "Member 'GeometryScriptExtraLibrary_MeshDeformFunctions_ApplyWrapDeform::ReturnValue' has a wrong offset!");

}

