#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingCore

#include "Basic.hpp"

#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GeometryScriptingCore.GeometryScriptDebug
// 0x0010 (0x0038 - 0x0028)
class UGeometryScriptDebug final : public UObject
{
public:
	TArray<struct FGeometryScriptDebugMessage>    Messages;                                          // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptDebug">();
	}
	static class UGeometryScriptDebug* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptDebug>();
	}
};
static_assert(alignof(UGeometryScriptDebug) == 0x000008, "Wrong alignment on UGeometryScriptDebug");
static_assert(sizeof(UGeometryScriptDebug) == 0x000038, "Wrong size on UGeometryScriptDebug");
static_assert(offsetof(UGeometryScriptDebug, Messages) == 0x000028, "Member 'UGeometryScriptDebug::Messages' has a wrong offset!");

// Class GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_CollisionFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void ResetDynamicMeshCollision(class UDynamicMeshComponent* Component, bool bEmitTransaction, class UGeometryScriptDebug* Debug)	 // 0x45c99fc;
	static class UDynamicMesh* SetDynamicMeshCollisionFromMesh(class UDynamicMesh* FromDynamicMesh, class UDynamicMeshComponent* ToDynamicMeshComponent, const struct FGeometryScriptCollisionFromMeshOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45ca984;
	static void SetStaticMeshCollisionFromComponent(class UStaticMesh* StaticMeshAsset, class UPrimitiveComponent* SourceComponent, const struct FGeometryScriptSetSimpleCollisionOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45ccf7c;
	static class UDynamicMesh* SetStaticMeshCollisionFromMesh(class UDynamicMesh* FromDynamicMesh, class UStaticMesh* ToStaticMeshAsset, const struct FGeometryScriptCollisionFromMeshOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45cd224;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_CollisionFunctions">();
	}
	static class UGeometryScriptLibrary_CollisionFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_CollisionFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_CollisionFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_CollisionFunctions");
static_assert(sizeof(UGeometryScriptLibrary_CollisionFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_CollisionFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_ContainmentFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ComputeMeshConvexDecomposition(class UDynamicMesh* TargetMesh, class UDynamicMesh*& CopyToMesh, class UDynamicMesh** CopyToMeshOut, const struct FGeometryScriptConvexDecompositionOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45bca94;
	static class UDynamicMesh* ComputeMeshConvexHull(class UDynamicMesh* TargetMesh, class UDynamicMesh*& CopyToMesh, class UDynamicMesh** CopyToMeshOut, const struct FGeometryScriptMeshSelection& Selection, const struct FGeometryScriptConvexHullOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45bcdf0;
	static class UDynamicMesh* ComputeMeshSweptHull(class UDynamicMesh* TargetMesh, class UDynamicMesh*& CopyToMesh, class UDynamicMesh** CopyToMeshOut, const struct FTransform& ProjectionFrame, const struct FGeometryScriptSweptHullOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45bd238;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_ContainmentFunctions">();
	}
	static class UGeometryScriptLibrary_ContainmentFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_ContainmentFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_ContainmentFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_ContainmentFunctions");
static_assert(sizeof(UGeometryScriptLibrary_ContainmentFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_ContainmentFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_ListUtilityFunctions final : public UBlueprintFunctionLibrary
{
public:
	static void ClearColorList(struct FGeometryScriptColorList& ColorList, const struct FLinearColor& ClearColor)	 // 0x45bb8c4;
	static void ClearIndexList(struct FGeometryScriptIndexList& IndexList, int32 ClearValue)	 // 0x45bbad4;
	static void ClearScalarList(struct FGeometryScriptScalarList& ScalarList, double ClearValue)	 // 0x45bbf2c;
	static void ClearUVList(struct FGeometryScriptUVList& UVList, const struct FVector2D& ClearUV)	 // 0x45bc0f8;
	static void ClearVectorList(struct FGeometryScriptVectorList& VectorList, const struct FVector& ClearValue)	 // 0x45bc308;
	static void ConvertArrayToColorList(const TArray<struct FLinearColor>& ColorArray, struct FGeometryScriptColorList* ColorList)	 // 0x45bde80;
	static void ConvertArrayToIndexList(const TArray<int32>& IndexArray, struct FGeometryScriptIndexList* IndexList, EGeometryScriptIndexType IndexType)	 // 0x45bdfdc;
	static void ConvertArrayToScalarList(const TArray<double>& VectorArray, struct FGeometryScriptScalarList* ScalarList)	 // 0x45be210;
	static void ConvertArrayToTriangleList(const TArray<struct FIntVector>& TriangleArray, struct FGeometryScriptTriangleList* TriangleList)	 // 0x45be4e8;
	static void ConvertArrayToUVList(const TArray<struct FVector2D>& UVArray, struct FGeometryScriptUVList* UVList)	 // 0x45be644;
	static void ConvertArrayToVectorList(const TArray<struct FVector>& VectorArray, struct FGeometryScriptVectorList* VectorList)	 // 0x45be7a0;
	static void ConvertColorListToArray(const struct FGeometryScriptColorList& ColorList, TArray<struct FLinearColor>* ColorArray)	 // 0x45be8f4;
	static void ConvertIndexListToArray(const struct FGeometryScriptIndexList& IndexList, TArray<int32>* IndexArray)	 // 0x45bead4;
	static void ConvertScalarListToArray(const struct FGeometryScriptScalarList& ScalarList, TArray<double>* ScalarArray)	 // 0x45becb8;
	static void ConvertTriangleListToArray(const struct FGeometryScriptTriangleList& TriangleList, TArray<struct FIntVector>* TriangleArray)	 // 0x45beee0;
	static void ConvertUVListToArray(const struct FGeometryScriptUVList& UVList, TArray<struct FVector2D>* UVArray)	 // 0x45bf0cc;
	static void ConvertVectorListToArray(const struct FGeometryScriptVectorList& VectorList, TArray<struct FVector>* VectorArray)	 // 0x45bf2bc;
	static void DuplicateColorList(const struct FGeometryScriptColorList& ColorList, struct FGeometryScriptColorList* DuplicateList)	 // 0x45c1ec8;
	static void DuplicateIndexList(const struct FGeometryScriptIndexList& IndexList, struct FGeometryScriptIndexList* DuplicateList)	 // 0x45c20dc;
	static void DuplicateScalarList(const struct FGeometryScriptScalarList& ScalarList, struct FGeometryScriptScalarList* DuplicateList)	 // 0x45c230c;
	static void DuplicateUVList(const struct FGeometryScriptUVList& UVList, struct FGeometryScriptUVList* DuplicateList)	 // 0x45c2520;
	static void DuplicateVectorList(const struct FGeometryScriptVectorList& VectorList, struct FGeometryScriptVectorList* DuplicateList)	 // 0x45c2734;
	static void ExtractColorListChannel(const struct FGeometryScriptColorList& ColorList, struct FGeometryScriptScalarList* ScalarList, int32 ChannelIndex)	 // 0x45c2b08;
	static void ExtractColorListChannels(const struct FGeometryScriptColorList& ColorList, struct FGeometryScriptVectorList* VectorList, int32 XChannelIndex, int32 YChannelIndex, int32 ZChannelIndex)	 // 0x45c2e0c;
	static struct FLinearColor GetColorListItem(const struct FGeometryScriptColorList& ColorList, int32 Index_0, bool* bIsValidIndex)	 // 0x45c36d0;
	static int32 GetColorListLastIndex(const struct FGeometryScriptColorList& ColorList)	 // 0x45c393c;
	static int32 GetColorListLength(const struct FGeometryScriptColorList& ColorList)	 // 0x45c3ac4;
	static int32 GetIndexListItem(const struct FGeometryScriptIndexList& IndexList, int32 Index_0, bool* bIsValidIndex)	 // 0x45c3bf0;
	static int32 GetIndexListLastIndex(const struct FGeometryScriptIndexList& IndexList)	 // 0x45c3ea0;
	static int32 GetIndexListLength(const struct FGeometryScriptIndexList& IndexList)	 // 0x45c402c;
	static double GetScalarListItem(const struct FGeometryScriptScalarList& ScalarList, int32 Index_0, bool* bIsValidIndex)	 // 0x45c5708;
	static int32 GetScalarListLastIndex(const struct FGeometryScriptScalarList& ScalarList)	 // 0x45c393c;
	static int32 GetScalarListLength(const struct FGeometryScriptScalarList& ScalarList)	 // 0x45c3ac4;
	static struct FIntVector GetTriangleListItem(const struct FGeometryScriptTriangleList& TriangleList, int32 Triangle, bool* bIsValidTriangle)	 // 0x45c6120;
	static int32 GetTriangleListLastTriangle(const struct FGeometryScriptTriangleList& TriangleList)	 // 0x45c63a0;
	static int32 GetTriangleListLength(const struct FGeometryScriptTriangleList& TriangleList)	 // 0x45c652c;
	static struct FVector2D GetUVListItem(const struct FGeometryScriptUVList& UVList, int32 Index_0, bool* bIsValidIndex)	 // 0x45c6bcc;
	static int32 GetUVListLastIndex(const struct FGeometryScriptUVList& UVList)	 // 0x45c393c;
	static int32 GetUVListLength(const struct FGeometryScriptUVList& UVList)	 // 0x45c3ac4;
	static struct FVector GetVectorListItem(const struct FGeometryScriptVectorList& VectorList, int32 Index_0, bool* bIsValidIndex)	 // 0x45c6e38;
	static int32 GetVectorListLastIndex(const struct FGeometryScriptVectorList& VectorList)	 // 0x45c70a0;
	static int32 GetVectorListLength(const struct FGeometryScriptVectorList& VectorList)	 // 0x45c7214;
	static void SetColorListItem(struct FGeometryScriptColorList& ColorList, int32 Index_0, const struct FLinearColor& NewColor, bool* bIsValidIndex)	 // 0x45ca644;
	static void SetIndexListItem(struct FGeometryScriptIndexList& IndexList, int32 Index_0, int32 NewValue, bool* bIsValidIndex)	 // 0x45cacd8;
	static void SetScalarListItem(struct FGeometryScriptScalarList& ScalarList, int32 Index_0, double NewValue, bool* bIsValidIndex)	 // 0x45ccc34;
	static void SetUVListItem(struct FGeometryScriptUVList& UVList, int32 Index_0, const struct FVector2D& NewUV, bool* bIsValidIndex)	 // 0x45ca644;
	static void SetVectorListItem(struct FGeometryScriptVectorList& VectorList, int32 Index_0, const struct FVector& NewValue, bool* bIsValidIndex)	 // 0x45cd830;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_ListUtilityFunctions">();
	}
	static class UGeometryScriptLibrary_ListUtilityFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_ListUtilityFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_ListUtilityFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_ListUtilityFunctions");
static_assert(sizeof(UGeometryScriptLibrary_ListUtilityFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_ListUtilityFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_StaticMeshFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_StaticMeshFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* CopyMeshFromSkeletalMesh(class USkeletalMesh* FromSkeletalMeshAsset, class UDynamicMesh* ToDynamicMesh, const struct FGeometryScriptCopyMeshFromAssetOptions& AssetOptions, const struct FGeometryScriptMeshReadLOD& RequestedLOD, EGeometryScriptOutcomePins* Outcome, class UGeometryScriptDebug* Debug)	 // 0x45bf490;
	static class UDynamicMesh* CopyMeshFromStaticMesh(class UStaticMesh* FromStaticMeshAsset, class UDynamicMesh* ToDynamicMesh, const struct FGeometryScriptCopyMeshFromAssetOptions& AssetOptions, const struct FGeometryScriptMeshReadLOD& RequestedLOD, EGeometryScriptOutcomePins* Outcome, class UGeometryScriptDebug* Debug)	 // 0x45bf880;
	static class UDynamicMesh* CopyMeshToSkeletalMesh(class UDynamicMesh* FromDynamicMesh, class USkeletalMesh* ToSkeletalMeshAsset, const struct FGeometryScriptCopyMeshToAssetOptions& OPTIONS, const struct FGeometryScriptMeshWriteLOD& TargetLod, EGeometryScriptOutcomePins* Outcome, class UGeometryScriptDebug* Debug)	 // 0x45c031c;
	static class UDynamicMesh* CopyMeshToStaticMesh(class UDynamicMesh* FromDynamicMesh, class UStaticMesh* ToStaticMeshAsset, const struct FGeometryScriptCopyMeshToAssetOptions& OPTIONS, const struct FGeometryScriptMeshWriteLOD& TargetLod, EGeometryScriptOutcomePins* Outcome, class UGeometryScriptDebug* Debug)	 // 0x45c077c;
	static void GetSectionMaterialListFromStaticMesh(class UStaticMesh* FromStaticMeshAsset, const struct FGeometryScriptMeshReadLOD& RequestedLOD, TArray<class UMaterialInterface*>* MaterialList, TArray<int32>* MaterialIndex, EGeometryScriptOutcomePins* Outcome, class UGeometryScriptDebug* Debug)	 // 0x45c59c4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_StaticMeshFunctions">();
	}
	static class UGeometryScriptLibrary_StaticMeshFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_StaticMeshFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_StaticMeshFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_StaticMeshFunctions");
static_assert(sizeof(UGeometryScriptLibrary_StaticMeshFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_StaticMeshFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshBakeFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshBakeFunctions final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UTexture2D*> BakeTexture(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, const struct FGeometryScriptBakeTargetMeshOptions& TargetOptions, class UDynamicMesh* SourceMesh, const struct FTransform& SourceTransform, const struct FGeometryScriptBakeSourceMeshOptions& SourceOptions, const TArray<struct FGeometryScriptBakeTypeOptions>& BakeTypes, const struct FGeometryScriptBakeTextureOptions& BakeOptions, class UGeometryScriptDebug* Debug)	 // 0x45ba5c4;
	static struct FGeometryScriptRenderCaptureTextures BakeTextureFromRenderCaptures(class UDynamicMesh* TargetMesh, const struct FTransform& TargetLocalToWorld, const struct FGeometryScriptBakeTargetMeshOptions& TargetOptions, const TArray<class AActor*>& SourceActors, const struct FGeometryScriptBakeRenderCaptureOptions& BakeOptions, class UGeometryScriptDebug* Debug)	 // 0x45bacec;
	static class UDynamicMesh* BakeVertex(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, const struct FGeometryScriptBakeTargetMeshOptions& TargetOptions, class UDynamicMesh* SourceMesh, const struct FTransform& SourceTransform, const struct FGeometryScriptBakeSourceMeshOptions& SourceOptions, const struct FGeometryScriptBakeOutputType& BakeTypes, const struct FGeometryScriptBakeVertexOptions& BakeOptions, class UGeometryScriptDebug* Debug)	 // 0x45bb20c;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeAmbientOcclusion(int32 OcclusionRays, float MaxDistance, float SpreadAngle, float BiasAngle)	 // 0x45c7f1c;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeBentNormal(int32 OcclusionRays, float MaxDistance, float SpreadAngle)	 // 0x45c816c;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeCurvature(EGeometryScriptBakeCurvatureTypeMode CurvatureType, EGeometryScriptBakeCurvatureColorMode ColorMapping, float ColorRangeMultiplier, float MinRangeMultiplier, EGeometryScriptBakeCurvatureClampMode Clamping)	 // 0x45c8338;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeFaceNormal()	 // 0x45c85fc;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeMaterialID()	 // 0x45c8690;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeMultiTexture(const TArray<class UTexture2D*>& MaterialIDSourceTextures, int32 SourceUVLayer)	 // 0x45c8724;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeObjectNormal()	 // 0x45c88d8;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypePosition()	 // 0x45c896c;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeTangentNormal()	 // 0x45c8a00;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeTexture(class UTexture2D* SourceTexture, int32 SourceUVLayer)	 // 0x45c8a94;
	static struct FGeometryScriptBakeTypeOptions MakeBakeTypeVertexColor()	 // 0x45c8be8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshBakeFunctions">();
	}
	static class UGeometryScriptLibrary_MeshBakeFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshBakeFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshBakeFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshBakeFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshBakeFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshBakeFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshBasicEditFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshBasicEditFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* AddTrianglesToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptTriangleList& NewTrianglesList, struct FGeometryScriptIndexList* NewIndicesList, int32 NewTriangleGroupID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45b38e0;
	static class UDynamicMesh* AddTriangleToMesh(class UDynamicMesh* TargetMesh, const struct FIntVector& NewTriangle, int32* NewTriangleIndex, int32 NewTriangleGroupID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45b34e4;
	static class UDynamicMesh* AddVertexToMesh(class UDynamicMesh* TargetMesh, const struct FVector& NewPosition, int32* NewVertexIndex, bool bDeferChangeNotifications)	 // 0x45b3f58;
	static class UDynamicMesh* AddVerticesToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptVectorList& NewPositionsList, struct FGeometryScriptIndexList* NewIndicesList, bool bDeferChangeNotifications)	 // 0x45b41a0;
	static class UDynamicMesh* AppendBuffersToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptSimpleMeshBuffers& Buffers, struct FGeometryScriptIndexList* NewTriangleIndicesList, int32 MaterialID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45b457c;
	static class UDynamicMesh* AppendMesh(class UDynamicMesh* TargetMesh, class UDynamicMesh* AppendMesh_0, const struct FTransform& AppendTransform, bool bDeferChangeNotifications, const struct FGeometryScriptAppendMeshOptions& AppendOptions, class UGeometryScriptDebug* Debug)	 // 0x45b4a90;
	static class UDynamicMesh* AppendMeshRepeated(class UDynamicMesh* TargetMesh, class UDynamicMesh* AppendMesh, const struct FTransform& AppendTransform, int32 RepeatCount, bool bApplyTransformToFirstInstance, bool bDeferChangeNotifications, const struct FGeometryScriptAppendMeshOptions& AppendOptions, class UGeometryScriptDebug* Debug)	 // 0x45b4e80;
	static class UDynamicMesh* AppendMeshTransformed(class UDynamicMesh* TargetMesh, class UDynamicMesh* AppendMesh, const TArray<struct FTransform>& AppendTransforms, const struct FTransform& ConstantTransform, bool bConstantTransformIsRelative, bool bDeferChangeNotifications, const struct FGeometryScriptAppendMeshOptions& AppendOptions, class UGeometryScriptDebug* Debug)	 // 0x45b536c;
	static class UDynamicMesh* DeleteSelectedTrianglesFromMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, int32* NumDeleted, bool bDeferChangeNotifications)	 // 0x45c0bac;
	static class UDynamicMesh* DeleteTriangleFromMesh(class UDynamicMesh* TargetMesh, int32 TriangleID, bool* bWasTriangleDeleted, bool bDeferChangeNotifications)	 // 0x45c0e1c;
	static class UDynamicMesh* DeleteTrianglesFromMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptIndexList& TriangleList, int32* NumDeleted, bool bDeferChangeNotifications)	 // 0x45c1328;
	static class UDynamicMesh* DeleteVertexFromMesh(class UDynamicMesh* TargetMesh, int32 VertexID, bool* bWasVertexDeleted, bool bDeferChangeNotifications)	 // 0x45c1654;
	static class UDynamicMesh* DeleteVerticesFromMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptIndexList& VertexList, int32* NumDeleted, bool bDeferChangeNotifications)	 // 0x45c188c;
	static class UDynamicMesh* DiscardMeshAttributes(class UDynamicMesh* TargetMesh, bool bDeferChangeNotifications)	 // 0x45c1bc0;
	static class UDynamicMesh* SetAllMeshVertexPositions(class UDynamicMesh* TargetMesh, const struct FGeometryScriptVectorList& PositionList, class UGeometryScriptDebug* Debug)	 // 0x45c9bf0;
	static class UDynamicMesh* SetVertexPosition(class UDynamicMesh* TargetMesh, int32 VertexID, const struct FVector& NewPosition, bool* bIsValidVertex, bool bDeferChangeNotifications)	 // 0x45ce0a0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshBasicEditFunctions">();
	}
	static class UGeometryScriptLibrary_MeshBasicEditFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshBasicEditFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshBasicEditFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshBasicEditFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshBasicEditFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshBasicEditFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshBoneWeightFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshBoneWeightFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ComputeSmoothBoneWeights(class UDynamicMesh* TargetMesh, class USkeleton* Skeleton, const struct FGeometryScriptSmoothBoneWeightsOptions& OPTIONS, const struct FGeometryScriptBoneWeightProfile& Profile, class UGeometryScriptDebug* Debug)	 // 0x45bd71c;
	static class UDynamicMesh* GetLargestVertexBoneWeight(class UDynamicMesh* TargetMesh, int32 VertexID, struct FGeometryScriptBoneWeight* BoneWeight, bool* bHasValidBoneWeights, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45c4164;
	static class UDynamicMesh* GetMaxBoneWeightIndex(class UDynamicMesh* TargetMesh, bool* bHasBoneWeights, int32* MaxBoneIndex, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45c49dc;
	static class UDynamicMesh* GetVertexBoneWeights(class UDynamicMesh* TargetMesh, int32 VertexID, TArray<struct FGeometryScriptBoneWeight>* BoneWeights, bool* bHasValidBoneWeights, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45c7338;
	static class UDynamicMesh* MeshCreateBoneWeights(class UDynamicMesh* TargetMesh, bool* bProfileExisted, bool bReplaceExistingProfile, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45c90a4;
	static class UDynamicMesh* MeshHasBoneWeights(class UDynamicMesh* TargetMesh, bool* bHasBoneWeights, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45c9300;
	static class UDynamicMesh* SetAllVertexBoneWeights(class UDynamicMesh* TargetMesh, const TArray<struct FGeometryScriptBoneWeight>& BoneWeights, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45ca444;
	static class UDynamicMesh* SetVertexBoneWeights(class UDynamicMesh* TargetMesh, int32 VertexID, const TArray<struct FGeometryScriptBoneWeight>& BoneWeights, bool* bIsValidVertexID, const struct FGeometryScriptBoneWeightProfile& Profile)	 // 0x45cdb74;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshBoneWeightFunctions">();
	}
	static class UGeometryScriptLibrary_MeshBoneWeightFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshBoneWeightFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshBoneWeightFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshBoneWeightFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshBoneWeightFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshBoneWeightFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshBooleanFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshBooleanFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ApplyMeshBoolean(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* ToolMesh, const struct FTransform& ToolTransform, EGeometryScriptBooleanOperation Operation, const struct FGeometryScriptMeshBooleanOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b7524;
	static class UDynamicMesh* ApplyMeshMirror(class UDynamicMesh* TargetMesh, const struct FTransform& MirrorFrame, const struct FGeometryScriptMeshMirrorOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b89d4;
	static class UDynamicMesh* ApplyMeshPlaneCut(class UDynamicMesh* TargetMesh, const struct FTransform& CutFrame, const struct FGeometryScriptMeshPlaneCutOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b9150;
	static class UDynamicMesh* ApplyMeshPlaneSlice(class UDynamicMesh* TargetMesh, const struct FTransform& CutFrame, const struct FGeometryScriptMeshPlaneSliceOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b943c;
	static class UDynamicMesh* ApplyMeshSelfUnion(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelfUnionOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b99a8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshBooleanFunctions">();
	}
	static class UGeometryScriptLibrary_MeshBooleanFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshBooleanFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshBooleanFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshBooleanFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshBooleanFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshBooleanFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshComparisonFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshComparisonFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* IsIntersectingMesh(class UDynamicMesh* TargetMesh, const struct FTransform& TargetTransform, class UDynamicMesh* OtherMesh, const struct FTransform& OtherTransform, bool* bIsIntersecting, class UGeometryScriptDebug* Debug)	 // 0x45c7830;
	static class UDynamicMesh* IsSameMeshAs(class UDynamicMesh* TargetMesh, class UDynamicMesh* OtherMesh, const struct FGeometryScriptIsSameMeshOptions& OPTIONS, bool* bIsSameMesh, class UGeometryScriptDebug* Debug)	 // 0x45c7c7c;
	static class UDynamicMesh* MeasureDistancesBetweenMeshes(class UDynamicMesh* TargetMesh, class UDynamicMesh* OtherMesh, const struct FGeometryScriptMeasureMeshDistanceOptions& OPTIONS, double* MaxDistance, double* MinDistance, double* AverageDistance, double* RootMeanSqrDeviation, class UGeometryScriptDebug* Debug)	 // 0x45c8c7c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshComparisonFunctions">();
	}
	static class UGeometryScriptLibrary_MeshComparisonFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshComparisonFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshComparisonFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshComparisonFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshComparisonFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshComparisonFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshDecompositionFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshDecompositionFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* CopyMeshSelectionToMesh(class UDynamicMesh* TargetMesh, class UDynamicMesh*& StoreToSubmesh, const struct FGeometryScriptMeshSelection& Selection, class UDynamicMesh** StoreToSubmeshOut, bool bAppendToExisting, bool bPreserveGroupIDs, class UGeometryScriptDebug* Debug)	 // 0x45bfbd8;
	static class UDynamicMesh* CopyMeshToMesh(class UDynamicMesh* CopyFromMesh, class UDynamicMesh*& CopyToMesh, class UDynamicMesh** CopyToMeshOut, class UGeometryScriptDebug* Debug)	 // 0x45c00f0;
	static class UDynamicMesh* GetSubMeshFromMesh(class UDynamicMesh* TargetMesh, class UDynamicMesh*& StoreToSubmesh, const struct FGeometryScriptIndexList& TriangleList, class UDynamicMesh** StoreToSubmeshOut, class UGeometryScriptDebug* Debug)	 // 0x45c5d84;
	static class UDynamicMesh* SplitMeshByComponents(class UDynamicMesh* TargetMesh, TArray<class UDynamicMesh*>* ComponentMeshes, class UDynamicMeshPool* MeshPool, class UGeometryScriptDebug* Debug)	 // 0x45ce36c;
	static class UDynamicMesh* SplitMeshByMaterialIDs(class UDynamicMesh* TargetMesh, TArray<class UDynamicMesh*>* ComponentMeshes, TArray<int32>* ComponentMaterialIDs, class UDynamicMeshPool* MeshPool, class UGeometryScriptDebug* Debug)	 // 0x45ce848;
	static class UDynamicMesh* SplitMeshByPolygroups(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, TArray<class UDynamicMesh*>* ComponentMeshes, TArray<int32>* ComponentPolygroups, class UDynamicMeshPool* MeshPool, class UGeometryScriptDebug* Debug)	 // 0x45cedd0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshDecompositionFunctions">();
	}
	static class UGeometryScriptLibrary_MeshDecompositionFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshDecompositionFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshDecompositionFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshDecompositionFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshDecompositionFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshDecompositionFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshDeformFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshDeformFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ApplyBendWarpToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptBendWarpOptions& OPTIONS, const struct FTransform& BendOrientation, float BendAngle, float BendExtent, class UGeometryScriptDebug* Debug)	 // 0x45b5c64;
	static class UDynamicMesh* ApplyDisplaceFromPerVertexVectors(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, const struct FGeometryScriptVectorList& VectorList, float Magnitude, class UGeometryScriptDebug* Debug)	 // 0x45b6064;
	static class UDynamicMesh* ApplyDisplaceFromTextureMap(class UDynamicMesh* TargetMesh, class UTexture2D* Texture, const struct FGeometryScriptMeshSelection& Selection, const struct FGeometryScriptDisplaceFromTextureOptions& OPTIONS, int32 UVLayer, class UGeometryScriptDebug* Debug)	 // 0x45b641c;
	static class UDynamicMesh* ApplyFlareWarpToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptFlareWarpOptions& OPTIONS, const struct FTransform& FlareOrientation, float FlarePercentX, float FlarePercentY, float FlareExtent, class UGeometryScriptDebug* Debug)	 // 0x45b67a8;
	static class UDynamicMesh* ApplyIterativeSmoothingToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, const struct FGeometryScriptIterativeMeshSmoothingOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b6c28;
	static class UDynamicMesh* ApplyMathWarpToMesh(class UDynamicMesh* TargetMesh, const struct FTransform& WarpOrientation, EGeometryScriptMathWarpType WarpType, const struct FGeometryScriptMathWarpOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b6ea8;
	static class UDynamicMesh* ApplyPerlinNoiseToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, const struct FGeometryScriptPerlinNoiseOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b9d78;
	static class UDynamicMesh* ApplyTwistWarpToMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptTwistWarpOptions& OPTIONS, const struct FTransform& TwistOrientation, float TwistAngle, float TwistExtent, class UGeometryScriptDebug* Debug)	 // 0x45ba028;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshDeformFunctions">();
	}
	static class UGeometryScriptLibrary_MeshDeformFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshDeformFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshDeformFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshDeformFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshDeformFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshDeformFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshMaterialFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshMaterialFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ClearMaterialIDs(class UDynamicMesh* TargetMesh, int32 ClearValue, class UGeometryScriptDebug* Debug)	 // 0x45bbccc;
	static class UDynamicMesh* CompactMaterialIDs(class UDynamicMesh* TargetMesh, const TArray<class UMaterialInterface*>& SourceMaterialList, TArray<class UMaterialInterface*>* CompactedMaterialList, class UGeometryScriptDebug* Debug)	 // 0x45bc518;
	static class UDynamicMesh* DeleteTrianglesByMaterialID(class UDynamicMesh* TargetMesh, int32 MaterialID, int32* NumDeleted, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45c1054;
	static class UDynamicMesh* EnableMaterialIDs(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45c2934;
	static class UDynamicMesh* GetAllTriangleMaterialIDs(class UDynamicMesh* TargetMesh, struct FGeometryScriptIndexList* MaterialIDList, bool* bHasMaterialIDs)	 // 0x45c34ac;
	static class UDynamicMesh* GetMaterialIDsOfTriangles(class UDynamicMesh* TargetMesh, const struct FGeometryScriptIndexList& TriangleIDList, struct FGeometryScriptIndexList* MaterialIDList, class UGeometryScriptDebug* Debug)	 // 0x45c4480;
	static int32 GetMaxMaterialID(class UDynamicMesh* TargetMesh, bool* bHasMaterialIDs)	 // 0x45c4c10;
	static int32 GetTriangleMaterialID(class UDynamicMesh* TargetMesh, int32 TriangleID, bool* bIsValidTriangle)	 // 0x45c66b0;
	static class UDynamicMesh* GetTrianglesByMaterialID(class UDynamicMesh* TargetMesh, int32 MaterialID, struct FGeometryScriptIndexList* TriangleIDList, class UGeometryScriptDebug* Debug)	 // 0x45c6858;
	static class UDynamicMesh* RemapMaterialIDs(class UDynamicMesh* TargetMesh, int32 FromMaterialID, int32 ToMaterialID, class UGeometryScriptDebug* Debug)	 // 0x45c9718;
	static class UDynamicMesh* SetAllTriangleMaterialIDs(class UDynamicMesh* TargetMesh, const struct FGeometryScriptIndexList& TriangleMaterialIDList, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45c9fa4;
	static class UDynamicMesh* SetMaterialIDForMeshSelection(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, int32 MaterialID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45cb020;
	static class UDynamicMesh* SetMaterialIDOnTriangles(class UDynamicMesh* TargetMesh, const struct FGeometryScriptIndexList& TriangleIDList, int32 MaterialID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45cb374;
	static class UDynamicMesh* SetPolygroupMaterialID(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 PolygroupID, int32 MaterialID, bool* bIsValidPolygroupID, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45cc854;
	static class UDynamicMesh* SetTriangleMaterialID(class UDynamicMesh* TargetMesh, int32 TriangleID, int32 MaterialID, bool* bIsValidTriangle, bool bDeferChangeNotifications)	 // 0x45cd570;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshMaterialFunctions">();
	}
	static class UGeometryScriptLibrary_MeshMaterialFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshMaterialFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshMaterialFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshMaterialFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshMaterialFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshMaterialFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshModelingFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshModelingFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ApplyMeshBevelSelection(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, EGeometryScriptMeshBevelSelectionMode BevelMode, const struct FGeometryScriptMeshBevelSelectionOptions& BevelOptions, class UGeometryScriptDebug* Debug)	 // 0x45b7228;
	static class UDynamicMesh* ApplyMeshDisconnectFaces(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, bool bAllowBowtiesInOutput, class UGeometryScriptDebug* Debug)	 // 0x45b7a34;
	static class UDynamicMesh* ApplyMeshDuplicateFaces(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshSelection& Selection, struct FGeometryScriptMeshSelection* NewTriangles, const struct FGeometryScriptMeshEditPolygroupOptions& GroupOptions, class UGeometryScriptDebug* Debug)	 // 0x45b7d20;
	static class UDynamicMesh* ApplyMeshExtrude_Compatibility_5p0(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshExtrudeOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b8248;
	static class UDynamicMesh* ApplyMeshInsetOutsetFaces(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshInsetOutsetFacesOptions& OPTIONS, const struct FGeometryScriptMeshSelection& Selection, class UGeometryScriptDebug* Debug)	 // 0x45b8448;
	static class UDynamicMesh* ApplyMeshLinearExtrudeFaces(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshLinearExtrudeOptions& OPTIONS, const struct FGeometryScriptMeshSelection& Selection, class UGeometryScriptDebug* Debug)	 // 0x45b8738;
	static class UDynamicMesh* ApplyMeshOffset(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshOffsetOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b8cc8;
	static class UDynamicMesh* ApplyMeshOffsetFaces(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshOffsetFacesOptions& OPTIONS, const struct FGeometryScriptMeshSelection& Selection, class UGeometryScriptDebug* Debug)	 // 0x45b8eb8;
	static class UDynamicMesh* ApplyMeshPolygroupBevel(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshBevelOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b9740;
	static class UDynamicMesh* ApplyMeshShell(class UDynamicMesh* TargetMesh, const struct FGeometryScriptMeshOffsetOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45b9b88;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshModelingFunctions">();
	}
	static class UGeometryScriptLibrary_MeshModelingFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshModelingFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshModelingFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshModelingFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshModelingFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshModelingFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshNormalsFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshNormalsFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* AutoRepairNormals(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45ba428;
	static class UDynamicMesh* ComputeSplitNormals(class UDynamicMesh* TargetMesh, const struct FGeometryScriptSplitNormalsOptions& SplitOptions, const struct FGeometryScriptCalculateNormalsOptions& CalculateOptions, class UGeometryScriptDebug* Debug)	 // 0x45bd9ec;
	static class UDynamicMesh* ComputeTangents(class UDynamicMesh* TargetMesh, const struct FGeometryScriptTangentsOptions& OPTIONS, class UGeometryScriptDebug* Debug)	 // 0x45bdc44;
	static class UDynamicMesh* DiscardTangents(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45c1d2c;
	static class UDynamicMesh* FlipNormals(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45c3310;
	static class UDynamicMesh* GetMeshHasTangents(class UDynamicMesh* TargetMesh, bool* bHasTangents, class UGeometryScriptDebug* Debug)	 // 0x45c4d34;
	static class UDynamicMesh* GetMeshPerVertexNormals(class UDynamicMesh* TargetMesh, struct FGeometryScriptVectorList* NormalList, bool* bIsValidNormalSet, bool* bHasVertexIDGaps, bool bAverageSplitVertexValues)	 // 0x45c4f0c;
	static class UDynamicMesh* GetMeshPerVertexTangents(class UDynamicMesh* TargetMesh, struct FGeometryScriptVectorList* TangentXList, struct FGeometryScriptVectorList* TangentYList, bool* bIsValidTangentSet, bool* bHasVertexIDGaps, bool bAverageSplitVertexValues)	 // 0x45c52c0;
	static class UDynamicMesh* RecomputeNormals(class UDynamicMesh* TargetMesh, const struct FGeometryScriptCalculateNormalsOptions& CalculateOptions, class UGeometryScriptDebug* Debug)	 // 0x45c94ec;
	static class UDynamicMesh* SetMeshPerVertexNormals(class UDynamicMesh* TargetMesh, const struct FGeometryScriptVectorList& VertexNormalList, class UGeometryScriptDebug* Debug)	 // 0x45cb8bc;
	static class UDynamicMesh* SetMeshPerVertexTangents(class UDynamicMesh* TargetMesh, const struct FGeometryScriptVectorList& TangentXList, const struct FGeometryScriptVectorList& TangentYList, class UGeometryScriptDebug* Debug)	 // 0x45cbc70;
	static class UDynamicMesh* SetMeshTriangleNormals(class UDynamicMesh* TargetMesh, int32 TriangleID, const struct FGeometryScriptTriangle& Normals, bool* bIsValidTriangle, bool bDeferChangeNotifications)	 // 0x45cc1fc;
	static class UDynamicMesh* SetPerFaceNormals(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45cc51c;
	static class UDynamicMesh* SetPerVertexNormals(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45cc6b8;
	static class UDynamicMesh* UpdateVertexNormal(class UDynamicMesh* TargetMesh, int32 VertexID, bool bUpdateNormal, const struct FVector& NewNormal, bool bUpdateTangents, const struct FVector& NewTangentX, const struct FVector& NewTangentY, bool* bIsValidVertex, bool bMergeSplitValues, bool bDeferChangeNotifications)	 // 0x45cf3fc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshNormalsFunctions">();
	}
	static class UGeometryScriptLibrary_MeshNormalsFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshNormalsFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshNormalsFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshNormalsFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshNormalsFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshNormalsFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshPolygroupFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshPolygroupFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ClearPolygroups(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 ClearValue, class UGeometryScriptDebug* Debug)	 // 0x45eeda0;
	static class UDynamicMesh* ComputePolygroupsFromAngleThreshold(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, float CreaseAngle, int32 MinGroupSize, class UGeometryScriptDebug* Debug)	 // 0x45efea8;
	static class UDynamicMesh* ComputePolygroupsFromPolygonDetection(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, bool bRespectUVSeams, bool bRespectHardNormals, double QuadAdjacencyWeight, double QuadMetricClamp, int32 MaxSearchRounds, class UGeometryScriptDebug* Debug)	 // 0x45f015c;
	static class UDynamicMesh* ConvertComponentsToPolygroups(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, class UGeometryScriptDebug* Debug)	 // 0x45f1d38;
	static class UDynamicMesh* ConvertUVIslandsToPolygroups(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 UVLayer, class UGeometryScriptDebug* Debug)	 // 0x45f4520;
	static class UDynamicMesh* CopyPolygroupsLayer(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& FromGroupLayer, const struct FGeometryScriptGroupLayer& ToGroupLayer, class UGeometryScriptDebug* Debug)	 // 0x45f5b50;
	static class UDynamicMesh* DeleteTrianglesInPolygroup(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 PolygroupID, int32* NumDeleted, bool bDeferChangeNotifications, class UGeometryScriptDebug* Debug)	 // 0x45f6f70;
	static class UDynamicMesh* EnablePolygroups(class UDynamicMesh* TargetMesh, class UGeometryScriptDebug* Debug)	 // 0x45f72d0;
	static class UDynamicMesh* GetAllTrianglePolygroupIDs(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, struct FGeometryScriptIndexList& PolygroupIDsOut)	 // 0x45f9624;
	static class UDynamicMesh* GetPolygroupIDsInMesh(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, struct FGeometryScriptIndexList& PolygroupIDsOut)	 // 0x45ff178;
	static int32 GetTrianglePolygroupID(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 TriangleID, bool* bIsValidTriangle)	 // 0x4601f0c;
	static class UDynamicMesh* GetTrianglesInPolygroup(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, int32 PolygroupID, struct FGeometryScriptIndexList& TriangleIDsOut)	 // 0x4602a64;
	static class UDynamicMesh* SetNumExtendedPolygroupLayers(class UDynamicMesh* TargetMesh, int32 NumLayers, class UGeometryScriptDebug* Debug)	 // 0x460d63c;
	static class UDynamicMesh* SetPolygroupForMeshSelection(class UDynamicMesh* TargetMesh, const struct FGeometryScriptGroupLayer& GroupLayer, const struct FGeometryScriptMeshSelection& Selection, int32* SetPolygroupIDOut, int32 SetPolygroupID, bool bGenerateNewPolygroup, bool bDeferChangeNotifications)	 // 0x460dac8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshPolygroupFunctions">();
	}
	static class UGeometryScriptLibrary_MeshPolygroupFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshPolygroupFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshPolygroupFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshPolygroupFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshPolygroupFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshPolygroupFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshPrimitiveFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshPrimitiveFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* AppendBox(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float DimensionX, float DimensionY, float DimensionZ, int32 StepsX, int32 StepsY, int32 StepsZ, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e370c;
	static class UDynamicMesh* AppendCapsule(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float Radius, float LineLength, int32 HemisphereSteps, int32 CircleSteps, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e3d64;
	static class UDynamicMesh* AppendCone(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float BaseRadius, float TopRadius, float Height, int32 RadialSteps, int32 HeightSteps, bool bCapped, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e42d0;
	static class UDynamicMesh* AppendCurvedStairs(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float StepWidth, float StepHeight, float InnerRadius, float CurveAngle, int32 NumSteps, bool bFloating, class UGeometryScriptDebug* Debug)	 // 0x45e4938;
	static class UDynamicMesh* AppendCylinder(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float Radius, float Height, int32 RadialSteps, int32 HeightSteps, bool bCapped, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e5100;
	static class UDynamicMesh* AppendDisc(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float Radius, int32 AngleSteps, int32 SpokeSteps, float StartAngle, float EndAngle, float HoleRadius, class UGeometryScriptDebug* Debug)	 // 0x45e56f8;
	static class UDynamicMesh* AppendLinearStairs(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float StepWidth, float StepHeight, float StepDepth, int32 NumSteps, bool bFloating, class UGeometryScriptDebug* Debug)	 // 0x45e5ce4;
	static class UDynamicMesh* AppendRectangle_Compatibility_5_0(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float DimensionX, float DimensionY, int32 StepsWidth, int32 StepsHeight, class UGeometryScriptDebug* Debug)	 // 0x45e6908;
	static class UDynamicMesh* AppendRectangleXY(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float DimensionX, float DimensionY, int32 StepsWidth, int32 StepsHeight, class UGeometryScriptDebug* Debug)	 // 0x45e6414;
	static class UDynamicMesh* AppendRevolvePath(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PathVertices, const struct FGeometryScriptRevolveOptions& RevolveOptions, int32 Steps, bool bCapped, class UGeometryScriptDebug* Debug)	 // 0x45e6dfc;
	static class UDynamicMesh* AppendRevolvePolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, const struct FGeometryScriptRevolveOptions& RevolveOptions, float Radius, int32 Steps, class UGeometryScriptDebug* Debug)	 // 0x45e7480;
	static class UDynamicMesh* AppendRoundRectangle_Compatibility_5_0(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float DimensionX, float DimensionY, float CornerRadius, int32 StepsWidth, int32 StepsHeight, int32 StepsRound, class UGeometryScriptDebug* Debug)	 // 0x45e80e0;
	static class UDynamicMesh* AppendRoundRectangleXY(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float DimensionX, float DimensionY, float CornerRadius, int32 StepsWidth, int32 StepsHeight, int32 StepsRound, class UGeometryScriptDebug* Debug)	 // 0x45e7af8;
	static class UDynamicMesh* AppendSimpleExtrudePolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, float Height, int32 HeightSteps, bool bCapped, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e86c8;
	static class UDynamicMesh* AppendSimpleSweptPolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, const TArray<struct FVector>& SweepPath, bool bLoop, bool bCapped, float StartScale, float EndScale, class UGeometryScriptDebug* Debug)	 // 0x45e8df0;
	static class UDynamicMesh* AppendSphereBox(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float Radius, int32 StepsX, int32 StepsY, int32 StepsZ, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e95a8;
	static class UDynamicMesh* AppendSphereLatLong(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, float Radius, int32 StepsPhi, int32 StepsTheta, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45e9b10;
	static class UDynamicMesh* AppendSpiralRevolvePolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, const struct FGeometryScriptRevolveOptions& RevolveOptions, float Radius, int32 Steps, float RisePerRevolution, class UGeometryScriptDebug* Debug)	 // 0x45ea000;
	static class UDynamicMesh* AppendSweepPolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, const TArray<struct FTransform>& SweepPath, bool bLoop, bool bCapped, float StartScale, float EndScale, float RotationAngleDeg, class UGeometryScriptDebug* Debug)	 // 0x45ea758;
	static class UDynamicMesh* AppendSweepPolyline(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolylineVertices, const TArray<struct FTransform>& SweepPath, const TArray<float>& PolylineTexParamU, const TArray<float>& SweepPathTexParamV, bool bLoop, float StartScale, float EndScale, float RotationAngleDeg, class UGeometryScriptDebug* Debug)	 // 0x45eb000;
	static class UDynamicMesh* AppendTorus(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const struct FGeometryScriptRevolveOptions& RevolveOptions, float MajorRadius, float MinorRadius, int32 MajorSteps, int32 MinorSteps, EGeometryScriptPrimitiveOriginMode Origin, class UGeometryScriptDebug* Debug)	 // 0x45eb88c;
	static class UDynamicMesh* AppendTriangulatedPolygon(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& PolygonVertices, bool bAllowSelfIntersections, class UGeometryScriptDebug* Debug)	 // 0x45ebeac;
	static class UDynamicMesh* AppendVoronoiDiagram2D(class UDynamicMesh* TargetMesh, const struct FGeometryScriptPrimitiveOptions& PrimitiveOptions, const struct FTransform& Transform, const TArray<struct FVector2D>& VoronoiSites, const struct FGeometryScriptVoronoiOptions& VoronoiOptions, class UGeometryScriptDebug* Debug)	 // 0x45ec35c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GeometryScriptLibrary_MeshPrimitiveFunctions">();
	}
	static class UGeometryScriptLibrary_MeshPrimitiveFunctions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGeometryScriptLibrary_MeshPrimitiveFunctions>();
	}
};
static_assert(alignof(UGeometryScriptLibrary_MeshPrimitiveFunctions) == 0x000008, "Wrong alignment on UGeometryScriptLibrary_MeshPrimitiveFunctions");
static_assert(sizeof(UGeometryScriptLibrary_MeshPrimitiveFunctions) == 0x000028, "Wrong size on UGeometryScriptLibrary_MeshPrimitiveFunctions");

// Class GeometryScriptingCore.GeometryScriptLibrary_MeshQueryFunctions
// 0x0000 (0x0028 - 0x0028)
class UGeometryScriptLibrary_MeshQueryFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UDynamicMesh* ComputeTriangleBarycentricCoords(class UDynamicMesh* TargetMesh, int32 TriangleID, bool* bIsValidTriangle, const struct FVector& Point, struct FVector* Vertex1, struct FVector* Vertex2, struct FVector* Vertex3, struct FVector* BarycentricCoords)	 // 0x45f05b8;
	static class UDynamicMesh* GetAllTriangleIDs(class UDynamicMesh* TargetMesh, struct FGeometryScriptIndexList* TriangleIDList, bool* bHasTriangleIDGaps)	 // 0x45f9110;
	static class UDynamicMesh* GetAllTriangleIndices(class UDynamicMesh* TargetMesh, struct FGeometryScriptTriangleList* TriangleList, bool bSkipGaps, bool* bHasTriangleIDGaps)	 // 0x45f9324;
	static class UDynamicMesh* GetAllVertexIDs(class UDynamicMesh* TargetMesh, struct FGeometryScriptIndexList* VertexIDList, bool* bHasVertexIDGaps)	 // 0x45f9858;
	static class UDynamicMesh* GetAllVertexPositions(class UDynamicMesh* TargetMesh, struct FGeometryScriptVectorList* PositionList, bool bSkipGaps, bool* bHasVertexIDGaps)	 // 0x45f9a6c;
	static bool GetHasMaterialIDs(class UDynamicMesh* TargetMesh)	 // 0x45fa904;
	static bool GetHasPolygroups(class UDynamicMesh* TargetMesh)	 // 0x45fa9fc;
	static bool GetHasTriangleIDGaps(class UDynamicMesh* TargetMesh)	 // 0x45faaf4;
	static bool GetHasTriangleNormals(class UDynamicMesh* TargetMesh)	 // 0x45fabec;
	static bool GetHasVertexColors(class UDynamicMesh* TargetMesh)	 // 0x45face4;
	static bool GetHasVertexIDGaps(class UDynamicMesh* TargetMesh)	 // 0x45faddc;
	static class UDynamicMesh* GetInterpolatedTriangleNormal(class UDynamicMesh* TargetMesh, int32 TriangleID, const struct FVector& BarycentricCoords, bool* bTriHasValidNormals, struct FVector* InterpolatedNormal)	 // 0x45faed4;
	static class UDynamicMesh* GetInterpolatedTriangleNormalTangents(class UDynamicMesh* TargetMesh, int32 TriangleID, const struct FVector& BarycentricCoords, bool* bTriHasValidElements, struct FVector* InterpolatedNormal, struct FVector* InterpolatedTangent, struct FVector* InterpolatedBiTangent)	 // 0x45fb130;
	static class UDynamicMesh* GetInterpolatedTrianglePosition(class UDynamicMesh* TargetMesh, int32 TriangleID, const struct FVector& BarycentricCoords, bool* bIsValidTriangle, struct FVector* InterpolatedPosition)	 // 0x45fb474;
	static class UDynamicMesh* GetInterpolatedTriangleUV(class UDynamicMesh* TargetMesh, int32 UvSetIndex, int32 TriangleID, const struct FVector& BarycentricCoords, bool* bTriHasValidUVs, struct FVector2D* InterpolatedUV)	 // 0x45fb730;
	static class UDynamicMesh* GetInterpolatedTriangleVertexColor(class UDynamicMesh* TargetMesh, int32 TriangleID, const struct FVector& BarycentricCoords, const struct FLinearColor& DefaultColor, bool* bTriHasValidVertexColors, struct FLinearColor* InterpolatedColor)	 // 0x45fba6c;
