#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingExtras

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GeometryScriptingExtras.EGeometryScriptWrapDeformOperation
// NumValues: 0x0004
enum class EGeometryScriptWrapDeformOperation : uint8
{
	WrapInside                               = 0,
	WrapOutside                              = 1,
	WrapBoth                                 = 2,
	EGeometryScriptWrapDeformOperation_MAX   = 3,
};

// Enum GeometryScriptingExtras.EGeometryScriptExtraBooleanOperation
// NumValues: 0x0005
enum class EGeometryScriptExtraBooleanOperation : uint8
{
	Union                                    = 0,
	Intersection                             = 1,
	Subtract                                 = 2,
	Trim                                     = 3,
	EGeometryScriptExtraBooleanOperation_MAX = 4,
};

// Enum GeometryScriptingExtras.EGeometryScriptExtraRemoveHiddenTrianglesMethod
// NumValues: 0x0003
enum class EGeometryScriptExtraRemoveHiddenTrianglesMethod : uint8
{
	FastWindingNumber                        = 0,
	RaycastOcclusionTest                     = 1,
	EGeometryScriptExtraRemoveHiddenTrianglesMethod_MAX = 2,
};

// Enum GeometryScriptingExtras.ESkinMeshVertexFlag
// NumValues: 0x0003
enum class ESkinMeshVertexFlag : uint8
{
	None                                     = 0,
	NoWrap                                   = 1,
	ESkinMeshVertexFlag_MAX                  = 2,
};

// Enum GeometryScriptingExtras.EGeometryScriptDebugMeshFlags
// NumValues: 0x0003
enum class EGeometryScriptDebugMeshFlags : uint8
{
	None                                     = 0,
	ShowWireframe                            = 1,
	EGeometryScriptDebugMeshFlags_MAX        = 2,
};

// ScriptStruct GeometryScriptingExtras.GeometryScriptExtraCylindricalDeformOptions
// 0x0018 (0x0018 - 0x0000)
struct FGeometryScriptExtraCylindricalDeformOptions final
{
public:
	float                                         TopScale;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MidSectionScale;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BottomScale;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MidSectionRatio;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunInBackgroundPriority;                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThreadCount;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptExtraCylindricalDeformOptions) == 0x000004, "Wrong alignment on FGeometryScriptExtraCylindricalDeformOptions");
static_assert(sizeof(FGeometryScriptExtraCylindricalDeformOptions) == 0x000018, "Wrong size on FGeometryScriptExtraCylindricalDeformOptions");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, TopScale) == 0x000000, "Member 'FGeometryScriptExtraCylindricalDeformOptions::TopScale' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, MidSectionScale) == 0x000004, "Member 'FGeometryScriptExtraCylindricalDeformOptions::MidSectionScale' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, BottomScale) == 0x000008, "Member 'FGeometryScriptExtraCylindricalDeformOptions::BottomScale' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, MidSectionRatio) == 0x00000C, "Member 'FGeometryScriptExtraCylindricalDeformOptions::MidSectionRatio' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, bRunInBackgroundPriority) == 0x000010, "Member 'FGeometryScriptExtraCylindricalDeformOptions::bRunInBackgroundPriority' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraCylindricalDeformOptions, ThreadCount) == 0x000014, "Member 'FGeometryScriptExtraCylindricalDeformOptions::ThreadCount' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptPressDeformOptions
// 0x00F0 (0x00F0 - 0x0000)
struct FGeometryScriptPressDeformOptions final
{
public:
	struct FTransform                             LocalPressTransform;                               // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AngleTolerance;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ModifiedDistance;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubdivLoopCount;                                   // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight_A;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight_B;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkinWeight;                                    // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SkinWeightThreshold;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             BoneNames;                                         // 0x0098(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGeometryScriptPressDeformOptions) == 0x000010, "Wrong alignment on FGeometryScriptPressDeformOptions");
static_assert(sizeof(FGeometryScriptPressDeformOptions) == 0x0000F0, "Wrong size on FGeometryScriptPressDeformOptions");
static_assert(offsetof(FGeometryScriptPressDeformOptions, LocalPressTransform) == 0x000000, "Member 'FGeometryScriptPressDeformOptions::LocalPressTransform' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, AngleTolerance) == 0x000060, "Member 'FGeometryScriptPressDeformOptions::AngleTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, ModifiedDistance) == 0x000068, "Member 'FGeometryScriptPressDeformOptions::ModifiedDistance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, SubdivLoopCount) == 0x000070, "Member 'FGeometryScriptPressDeformOptions::SubdivLoopCount' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, Weight_A) == 0x000078, "Member 'FGeometryScriptPressDeformOptions::Weight_A' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, Weight_B) == 0x000080, "Member 'FGeometryScriptPressDeformOptions::Weight_B' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, bUseSkinWeight) == 0x000088, "Member 'FGeometryScriptPressDeformOptions::bUseSkinWeight' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, SkinWeightThreshold) == 0x000090, "Member 'FGeometryScriptPressDeformOptions::SkinWeightThreshold' has a wrong offset!");
static_assert(offsetof(FGeometryScriptPressDeformOptions, BoneNames) == 0x000098, "Member 'FGeometryScriptPressDeformOptions::BoneNames' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptSqueezeDeformOptions
// 0x0100 (0x0100 - 0x0000)
struct FGeometryScriptSqueezeDeformOptions final
{
public:
	struct FTransform                             LocalSqueezeTransform;                             // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AngleTolerance;                                    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ModifiedDistance;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubdivLoopCount;                                   // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFakeInner;                                        // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FakeThickness;                                     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight_A;                                          // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight_B;                                          // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkinWeight;                                    // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SkinWeightThreshold;                               // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             BoneNames;                                         // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bRunInBackgroundPriority;                          // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThreadCount;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGeometryScriptSqueezeDeformOptions) == 0x000010, "Wrong alignment on FGeometryScriptSqueezeDeformOptions");
static_assert(sizeof(FGeometryScriptSqueezeDeformOptions) == 0x000100, "Wrong size on FGeometryScriptSqueezeDeformOptions");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, LocalSqueezeTransform) == 0x000000, "Member 'FGeometryScriptSqueezeDeformOptions::LocalSqueezeTransform' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, AngleTolerance) == 0x000060, "Member 'FGeometryScriptSqueezeDeformOptions::AngleTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, ModifiedDistance) == 0x000068, "Member 'FGeometryScriptSqueezeDeformOptions::ModifiedDistance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, SubdivLoopCount) == 0x000070, "Member 'FGeometryScriptSqueezeDeformOptions::SubdivLoopCount' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, bFakeInner) == 0x000074, "Member 'FGeometryScriptSqueezeDeformOptions::bFakeInner' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, FakeThickness) == 0x000078, "Member 'FGeometryScriptSqueezeDeformOptions::FakeThickness' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, Weight_A) == 0x000080, "Member 'FGeometryScriptSqueezeDeformOptions::Weight_A' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, Weight_B) == 0x000088, "Member 'FGeometryScriptSqueezeDeformOptions::Weight_B' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, bUseSkinWeight) == 0x000090, "Member 'FGeometryScriptSqueezeDeformOptions::bUseSkinWeight' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, SkinWeightThreshold) == 0x000098, "Member 'FGeometryScriptSqueezeDeformOptions::SkinWeightThreshold' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, BoneNames) == 0x0000A0, "Member 'FGeometryScriptSqueezeDeformOptions::BoneNames' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, bRunInBackgroundPriority) == 0x0000F0, "Member 'FGeometryScriptSqueezeDeformOptions::bRunInBackgroundPriority' has a wrong offset!");
static_assert(offsetof(FGeometryScriptSqueezeDeformOptions, ThreadCount) == 0x0000F4, "Member 'FGeometryScriptSqueezeDeformOptions::ThreadCount' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptLatticeWrapDeformDetailWeight
// 0x0020 (0x0020 - 0x0000)
struct FGeometryScriptLatticeWrapDeformDetailWeight final
{
public:
	struct FIntVector                             Min;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             Max;                                               // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptLatticeWrapDeformDetailWeight) == 0x000008, "Wrong alignment on FGeometryScriptLatticeWrapDeformDetailWeight");
static_assert(sizeof(FGeometryScriptLatticeWrapDeformDetailWeight) == 0x000020, "Wrong size on FGeometryScriptLatticeWrapDeformDetailWeight");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformDetailWeight, Min) == 0x000000, "Member 'FGeometryScriptLatticeWrapDeformDetailWeight::Min' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformDetailWeight, Max) == 0x00000C, "Member 'FGeometryScriptLatticeWrapDeformDetailWeight::Max' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformDetailWeight, Weight) == 0x000018, "Member 'FGeometryScriptLatticeWrapDeformDetailWeight::Weight' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptLatticeWrapDeformOptions
// 0x0040 (0x0040 - 0x0000)
struct FGeometryScriptLatticeWrapDeformOptions final
{
public:
	struct FIntVector                             Dimension;                                         // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMinDelta;                                      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Weight;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFakeInner;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedExtrudePass;                                  // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AngleTolerance;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeometryScriptLatticeWrapDeformDetailWeight> DetailWeights;                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRunInBackgroundPriority;                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThreadCount;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptLatticeWrapDeformOptions) == 0x000008, "Wrong alignment on FGeometryScriptLatticeWrapDeformOptions");
static_assert(sizeof(FGeometryScriptLatticeWrapDeformOptions) == 0x000040, "Wrong size on FGeometryScriptLatticeWrapDeformOptions");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, Dimension) == 0x000000, "Member 'FGeometryScriptLatticeWrapDeformOptions::Dimension' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, bUseMinDelta) == 0x00000C, "Member 'FGeometryScriptLatticeWrapDeformOptions::bUseMinDelta' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, Weight) == 0x000010, "Member 'FGeometryScriptLatticeWrapDeformOptions::Weight' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, bFakeInner) == 0x000018, "Member 'FGeometryScriptLatticeWrapDeformOptions::bFakeInner' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, bNeedExtrudePass) == 0x000019, "Member 'FGeometryScriptLatticeWrapDeformOptions::bNeedExtrudePass' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, AngleTolerance) == 0x000020, "Member 'FGeometryScriptLatticeWrapDeformOptions::AngleTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, DetailWeights) == 0x000028, "Member 'FGeometryScriptLatticeWrapDeformOptions::DetailWeights' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, bRunInBackgroundPriority) == 0x000038, "Member 'FGeometryScriptLatticeWrapDeformOptions::bRunInBackgroundPriority' has a wrong offset!");
static_assert(offsetof(FGeometryScriptLatticeWrapDeformOptions, ThreadCount) == 0x00003C, "Member 'FGeometryScriptLatticeWrapDeformOptions::ThreadCount' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptWrapDeformOptions
// 0x0120 (0x0120 - 0x0000)
struct FGeometryScriptWrapDeformOptions final
{
public:
	EGeometryScriptWrapDeformOperation            Operation;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalWrapTransform;                                // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ModifiedDistance;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubdivLoopCount;                                   // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Offset;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkinWeight;                                    // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SkinWeightThreshold;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtrudeDistance;                                   // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ExtrudeTolerance;                                  // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyHulls;                                    // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HullTargetFaceCount;                               // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExpandAmount;                                      // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NormalTolerance;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             BoneNames;                                         // 0x00D0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptWrapDeformOptions) == 0x000010, "Wrong alignment on FGeometryScriptWrapDeformOptions");
static_assert(sizeof(FGeometryScriptWrapDeformOptions) == 0x000120, "Wrong size on FGeometryScriptWrapDeformOptions");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, Operation) == 0x000000, "Member 'FGeometryScriptWrapDeformOptions::Operation' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, LocalWrapTransform) == 0x000010, "Member 'FGeometryScriptWrapDeformOptions::LocalWrapTransform' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, ModifiedDistance) == 0x000070, "Member 'FGeometryScriptWrapDeformOptions::ModifiedDistance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, SubdivLoopCount) == 0x000078, "Member 'FGeometryScriptWrapDeformOptions::SubdivLoopCount' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, Offset) == 0x000080, "Member 'FGeometryScriptWrapDeformOptions::Offset' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, bUseSkinWeight) == 0x000088, "Member 'FGeometryScriptWrapDeformOptions::bUseSkinWeight' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, SkinWeightThreshold) == 0x000090, "Member 'FGeometryScriptWrapDeformOptions::SkinWeightThreshold' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, ExtrudeDistance) == 0x000098, "Member 'FGeometryScriptWrapDeformOptions::ExtrudeDistance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, ExtrudeTolerance) == 0x0000A0, "Member 'FGeometryScriptWrapDeformOptions::ExtrudeTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, bSimplifyHulls) == 0x0000A8, "Member 'FGeometryScriptWrapDeformOptions::bSimplifyHulls' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, HullTargetFaceCount) == 0x0000AC, "Member 'FGeometryScriptWrapDeformOptions::HullTargetFaceCount' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, ExpandAmount) == 0x0000B0, "Member 'FGeometryScriptWrapDeformOptions::ExpandAmount' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, NormalTolerance) == 0x0000C8, "Member 'FGeometryScriptWrapDeformOptions::NormalTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptWrapDeformOptions, BoneNames) == 0x0000D0, "Member 'FGeometryScriptWrapDeformOptions::BoneNames' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptExtraMeshBooleanOptions
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptExtraMeshBooleanOptions final
{
public:
	bool                                          bFillHoles;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyOutput;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SimplifyPlanarTolerance;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompactResult;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFastIntersection;                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarkRemovedTriangleOnly;                          // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunInBackgroundPriority;                          // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThreadCount;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptExtraMeshBooleanOptions) == 0x000004, "Wrong alignment on FGeometryScriptExtraMeshBooleanOptions");
static_assert(sizeof(FGeometryScriptExtraMeshBooleanOptions) == 0x000010, "Wrong size on FGeometryScriptExtraMeshBooleanOptions");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bFillHoles) == 0x000000, "Member 'FGeometryScriptExtraMeshBooleanOptions::bFillHoles' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bSimplifyOutput) == 0x000001, "Member 'FGeometryScriptExtraMeshBooleanOptions::bSimplifyOutput' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, SimplifyPlanarTolerance) == 0x000004, "Member 'FGeometryScriptExtraMeshBooleanOptions::SimplifyPlanarTolerance' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bCompactResult) == 0x000008, "Member 'FGeometryScriptExtraMeshBooleanOptions::bCompactResult' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bFastIntersection) == 0x000009, "Member 'FGeometryScriptExtraMeshBooleanOptions::bFastIntersection' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bMarkRemovedTriangleOnly) == 0x00000A, "Member 'FGeometryScriptExtraMeshBooleanOptions::bMarkRemovedTriangleOnly' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, bRunInBackgroundPriority) == 0x00000B, "Member 'FGeometryScriptExtraMeshBooleanOptions::bRunInBackgroundPriority' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshBooleanOptions, ThreadCount) == 0x00000C, "Member 'FGeometryScriptExtraMeshBooleanOptions::ThreadCount' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptExtraRemoveHiddenTrianglesOptions
// 0x0020 (0x0020 - 0x0000)
struct FGeometryScriptExtraRemoveHiddenTrianglesOptions final
{
public:
	EGeometryScriptExtraRemoveHiddenTrianglesMethod Method;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SamplesPerTriangle;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShrinkSelection;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindingIsoValue;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RaysPerSample;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalOffset;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompactResult;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowSelfOcclude;                                 // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMarkRemovedTriangleOnly;                          // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunInBackgroundPriority;                          // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThreadCount;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptExtraRemoveHiddenTrianglesOptions) == 0x000004, "Wrong alignment on FGeometryScriptExtraRemoveHiddenTrianglesOptions");
static_assert(sizeof(FGeometryScriptExtraRemoveHiddenTrianglesOptions) == 0x000020, "Wrong size on FGeometryScriptExtraRemoveHiddenTrianglesOptions");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, Method) == 0x000000, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::Method' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, SamplesPerTriangle) == 0x000004, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::SamplesPerTriangle' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, ShrinkSelection) == 0x000008, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::ShrinkSelection' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, WindingIsoValue) == 0x00000C, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::WindingIsoValue' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, RaysPerSample) == 0x000010, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::RaysPerSample' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, NormalOffset) == 0x000014, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::NormalOffset' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, bCompactResult) == 0x000018, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::bCompactResult' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, bAllowSelfOcclude) == 0x000019, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::bAllowSelfOcclude' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, bMarkRemovedTriangleOnly) == 0x00001A, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::bMarkRemovedTriangleOnly' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, bRunInBackgroundPriority) == 0x00001B, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::bRunInBackgroundPriority' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraRemoveHiddenTrianglesOptions, ThreadCount) == 0x00001C, "Member 'FGeometryScriptExtraRemoveHiddenTrianglesOptions::ThreadCount' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptExtraMeshMaterial
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptExtraMeshMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptExtraMeshMaterial) == 0x000008, "Wrong alignment on FGeometryScriptExtraMeshMaterial");
static_assert(sizeof(FGeometryScriptExtraMeshMaterial) == 0x000010, "Wrong size on FGeometryScriptExtraMeshMaterial");
static_assert(offsetof(FGeometryScriptExtraMeshMaterial, Material) == 0x000000, "Member 'FGeometryScriptExtraMeshMaterial::Material' has a wrong offset!");
static_assert(offsetof(FGeometryScriptExtraMeshMaterial, SlotName) == 0x000008, "Member 'FGeometryScriptExtraMeshMaterial::SlotName' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptExtraMeshMaterialSet
// 0x0010 (0x0010 - 0x0000)
struct FGeometryScriptExtraMeshMaterialSet final
{
public:
	TArray<struct FGeometryScriptExtraMeshMaterial> Materials;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGeometryScriptExtraMeshMaterialSet) == 0x000008, "Wrong alignment on FGeometryScriptExtraMeshMaterialSet");
static_assert(sizeof(FGeometryScriptExtraMeshMaterialSet) == 0x000010, "Wrong size on FGeometryScriptExtraMeshMaterialSet");
static_assert(offsetof(FGeometryScriptExtraMeshMaterialSet, Materials) == 0x000000, "Member 'FGeometryScriptExtraMeshMaterialSet::Materials' has a wrong offset!");

// ScriptStruct GeometryScriptingExtras.GeometryScriptingExtrasDebugMeshInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGeometryScriptingExtrasDebugMeshInfo final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGeometryScriptingExtrasDebugMeshInfo) == 0x000008, "Wrong alignment on FGeometryScriptingExtrasDebugMeshInfo");
static_assert(sizeof(FGeometryScriptingExtrasDebugMeshInfo) == 0x000020, "Wrong size on FGeometryScriptingExtrasDebugMeshInfo");

}

