#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HDRIBackdrop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HDRIBackdrop.HDRIBackdrop_C
// 0x0068 (0x0318 - 0x02B0)
class AHDRIBackdrop_C final : public AActor
{
public:
	class USkyLightComponent*                     SkyLight;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Geometry;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneComponent;                                    // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextureCube*                           Cubemap;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Size;                                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightingDistanceFactor;                            // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          UseCameraProjection;                               // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                                ProjectionCenter;                                  // 0x0300(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript()	 // 0xae1e64;
	void CreateMaterial()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"HDRIBackdrop_C">();
	}
	static class AHDRIBackdrop_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AHDRIBackdrop_C>();
	}
};
static_assert(alignof(AHDRIBackdrop_C) == 0x000008, "Wrong alignment on AHDRIBackdrop_C");
static_assert(sizeof(AHDRIBackdrop_C) == 0x000318, "Wrong size on AHDRIBackdrop_C");
static_assert(offsetof(AHDRIBackdrop_C, SkyLight) == 0x0002B0, "Member 'AHDRIBackdrop_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, Geometry) == 0x0002B8, "Member 'AHDRIBackdrop_C::Geometry' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, SceneComponent) == 0x0002C0, "Member 'AHDRIBackdrop_C::SceneComponent' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, Cubemap) == 0x0002C8, "Member 'AHDRIBackdrop_C::Cubemap' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, MaterialInstance) == 0x0002D0, "Member 'AHDRIBackdrop_C::MaterialInstance' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, Intensity) == 0x0002D8, "Member 'AHDRIBackdrop_C::Intensity' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, Size) == 0x0002E0, "Member 'AHDRIBackdrop_C::Size' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, LightingDistanceFactor) == 0x0002E8, "Member 'AHDRIBackdrop_C::LightingDistanceFactor' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, UseCameraProjection) == 0x0002F0, "Member 'AHDRIBackdrop_C::UseCameraProjection' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, Mesh) == 0x0002F8, "Member 'AHDRIBackdrop_C::Mesh' has a wrong offset!");
static_assert(offsetof(AHDRIBackdrop_C, ProjectionCenter) == 0x000300, "Member 'AHDRIBackdrop_C::ProjectionCenter' has a wrong offset!");

}

