#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hideout

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "DataRegistry_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "InputCore_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "BackendApi_structs.hpp"


namespace SDK
{

// Class Hideout.P2ClothingUpgradeDetailWidget
// 0x0108 (0x0388 - 0x0280)
class UP2ClothingUpgradeDetailWidget : public UUserWidget
{
public:
	TSubclassOf<class UP2ClothingUpgradeStatWidget> StatWidgetClass;                                 // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UP2ClothingUpgradeRequirementWidget> RequirementWidgetClass;                   // 0x0288(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UP2HideoutCommonItemWidget> HideoutCommonItemWidgetClass;                      // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FP2ItemWidgetParams                    ItemWidgetParams;                                  // 0x0298(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                           Color_RequirementMet;                              // 0x02D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           Color_RequirementNotMet;                           // 0x02E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2LevelSlotGroupWidget*                LevelSlotGroup;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_UpgradeName;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_CurrentLvl;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_IncreaseLvl;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_MoneyCost;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_Level;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VB_CategoryStats;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VB_Requirements;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VB_Requirement;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           VB_Cost;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         HB_LvlChangegIndicator;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         HB_Cost;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGridPanel*                             GP_Title;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Img_DividerLine01;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 ClothingUpgradeIcon;                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Bdr_AllCompleted;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       UpgradeAnim;                                       // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_RefreshWidget(bool bLevelUpAvailable)	 // 0xae1e64;
	void RefreshWidget()	 // 0x4baf904;
	void SetLevelSlotGroup()	 // 0x4bb0988;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeDetailWidget">();
	}
	static class UP2ClothingUpgradeDetailWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeDetailWidget>();
	}
};
static_assert(alignof(UP2ClothingUpgradeDetailWidget) == 0x000008, "Wrong alignment on UP2ClothingUpgradeDetailWidget");
static_assert(sizeof(UP2ClothingUpgradeDetailWidget) == 0x000388, "Wrong size on UP2ClothingUpgradeDetailWidget");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, StatWidgetClass) == 0x000280, "Member 'UP2ClothingUpgradeDetailWidget::StatWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, RequirementWidgetClass) == 0x000288, "Member 'UP2ClothingUpgradeDetailWidget::RequirementWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, HideoutCommonItemWidgetClass) == 0x000290, "Member 'UP2ClothingUpgradeDetailWidget::HideoutCommonItemWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, ItemWidgetParams) == 0x000298, "Member 'UP2ClothingUpgradeDetailWidget::ItemWidgetParams' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Color_RequirementMet) == 0x0002D8, "Member 'UP2ClothingUpgradeDetailWidget::Color_RequirementMet' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Color_RequirementNotMet) == 0x0002E8, "Member 'UP2ClothingUpgradeDetailWidget::Color_RequirementNotMet' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, LevelSlotGroup) == 0x0002F8, "Member 'UP2ClothingUpgradeDetailWidget::LevelSlotGroup' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Txt_UpgradeName) == 0x000300, "Member 'UP2ClothingUpgradeDetailWidget::Txt_UpgradeName' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Txt_CurrentLvl) == 0x000308, "Member 'UP2ClothingUpgradeDetailWidget::Txt_CurrentLvl' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Txt_IncreaseLvl) == 0x000310, "Member 'UP2ClothingUpgradeDetailWidget::Txt_IncreaseLvl' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Txt_MoneyCost) == 0x000318, "Member 'UP2ClothingUpgradeDetailWidget::Txt_MoneyCost' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Txt_Level) == 0x000320, "Member 'UP2ClothingUpgradeDetailWidget::Txt_Level' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, VB_CategoryStats) == 0x000328, "Member 'UP2ClothingUpgradeDetailWidget::VB_CategoryStats' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, VB_Requirements) == 0x000330, "Member 'UP2ClothingUpgradeDetailWidget::VB_Requirements' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, VB_Requirement) == 0x000338, "Member 'UP2ClothingUpgradeDetailWidget::VB_Requirement' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, VB_Cost) == 0x000340, "Member 'UP2ClothingUpgradeDetailWidget::VB_Cost' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, HB_LvlChangegIndicator) == 0x000348, "Member 'UP2ClothingUpgradeDetailWidget::HB_LvlChangegIndicator' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, HB_Cost) == 0x000350, "Member 'UP2ClothingUpgradeDetailWidget::HB_Cost' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, GP_Title) == 0x000358, "Member 'UP2ClothingUpgradeDetailWidget::GP_Title' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Img_DividerLine01) == 0x000360, "Member 'UP2ClothingUpgradeDetailWidget::Img_DividerLine01' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, ClothingUpgradeIcon) == 0x000368, "Member 'UP2ClothingUpgradeDetailWidget::ClothingUpgradeIcon' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, Bdr_AllCompleted) == 0x000370, "Member 'UP2ClothingUpgradeDetailWidget::Bdr_AllCompleted' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeDetailWidget, UpgradeAnim) == 0x000378, "Member 'UP2ClothingUpgradeDetailWidget::UpgradeAnim' has a wrong offset!");

// Class Hideout.P2SquadManagementWidget
// 0x00A0 (0x0620 - 0x0580)
class UP2SquadManagementWidget : public UP2CommonActivatableWidget
{
public:
	class UButton*                                Btn_InviteBtn;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                Btn_SquadBtn;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Bdr_NewNoti;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Bdr_NewNoti_List;                                  // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        WS_ContentTabs;                                    // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2SquadManagementPlayerWidget*         W_SquadPlayerWidget01;                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2SquadManagementPlayerWidget*         W_SquadPlayerWidget02;                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UP2SquadManagementPlayerWidget*         W_SquadPlayerWidget03;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ReceivedInviteCueTag;                              // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UP2SquadManagementInviteListWidget> SquadInviteWidgetClass;                    // 0x05C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x40];                                     // 0x05D0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2TeamMemberArrayItem>         CachedTeamMembers;                                 // 0x0610(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void OnClicked_BtnInvite()	 // 0x4c23788;
	void SetNewInvitesNotiDot(bool InNewInvites, bool bForce)	 // 0x4c247c0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2SquadManagementWidget">();
	}
	static class UP2SquadManagementWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2SquadManagementWidget>();
	}
};
static_assert(alignof(UP2SquadManagementWidget) == 0x000008, "Wrong alignment on UP2SquadManagementWidget");
static_assert(sizeof(UP2SquadManagementWidget) == 0x000620, "Wrong size on UP2SquadManagementWidget");
static_assert(offsetof(UP2SquadManagementWidget, Btn_InviteBtn) == 0x000580, "Member 'UP2SquadManagementWidget::Btn_InviteBtn' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, Btn_SquadBtn) == 0x000588, "Member 'UP2SquadManagementWidget::Btn_SquadBtn' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, Bdr_NewNoti) == 0x000590, "Member 'UP2SquadManagementWidget::Bdr_NewNoti' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, Bdr_NewNoti_List) == 0x000598, "Member 'UP2SquadManagementWidget::Bdr_NewNoti_List' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, WS_ContentTabs) == 0x0005A0, "Member 'UP2SquadManagementWidget::WS_ContentTabs' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, W_SquadPlayerWidget01) == 0x0005A8, "Member 'UP2SquadManagementWidget::W_SquadPlayerWidget01' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, W_SquadPlayerWidget02) == 0x0005B0, "Member 'UP2SquadManagementWidget::W_SquadPlayerWidget02' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, W_SquadPlayerWidget03) == 0x0005B8, "Member 'UP2SquadManagementWidget::W_SquadPlayerWidget03' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, ReceivedInviteCueTag) == 0x0005C0, "Member 'UP2SquadManagementWidget::ReceivedInviteCueTag' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, SquadInviteWidgetClass) == 0x0005C8, "Member 'UP2SquadManagementWidget::SquadInviteWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2SquadManagementWidget, CachedTeamMembers) == 0x000610, "Member 'UP2SquadManagementWidget::CachedTeamMembers' has a wrong offset!");

// Class Hideout.P2AbilityTask_FacilityPreview
// 0x0030 (0x01E0 - 0x01B0)
class UP2AbilityTask_FacilityPreview : public UP2AbilityTask_PlaceablePreview
{
public:
	uint8                                         Pad_1B0[0x8];                                      // 0x01B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AP2FacilityBoundaryBox>> BoundaryBoxes;                              // 0x01B8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2FacilityUpgradeSlotChangeInfo> UpgradeSlotChangeInfos;                          // 0x01D0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_FacilityPreview">();
	}
	static class UP2AbilityTask_FacilityPreview* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_FacilityPreview>();
	}
};
static_assert(alignof(UP2AbilityTask_FacilityPreview) == 0x000008, "Wrong alignment on UP2AbilityTask_FacilityPreview");
static_assert(sizeof(UP2AbilityTask_FacilityPreview) == 0x0001E0, "Wrong size on UP2AbilityTask_FacilityPreview");
static_assert(offsetof(UP2AbilityTask_FacilityPreview, BoundaryBoxes) == 0x0001B8, "Member 'UP2AbilityTask_FacilityPreview::BoundaryBoxes' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_FacilityPreview, UpgradeSlotChangeInfos) == 0x0001D0, "Member 'UP2AbilityTask_FacilityPreview::UpgradeSlotChangeInfos' has a wrong offset!");

// Class Hideout.P2GameplayContextRequirementResupply
// 0x0040 (0x00A0 - 0x0060)
class UP2GameplayContextRequirementResupply final : public UP2GameplayContextRequirement
{
public:
	TArray<struct FP2GameplayContextRequirementResupplyRequiredItemInfo> RequiredItems;              // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	class FText                                   Description;                                       // 0x0070(0x0018)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemsAmountChangedCallback(const struct FP2TradingInfo& InTradeInfo, int32 InAmount)	 // 0x4be3984;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GameplayContextRequirementResupply">();
	}
	static class UP2GameplayContextRequirementResupply* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2GameplayContextRequirementResupply>();
	}
};
static_assert(alignof(UP2GameplayContextRequirementResupply) == 0x000008, "Wrong alignment on UP2GameplayContextRequirementResupply");
static_assert(sizeof(UP2GameplayContextRequirementResupply) == 0x0000A0, "Wrong size on UP2GameplayContextRequirementResupply");
static_assert(offsetof(UP2GameplayContextRequirementResupply, RequiredItems) == 0x000060, "Member 'UP2GameplayContextRequirementResupply::RequiredItems' has a wrong offset!");
static_assert(offsetof(UP2GameplayContextRequirementResupply, Description) == 0x000070, "Member 'UP2GameplayContextRequirementResupply::Description' has a wrong offset!");

// Class Hideout.P2ClothingUpgradeGroupHeaderWidget
// 0x0008 (0x0288 - 0x0280)
class UP2ClothingUpgradeGroupHeaderWidget : public UUserWidget
{
public:
	class UTextBlock*                             Txt_ItemGroupTitle;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeGroupHeaderWidget">();
	}
	static class UP2ClothingUpgradeGroupHeaderWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeGroupHeaderWidget>();
	}
};
static_assert(alignof(UP2ClothingUpgradeGroupHeaderWidget) == 0x000008, "Wrong alignment on UP2ClothingUpgradeGroupHeaderWidget");
static_assert(sizeof(UP2ClothingUpgradeGroupHeaderWidget) == 0x000288, "Wrong size on UP2ClothingUpgradeGroupHeaderWidget");
static_assert(offsetof(UP2ClothingUpgradeGroupHeaderWidget, Txt_ItemGroupTitle) == 0x000280, "Member 'UP2ClothingUpgradeGroupHeaderWidget::Txt_ItemGroupTitle' has a wrong offset!");

// Class Hideout.P2AbilityTask_DecorationPreview
// 0x0018 (0x01F8 - 0x01E0)
class UP2AbilityTask_DecorationPreview final : public UP2AbilityTask_FacilityPreview
{
public:
	uint8                                         Pad_1E0[0x10];                                     // 0x01E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2HideoutGridDecorativeSubsystem*      GridSubsystem;                                     // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnQuickPurchaseFinished(const TArray<class UP2ItemData*>& SucceededItems, const TArray<class UP2ItemData*>& FailedItems)	 // 0x4baaf60;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_DecorationPreview">();
	}
	static class UP2AbilityTask_DecorationPreview* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_DecorationPreview>();
	}
};
static_assert(alignof(UP2AbilityTask_DecorationPreview) == 0x000008, "Wrong alignment on UP2AbilityTask_DecorationPreview");
static_assert(sizeof(UP2AbilityTask_DecorationPreview) == 0x0001F8, "Wrong size on UP2AbilityTask_DecorationPreview");
static_assert(offsetof(UP2AbilityTask_DecorationPreview, GridSubsystem) == 0x0001F0, "Member 'UP2AbilityTask_DecorationPreview::GridSubsystem' has a wrong offset!");

// Class Hideout.P2ClothingUpgradeGroupWidget
// 0x0040 (0x02C0 - 0x0280)
class UP2ClothingUpgradeGroupWidget : public UUserWidget
{
public:
	struct FGameplayTag                           CategoryTag;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UP2ClothingUpgradeItemWidget> ItemWidgetClass;                                 // 0x0288(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                ItemEmptyWidgetClass;                              // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ClothingUpgradeGroupHeaderWidget*    GroupHeader;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWrapBox*                               WB_Items;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UP2ClothingUpgradeWidget> ParentWidgetRef;                                  // 0x02B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnClothingUpgradeNodeWidgetClicked(class UP2ClothingUpgradeItemWidget* InNodeWidget)	 // 0x4baf28c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeGroupWidget">();
	}
	static class UP2ClothingUpgradeGroupWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeGroupWidget>();
	}
};
static_assert(alignof(UP2ClothingUpgradeGroupWidget) == 0x000008, "Wrong alignment on UP2ClothingUpgradeGroupWidget");
static_assert(sizeof(UP2ClothingUpgradeGroupWidget) == 0x0002C0, "Wrong size on UP2ClothingUpgradeGroupWidget");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, CategoryTag) == 0x000280, "Member 'UP2ClothingUpgradeGroupWidget::CategoryTag' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, ItemWidgetClass) == 0x000288, "Member 'UP2ClothingUpgradeGroupWidget::ItemWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, ItemEmptyWidgetClass) == 0x000290, "Member 'UP2ClothingUpgradeGroupWidget::ItemEmptyWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, GroupHeader) == 0x0002A8, "Member 'UP2ClothingUpgradeGroupWidget::GroupHeader' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, WB_Items) == 0x0002B0, "Member 'UP2ClothingUpgradeGroupWidget::WB_Items' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeGroupWidget, ParentWidgetRef) == 0x0002B8, "Member 'UP2ClothingUpgradeGroupWidget::ParentWidgetRef' has a wrong offset!");

// Class Hideout.P2ScrollBarBtnWidget
// 0x0028 (0x02A8 - 0x0280)
class UP2ScrollBarBtnWidget : public UUserWidget
{
public:
	EP2ScrollDir                                  ScrollDir;                                         // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             TargetScrList;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PressedThresholdTime;                              // 0x0290(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                Btn_ScrollBtn;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPressed_BtnScroll()	 // 0x4c24238;
	void OnReleased_BtnScroll()	 // 0x4c244c8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ScrollBarBtnWidget">();
	}
	static class UP2ScrollBarBtnWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ScrollBarBtnWidget>();
	}
};
static_assert(alignof(UP2ScrollBarBtnWidget) == 0x000008, "Wrong alignment on UP2ScrollBarBtnWidget");
static_assert(sizeof(UP2ScrollBarBtnWidget) == 0x0002A8, "Wrong size on UP2ScrollBarBtnWidget");
static_assert(offsetof(UP2ScrollBarBtnWidget, ScrollDir) == 0x000280, "Member 'UP2ScrollBarBtnWidget::ScrollDir' has a wrong offset!");
static_assert(offsetof(UP2ScrollBarBtnWidget, TargetScrList) == 0x000288, "Member 'UP2ScrollBarBtnWidget::TargetScrList' has a wrong offset!");
static_assert(offsetof(UP2ScrollBarBtnWidget, PressedThresholdTime) == 0x000290, "Member 'UP2ScrollBarBtnWidget::PressedThresholdTime' has a wrong offset!");
static_assert(offsetof(UP2ScrollBarBtnWidget, Btn_ScrollBtn) == 0x000298, "Member 'UP2ScrollBarBtnWidget::Btn_ScrollBtn' has a wrong offset!");

// Class Hideout.P2AbilityTask_DecorPreview
// 0x0010 (0x01C0 - 0x01B0)
class UP2AbilityTask_DecorPreview final : public UP2AbilityTask_PlaceablePreview
{
public:
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_DecorPreview">();
	}
	static class UP2AbilityTask_DecorPreview* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_DecorPreview>();
	}
};
static_assert(alignof(UP2AbilityTask_DecorPreview) == 0x000008, "Wrong alignment on UP2AbilityTask_DecorPreview");
static_assert(sizeof(UP2AbilityTask_DecorPreview) == 0x0001C0, "Wrong size on UP2AbilityTask_DecorPreview");

// Class Hideout.P2ClothingUpgradeItemWidget
// 0x0030 (0x02B0 - 0x0280)
class UP2ClothingUpgradeItemWidget : public UUserWidget
{
public:
	class UP2LevelSlotGroupWidget*                LevelSlotGroup;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Txt_ClothingUpgradeItemName;                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Img_ClothingUpgradeItemIcon;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                Btn_Item;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UP2ClothingUpgradeGroupWidget> ParentGroupWidgetRef;                        // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UP2ClothingUpgradeNode>  CachedNode;                                        // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BP_SetSelected(bool bInIsSelected)	 // 0xae1e64;
	void OnClicked_BtnItem()	 // 0x4baefe8;
	void SetAvailable(bool InIsAvailable)	 // 0xae1e64;
	void SetNode(class UP2ClothingUpgradeNode* InNode)	 // 0x4bb09e0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeItemWidget">();
	}
	static class UP2ClothingUpgradeItemWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeItemWidget>();
	}
};
static_assert(alignof(UP2ClothingUpgradeItemWidget) == 0x000008, "Wrong alignment on UP2ClothingUpgradeItemWidget");
static_assert(sizeof(UP2ClothingUpgradeItemWidget) == 0x0002B0, "Wrong size on UP2ClothingUpgradeItemWidget");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, LevelSlotGroup) == 0x000280, "Member 'UP2ClothingUpgradeItemWidget::LevelSlotGroup' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, Txt_ClothingUpgradeItemName) == 0x000288, "Member 'UP2ClothingUpgradeItemWidget::Txt_ClothingUpgradeItemName' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, Img_ClothingUpgradeItemIcon) == 0x000290, "Member 'UP2ClothingUpgradeItemWidget::Img_ClothingUpgradeItemIcon' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, Btn_Item) == 0x000298, "Member 'UP2ClothingUpgradeItemWidget::Btn_Item' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, ParentGroupWidgetRef) == 0x0002A0, "Member 'UP2ClothingUpgradeItemWidget::ParentGroupWidgetRef' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeItemWidget, CachedNode) == 0x0002A8, "Member 'UP2ClothingUpgradeItemWidget::CachedNode' has a wrong offset!");

// Class Hideout.P2AbilityTask_FacilityPreviewCheat
// 0x0000 (0x01E0 - 0x01E0)
class UP2AbilityTask_FacilityPreviewCheat final : public UP2AbilityTask_FacilityPreview
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_FacilityPreviewCheat">();
	}
	static class UP2AbilityTask_FacilityPreviewCheat* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_FacilityPreviewCheat>();
	}
};
static_assert(alignof(UP2AbilityTask_FacilityPreviewCheat) == 0x000008, "Wrong alignment on UP2AbilityTask_FacilityPreviewCheat");
static_assert(sizeof(UP2AbilityTask_FacilityPreviewCheat) == 0x0001E0, "Wrong size on UP2AbilityTask_FacilityPreviewCheat");

// Class Hideout.P2TestGearLoadoutTitleWidget
// 0x0008 (0x0288 - 0x0280)
class UP2TestGearLoadoutTitleWidget : public UUserWidget
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFactionReputationChanged(class UP2Faction* InFaction, int32 InCurrentReputation, int32 InPreviousReputation)	 // 0x4c29b44;
	void SetFactionReputationValue(int32 InLevel, int32 InReputation, int32 InMaxReputation)	 // 0xae1e64;
	void SetIsFactionTestGearTitle(bool bIsFactionTestGearTitle)	 // 0xae1e64;
	void SetIsUnavailable(bool bIsUnavailable)	 // 0xae1e64;
	void SetTestGearTitle(const class FText& InTitle)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestGearLoadoutTitleWidget">();
	}
	static class UP2TestGearLoadoutTitleWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TestGearLoadoutTitleWidget>();
	}
};
static_assert(alignof(UP2TestGearLoadoutTitleWidget) == 0x000008, "Wrong alignment on UP2TestGearLoadoutTitleWidget");
static_assert(sizeof(UP2TestGearLoadoutTitleWidget) == 0x000288, "Wrong size on UP2TestGearLoadoutTitleWidget");

// Class Hideout.P2AbilityTask_GridSnapPreview
// 0x00B8 (0x0268 - 0x01B0)
class UP2AbilityTask_GridSnapPreview final : public UP2AbilityTask_PlaceablePreview
{
public:
	class UP2GridSnapFacilitySocket*              CurrentAttachTargetSocket;                         // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2Facility_GridSnapDecorative*         PlaceablePreviewGridSnapDecorativeActor;           // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2Facility_GridSnapDecorative*         ReplaceTarget;                                     // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    LastAimingComponent;                               // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                 SourceObject;                                      // 0x01D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D8[0x10];                                     // 0x01D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2HideoutGridDecorativeSubsystem*      GridSubsystem;                                     // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F0[0x78];                                     // 0x01F0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQuickPurchaseFinished(const TArray<class UP2ItemData*>& SucceededItems, const TArray<class UP2ItemData*>& FailedItems)	 // 0x4bab0a4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_GridSnapPreview">();
	}
	static class UP2AbilityTask_GridSnapPreview* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_GridSnapPreview>();
	}
};
static_assert(alignof(UP2AbilityTask_GridSnapPreview) == 0x000008, "Wrong alignment on UP2AbilityTask_GridSnapPreview");
static_assert(sizeof(UP2AbilityTask_GridSnapPreview) == 0x000268, "Wrong size on UP2AbilityTask_GridSnapPreview");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, CurrentAttachTargetSocket) == 0x0001B0, "Member 'UP2AbilityTask_GridSnapPreview::CurrentAttachTargetSocket' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, PlaceablePreviewGridSnapDecorativeActor) == 0x0001B8, "Member 'UP2AbilityTask_GridSnapPreview::PlaceablePreviewGridSnapDecorativeActor' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, ReplaceTarget) == 0x0001C0, "Member 'UP2AbilityTask_GridSnapPreview::ReplaceTarget' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, LastAimingComponent) == 0x0001C8, "Member 'UP2AbilityTask_GridSnapPreview::LastAimingComponent' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, SourceObject) == 0x0001D0, "Member 'UP2AbilityTask_GridSnapPreview::SourceObject' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_GridSnapPreview, GridSubsystem) == 0x0001E8, "Member 'UP2AbilityTask_GridSnapPreview::GridSubsystem' has a wrong offset!");

// Class Hideout.P2FunctionLibrary_Facility
// 0x0000 (0x0028 - 0x0028)
class UP2FunctionLibrary_Facility final : public UBlueprintFunctionLibrary
{
public:
	static void CancelDeliveryRequest(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot)	 // 0x4bd5868;
	static void CancelDestroyFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot)	 // 0x4bd59d8;
	static bool CheckCancelDeliveryFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const class UP2FacilityData* InFaclityData)	 // 0x4bd6050;
	static bool CheckCancelDestroyFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const class UP2FacilityData* InFaclityData)	 // 0x4bd61b4;
	static bool CheckDeliveryFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const class UP2FacilityData* InFaclityData)	 // 0x4bd6414;
	static bool CheckDestroyFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const class UP2FacilityData* InFaclityData)	 // 0x4bd66a4;
	static bool CheckInventoryHasSpaceItems(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const TArray<struct FP2ExchangeInfo>& InExhangesInfos, int32 InExtraMultiplyAmount)	 // 0x4bd6810;
	static bool CheckPlayerHasItems(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const TArray<struct FP2ExchangeInfo>& InExhangesInfos, bool InCheckInventory, bool InCheckStash, int32 InExtraMultiplyAmount)	 // 0x4bd6a74;
	static bool CheckStashHasSpaceItems(const class AActor* InOwnerActor, const TArray<struct FP2ExchangeInfo>& InExhangesInfos, int32 InExtraMultiplyAmount)	 // 0x4bd6ee8;
	static void CleanUp(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot)	 // 0x4bd7100;
	static void DeliveryRequest(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot, class UP2FacilityData* InFacilityData)	 // 0x4bd7538;
	static void DestroyFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot)	 // 0x4bd7728;
	static struct FP2CraftingDataRow GetCraftingDataRow(const struct FP2ExchangeDataInfo& InExchangeInfo)	 // 0x4bd89a8;
	static struct FP2CraftingRecipeRow GetCraftingRecipeRow(const struct FP2ExchangeDataInfo& InExchangeInfo)	 // 0x2f23050;
	static int32 GetFacilityCountInWorld(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const class UP2FacilityData* InFacilityData)	 // 0x4bd8ffc;
	static class AP2Facility* GetFacilityForPawn(const class APawn* InPawn, const class AP2FacilitySpot* InFacilitySpot)	 // 0x4bd91a8;
	static struct FP2ProductionDataRow GetProductionDataRow(const struct FP2ExchangeDataInfo& InExchangeInfo)	 // 0x4bda0ec;
	static int32 GetTotalAmountItemData(const class AP2HeroCharacter* InHeroCharacter, const class UP2ItemData* InItemData)	 // 0x4bdab70;
	static void InstallFacility(const class AP2PlayerController_Hideout* InP2PlayerControllerHideout, class AP2FacilitySpot* InFacilitySpot)	 // 0x4bdb220;
	static void UpdateUnlockStateDroneMod(class AP2PlayerController_Hideout* InP2PlayerControllerHideout, const struct FGameplayTag& InModDroneTag, EP2DroneUnlockState InUnlockState)	 // 0x4bdecf4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2FunctionLibrary_Facility">();
	}
	static class UP2FunctionLibrary_Facility* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2FunctionLibrary_Facility>();
	}
};
static_assert(alignof(UP2FunctionLibrary_Facility) == 0x000008, "Wrong alignment on UP2FunctionLibrary_Facility");
static_assert(sizeof(UP2FunctionLibrary_Facility) == 0x000028, "Wrong size on UP2FunctionLibrary_Facility");

// Class Hideout.P2ClothingUpgradeNodeData
// 0x0030 (0x0068 - 0x0038)
class UP2ClothingUpgradeNodeData final : public UP2RequirementManagerData
{
public:
	struct FDataRegistryId                        DataRegistryId;                                    // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CategoryTag;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ExternalSkillTag;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FP2ClothingUpgradeNodeLevelData> LevelDatas;                                       // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeNodeData">();
	}
	static class UP2ClothingUpgradeNodeData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeNodeData>();
	}
};
static_assert(alignof(UP2ClothingUpgradeNodeData) == 0x000008, "Wrong alignment on UP2ClothingUpgradeNodeData");
static_assert(sizeof(UP2ClothingUpgradeNodeData) == 0x000068, "Wrong size on UP2ClothingUpgradeNodeData");
static_assert(offsetof(UP2ClothingUpgradeNodeData, DataRegistryId) == 0x000038, "Member 'UP2ClothingUpgradeNodeData::DataRegistryId' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeNodeData, CategoryTag) == 0x000048, "Member 'UP2ClothingUpgradeNodeData::CategoryTag' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeNodeData, ExternalSkillTag) == 0x000050, "Member 'UP2ClothingUpgradeNodeData::ExternalSkillTag' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeNodeData, LevelDatas) == 0x000058, "Member 'UP2ClothingUpgradeNodeData::LevelDatas' has a wrong offset!");

// Class Hideout.P2Ability_AttachItem
// 0x0000 (0x0490 - 0x0490)
class UP2Ability_AttachItem : public UP2Ability
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_AttachItem">();
	}
	static class UP2Ability_AttachItem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_AttachItem>();
	}
};
static_assert(alignof(UP2Ability_AttachItem) == 0x000008, "Wrong alignment on UP2Ability_AttachItem");
static_assert(sizeof(UP2Ability_AttachItem) == 0x000490, "Wrong size on UP2Ability_AttachItem");

// Class Hideout.P2TradingRequiredItemWidget
// 0x0078 (0x02F8 - 0x0280)
class UP2TradingRequiredItemWidget : public UUserWidget
{
public:
	class UP2CommonItemWidget*                    W_CommonItemWidget;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ItemNameText;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         RT_ReqItemQuantity;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              ItemCellSize;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x58];                                     // 0x02A0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TradingRequiredItemWidget">();
	}
	static class UP2TradingRequiredItemWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TradingRequiredItemWidget>();
	}
};
static_assert(alignof(UP2TradingRequiredItemWidget) == 0x000008, "Wrong alignment on UP2TradingRequiredItemWidget");
static_assert(sizeof(UP2TradingRequiredItemWidget) == 0x0002F8, "Wrong size on UP2TradingRequiredItemWidget");
static_assert(offsetof(UP2TradingRequiredItemWidget, W_CommonItemWidget) == 0x000280, "Member 'UP2TradingRequiredItemWidget::W_CommonItemWidget' has a wrong offset!");
static_assert(offsetof(UP2TradingRequiredItemWidget, ItemNameText) == 0x000288, "Member 'UP2TradingRequiredItemWidget::ItemNameText' has a wrong offset!");
static_assert(offsetof(UP2TradingRequiredItemWidget, RT_ReqItemQuantity) == 0x000290, "Member 'UP2TradingRequiredItemWidget::RT_ReqItemQuantity' has a wrong offset!");
static_assert(offsetof(UP2TradingRequiredItemWidget, ItemCellSize) == 0x000298, "Member 'UP2TradingRequiredItemWidget::ItemCellSize' has a wrong offset!");

// Class Hideout.P2Ability_AddToQuickPlacementMode
// 0x0000 (0x0490 - 0x0490)
class UP2Ability_AddToQuickPlacementMode : public UP2Ability
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_AddToQuickPlacementMode">();
	}
	static class UP2Ability_AddToQuickPlacementMode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_AddToQuickPlacementMode>();
	}
};
static_assert(alignof(UP2Ability_AddToQuickPlacementMode) == 0x000008, "Wrong alignment on UP2Ability_AddToQuickPlacementMode");
static_assert(sizeof(UP2Ability_AddToQuickPlacementMode) == 0x000490, "Wrong size on UP2Ability_AddToQuickPlacementMode");

// Class Hideout.P2ClothingUpgradeNode
// 0x0018 (0x0060 - 0x0048)
class UP2ClothingUpgradeNode final : public UP2RequirementManager
{
public:
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLevel;                                      // 0x0058(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentLevel()	 // 0x4bb5b6c;

	int32 GetCurrentLevel() const	 // 0x4bb4078;
	const class UP2ClothingUpgradeNodeData* GetData() const	 // 0x17cf1b8;
	int32 GetMaxLevel() const	 // 0x4bb408c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeNode">();
	}
	static class UP2ClothingUpgradeNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeNode>();
	}
};
static_assert(alignof(UP2ClothingUpgradeNode) == 0x000008, "Wrong alignment on UP2ClothingUpgradeNode");
static_assert(sizeof(UP2ClothingUpgradeNode) == 0x000060, "Wrong size on UP2ClothingUpgradeNode");
static_assert(offsetof(UP2ClothingUpgradeNode, CurrentLevel) == 0x000058, "Member 'UP2ClothingUpgradeNode::CurrentLevel' has a wrong offset!");

// Class Hideout.P2Ability_ReplaceDecoration
// 0x0000 (0x0490 - 0x0490)
class UP2Ability_ReplaceDecoration : public UP2Ability
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_ReplaceDecoration">();
	}
	static class UP2Ability_ReplaceDecoration* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_ReplaceDecoration>();
	}
};
static_assert(alignof(UP2Ability_ReplaceDecoration) == 0x000008, "Wrong alignment on UP2Ability_ReplaceDecoration");
static_assert(sizeof(UP2Ability_ReplaceDecoration) == 0x000490, "Wrong size on UP2Ability_ReplaceDecoration");

// Class Hideout.P2ClothingUpgradeRequirementWidget
// 0x0038 (0x02B8 - 0x0280)
class UP2ClothingUpgradeRequirementWidget : public UUserWidget
{
public:
	struct FLinearColor                           Color_RequirementMet;                              // 0x0280(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           Color_RequirementNotMet;                           // 0x0290(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         RTxt_Requirement;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Bdr_RequirementStatusBg;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBorder*                                Bdr_RequirementStatusBg_Complete;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ClothingUpgradeRequirementWidget">();
	}
	static class UP2ClothingUpgradeRequirementWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2ClothingUpgradeRequirementWidget>();
	}
};
static_assert(alignof(UP2ClothingUpgradeRequirementWidget) == 0x000008, "Wrong alignment on UP2ClothingUpgradeRequirementWidget");
static_assert(sizeof(UP2ClothingUpgradeRequirementWidget) == 0x0002B8, "Wrong size on UP2ClothingUpgradeRequirementWidget");
static_assert(offsetof(UP2ClothingUpgradeRequirementWidget, Color_RequirementMet) == 0x000280, "Member 'UP2ClothingUpgradeRequirementWidget::Color_RequirementMet' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeRequirementWidget, Color_RequirementNotMet) == 0x000290, "Member 'UP2ClothingUpgradeRequirementWidget::Color_RequirementNotMet' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeRequirementWidget, RTxt_Requirement) == 0x0002A0, "Member 'UP2ClothingUpgradeRequirementWidget::RTxt_Requirement' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeRequirementWidget, Bdr_RequirementStatusBg) == 0x0002A8, "Member 'UP2ClothingUpgradeRequirementWidget::Bdr_RequirementStatusBg' has a wrong offset!");
static_assert(offsetof(UP2ClothingUpgradeRequirementWidget, Bdr_RequirementStatusBg_Complete) == 0x0002B0, "Member 'UP2ClothingUpgradeRequirementWidget::Bdr_RequirementStatusBg_Complete' has a wrong offset!");

// Class Hideout.P2TradingItemGroupEntryData
// 0x0080 (0x00A8 - 0x0028)
class UP2TradingItemGroupEntryData : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FP2TradingInfo& InClickedTradingInfo)> OnItemButtonClickedEvent; // 0x0030(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	TMap<struct FP2TradingInfo, struct FIntPoint> TradeInfoPositionsMap;                             // 0x0040(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<int32>                                 CellHeights;                                       // 0x0090(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TradingItemGroupEntryData">();
	}
	static class UP2TradingItemGroupEntryData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TradingItemGroupEntryData>();
	}
};
static_assert(alignof(UP2TradingItemGroupEntryData) == 0x000008, "Wrong alignment on UP2TradingItemGroupEntryData");
static_assert(sizeof(UP2TradingItemGroupEntryData) == 0x0000A8, "Wrong size on UP2TradingItemGroupEntryData");
static_assert(offsetof(UP2TradingItemGroupEntryData, OnItemButtonClickedEvent) == 0x000030, "Member 'UP2TradingItemGroupEntryData::OnItemButtonClickedEvent' has a wrong offset!");
static_assert(offsetof(UP2TradingItemGroupEntryData, TradeInfoPositionsMap) == 0x000040, "Member 'UP2TradingItemGroupEntryData::TradeInfoPositionsMap' has a wrong offset!");
static_assert(offsetof(UP2TradingItemGroupEntryData, CellHeights) == 0x000090, "Member 'UP2TradingItemGroupEntryData::CellHeights' has a wrong offset!");

// Class Hideout.P2Ability_DeleteAimingDecoration
// 0x0000 (0x0490 - 0x0490)
class UP2Ability_DeleteAimingDecoration final : public UP2Ability
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_DeleteAimingDecoration">();
	}
	static class UP2Ability_DeleteAimingDecoration* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_DeleteAimingDecoration>();
	}
};
static_assert(alignof(UP2Ability_DeleteAimingDecoration) == 0x000008, "Wrong alignment on UP2Ability_DeleteAimingDecoration");
static_assert(sizeof(UP2Ability_DeleteAimingDecoration) == 0x000490, "Wrong size on UP2Ability_DeleteAimingDecoration");

// Class Hideout.P2PlaceableFacilityData
// 0x0008 (0x0110 - 0x0108)
class UP2PlaceableFacilityData : public UP2PlaceableData
{
public:
	class UP2FacilityData*                        FacilityData;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2PlaceableFacilityData">();
	}
	static class UP2PlaceableFacilityData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2PlaceableFacilityData>();
	}
};
static_assert(alignof(UP2PlaceableFacilityData) == 0x000008, "Wrong alignment on UP2PlaceableFacilityData");
static_assert(sizeof(UP2PlaceableFacilityData) == 0x000110, "Wrong size on UP2PlaceableFacilityData");
static_assert(offsetof(UP2PlaceableFacilityData, FacilityData) == 0x000108, "Member 'UP2PlaceableFacilityData::FacilityData' has a wrong offset!");

// Class Hideout.P2GridSnapDecorativeData
// 0x0028 (0x0138 - 0x0110)
class UP2GridSnapDecorativeData final : public UP2PlaceableFacilityData
{
public:
	struct FVector                                MoveStep;                                          // 0x0110(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RotateStep;                                        // 0x0128(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2GridSnapDecorativeType                     DecorativeType;                                    // 0x0130(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GridSnapDecorativeData">();
	}
	static class UP2GridSnapDecorativeData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2GridSnapDecorativeData>();
	}
};
static_assert(alignof(UP2GridSnapDecorativeData) == 0x000008, "Wrong alignment on UP2GridSnapDecorativeData");
static_assert(sizeof(UP2GridSnapDecorativeData) == 0x000138, "Wrong size on UP2GridSnapDecorativeData");
static_assert(offsetof(UP2GridSnapDecorativeData, MoveStep) == 0x000110, "Member 'UP2GridSnapDecorativeData::MoveStep' has a wrong offset!");
