#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hideout

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum Hideout.EP2FacilityErrorType
// NumValues: 0x0008
enum class EP2FacilityErrorType : uint8
{
	None                                     = 0,
	InvalidMemoryData                        = 1,
	FacilityBusy                             = 2,
	NoPlaceInContainers                      = 3,
	FacilitySlotNotIdle                      = 4,
	FacilityModuleNotInstalled               = 5,
	InValidItemData                          = 6,
	EP2FacilityErrorType_MAX                 = 7,
};

// Enum Hideout.EP2FacilitySpotStatus
// NumValues: 0x000C
enum class EP2FacilitySpotStatus : uint8
{
	DeliveryDisabled                         = 0,
	Cleaning                                 = 1,
	DeliveryAvailable                        = 2,
	DeliveryWaiting                          = 3,
	DeliveryComplete                         = 4,
	Installing                               = 5,
	Installed                                = 6,
	Destroying                               = 7,
	Destroyed                                = 8,
	DeliveryHalt                             = 9,
	None                                     = 10,
	EP2FacilitySpotStatus_MAX                = 11,
};

// Enum Hideout.EP2ModdingResultType
// NumValues: 0x0005
enum class EP2ModdingResultType : uint8
{
	None                                     = 0,
	ModWithContents                          = 1,
	NotEnoughSpace                           = 2,
	ModdingCompleted                         = 3,
	Max                                      = 4,
};

// Enum Hideout.EP2ModdingStatusType
// NumValues: 0x0010
enum class EP2ModdingStatusType : uint8
{
	None                                     = 0,
	StartedModify                            = 1,
	StartedCustomOrderModify                 = 2,
	StartedModifySkinCustomize               = 3,
	AvailableModify                          = 4,
	AvailableModifyByQuickperchase           = 5,
	AvailableModifyByDroneModQuickperchase   = 6,
	UnavailableModify                        = 7,
	UnavailableModifyByIsUnchanged           = 8,
	UnavailableModifyByModWithContents       = 9,
	UnavailableModifyByLocked                = 10,
	UnavailableModifySkinCustomize           = 11,
	EndedModify                              = 12,
	EndedCustomOrderModify                   = 13,
	EndedModifySkinCustomize                 = 14,
	Max                                      = 15,
};

// Enum Hideout.EP2SlotFocusType
// NumValues: 0x0003
enum class EP2SlotFocusType : uint8
{
	CameraMoveToSlot                         = 0,
	ItemMoveToCamera                         = 1,
	EP2SlotFocusType_MAX                     = 2,
};

// Enum Hideout.EP2RepairDurabilityBonus
// NumValues: 0x0005
enum class EP2RepairDurabilityBonus : uint8
{
	Total                                    = 0,
	BaseMaterial                             = 1,
	Module                                   = 2,
	PlayerProficiencies                      = 3,
	EP2RepairDurabilityBonus_MAX             = 4,
};

// Enum Hideout.EP2GuestFacilityPolicy
// NumValues: 0x0005
enum class EP2GuestFacilityPolicy : uint8
{
	NotAvailable                             = 0,
	AvailableInsteadOfLeaderFacility         = 1,
	AvailableHidden                          = 2,
	HiddenGuestFacilitySpot                  = 3,
	EP2GuestFacilityPolicy_MAX               = 4,
};

// Enum Hideout.EP2LeaderboardRankType
// NumValues: 0x000E
enum class EP2LeaderboardRankType : uint8
{
	None                                     = 0,
	LeaderboardPmcKill                       = 1,
	LeaderboardRaidExtractionNumber          = 2,
	LeaderboardRaidCurrency                  = 3,
	LeaderboardRaidSessionNumber             = 4,
	LeaderboardPmcDeathNumber                = 5,
	LeaderboardNpcDeathNumber                = 6,
	LeaderboardNpcKill                       = 7,
	LeaderboardBossKill                      = 8,
	LeaderboardPmcDamage                     = 9,
	LeaderboardRaidEarnedCurrency            = 10,
	LeaderboardRaidLossCurrency              = 11,
	LeaderboardTimeInRaid                    = 12,
	EP2LeaderboardRankType_MAX               = 13,
};

// Enum Hideout.EP2TransactionResult_Buy
// NumValues: 0x0006
enum class EP2TransactionResult_Buy : uint8
{
	Success                                  = 0,
	Fail                                     = 1,
	Fail_Space                               = 2,
	Fail_Funds                               = 3,
	Fail_SoldOut                             = 4,
	EP2TransactionResult_MAX                 = 5,
};

// Enum Hideout.EP2TransactionResult_Sell
// NumValues: 0x0005
enum class EP2TransactionResult_Sell : uint8
{
	Success                                  = 0,
	Fail                                     = 1,
	Fail_SlotItem                            = 2,
	Fail_ItemWithItems                       = 3,
	EP2TransactionResult_MAX                 = 4,
};

// Enum Hideout.EP2SquadMessageType
// NumValues: 0x0008
enum class EP2SquadMessageType : uint8
{
	Success                                  = 0,
	Error                                    = 1,
	Request                                  = 2,
	Accept                                   = 3,
	Reject                                   = 4,
	Kick                                     = 5,
	Leave                                    = 6,
	EP2SquadMessageType_MAX                  = 7,
};

// Enum Hideout.EP2HideoutInstanceEvent
// NumValues: 0x0005
enum class EP2HideoutInstanceEvent : uint8
{
	VisitOtherHideout                        = 0,
	VisitMyHideout                           = 1,
	ReturnMyHideout                          = 2,
	LeaveMyHideout                           = 3,
	EP2HideoutInstanceEvent_MAX              = 4,
};

// Enum Hideout.EP2TriggerEventState
// NumValues: 0x0006
enum class EP2TriggerEventState : uint8
{
	Disabled                                 = 0,
	Ready                                    = 1,
	Ongoing                                  = 2,
	Complete                                 = 3,
	Finalize                                 = 4,
	EP2TriggerEventState_MAX                 = 5,
};

// Enum Hideout.EP2MailRequestType
// NumValues: 0x0008
enum class EP2MailRequestType : uint8
{
	GetSummary                               = 0,
	GetMails                                 = 1,
	ClaimAttachedItem                        = 2,
	Read                                     = 3,
	Delete                                   = 4,
	Refresh                                  = 5,
	ClaimAndDelete                           = 6,
	EP2MailRequestType_MAX                   = 7,
};

// Enum Hideout.EP2MailFrom
// NumValues: 0x0003
enum class EP2MailFrom : uint8
{
	InGame                                   = 0,
	OutGame                                  = 1,
	EP2MailFrom_MAX                          = 2,
};

// Enum Hideout.EP2DroneUnlockState
// NumValues: 0x0004
enum class EP2DroneUnlockState : uint8
{
	Locked                                   = 0,
	Researched                               = 1,
	Unlocked                                 = 2,
	EP2DroneUnlockState_MAX                  = 3,
};

// Enum Hideout.ELaptopGNBType
// NumValues: 0x0009
enum class ELaptopGNBType : uint8
{
	None                                     = 0,
	Main                                     = 1,
	Trade                                    = 2,
	Contract                                 = 3,
	FactionWage                              = 4,
	CharacterInfo                            = 5,
	MessageHub                               = 6,
	LeaderBoard                              = 7,
	ELaptopGNBType_MAX                       = 8,
};

// Enum Hideout.EP2FacilitySlotStatus
// NumValues: 0x0005
enum class EP2FacilitySlotStatus : uint8
{
	Idle                                     = 0,
	Installing                               = 1,
	Installed                                = 2,
	Uninstalling                             = 3,
	EP2FacilitySlotStatus_MAX                = 4,
};

// Enum Hideout.EP2MessageClaimState
// NumValues: 0x0004
enum class EP2MessageClaimState : uint8
{
	Nothing                                  = 0,
	UnClaimed                                = 1,
	Claimed                                  = 2,
	EP2MessageClaimState_MAX                 = 3,
};

// Enum Hideout.EP2MessageState
// NumValues: 0x0004
enum class EP2MessageState : uint8
{
	UnRead                                   = 0,
	Read                                     = 1,
	Open                                     = 2,
	EP2MessageState_MAX                      = 3,
};

// Enum Hideout.EP2ModdableItemListType
// NumValues: 0x0003
enum class EP2ModdableItemListType : uint8
{
	Inventory                                = 0,
	CustomOrder                              = 1,
	EP2ModdableItemListType_MAX              = 2,
};

// Enum Hideout.EP2ResearchNodeWidgetState
// NumValues: 0x0008
enum class EP2ResearchNodeWidgetState : uint8
{
	Locked                                   = 0,
	Blocked                                  = 1,
	Available                                = 2,
	Ready                                    = 3,
	InProgress                               = 4,
	Claimable                                = 5,
	Completed                                = 6,
	EP2ResearchNodeWidgetState_MAX           = 7,
};

// Enum Hideout.EGridSnapPreviewMovingAnimation
// NumValues: 0x0004
enum class EGridSnapPreviewMovingAnimation : uint8
{
	Anim_None                                = 0,
	Anim_Up                                  = 1,
	Anim_Down                                = 2,
	Anim_MAX                                 = 3,
};

// Enum Hideout.EP2AttachItemRequestType
// NumValues: 0x0004
enum class EP2AttachItemRequestType : uint8
{
	Swap                                     = 0,
	Attach                                   = 1,
	Detach                                   = 2,
	EP2AttachItemRequestType_MAX             = 3,
};

// Enum Hideout.EP2FacilityInteractionPolicy
// NumValues: 0x0003
enum class EP2FacilityInteractionPolicy : uint32
{
	HideoutOwner                             = 0,
	Everyone                                 = 1,
	EP2FacilityInteractionPolicy_MAX         = 2,
};

// Enum Hideout.EP2AttachItemInteractionType
// NumValues: 0x0005
enum class EP2AttachItemInteractionType : uint8
{
	Swap                                     = 0,
	Attach                                   = 1,
	Detach                                   = 2,
	Invalid                                  = 3,
	EP2AttachItemInteractionType_MAX         = 4,
};

// Enum Hideout.EP2ScreenLockReason
// NumValues: 0x0006
enum class EP2ScreenLockReason : uint8
{
	WardrobeWorldLoading                     = 0,
	WardrobeWorldEnding                      = 1,
	WardrobeWorldSwitching                   = 2,
	CustomizationApplication                 = 3,
	MannequinLoading                         = 4,
	EP2ScreenLockReason_MAX                  = 5,
};

// Enum Hideout.EBuildModeWidgetState
// NumValues: 0x0006
enum class EBuildModeWidgetState : uint8
{
	Install                                  = 0,
	Edit                                     = 1,
	Move                                     = 2,
	Upgrade                                  = 3,
	Replace                                  = 4,
	EBuildModeWidgetState_MAX                = 5,
};

// Enum Hideout.EFacilityInstallWidgetType
// NumValues: 0x0003
enum class EFacilityInstallWidgetType : uint8
{
	Install                                  = 0,
	Replace                                  = 1,
	EFacilityInstallWidgetType_MAX           = 2,
};

// Enum Hideout.EP2GunWallType
// NumValues: 0x0003
enum class EP2GunWallType : uint8
{
	FixedSlot                                = 0,
	FreePlacement                            = 1,
	EP2GunWallType_MAX                       = 2,
};

// Enum Hideout.EP2GunWallSlotAlignType
// NumValues: 0x0004
enum class EP2GunWallSlotAlignType : uint8
{
	Negative                                 = 0,
	Center                                   = 1,
	Positive                                 = 2,
	EP2GunWallSlotAlignType_MAX              = 3,
};

// Enum Hideout.EP2ContextRequirement_ReturnToHideoutType
// NumValues: 0x0004
enum class EP2ContextRequirement_ReturnToHideoutType : uint8
{
	Exfiltrated                              = 0,
	Dead                                     = 1,
	Any                                      = 2,
	EP2ContextRequirement_MAX                = 3,
};

// Enum Hideout.EP2HideoutExpandingUnitState
// NumValues: 0x0005
enum class EP2HideoutExpandingUnitState : uint8
{
	Disabled                                 = 0,
	Ready                                    = 1,
	Ongoing                                  = 2,
	Complete                                 = 3,
	EP2HideoutExpandingUnitState_MAX         = 4,
};

// Enum Hideout.EP2TradingBuySellBtnType
// NumValues: 0x0003
enum class EP2TradingBuySellBtnType : uint8
{
	Buy                                      = 0,
	Sell                                     = 1,
	EP2TradingBuySellBtnType_MAX             = 2,
};

// Enum Hideout.EP2InviteStatus_Private
// NumValues: 0x000C
enum class EP2InviteStatus_Private : uint8
{
	Default                                  = 0,
	NoEntry                                  = 1,
	InviteSelf                               = 2,
	InProgress                               = 3,
	InviteRequestSuccess                     = 4,
	UnknownError                             = 5,
	NotFound                                 = 6,
	AlreadyInSquad                           = 7,
	SquadFull                                = 8,
	PlayerOffline                            = 9,
	PlayerInRaid                             = 10,
	EP2InviteStatus_MAX                      = 11,
};

// Enum Hideout.EP2InvitePopupType
// NumValues: 0x0003
enum class EP2InvitePopupType : uint8
{
	Invite                                   = 0,
	Leave                                    = 1,
	EP2InvitePopupType_MAX                   = 2,
};

// Enum Hideout.EP2LeaderboardListItemType
// NumValues: 0x0004
enum class EP2LeaderboardListItemType : uint8
{
	Ranked                                   = 0,
	Default                                  = 1,
	PlayerSelf                               = 2,
	EP2LeaderboardListItemType_MAX           = 3,
};

// Enum Hideout.EP2PresetItemState
// NumValues: 0x0005
enum class EP2PresetItemState : uint8
{
	Ready                                    = 0,
	Available                                = 1,
	PartiallyAvailable                       = 2,
	Unavailable                              = 3,
	EP2PresetItemState_MAX                   = 4,
};

// Enum Hideout.EP2PresetUnavailableReason
// NumValues: 0x0006
enum class EP2PresetUnavailableReason : uint8
{
	None                                     = 0,
	UnavailableInStore                       = 1,
	SoldOut                                  = 2,
	NoModdingFacility                        = 3,
	UnavailableContainer                     = 4,
	EP2PresetUnavailableReason_MAX           = 5,
};

// Enum Hideout.EP2WidgetMailCategory
// NumValues: 0x0004
enum class EP2WidgetMailCategory : uint8
{
	All                                      = 0,
	System                                   = 1,
	Faction                                  = 2,
	EP2WidgetMailCategory_MAX                = 3,
};

// Enum Hideout.EP2QuickPurchasePopupState
// NumValues: 0x0006
enum class EP2QuickPurchasePopupState : uint8
{
	Default                                  = 0,
	InsufficientFunds                        = 1,
	NotEnoughSpace                           = 2,
	NotSelectedItems                         = 3,
	OutOfStock                               = 4,
	EP2QuickPurchasePopupState_MAX           = 5,
};

// Enum Hideout.EP2GameplayConfigCategory
// NumValues: 0x0009
enum class EP2GameplayConfigCategory : uint8
{
	CUSTOM_ITEM                              = 0,
	CUSTOM_FACTION                           = 1,
	CUSTOM_PLAYERLEVEL                       = 2,
	CUSTOM_BALANCE                           = 3,
	CUSTOM_FACILITY                          = 4,
	CUSTOM_TRIGGEREVENT                      = 5,
	CUSTOM_RESEARCH                          = 6,
	COUNT                                    = 7,
	EP2GameplayConfigCategory_MAX            = 8,
};

// Enum Hideout.EP2PresetSaveFailReason
// NumValues: 0x0005
enum class EP2PresetSaveFailReason : uint8
{
	ExistedName                              = 0,
	MaxNum                                   = 1,
	LongName                                 = 2,
	None                                     = 3,
	EP2PresetSaveFailReason_MAX              = 4,
};

// Enum Hideout.EP2ProductionRecipeFindOption
// NumValues: 0x0003
enum class EP2ProductionRecipeFindOption : uint8
{
	Material                                 = 0,
	Result                                   = 1,
	EP2ProductionRecipeFindOption_MAX        = 2,
};

// Enum Hideout.P2PresetCategory
// NumValues: 0x000A
enum class EP2PresetCategory : uint8
{
	ITEM                                     = 0,
	FACTION                                  = 1,
	PLAYERLEVEL                              = 2,
	BALANCE                                  = 3,
	FACILITY                                 = 4,
	TRIGGEREVENT                             = 5,
	RESEARCH                                 = 6,
	CONTEXTHELPER                            = 7,
	COUNT                                    = 8,
	P2PresetCategory_MAX                     = 9,
};

// Enum Hideout.EP2ProductionQueueSlotState
// NumValues: 0x0004
enum class EP2ProductionQueueSlotState : uint8
{
	Empty                                    = 0,
	Inprogress                               = 1,
	Locked                                   = 2,
	EP2ProductionQueueSlotState_MAX          = 3,
};

// Enum Hideout.FP2ItemLootState
// NumValues: 0x0004
enum class EFP2ItemLootState : uint8
{
	Looted                                   = 0,
	Lost                                     = 1,
	Saved                                    = 2,
	FP2ItemLootState_MAX                     = 3,
};

// Enum Hideout.EP2RaidResultWidgetState
// NumValues: 0x0004
enum class EP2RaidResultWidgetState : uint8
{
	RaidSummary                              = 0,
	FatalityDetails                          = 1,
	RaidLog                                  = 2,
	EP2RaidResultWidgetState_MAX             = 3,
};

// Enum Hideout.EP2ClassRepNodeMapping_Hideout
// NumValues: 0x0007
enum class EP2ClassRepNodeMapping_Hideout : uint8
{
	RelevantForHideoutInstance               = 0,
	NotRouted                                = 1,
	RelevantAllConnections                   = 2,
	RelevantForHideoutInstanceOrAllConnections = 3,
	RelevantForConnection                    = 4,
	RelevantForHideoutInstanceAndConnection  = 5,
	EP2ClassRepNodeMapping_MAX               = 6,
};

// Enum Hideout.EP2ResearchSlotState
// NumValues: 0x0005
enum class EP2ResearchSlotState : uint8
{
	UnSet                                    = 0,
	Locked                                   = 1,
	Available                                = 2,
	InProgress                               = 3,
	EP2ResearchSlotState_MAX                 = 4,
};

// Enum Hideout.EP2ResupplyCategory
// NumValues: 0x0006
enum class EP2ResupplyCategory : uint8
{
	Magazine                                 = 0,
	Ammo                                     = 1,
	Consumable                               = 2,
	Throwable                                = 3,
	Utility                                  = 4,
	EP2ResupplyCategory_MAX                  = 5,
};

// Enum Hideout.EP2ScrollDir
// NumValues: 0x0004
enum class EP2ScrollDir : uint8
{
	Up                                       = 0,
	None                                     = 1,
	Down                                     = 2,
	EP2ScrollDir_MAX                         = 3,
};

// Enum Hideout.EP2TradingPopupType
// NumValues: 0x0003
enum class EP2TradingPopupType : uint8
{
	Barter                                   = 0,
	Upsell                                   = 1,
	EP2TradingPopupType_MAX                  = 2,
};

// Enum Hideout.EP2TransactionResult_Upsell
// NumValues: 0x0003
enum class EP2TransactionResult_Upsell : uint8
{
	Success                                  = 0,
	Fail                                     = 1,
	EP2TransactionResult_MAX                 = 2,
};

// Enum Hideout.EP2TradingErrorMsgType
// NumValues: 0x000C
enum class EP2TradingErrorMsgType : uint8
{
	TryBuyWhileSelling                       = 0,
	TrySellWhileBuying                       = 1,
	TryBarterWhileBuying                     = 2,
	TryUpsellWhileSelling                    = 3,
	TryGoFactionStoreWhileSelling            = 4,
	TryBuyUnavailableItem                    = 5,
	TrySellToFactionStore                    = 6,
	TryBuySoldOutItem                        = 7,
	TrySellWearableWithItems                 = 8,
	TrySellItemInItemSlot                    = 9,
	TooManyTradingItems                      = 10,
	EP2TradingErrorMsgType_MAX               = 11,
};

// Enum Hideout.EP2FacilityStatus
// NumValues: 0x0006
enum class EP2FacilityStatus : uint8
{
	Idle                                     = 0,
	Upgrading                                = 1,
	Discarding                               = 2,
	Working                                  = 3,
	WaitforComplete                          = 4,
	EP2FacilityStatus_MAX                    = 5,
};

// Enum Hideout.EP2FacilityInstalationType
// NumValues: 0x0004
enum class EP2FacilityInstalationType : uint8
{
	Normal                                   = 0,
	Core                                     = 1,
	Fixed                                    = 2,
	EP2FacilityInstalationType_MAX           = 3,
};

// Enum Hideout.EP2GridSnapDecorativeType
// NumValues: 0x0008
enum class EP2GridSnapDecorativeType : uint8
{
	None                                     = 0,
	Floor                                    = 1,
	Wall                                     = 2,
	Pillar                                   = 3,
	Ceiling                                  = 4,
	Decoration                               = 5,
	StaticGround                             = 6,
	EP2GridSnapDecorativeType_MAX            = 7,
};

// Enum Hideout.EP2DecorationInstallNormalDirection
// NumValues: 0x0004
enum class EP2DecorationInstallNormalDirection : uint8
{
	Down                                     = 0,
	Up                                       = 1,
	Side                                     = 2,
	EP2DecorationInstallNormalDirection_MAX  = 3,
};

// Enum Hideout.EP2DecorationRootDirection
// NumValues: 0x0007
enum class EP2DecorationRootDirection : uint8
{
	Down                                     = 0,
	Up                                       = 1,
	Forward                                  = 2,
	Backward                                 = 3,
	Left                                     = 4,
	Right                                    = 5,
	EP2DecorationRootDirection_MAX           = 6,
};

// Enum Hideout.EP2DeliveryDisabledType
// NumValues: 0x0009
enum class EP2DeliveryDisabledType : uint8
{
	None                                     = 0,
	LackOfLevel                              = 1,
	LackOfmoney                              = 2,
	LackOfItems                              = 3,
	LackOfItemsButCanQuickPurchase           = 4,
	AlreadyExists                            = 5,
	EmptyOfFacilityData                      = 6,
	Locked                                   = 7,
	EP2DeliveryDisabledType_MAX              = 8,
};

// Enum Hideout.EP2StatType
// NumValues: 0x000A
enum class EP2StatType : uint8
{
	None                                     = 0,
	Power                                    = 1,
	Accuracy                                 = 2,
	Control                                  = 3,
	Handling                                 = 4,
	ArmorProtection                          = 5,
	ArmorDurability                          = 6,
	Capacity                                 = 7,
	Weight                                   = 8,
	Max                                      = 9,
};

// Enum Hideout.EP2StatincreaseType
// NumValues: 0x0005
enum class EP2StatincreaseType : uint8
{
	None                                     = 0,
	Increase                                 = 1,
	Dncrease                                 = 2,
	Same                                     = 3,
	Max                                      = 4,
};

// Enum Hideout.EP2FacilityLockType
// NumValues: 0x0004
enum class EP2FacilityLockType : uint8
{
	None                                     = 0,
	RequireItem                              = 1,
	RequireResearch                          = 2,
	EP2FacilityLockType_MAX                  = 3,
};

// Enum Hideout.EP2FacilityDeleteUnavailableReason
// NumValues: 0x0008
enum class EP2FacilityDeleteUnavailableReason : uint8
{
	None                                     = 0,
	CoreFacility                             = 1,
	NotYetInstalled                          = 2,
	IsBusy                                   = 3,
	InstalledFacilityModule                  = 4,
	NeedSupportiveFacility                   = 5,
	WaitingServerResponse                    = 6,
	EP2FacilityDeleteUnavailableReason_MAX   = 7,
};

// Enum Hideout.EDirectFacilityGNBType
// NumValues: 0x0005
enum class EDirectFacilityGNBType : uint8
{
	None                                     = 0,
	Facility                                 = 1,
	Build                                    = 2,
	Decoration                               = 3,
	EDirectFacilityGNBType_MAX               = 4,
};

// Enum Hideout.EDirectFacilityLNBType
// NumValues: 0x000F
enum class EDirectFacilityLNBType : uint8
{
	None                                     = 0,
	All                                      = 1,
	Craft                                    = 2,
	Salvage                                  = 3,
	Functional                               = 4,
	Buff                                     = 5,
	All_Build                                = 6,
	Floor                                    = 7,
	Ceiling                                  = 8,
	Wall                                     = 9,
	All_Decoration                           = 10,
	Furniture                                = 11,
	Lighting                                 = 12,
	Decoration                               = 13,
	EDirectFacilityLNBType_MAX               = 14,
};

// Enum Hideout.EP2FacilityUpgradeModuleChangeType
// NumValues: 0x0004
enum class EP2FacilityUpgradeModuleChangeType : uint8
{
	Install                                  = 0,
	InstallWithQuickPurchase                 = 1,
	UnInstall                                = 2,
	EP2FacilityUpgradeModuleChangeType_MAX   = 3,
};

// Enum Hideout.EP2VRStationAction
// NumValues: 0x0004
enum class EP2VRStationAction : uint8
{
	StartSimulation                          = 0,
	RestartSimulation                        = 1,
	EndSimulation                            = 2,
	EP2VRStationAction_MAX                   = 3,
};

// Enum Hideout.EP2ItemsAddedOnStashType
// NumValues: 0x0004
enum class EP2ItemsAddedOnStashType : uint8
{
	Faction_Start                            = 0,
	Move                                     = 1,
	Admin                                    = 2,
	EP2ItemsAddedOnStashType_MAX             = 3,
};

// Enum Hideout.EP2LeaderboardType
// NumValues: 0x0005
enum class EP2LeaderboardType : uint8
{
	None                                     = 0,
	LeaderboardPmcKill                       = 1,
	LeaderboardRaidExtractionNumber          = 2,
	LeaderboardRaidCurrency                  = 3,
	Max                                      = 4,
};

// Enum Hideout.EP2ProductionType
// NumValues: 0x0003
enum class EP2ProductionType : uint8
{
	Crafting                                 = 0,
	Salvage                                  = 1,
	EP2ProductionType_MAX                    = 2,
};

// Enum Hideout.EP2ProductionItemGroupDirection
// NumValues: 0x0006
enum class EP2ProductionItemGroupDirection : uint8
{
	None                                     = 0,
	TopLeft                                  = 1,
	TopRight                                 = 2,
	BottomLeft                               = 3,
	BottomRight                              = 4,
	EP2ProductionItemGroupDirection_MAX      = 5,
};

// ScriptStruct Hideout.P2FacilitySpotStatusInfo
// 0x0010 (0x0010 - 0x0000)
struct FP2FacilitySpotStatusInfo final
{
public:
	class UP2FacilityData*                        FacilityData;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2FacilitySpotStatus                         FacilitySpotStatus;                                // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2FacilitySpotStatusInfo) == 0x000008, "Wrong alignment on FP2FacilitySpotStatusInfo");
static_assert(sizeof(FP2FacilitySpotStatusInfo) == 0x000010, "Wrong size on FP2FacilitySpotStatusInfo");
static_assert(offsetof(FP2FacilitySpotStatusInfo, FacilityData) == 0x000000, "Member 'FP2FacilitySpotStatusInfo::FacilityData' has a wrong offset!");
static_assert(offsetof(FP2FacilitySpotStatusInfo, FacilitySpotStatus) == 0x000008, "Member 'FP2FacilitySpotStatusInfo::FacilitySpotStatus' has a wrong offset!");

// ScriptStruct Hideout.P2FacilityModuleInstallPoint
// 0x00B0 (0x00B0 - 0x0000)
struct FP2FacilityModuleInstallPoint final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraComponentTag;                                // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoundaryCenter;                                    // 0x0078(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoundaryExtent;                                    // 0x0090(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2ItemData*                            PreviewItemData;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2FacilityModuleInstallPoint) == 0x000010, "Wrong alignment on FP2FacilityModuleInstallPoint");
static_assert(sizeof(FP2FacilityModuleInstallPoint) == 0x0000B0, "Wrong size on FP2FacilityModuleInstallPoint");
static_assert(offsetof(FP2FacilityModuleInstallPoint, Index) == 0x000000, "Member 'FP2FacilityModuleInstallPoint::Index' has a wrong offset!");
static_assert(offsetof(FP2FacilityModuleInstallPoint, Transform) == 0x000010, "Member 'FP2FacilityModuleInstallPoint::Transform' has a wrong offset!");
static_assert(offsetof(FP2FacilityModuleInstallPoint, CameraComponentTag) == 0x000070, "Member 'FP2FacilityModuleInstallPoint::CameraComponentTag' has a wrong offset!");
static_assert(offsetof(FP2FacilityModuleInstallPoint, BoundaryCenter) == 0x000078, "Member 'FP2FacilityModuleInstallPoint::BoundaryCenter' has a wrong offset!");
static_assert(offsetof(FP2FacilityModuleInstallPoint, BoundaryExtent) == 0x000090, "Member 'FP2FacilityModuleInstallPoint::BoundaryExtent' has a wrong offset!");
static_assert(offsetof(FP2FacilityModuleInstallPoint, PreviewItemData) == 0x0000A8, "Member 'FP2FacilityModuleInstallPoint::PreviewItemData' has a wrong offset!");

// ScriptStruct Hideout.P2FacilityDefaultMaterialInfo
// 0x0018 (0x0018 - 0x0000)
struct FP2FacilityDefaultMaterialInfo final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             DefaultMaterials;                                  // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2FacilityDefaultMaterialInfo) == 0x000008, "Wrong alignment on FP2FacilityDefaultMaterialInfo");
static_assert(sizeof(FP2FacilityDefaultMaterialInfo) == 0x000018, "Wrong size on FP2FacilityDefaultMaterialInfo");
static_assert(offsetof(FP2FacilityDefaultMaterialInfo, MeshComponent) == 0x000000, "Member 'FP2FacilityDefaultMaterialInfo::MeshComponent' has a wrong offset!");
static_assert(offsetof(FP2FacilityDefaultMaterialInfo, DefaultMaterials) == 0x000008, "Member 'FP2FacilityDefaultMaterialInfo::DefaultMaterials' has a wrong offset!");

// ScriptStruct Hideout.P2FacilityUpgradeSlotChangeInfo
// 0x0020 (0x0020 - 0x0000)
struct FP2FacilityUpgradeSlotChangeInfo final
{
public:
	EP2FacilityUpgradeModuleChangeType            InstallType;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Slot*                                Slot;                                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                Item;                                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2ItemData*                            ItemData;                                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2FacilityUpgradeSlotChangeInfo) == 0x000008, "Wrong alignment on FP2FacilityUpgradeSlotChangeInfo");
static_assert(sizeof(FP2FacilityUpgradeSlotChangeInfo) == 0x000020, "Wrong size on FP2FacilityUpgradeSlotChangeInfo");
static_assert(offsetof(FP2FacilityUpgradeSlotChangeInfo, InstallType) == 0x000000, "Member 'FP2FacilityUpgradeSlotChangeInfo::InstallType' has a wrong offset!");
static_assert(offsetof(FP2FacilityUpgradeSlotChangeInfo, Slot) == 0x000008, "Member 'FP2FacilityUpgradeSlotChangeInfo::Slot' has a wrong offset!");
static_assert(offsetof(FP2FacilityUpgradeSlotChangeInfo, Item) == 0x000010, "Member 'FP2FacilityUpgradeSlotChangeInfo::Item' has a wrong offset!");
static_assert(offsetof(FP2FacilityUpgradeSlotChangeInfo, ItemData) == 0x000018, "Member 'FP2FacilityUpgradeSlotChangeInfo::ItemData' has a wrong offset!");

// ScriptStruct Hideout.P2TargetData_FacilityBuildMode
// 0x0038 (0x0040 - 0x0008)
struct FP2TargetData_FacilityBuildMode final : public FGameplayAbilityTargetData
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2FacilityData*                        TargetFacilityData;                                // 0x0010(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2FacilitySpot*                        TargetFacilitySpot;                                // 0x0018(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2FacilityUpgradeSlotChangeInfo> UpgradeSlotChangeInfos;                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2TargetData_FacilityBuildMode) == 0x000008, "Wrong alignment on FP2TargetData_FacilityBuildMode");
static_assert(sizeof(FP2TargetData_FacilityBuildMode) == 0x000040, "Wrong size on FP2TargetData_FacilityBuildMode");
static_assert(offsetof(FP2TargetData_FacilityBuildMode, TargetFacilityData) == 0x000010, "Member 'FP2TargetData_FacilityBuildMode::TargetFacilityData' has a wrong offset!");
static_assert(offsetof(FP2TargetData_FacilityBuildMode, TargetFacilitySpot) == 0x000018, "Member 'FP2TargetData_FacilityBuildMode::TargetFacilitySpot' has a wrong offset!");
static_assert(offsetof(FP2TargetData_FacilityBuildMode, UpgradeSlotChangeInfos) == 0x000030, "Member 'FP2TargetData_FacilityBuildMode::UpgradeSlotChangeInfos' has a wrong offset!");

// ScriptStruct Hideout.P2ExchangeDataInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FP2ExchangeDataInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataRegistryId                        DataRegistryId;                                    // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2ExchangeDataInfo) == 0x000008, "Wrong alignment on FP2ExchangeDataInfo");
static_assert(sizeof(FP2ExchangeDataInfo) == 0x000020, "Wrong size on FP2ExchangeDataInfo");
static_assert(offsetof(FP2ExchangeDataInfo, DataRegistryId) == 0x000008, "Member 'FP2ExchangeDataInfo::DataRegistryId' has a wrong offset!");

// ScriptStruct Hideout.ModdingCameraZoomOutDistanceOffest
// 0x0028 (0x0028 - 0x0000)
struct FModdingCameraZoomOutDistanceOffest final
{
public:
	struct FGameplayTagContainer                  ItemTags;                                          // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         OffsetValue;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModdingCameraZoomOutDistanceOffest) == 0x000008, "Wrong alignment on FModdingCameraZoomOutDistanceOffest");
static_assert(sizeof(FModdingCameraZoomOutDistanceOffest) == 0x000028, "Wrong size on FModdingCameraZoomOutDistanceOffest");
static_assert(offsetof(FModdingCameraZoomOutDistanceOffest, ItemTags) == 0x000000, "Member 'FModdingCameraZoomOutDistanceOffest::ItemTags' has a wrong offset!");
static_assert(offsetof(FModdingCameraZoomOutDistanceOffest, OffsetValue) == 0x000020, "Member 'FModdingCameraZoomOutDistanceOffest::OffsetValue' has a wrong offset!");

// ScriptStruct Hideout.P2TargetData_FacilityUpgradePreview
// 0x0028 (0x0030 - 0x0008)
struct FP2TargetData_FacilityUpgradePreview final : public FGameplayAbilityTargetData
{
public:
	class UP2PlaceableData*                       PlaceableData;                                     // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UObject>                 SourceObject;                                      // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FP2FacilityUpgradeSlotChangeInfo> UpgradeSlotChangeInfos;                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2TargetData_FacilityUpgradePreview) == 0x000008, "Wrong alignment on FP2TargetData_FacilityUpgradePreview");
static_assert(sizeof(FP2TargetData_FacilityUpgradePreview) == 0x000030, "Wrong size on FP2TargetData_FacilityUpgradePreview");
static_assert(offsetof(FP2TargetData_FacilityUpgradePreview, PlaceableData) == 0x000008, "Member 'FP2TargetData_FacilityUpgradePreview::PlaceableData' has a wrong offset!");
static_assert(offsetof(FP2TargetData_FacilityUpgradePreview, SourceObject) == 0x000010, "Member 'FP2TargetData_FacilityUpgradePreview::SourceObject' has a wrong offset!");
static_assert(offsetof(FP2TargetData_FacilityUpgradePreview, UpgradeSlotChangeInfos) == 0x000020, "Member 'FP2TargetData_FacilityUpgradePreview::UpgradeSlotChangeInfos' has a wrong offset!");

// ScriptStruct Hideout.P2ModdingAttachedInfo
// 0x0010 (0x0010 - 0x0000)
struct FP2ModdingAttachedInfo final
{
public:
	class UP2SlotData*                            EquipSlotData;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2Item*                                AttachedItem;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2ModdingAttachedInfo) == 0x000008, "Wrong alignment on FP2ModdingAttachedInfo");
static_assert(sizeof(FP2ModdingAttachedInfo) == 0x000010, "Wrong size on FP2ModdingAttachedInfo");
static_assert(offsetof(FP2ModdingAttachedInfo, EquipSlotData) == 0x000000, "Member 'FP2ModdingAttachedInfo::EquipSlotData' has a wrong offset!");
static_assert(offsetof(FP2ModdingAttachedInfo, AttachedItem) == 0x000008, "Member 'FP2ModdingAttachedInfo::AttachedItem' has a wrong offset!");

// ScriptStruct Hideout.P2ProductionModuleConfig
// 0x000C (0x000C - 0x0000)
struct FP2ProductionModuleConfig final
{
public:
	float                                         BonusMultiplier;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomAmountMultiplier;                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeReduceMultiplier;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2ProductionModuleConfig) == 0x000004, "Wrong alignment on FP2ProductionModuleConfig");
static_assert(sizeof(FP2ProductionModuleConfig) == 0x00000C, "Wrong size on FP2ProductionModuleConfig");
static_assert(offsetof(FP2ProductionModuleConfig, BonusMultiplier) == 0x000000, "Member 'FP2ProductionModuleConfig::BonusMultiplier' has a wrong offset!");
static_assert(offsetof(FP2ProductionModuleConfig, RandomAmountMultiplier) == 0x000004, "Member 'FP2ProductionModuleConfig::RandomAmountMultiplier' has a wrong offset!");
static_assert(offsetof(FP2ProductionModuleConfig, TimeReduceMultiplier) == 0x000008, "Member 'FP2ProductionModuleConfig::TimeReduceMultiplier' has a wrong offset!");

// ScriptStruct Hideout.P2FacilityStatusInfo
// 0x000C (0x000C - 0x0000)
struct FP2FacilityStatusInfo final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FacilityStatusStartedTime;                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FacilityWorkDone;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2FacilityStatusInfo) == 0x000004, "Wrong alignment on FP2FacilityStatusInfo");
static_assert(sizeof(FP2FacilityStatusInfo) == 0x00000C, "Wrong size on FP2FacilityStatusInfo");
static_assert(offsetof(FP2FacilityStatusInfo, FacilityStatusStartedTime) == 0x000004, "Member 'FP2FacilityStatusInfo::FacilityStatusStartedTime' has a wrong offset!");
static_assert(offsetof(FP2FacilityStatusInfo, FacilityWorkDone) == 0x000008, "Member 'FP2FacilityStatusInfo::FacilityWorkDone' has a wrong offset!");

// ScriptStruct Hideout.P2ProductionEventData
// 0x0040 (0x0040 - 0x0000)
struct FP2ProductionEventData final
{
public:
	struct FP2ExchangeDataInfo                    ExchangeDataInfo;                                  // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FP2ExchangeInfo>                ResultItems;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FP2ProductionModuleConfig              ModuleConfig;                                      // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2ProductionEventData) == 0x000008, "Wrong alignment on FP2ProductionEventData");
static_assert(sizeof(FP2ProductionEventData) == 0x000040, "Wrong size on FP2ProductionEventData");
static_assert(offsetof(FP2ProductionEventData, ExchangeDataInfo) == 0x000000, "Member 'FP2ProductionEventData::ExchangeDataInfo' has a wrong offset!");
static_assert(offsetof(FP2ProductionEventData, ResultItems) == 0x000020, "Member 'FP2ProductionEventData::ResultItems' has a wrong offset!");
static_assert(offsetof(FP2ProductionEventData, ModuleConfig) == 0x000030, "Member 'FP2ProductionEventData::ModuleConfig' has a wrong offset!");

// ScriptStruct Hideout.P2CandidateMaterialItemInfo
// 0x0010 (0x0010 - 0x0000)
struct FP2CandidateMaterialItemInfo final
{
public:
	class UP2Item*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StackSplitCount;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2CandidateMaterialItemInfo) == 0x000008, "Wrong alignment on FP2CandidateMaterialItemInfo");
static_assert(sizeof(FP2CandidateMaterialItemInfo) == 0x000010, "Wrong size on FP2CandidateMaterialItemInfo");
static_assert(offsetof(FP2CandidateMaterialItemInfo, Item) == 0x000000, "Member 'FP2CandidateMaterialItemInfo::Item' has a wrong offset!");
static_assert(offsetof(FP2CandidateMaterialItemInfo, StackSplitCount) == 0x000008, "Member 'FP2CandidateMaterialItemInfo::StackSplitCount' has a wrong offset!");

// ScriptStruct Hideout.P2ModdingUnOwnedAttachedInfo
// 0x0010 (0x0010 - 0x0000)
struct FP2ModdingUnOwnedAttachedInfo final
{
public:
	class UP2SlotData*                            EquipSlotData;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2ItemData*                            AttachedItemData;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2ModdingUnOwnedAttachedInfo) == 0x000008, "Wrong alignment on FP2ModdingUnOwnedAttachedInfo");
static_assert(sizeof(FP2ModdingUnOwnedAttachedInfo) == 0x000010, "Wrong size on FP2ModdingUnOwnedAttachedInfo");
static_assert(offsetof(FP2ModdingUnOwnedAttachedInfo, EquipSlotData) == 0x000000, "Member 'FP2ModdingUnOwnedAttachedInfo::EquipSlotData' has a wrong offset!");
static_assert(offsetof(FP2ModdingUnOwnedAttachedInfo, AttachedItemData) == 0x000008, "Member 'FP2ModdingUnOwnedAttachedInfo::AttachedItemData' has a wrong offset!");

// ScriptStruct Hideout.P2DroneModUnlockStateDelta
// 0x0028 (0x0028 - 0x0000)
struct FP2DroneModUnlockStateDelta final
{
public:
	struct FGameplayTagContainer                  ModifiedTags;                                      // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EP2DroneUnlockState                           NewUnlockState;                                    // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2DroneModUnlockStateDelta) == 0x000008, "Wrong alignment on FP2DroneModUnlockStateDelta");
static_assert(sizeof(FP2DroneModUnlockStateDelta) == 0x000028, "Wrong size on FP2DroneModUnlockStateDelta");
static_assert(offsetof(FP2DroneModUnlockStateDelta, ModifiedTags) == 0x000000, "Member 'FP2DroneModUnlockStateDelta::ModifiedTags' has a wrong offset!");
static_assert(offsetof(FP2DroneModUnlockStateDelta, NewUnlockState) == 0x000020, "Member 'FP2DroneModUnlockStateDelta::NewUnlockState' has a wrong offset!");

// ScriptStruct Hideout.P2CraftingRecipeRow
// 0x0078 (0x0138 - 0x00C0)
struct FP2CraftingRecipeRow final : public FP2CraftingDataRow
{
public:
	TSoftObjectPtr<class UP2FacilityModuleData>   UpgradeRequirement;                                // 0x00C0(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UP2ResearchNodeData>> ResearchRequirements;                          // 0x00F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UP2ContractData>         ContractRequirement;                               // 0x0100(0x0030)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredPMCLevel;                                  // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2CraftingRecipeRow) == 0x000008, "Wrong alignment on FP2CraftingRecipeRow");
static_assert(sizeof(FP2CraftingRecipeRow) == 0x000138, "Wrong size on FP2CraftingRecipeRow");
static_assert(offsetof(FP2CraftingRecipeRow, UpgradeRequirement) == 0x0000C0, "Member 'FP2CraftingRecipeRow::UpgradeRequirement' has a wrong offset!");
static_assert(offsetof(FP2CraftingRecipeRow, ResearchRequirements) == 0x0000F0, "Member 'FP2CraftingRecipeRow::ResearchRequirements' has a wrong offset!");
static_assert(offsetof(FP2CraftingRecipeRow, ContractRequirement) == 0x000100, "Member 'FP2CraftingRecipeRow::ContractRequirement' has a wrong offset!");
static_assert(offsetof(FP2CraftingRecipeRow, RequiredPMCLevel) == 0x000130, "Member 'FP2CraftingRecipeRow::RequiredPMCLevel' has a wrong offset!");

// ScriptStruct Hideout.P2ClothingUpgradeNodeDataInfo
// 0x0008 (0x0010 - 0x0008)
struct FP2ClothingUpgradeNodeDataInfo final : public FP2RequirementDataInfo
{
public:
	class UP2ClothingUpgradeNodeData*             Data;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2ClothingUpgradeNodeDataInfo) == 0x000008, "Wrong alignment on FP2ClothingUpgradeNodeDataInfo");
static_assert(sizeof(FP2ClothingUpgradeNodeDataInfo) == 0x000010, "Wrong size on FP2ClothingUpgradeNodeDataInfo");
static_assert(offsetof(FP2ClothingUpgradeNodeDataInfo, Data) == 0x000008, "Member 'FP2ClothingUpgradeNodeDataInfo::Data' has a wrong offset!");

// ScriptStruct Hideout.P2CharacterRankInfo
// 0x0020 (0x0020 - 0x0000)
struct FP2CharacterRankInfo final
{
public:
	EP2LeaderboardRankType                        LeaderboardRankType;                               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Score;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rank;                                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Percentile;                                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2CharacterRankInfo) == 0x000008, "Wrong alignment on FP2CharacterRankInfo");
static_assert(sizeof(FP2CharacterRankInfo) == 0x000020, "Wrong size on FP2CharacterRankInfo");
static_assert(offsetof(FP2CharacterRankInfo, LeaderboardRankType) == 0x000000, "Member 'FP2CharacterRankInfo::LeaderboardRankType' has a wrong offset!");
static_assert(offsetof(FP2CharacterRankInfo, Score) == 0x000008, "Member 'FP2CharacterRankInfo::Score' has a wrong offset!");
static_assert(offsetof(FP2CharacterRankInfo, Rank) == 0x000010, "Member 'FP2CharacterRankInfo::Rank' has a wrong offset!");
static_assert(offsetof(FP2CharacterRankInfo, Percentile) == 0x000018, "Member 'FP2CharacterRankInfo::Percentile' has a wrong offset!");

// ScriptStruct Hideout.P2RaidResultExpLogWidgetInfo
// 0x0020 (0x0020 - 0x0000)
struct FP2RaidResultExpLogWidgetInfo final
{
public:
	class FText                                   ExpReasonText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ExpValue;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2RaidResultExpLogWidgetInfo) == 0x000008, "Wrong alignment on FP2RaidResultExpLogWidgetInfo");
static_assert(sizeof(FP2RaidResultExpLogWidgetInfo) == 0x000020, "Wrong size on FP2RaidResultExpLogWidgetInfo");
static_assert(offsetof(FP2RaidResultExpLogWidgetInfo, ExpReasonText) == 0x000000, "Member 'FP2RaidResultExpLogWidgetInfo::ExpReasonText' has a wrong offset!");
static_assert(offsetof(FP2RaidResultExpLogWidgetInfo, ExpValue) == 0x000018, "Member 'FP2RaidResultExpLogWidgetInfo::ExpValue' has a wrong offset!");

// ScriptStruct Hideout.P2SquadMessage
// 0x0060 (0x0060 - 0x0000)
struct FP2SquadMessage final
{
public:
	struct FGameplayTag                           MessageType;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2SquadMessageType                           Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 From;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 To;                                                // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMessage;                                      // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ErrorDisplayText;                                  // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ErrorCode;                                         // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2SquadMessage) == 0x000008, "Wrong alignment on FP2SquadMessage");
static_assert(sizeof(FP2SquadMessage) == 0x000060, "Wrong size on FP2SquadMessage");
static_assert(offsetof(FP2SquadMessage, MessageType) == 0x000000, "Member 'FP2SquadMessage::MessageType' has a wrong offset!");
static_assert(offsetof(FP2SquadMessage, Type) == 0x000008, "Member 'FP2SquadMessage::Type' has a wrong offset!");
static_assert(offsetof(FP2SquadMessage, From) == 0x000010, "Member 'FP2SquadMessage::From' has a wrong offset!");
static_assert(offsetof(FP2SquadMessage, To) == 0x000020, "Member 'FP2SquadMessage::To' has a wrong offset!");
