#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "LoadingScreen_structs.hpp"


namespace SDK
{

// Class LoadingScreen.AsyncLoadingScreenLibrary
// 0x0000 (0x0028 - 0x0028)
class UAsyncLoadingScreenLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetDisplayBackgroundIndex(int32 BackgroundIndex)	 // 0x46ee678;
	static void SetDisplayMovieIndex(int32 MovieIndex)	 // 0x46ee728;
	static void SetDisplayTipTextIndex(int32 TipTextIndex)	 // 0x46ee7d0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AsyncLoadingScreenLibrary">();
	}
	static class UAsyncLoadingScreenLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAsyncLoadingScreenLibrary>();
	}
};
static_assert(alignof(UAsyncLoadingScreenLibrary) == 0x000008, "Wrong alignment on UAsyncLoadingScreenLibrary");
static_assert(sizeof(UAsyncLoadingScreenLibrary) == 0x000028, "Wrong size on UAsyncLoadingScreenLibrary");

// Class LoadingScreen.LoadingProcessInterface
// 0x0000 (0x0000 - 0x0000)
class ILoadingProcessInterface final
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LoadingProcessInterface">();
	}
	static class ILoadingProcessInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ILoadingProcessInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(ILoadingProcessInterface) == 0x000001, "Wrong alignment on ILoadingProcessInterface");
static_assert(sizeof(ILoadingProcessInterface) == 0x000001, "Wrong size on ILoadingProcessInterface");

// Class LoadingScreen.LoadingProcessTask
// 0x0018 (0x0040 - 0x0028)
class ULoadingProcessTask final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class ULoadingProcessTask* CreateLoadingScreenProcessTask(class UObject* WorldContextObject, const class FString& ShowLoadingScreenReason)	 // 0x17b2b34;

	void SetShowLoadingScreenReason(const class FString& InReason)	 // 0x46ee880;
	void Unregister()	 // 0x17b2a7c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LoadingProcessTask">();
	}
	static class ULoadingProcessTask* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULoadingProcessTask>();
	}
};
static_assert(alignof(ULoadingProcessTask) == 0x000008, "Wrong alignment on ULoadingProcessTask");
static_assert(sizeof(ULoadingProcessTask) == 0x000040, "Wrong size on ULoadingProcessTask");

// Class LoadingScreen.LoadingScreenDataAsset
// 0x07E0 (0x0810 - 0x0030)
class ULoadingScreenDataAsset final : public UDataAsset
{
public:
	struct FALoadingScreenSettings                LoadingScreen;                                     // 0x0030(0x07E0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LoadingScreenDataAsset">();
	}
	static class ULoadingScreenDataAsset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULoadingScreenDataAsset>();
	}
};
static_assert(alignof(ULoadingScreenDataAsset) == 0x000010, "Wrong alignment on ULoadingScreenDataAsset");
static_assert(sizeof(ULoadingScreenDataAsset) == 0x000810, "Wrong size on ULoadingScreenDataAsset");
static_assert(offsetof(ULoadingScreenDataAsset, LoadingScreen) == 0x000030, "Member 'ULoadingScreenDataAsset::LoadingScreen' has a wrong offset!");

// Class LoadingScreen.LoadingScreenManager
// 0x0078 (0x00A8 - 0x0030)
class ULoadingScreenManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingScreenDataAsset*                NextLoadingScreen;                                 // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static bool IsShowingLoadingScreen(const class UObject* WorldContextObject)	 // 0x46ee508;
	static void SetDefaultLoadingScreen(const class UObject* WorldContextObject)	 // 0x46ee5c8;
	static void SetNextLoadingScreen(const class UObject* WorldContextObject, const class ULoadingScreenDataAsset* InLoadingScreenSettings)	 // 0x16f1548;
	static void ShowLoadingScreen(const class UObject* WorldContextObject, const class ULoadingScreenDataAsset* InLoadingScreenSettings)	 // 0x46ee954;

	class FString GetDebugReasonForShowingOrHidingLoadingScreen() const	 // 0x46ee4c0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LoadingScreenManager">();
	}
	static class ULoadingScreenManager* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULoadingScreenManager>();
	}
};
static_assert(alignof(ULoadingScreenManager) == 0x000008, "Wrong alignment on ULoadingScreenManager");
static_assert(sizeof(ULoadingScreenManager) == 0x0000A8, "Wrong size on ULoadingScreenManager");
static_assert(offsetof(ULoadingScreenManager, NextLoadingScreen) == 0x0000A0, "Member 'ULoadingScreenManager::NextLoadingScreen' has a wrong offset!");

// Class LoadingScreen.LoadingScreenSettings
// 0x1658 (0x1690 - 0x0038)
class ULoadingScreenSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	float                                         LoadingScreenHeartbeatHangDuration;                // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LogLoadingScreenHeartbeatInterval;                 // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogLoadingScreenReasonEveryFrame;                  // 0x0040(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceLoadingScreenVisible;                         // 0x0041(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceLoadingScreenInvisible;                       // 0x0042(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HoldLoadingScreenAdditionalSecsEvenInEditor;       // 0x0043(0x0001)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceTickLoadingScreenEvenInEditor;                // 0x0044(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0xB];                                       // 0x0045(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALoadingScreenSettings                StartupLoadingScreen;                              // 0x0050(0x07E0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FALoadingScreenSettings                DefaultLoadingScreen;                              // 0x0830(0x07E0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FClassicLayoutSettings                 Classic;                                           // 0x1010(0x00F0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FCenterLayoutSettings                  Center;                                            // 0x1100(0x00F0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FLetterboxLayoutSettings               Letterbox;                                         // 0x11F0(0x01D0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FSidebarLayoutSettings                 Sidebar;                                           // 0x13C0(0x0100)(Edit, Config, NativeAccessSpecifierPublic)
	struct FDualSidebarLayoutSettings             DualSidebar;                                       // 0x14C0(0x01D0)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LoadingScreenSettings">();
	}
	static class ULoadingScreenSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULoadingScreenSettings>();
	}
};
static_assert(alignof(ULoadingScreenSettings) == 0x000010, "Wrong alignment on ULoadingScreenSettings");
static_assert(sizeof(ULoadingScreenSettings) == 0x001690, "Wrong size on ULoadingScreenSettings");
static_assert(offsetof(ULoadingScreenSettings, LoadingScreenHeartbeatHangDuration) == 0x000038, "Member 'ULoadingScreenSettings::LoadingScreenHeartbeatHangDuration' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, LogLoadingScreenHeartbeatInterval) == 0x00003C, "Member 'ULoadingScreenSettings::LogLoadingScreenHeartbeatInterval' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, LogLoadingScreenReasonEveryFrame) == 0x000040, "Member 'ULoadingScreenSettings::LogLoadingScreenReasonEveryFrame' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, ForceLoadingScreenVisible) == 0x000041, "Member 'ULoadingScreenSettings::ForceLoadingScreenVisible' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, ForceLoadingScreenInvisible) == 0x000042, "Member 'ULoadingScreenSettings::ForceLoadingScreenInvisible' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, HoldLoadingScreenAdditionalSecsEvenInEditor) == 0x000043, "Member 'ULoadingScreenSettings::HoldLoadingScreenAdditionalSecsEvenInEditor' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, ForceTickLoadingScreenEvenInEditor) == 0x000044, "Member 'ULoadingScreenSettings::ForceTickLoadingScreenEvenInEditor' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, StartupLoadingScreen) == 0x000050, "Member 'ULoadingScreenSettings::StartupLoadingScreen' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, DefaultLoadingScreen) == 0x000830, "Member 'ULoadingScreenSettings::DefaultLoadingScreen' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, Classic) == 0x001010, "Member 'ULoadingScreenSettings::Classic' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, Center) == 0x001100, "Member 'ULoadingScreenSettings::Center' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, Letterbox) == 0x0011F0, "Member 'ULoadingScreenSettings::Letterbox' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, Sidebar) == 0x0013C0, "Member 'ULoadingScreenSettings::Sidebar' has a wrong offset!");
static_assert(offsetof(ULoadingScreenSettings, DualSidebar) == 0x0014C0, "Member 'ULoadingScreenSettings::DualSidebar' has a wrong offset!");

}

