#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function LoadingScreen.AsyncLoadingScreenLibrary.SetDisplayBackgroundIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex final
{
public:
	int32                                         BackgroundIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex, BackgroundIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayBackgroundIndex::BackgroundIndex' has a wrong offset!");

// Function LoadingScreen.AsyncLoadingScreenLibrary.SetDisplayMovieIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayMovieIndex final
{
public:
	int32                                         MovieIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayMovieIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayMovieIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayMovieIndex, MovieIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayMovieIndex::MovieIndex' has a wrong offset!");

// Function LoadingScreen.AsyncLoadingScreenLibrary.SetDisplayTipTextIndex
// 0x0004 (0x0004 - 0x0000)
struct AsyncLoadingScreenLibrary_SetDisplayTipTextIndex final
{
public:
	int32                                         TipTextIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex) == 0x000004, "Wrong alignment on AsyncLoadingScreenLibrary_SetDisplayTipTextIndex");
static_assert(sizeof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex) == 0x000004, "Wrong size on AsyncLoadingScreenLibrary_SetDisplayTipTextIndex");
static_assert(offsetof(AsyncLoadingScreenLibrary_SetDisplayTipTextIndex, TipTextIndex) == 0x000000, "Member 'AsyncLoadingScreenLibrary_SetDisplayTipTextIndex::TipTextIndex' has a wrong offset!");

// Function LoadingScreen.LoadingProcessTask.CreateLoadingScreenProcessTask
// 0x0020 (0x0020 - 0x0000)
struct LoadingProcessTask_CreateLoadingScreenProcessTask final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowLoadingScreenReason;                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoadingProcessTask*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000008, "Wrong alignment on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(sizeof(LoadingProcessTask_CreateLoadingScreenProcessTask) == 0x000020, "Wrong size on LoadingProcessTask_CreateLoadingScreenProcessTask");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, WorldContextObject) == 0x000000, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ShowLoadingScreenReason) == 0x000008, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ShowLoadingScreenReason' has a wrong offset!");
static_assert(offsetof(LoadingProcessTask_CreateLoadingScreenProcessTask, ReturnValue) == 0x000018, "Member 'LoadingProcessTask_CreateLoadingScreenProcessTask::ReturnValue' has a wrong offset!");

// Function LoadingScreen.LoadingProcessTask.SetShowLoadingScreenReason
// 0x0010 (0x0010 - 0x0000)
struct LoadingProcessTask_SetShowLoadingScreenReason final
{
public:
	class FString                                 InReason;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000008, "Wrong alignment on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(sizeof(LoadingProcessTask_SetShowLoadingScreenReason) == 0x000010, "Wrong size on LoadingProcessTask_SetShowLoadingScreenReason");
static_assert(offsetof(LoadingProcessTask_SetShowLoadingScreenReason, InReason) == 0x000000, "Member 'LoadingProcessTask_SetShowLoadingScreenReason::InReason' has a wrong offset!");

// Function LoadingScreen.LoadingScreenManager.IsShowingLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_IsShowingLoadingScreen final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LoadingScreenManager_IsShowingLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_IsShowingLoadingScreen");
static_assert(sizeof(LoadingScreenManager_IsShowingLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_IsShowingLoadingScreen");
static_assert(offsetof(LoadingScreenManager_IsShowingLoadingScreen, WorldContextObject) == 0x000000, "Member 'LoadingScreenManager_IsShowingLoadingScreen::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingScreenManager_IsShowingLoadingScreen, ReturnValue) == 0x000008, "Member 'LoadingScreenManager_IsShowingLoadingScreen::ReturnValue' has a wrong offset!");

// Function LoadingScreen.LoadingScreenManager.SetDefaultLoadingScreen
// 0x0008 (0x0008 - 0x0000)
struct LoadingScreenManager_SetDefaultLoadingScreen final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_SetDefaultLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_SetDefaultLoadingScreen");
static_assert(sizeof(LoadingScreenManager_SetDefaultLoadingScreen) == 0x000008, "Wrong size on LoadingScreenManager_SetDefaultLoadingScreen");
static_assert(offsetof(LoadingScreenManager_SetDefaultLoadingScreen, WorldContextObject) == 0x000000, "Member 'LoadingScreenManager_SetDefaultLoadingScreen::WorldContextObject' has a wrong offset!");

// Function LoadingScreen.LoadingScreenManager.SetNextLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_SetNextLoadingScreen final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULoadingScreenDataAsset*          InLoadingScreenSettings;                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_SetNextLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_SetNextLoadingScreen");
static_assert(sizeof(LoadingScreenManager_SetNextLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_SetNextLoadingScreen");
static_assert(offsetof(LoadingScreenManager_SetNextLoadingScreen, WorldContextObject) == 0x000000, "Member 'LoadingScreenManager_SetNextLoadingScreen::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingScreenManager_SetNextLoadingScreen, InLoadingScreenSettings) == 0x000008, "Member 'LoadingScreenManager_SetNextLoadingScreen::InLoadingScreenSettings' has a wrong offset!");

// Function LoadingScreen.LoadingScreenManager.ShowLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_ShowLoadingScreen final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULoadingScreenDataAsset*          InLoadingScreenSettings;                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_ShowLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_ShowLoadingScreen");
static_assert(sizeof(LoadingScreenManager_ShowLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_ShowLoadingScreen");
static_assert(offsetof(LoadingScreenManager_ShowLoadingScreen, WorldContextObject) == 0x000000, "Member 'LoadingScreenManager_ShowLoadingScreen::WorldContextObject' has a wrong offset!");
static_assert(offsetof(LoadingScreenManager_ShowLoadingScreen, InLoadingScreenSettings) == 0x000008, "Member 'LoadingScreenManager_ShowLoadingScreen::InLoadingScreenSettings' has a wrong offset!");

// Function LoadingScreen.LoadingScreenManager.GetDebugReasonForShowingOrHidingLoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000008, "Wrong alignment on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(sizeof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen) == 0x000010, "Wrong size on LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen");
static_assert(offsetof(LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen, ReturnValue) == 0x000000, "Member 'LoadingScreenManager_GetDebugReasonForShowingOrHidingLoadingScreen::ReturnValue' has a wrong offset!");

}

