#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "MoviePlayer_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum LoadingScreen.EAsyncLoadingScreenLayout
// NumValues: 0x0006
enum class EAsyncLoadingScreenLayout : uint8
{
	ALSL_Classic                             = 0,
	ALSL_Center                              = 1,
	ALSL_Letterbox                           = 2,
	ALSL_Sidebar                             = 3,
	ALSL_DualSidebar                         = 4,
	ALSL_MAX                                 = 5,
};

// Enum LoadingScreen.ELoadingIconType
// NumValues: 0x0005
enum class ELoadingIconType : uint8
{
	LIT_Throbber                             = 0,
	LIT_CircularThrobber                     = 1,
	LIT_ImageSequence                        = 2,
	LIT_SingleImage                          = 3,
	LIT_MAX                                  = 4,
};

// Enum LoadingScreen.ELoadingWidgetType
// NumValues: 0x0003
enum class ELoadingWidgetType : uint8
{
	LWT_Horizontal                           = 0,
	LWT_Vertical                             = 1,
	LWT_MAX                                  = 2,
};

// ScriptStruct LoadingScreen.WidgetAlignment
// 0x0002 (0x0002 - 0x0000)
struct FWidgetAlignment final
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWidgetAlignment) == 0x000001, "Wrong alignment on FWidgetAlignment");
static_assert(sizeof(FWidgetAlignment) == 0x000002, "Wrong size on FWidgetAlignment");
static_assert(offsetof(FWidgetAlignment, HorizontalAlignment) == 0x000000, "Member 'FWidgetAlignment::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FWidgetAlignment, VerticalAlignment) == 0x000001, "Member 'FWidgetAlignment::VerticalAlignment' has a wrong offset!");

// ScriptStruct LoadingScreen.TextAppearance
// 0x0098 (0x0098 - 0x0000)
struct FTextAppearance final
{
public:
	struct FSlateColor                            ColorAndOpacity;                                   // 0x0000(0x0014)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x0018(0x0058)(Edit, BlueprintVisible, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ShadowOffset;                                      // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextJustify                                  Justification;                                     // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTextAppearance) == 0x000008, "Wrong alignment on FTextAppearance");
static_assert(sizeof(FTextAppearance) == 0x000098, "Wrong size on FTextAppearance");
static_assert(offsetof(FTextAppearance, ColorAndOpacity) == 0x000000, "Member 'FTextAppearance::ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextAppearance, Font) == 0x000018, "Member 'FTextAppearance::Font' has a wrong offset!");
static_assert(offsetof(FTextAppearance, ShadowOffset) == 0x000070, "Member 'FTextAppearance::ShadowOffset' has a wrong offset!");
static_assert(offsetof(FTextAppearance, ShadowColorAndOpacity) == 0x000080, "Member 'FTextAppearance::ShadowColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextAppearance, Justification) == 0x000090, "Member 'FTextAppearance::Justification' has a wrong offset!");

// ScriptStruct LoadingScreen.ThrobberSettings
// 0x00E0 (0x00E0 - 0x0000)
struct FThrobberSettings final
{
public:
	int32                                         NumberOfPieces;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateHorizontally;                              // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateVertically;                                // 0x0005(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateOpacity;                                   // 0x0006(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x9];                                        // 0x0007(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Image;                                             // 0x0010(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FThrobberSettings) == 0x000010, "Wrong alignment on FThrobberSettings");
static_assert(sizeof(FThrobberSettings) == 0x0000E0, "Wrong size on FThrobberSettings");
static_assert(offsetof(FThrobberSettings, NumberOfPieces) == 0x000000, "Member 'FThrobberSettings::NumberOfPieces' has a wrong offset!");
static_assert(offsetof(FThrobberSettings, bAnimateHorizontally) == 0x000004, "Member 'FThrobberSettings::bAnimateHorizontally' has a wrong offset!");
static_assert(offsetof(FThrobberSettings, bAnimateVertically) == 0x000005, "Member 'FThrobberSettings::bAnimateVertically' has a wrong offset!");
static_assert(offsetof(FThrobberSettings, bAnimateOpacity) == 0x000006, "Member 'FThrobberSettings::bAnimateOpacity' has a wrong offset!");
static_assert(offsetof(FThrobberSettings, Image) == 0x000010, "Member 'FThrobberSettings::Image' has a wrong offset!");

// ScriptStruct LoadingScreen.CircularThrobberSettings
// 0x00E0 (0x00E0 - 0x0000)
struct FCircularThrobberSettings final
{
public:
	int32                                         NumberOfPieces;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Period;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Image;                                             // 0x0010(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCircularThrobberSettings) == 0x000010, "Wrong alignment on FCircularThrobberSettings");
static_assert(sizeof(FCircularThrobberSettings) == 0x0000E0, "Wrong size on FCircularThrobberSettings");
static_assert(offsetof(FCircularThrobberSettings, NumberOfPieces) == 0x000000, "Member 'FCircularThrobberSettings::NumberOfPieces' has a wrong offset!");
static_assert(offsetof(FCircularThrobberSettings, Period) == 0x000004, "Member 'FCircularThrobberSettings::Period' has a wrong offset!");
static_assert(offsetof(FCircularThrobberSettings, Radius) == 0x000008, "Member 'FCircularThrobberSettings::Radius' has a wrong offset!");
static_assert(offsetof(FCircularThrobberSettings, Image) == 0x000010, "Member 'FCircularThrobberSettings::Image' has a wrong offset!");

// ScriptStruct LoadingScreen.ImageSequenceSettings
// 0x0028 (0x0028 - 0x0000)
struct FImageSequenceSettings final
{
public:
	TArray<class UTexture2D*>                     Images;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              Scale;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Interval;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayReverse;                                      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FImageSequenceSettings) == 0x000008, "Wrong alignment on FImageSequenceSettings");
static_assert(sizeof(FImageSequenceSettings) == 0x000028, "Wrong size on FImageSequenceSettings");
static_assert(offsetof(FImageSequenceSettings, Images) == 0x000000, "Member 'FImageSequenceSettings::Images' has a wrong offset!");
static_assert(offsetof(FImageSequenceSettings, Scale) == 0x000010, "Member 'FImageSequenceSettings::Scale' has a wrong offset!");
static_assert(offsetof(FImageSequenceSettings, Interval) == 0x000020, "Member 'FImageSequenceSettings::Interval' has a wrong offset!");
static_assert(offsetof(FImageSequenceSettings, bPlayReverse) == 0x000024, "Member 'FImageSequenceSettings::bPlayReverse' has a wrong offset!");

// ScriptStruct LoadingScreen.BackgroundSettings
// 0x0038 (0x0038 - 0x0000)
struct FBackgroundSettings final
{
public:
	TArray<struct FSoftObjectPath>                Images;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EStretch                                      ImageStretch;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           BackgroundColor;                                   // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDisplayBackgroundManually;                     // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolidFill;                                        // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBackgroundSettings) == 0x000008, "Wrong alignment on FBackgroundSettings");
static_assert(sizeof(FBackgroundSettings) == 0x000038, "Wrong size on FBackgroundSettings");
static_assert(offsetof(FBackgroundSettings, Images) == 0x000000, "Member 'FBackgroundSettings::Images' has a wrong offset!");
static_assert(offsetof(FBackgroundSettings, ImageStretch) == 0x000010, "Member 'FBackgroundSettings::ImageStretch' has a wrong offset!");
static_assert(offsetof(FBackgroundSettings, Padding) == 0x000014, "Member 'FBackgroundSettings::Padding' has a wrong offset!");
static_assert(offsetof(FBackgroundSettings, BackgroundColor) == 0x000024, "Member 'FBackgroundSettings::BackgroundColor' has a wrong offset!");
static_assert(offsetof(FBackgroundSettings, bSetDisplayBackgroundManually) == 0x000034, "Member 'FBackgroundSettings::bSetDisplayBackgroundManually' has a wrong offset!");
static_assert(offsetof(FBackgroundSettings, bSolidFill) == 0x000035, "Member 'FBackgroundSettings::bSolidFill' has a wrong offset!");

// ScriptStruct LoadingScreen.HoldToSkipWidgetSettings
// 0x0138 (0x0138 - 0x0000)
struct FHoldToSkipWidgetSettings final
{
public:
	struct FWidgetAlignment                       Alignment;                                         // 0x0000(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         HoldDuration;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeatDecreaseMultiplier;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoadingTipDuration;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HoldToSkipTipDuration;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Size;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ProgressBarMaterial;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ProgressMaterialParamName;                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ProgressBarColor;                                  // 0x0048(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadingText;                                       // 0x0060(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0078(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTextAppearance                        TextAppearance;                                    // 0x0090(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                TextPadding;                                       // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoldToSkipWidgetSettings) == 0x000008, "Wrong alignment on FHoldToSkipWidgetSettings");
static_assert(sizeof(FHoldToSkipWidgetSettings) == 0x000138, "Wrong size on FHoldToSkipWidgetSettings");
static_assert(offsetof(FHoldToSkipWidgetSettings, Alignment) == 0x000000, "Member 'FHoldToSkipWidgetSettings::Alignment' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, Padding) == 0x000004, "Member 'FHoldToSkipWidgetSettings::Padding' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, HoldDuration) == 0x000014, "Member 'FHoldToSkipWidgetSettings::HoldDuration' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, HeatDecreaseMultiplier) == 0x000018, "Member 'FHoldToSkipWidgetSettings::HeatDecreaseMultiplier' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, LoadingTipDuration) == 0x00001C, "Member 'FHoldToSkipWidgetSettings::LoadingTipDuration' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, HoldToSkipTipDuration) == 0x000020, "Member 'FHoldToSkipWidgetSettings::HoldToSkipTipDuration' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, Size) == 0x000028, "Member 'FHoldToSkipWidgetSettings::Size' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, ProgressBarMaterial) == 0x000038, "Member 'FHoldToSkipWidgetSettings::ProgressBarMaterial' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, ProgressMaterialParamName) == 0x000040, "Member 'FHoldToSkipWidgetSettings::ProgressMaterialParamName' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, ProgressBarColor) == 0x000048, "Member 'FHoldToSkipWidgetSettings::ProgressBarColor' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, LoadingText) == 0x000060, "Member 'FHoldToSkipWidgetSettings::LoadingText' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, Text) == 0x000078, "Member 'FHoldToSkipWidgetSettings::Text' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, TextAppearance) == 0x000090, "Member 'FHoldToSkipWidgetSettings::TextAppearance' has a wrong offset!");
static_assert(offsetof(FHoldToSkipWidgetSettings, TextPadding) == 0x000128, "Member 'FHoldToSkipWidgetSettings::TextPadding' has a wrong offset!");

// ScriptStruct LoadingScreen.SubtitleWidgetSettings
// 0x00B8 (0x00B8 - 0x0000)
struct FSubtitleWidgetSettings final
{
public:
	struct FWidgetAlignment                       Alignment;                                         // 0x0000(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextAppearance                        TextAppearance;                                    // 0x0008(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                TextPadding;                                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WrapTextAt;                                        // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoWrap;                                         // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSubtitleWidgetSettings) == 0x000008, "Wrong alignment on FSubtitleWidgetSettings");
static_assert(sizeof(FSubtitleWidgetSettings) == 0x0000B8, "Wrong size on FSubtitleWidgetSettings");
static_assert(offsetof(FSubtitleWidgetSettings, Alignment) == 0x000000, "Member 'FSubtitleWidgetSettings::Alignment' has a wrong offset!");
static_assert(offsetof(FSubtitleWidgetSettings, TextAppearance) == 0x000008, "Member 'FSubtitleWidgetSettings::TextAppearance' has a wrong offset!");
static_assert(offsetof(FSubtitleWidgetSettings, TextPadding) == 0x0000A0, "Member 'FSubtitleWidgetSettings::TextPadding' has a wrong offset!");
static_assert(offsetof(FSubtitleWidgetSettings, WrapTextAt) == 0x0000B0, "Member 'FSubtitleWidgetSettings::WrapTextAt' has a wrong offset!");
static_assert(offsetof(FSubtitleWidgetSettings, bAutoWrap) == 0x0000B4, "Member 'FSubtitleWidgetSettings::bAutoWrap' has a wrong offset!");

// ScriptStruct LoadingScreen.LoadingWidgetSettings
// 0x03E0 (0x03E0 - 0x0000)
struct FLoadingWidgetSettings final
{
public:
	ELoadingIconType                              LoadingIconType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELoadingWidgetType                            LoadingWidgetType;                                 // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TransformTranslation;                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TransformScale;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TransformPivot;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   LoadingText;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ShaderCompilationText;                             // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bShowRemainingShadersCount;                        // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadingTextRightPosition;                         // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadingTextTopPosition;                           // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextAppearance                        Appearance;                                        // 0x0070(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FThrobberSettings                      ThrobberSettings;                                  // 0x0110(0x00E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCircularThrobberSettings              CircularThrobberSettings;                          // 0x01F0(0x00E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FImageSequenceSettings                 ImageSequenceSettings;                             // 0x02D0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            SingleImageThrobber;                               // 0x0300(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       TextAlignment;                                     // 0x03D0(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       LoadingIconAlignment;                              // 0x03D2(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Space;                                             // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideLoadingWidgetWhenCompletes;                   // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLoadingWidgetSettings) == 0x000010, "Wrong alignment on FLoadingWidgetSettings");
static_assert(sizeof(FLoadingWidgetSettings) == 0x0003E0, "Wrong size on FLoadingWidgetSettings");
static_assert(offsetof(FLoadingWidgetSettings, LoadingIconType) == 0x000000, "Member 'FLoadingWidgetSettings::LoadingIconType' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, LoadingWidgetType) == 0x000001, "Member 'FLoadingWidgetSettings::LoadingWidgetType' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, TransformTranslation) == 0x000008, "Member 'FLoadingWidgetSettings::TransformTranslation' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, TransformScale) == 0x000018, "Member 'FLoadingWidgetSettings::TransformScale' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, TransformPivot) == 0x000028, "Member 'FLoadingWidgetSettings::TransformPivot' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, LoadingText) == 0x000038, "Member 'FLoadingWidgetSettings::LoadingText' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, ShaderCompilationText) == 0x000050, "Member 'FLoadingWidgetSettings::ShaderCompilationText' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, bShowRemainingShadersCount) == 0x000068, "Member 'FLoadingWidgetSettings::bShowRemainingShadersCount' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, bLoadingTextRightPosition) == 0x000069, "Member 'FLoadingWidgetSettings::bLoadingTextRightPosition' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, bLoadingTextTopPosition) == 0x00006A, "Member 'FLoadingWidgetSettings::bLoadingTextTopPosition' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, Appearance) == 0x000070, "Member 'FLoadingWidgetSettings::Appearance' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, ThrobberSettings) == 0x000110, "Member 'FLoadingWidgetSettings::ThrobberSettings' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, CircularThrobberSettings) == 0x0001F0, "Member 'FLoadingWidgetSettings::CircularThrobberSettings' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, ImageSequenceSettings) == 0x0002D0, "Member 'FLoadingWidgetSettings::ImageSequenceSettings' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, SingleImageThrobber) == 0x000300, "Member 'FLoadingWidgetSettings::SingleImageThrobber' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, TextAlignment) == 0x0003D0, "Member 'FLoadingWidgetSettings::TextAlignment' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, LoadingIconAlignment) == 0x0003D2, "Member 'FLoadingWidgetSettings::LoadingIconAlignment' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, Space) == 0x0003D4, "Member 'FLoadingWidgetSettings::Space' has a wrong offset!");
static_assert(offsetof(FLoadingWidgetSettings, bHideLoadingWidgetWhenCompletes) == 0x0003D8, "Member 'FLoadingWidgetSettings::bHideLoadingWidgetWhenCompletes' has a wrong offset!");

// ScriptStruct LoadingScreen.TipSettings
// 0x00B0 (0x00B0 - 0x0000)
struct FTipSettings final
{
public:
	TArray<class FText>                           TipText;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTextAppearance                        Appearance;                                        // 0x0010(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         TipWrapAt;                                         // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDisplayTipTextManually;                        // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTipSettings) == 0x000008, "Wrong alignment on FTipSettings");
static_assert(sizeof(FTipSettings) == 0x0000B0, "Wrong size on FTipSettings");
static_assert(offsetof(FTipSettings, TipText) == 0x000000, "Member 'FTipSettings::TipText' has a wrong offset!");
static_assert(offsetof(FTipSettings, Appearance) == 0x000010, "Member 'FTipSettings::Appearance' has a wrong offset!");
static_assert(offsetof(FTipSettings, TipWrapAt) == 0x0000A8, "Member 'FTipSettings::TipWrapAt' has a wrong offset!");
static_assert(offsetof(FTipSettings, bSetDisplayTipTextManually) == 0x0000AC, "Member 'FTipSettings::bSetDisplayTipTextManually' has a wrong offset!");

// ScriptStruct LoadingScreen.LoadingCompleteTextSettings
// 0x00D0 (0x00D0 - 0x0000)
struct FLoadingCompleteTextSettings final
{
public:
	class FText                                   LoadingCompleteText;                               // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTextAppearance                        Appearance;                                        // 0x0018(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       Alignment;                                         // 0x00B0(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x00B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bFadeInOutAnim;                                    // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimationSpeed;                                    // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLoadingCompleteTextSettings) == 0x000008, "Wrong alignment on FLoadingCompleteTextSettings");
static_assert(sizeof(FLoadingCompleteTextSettings) == 0x0000D0, "Wrong size on FLoadingCompleteTextSettings");
static_assert(offsetof(FLoadingCompleteTextSettings, LoadingCompleteText) == 0x000000, "Member 'FLoadingCompleteTextSettings::LoadingCompleteText' has a wrong offset!");
static_assert(offsetof(FLoadingCompleteTextSettings, Appearance) == 0x000018, "Member 'FLoadingCompleteTextSettings::Appearance' has a wrong offset!");
static_assert(offsetof(FLoadingCompleteTextSettings, Alignment) == 0x0000B0, "Member 'FLoadingCompleteTextSettings::Alignment' has a wrong offset!");
static_assert(offsetof(FLoadingCompleteTextSettings, Padding) == 0x0000B4, "Member 'FLoadingCompleteTextSettings::Padding' has a wrong offset!");
static_assert(offsetof(FLoadingCompleteTextSettings, bFadeInOutAnim) == 0x0000C4, "Member 'FLoadingCompleteTextSettings::bFadeInOutAnim' has a wrong offset!");
static_assert(offsetof(FLoadingCompleteTextSettings, AnimationSpeed) == 0x0000C8, "Member 'FLoadingCompleteTextSettings::AnimationSpeed' has a wrong offset!");

// ScriptStruct LoadingScreen.LoadingScreenWidgetSettings
// 0x07A0 (0x07A0 - 0x0000)
struct FLoadingScreenWidgetSettings final
{
public:
	bool                                          bShowLoadingCompleteText;                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHoldToSkipWidget;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSubtitles;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWidgetOverlayAfterMovieEnds;                  // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadingCompleteTextSettings           LoadingCompleteTextSettings;                       // 0x0008(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBackgroundSettings                    Background;                                        // 0x00D8(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTipSettings                           TipWidget;                                         // 0x0110(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLoadingWidgetSettings                 LoadingWidget;                                     // 0x01C0(0x03E0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHoldToSkipWidgetSettings              HoldToSkipWidget;                                  // 0x05A0(0x0138)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSubtitleWidgetSettings                SubtitleWidget;                                    // 0x06D8(0x00B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       Alignment;                                         // 0x0790(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EAsyncLoadingScreenLayout                     Layout;                                            // 0x0792(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_793[0xD];                                      // 0x0793(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLoadingScreenWidgetSettings) == 0x000010, "Wrong alignment on FLoadingScreenWidgetSettings");
static_assert(sizeof(FLoadingScreenWidgetSettings) == 0x0007A0, "Wrong size on FLoadingScreenWidgetSettings");
static_assert(offsetof(FLoadingScreenWidgetSettings, bShowLoadingCompleteText) == 0x000000, "Member 'FLoadingScreenWidgetSettings::bShowLoadingCompleteText' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, bShowHoldToSkipWidget) == 0x000001, "Member 'FLoadingScreenWidgetSettings::bShowHoldToSkipWidget' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, bHasSubtitles) == 0x000002, "Member 'FLoadingScreenWidgetSettings::bHasSubtitles' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, bShowWidgetOverlayAfterMovieEnds) == 0x000003, "Member 'FLoadingScreenWidgetSettings::bShowWidgetOverlayAfterMovieEnds' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, LoadingCompleteTextSettings) == 0x000008, "Member 'FLoadingScreenWidgetSettings::LoadingCompleteTextSettings' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, Background) == 0x0000D8, "Member 'FLoadingScreenWidgetSettings::Background' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, TipWidget) == 0x000110, "Member 'FLoadingScreenWidgetSettings::TipWidget' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, LoadingWidget) == 0x0001C0, "Member 'FLoadingScreenWidgetSettings::LoadingWidget' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, HoldToSkipWidget) == 0x0005A0, "Member 'FLoadingScreenWidgetSettings::HoldToSkipWidget' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, SubtitleWidget) == 0x0006D8, "Member 'FLoadingScreenWidgetSettings::SubtitleWidget' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, Alignment) == 0x000790, "Member 'FLoadingScreenWidgetSettings::Alignment' has a wrong offset!");
static_assert(offsetof(FLoadingScreenWidgetSettings, Layout) == 0x000792, "Member 'FLoadingScreenWidgetSettings::Layout' has a wrong offset!");

// ScriptStruct LoadingScreen.ALoadingScreenSettings
// 0x07E0 (0x07E0 - 0x0000)
struct FALoadingScreenSettings final
{
public:
	float                                         MinimumLoadingScreenDisplayTime;                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidgetZOrder;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoCompleteWhenLoadingCompletes;                 // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoviesAreSkippable;                               // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForManualStop;                                // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInEarlyStartup;                              // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowEngineTick;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGameViewportFadeIn;                               // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeInTime;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             FadeEaseType;                                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePlaybackType                            PlaybackType;                                      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MoviePaths;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bShuffle;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWidgetOverlay;                                // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0xE];                                       // 0x0032(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLoadingScreenWidgetSettings           WidgetOverlay;                                     // 0x0040(0x07A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FALoadingScreenSettings) == 0x000010, "Wrong alignment on FALoadingScreenSettings");
static_assert(sizeof(FALoadingScreenSettings) == 0x0007E0, "Wrong size on FALoadingScreenSettings");
static_assert(offsetof(FALoadingScreenSettings, MinimumLoadingScreenDisplayTime) == 0x000000, "Member 'FALoadingScreenSettings::MinimumLoadingScreenDisplayTime' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, WidgetZOrder) == 0x000008, "Member 'FALoadingScreenSettings::WidgetZOrder' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bAutoCompleteWhenLoadingCompletes) == 0x00000C, "Member 'FALoadingScreenSettings::bAutoCompleteWhenLoadingCompletes' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bMoviesAreSkippable) == 0x00000D, "Member 'FALoadingScreenSettings::bMoviesAreSkippable' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bWaitForManualStop) == 0x00000E, "Member 'FALoadingScreenSettings::bWaitForManualStop' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bAllowInEarlyStartup) == 0x00000F, "Member 'FALoadingScreenSettings::bAllowInEarlyStartup' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bAllowEngineTick) == 0x000010, "Member 'FALoadingScreenSettings::bAllowEngineTick' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bGameViewportFadeIn) == 0x000011, "Member 'FALoadingScreenSettings::bGameViewportFadeIn' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, FadeInTime) == 0x000014, "Member 'FALoadingScreenSettings::FadeInTime' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, FadeEaseType) == 0x000018, "Member 'FALoadingScreenSettings::FadeEaseType' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, PlaybackType) == 0x000019, "Member 'FALoadingScreenSettings::PlaybackType' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, MoviePaths) == 0x000020, "Member 'FALoadingScreenSettings::MoviePaths' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bShuffle) == 0x000030, "Member 'FALoadingScreenSettings::bShuffle' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, bShowWidgetOverlay) == 0x000031, "Member 'FALoadingScreenSettings::bShowWidgetOverlay' has a wrong offset!");
static_assert(offsetof(FALoadingScreenSettings, WidgetOverlay) == 0x000040, "Member 'FALoadingScreenSettings::WidgetOverlay' has a wrong offset!");

// ScriptStruct LoadingScreen.ClassicLayoutSettings
// 0x00F0 (0x00F0 - 0x0000)
struct FClassicLayoutSettings final
{
public:
	bool                                          bIsWidgetAtBottom;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoadingWidgetAtLeft;                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Space;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       TipAlignment;                                      // 0x0008(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          BorderHorizontalAlignment;                         // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                BorderPadding;                                     // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BorderBackground;                                  // 0x0020(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClassicLayoutSettings) == 0x000010, "Wrong alignment on FClassicLayoutSettings");
static_assert(sizeof(FClassicLayoutSettings) == 0x0000F0, "Wrong size on FClassicLayoutSettings");
static_assert(offsetof(FClassicLayoutSettings, bIsWidgetAtBottom) == 0x000000, "Member 'FClassicLayoutSettings::bIsWidgetAtBottom' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, bIsLoadingWidgetAtLeft) == 0x000001, "Member 'FClassicLayoutSettings::bIsLoadingWidgetAtLeft' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, Space) == 0x000004, "Member 'FClassicLayoutSettings::Space' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, TipAlignment) == 0x000008, "Member 'FClassicLayoutSettings::TipAlignment' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, BorderHorizontalAlignment) == 0x00000A, "Member 'FClassicLayoutSettings::BorderHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, BorderPadding) == 0x00000C, "Member 'FClassicLayoutSettings::BorderPadding' has a wrong offset!");
static_assert(offsetof(FClassicLayoutSettings, BorderBackground) == 0x000020, "Member 'FClassicLayoutSettings::BorderBackground' has a wrong offset!");

// ScriptStruct LoadingScreen.CenterLayoutSettings
// 0x00F0 (0x00F0 - 0x0000)
struct FCenterLayoutSettings final
{
public:
	bool                                          bIsTipAtBottom;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       TipAlignment;                                      // 0x0001(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          BorderHorizontalAlignment;                         // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BorderVerticalOffset;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                BorderPadding;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BorderBackground;                                  // 0x0020(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCenterLayoutSettings) == 0x000010, "Wrong alignment on FCenterLayoutSettings");
static_assert(sizeof(FCenterLayoutSettings) == 0x0000F0, "Wrong size on FCenterLayoutSettings");
static_assert(offsetof(FCenterLayoutSettings, bIsTipAtBottom) == 0x000000, "Member 'FCenterLayoutSettings::bIsTipAtBottom' has a wrong offset!");
static_assert(offsetof(FCenterLayoutSettings, TipAlignment) == 0x000001, "Member 'FCenterLayoutSettings::TipAlignment' has a wrong offset!");
static_assert(offsetof(FCenterLayoutSettings, BorderHorizontalAlignment) == 0x000003, "Member 'FCenterLayoutSettings::BorderHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FCenterLayoutSettings, BorderVerticalOffset) == 0x000004, "Member 'FCenterLayoutSettings::BorderVerticalOffset' has a wrong offset!");
static_assert(offsetof(FCenterLayoutSettings, BorderPadding) == 0x000008, "Member 'FCenterLayoutSettings::BorderPadding' has a wrong offset!");
static_assert(offsetof(FCenterLayoutSettings, BorderBackground) == 0x000020, "Member 'FCenterLayoutSettings::BorderBackground' has a wrong offset!");

// ScriptStruct LoadingScreen.LetterboxLayoutSettings
// 0x01D0 (0x01D0 - 0x0000)
struct FLetterboxLayoutSettings final
{
public:
	bool                                          bIsLoadingWidgetAtTop;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       TipAlignment;                                      // 0x0001(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       LoadingWidgetAlignment;                            // 0x0003(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          TopBorderHorizontalAlignment;                      // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          BottomBorderHorizontalAlignment;                   // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                TopBorderPadding;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                BottomBorderPadding;                               // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TopBorderBackground;                               // 0x0030(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BottomBorderBackground;                            // 0x0100(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLetterboxLayoutSettings) == 0x000010, "Wrong alignment on FLetterboxLayoutSettings");
static_assert(sizeof(FLetterboxLayoutSettings) == 0x0001D0, "Wrong size on FLetterboxLayoutSettings");
static_assert(offsetof(FLetterboxLayoutSettings, bIsLoadingWidgetAtTop) == 0x000000, "Member 'FLetterboxLayoutSettings::bIsLoadingWidgetAtTop' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, TipAlignment) == 0x000001, "Member 'FLetterboxLayoutSettings::TipAlignment' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, LoadingWidgetAlignment) == 0x000003, "Member 'FLetterboxLayoutSettings::LoadingWidgetAlignment' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, TopBorderHorizontalAlignment) == 0x000005, "Member 'FLetterboxLayoutSettings::TopBorderHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, BottomBorderHorizontalAlignment) == 0x000006, "Member 'FLetterboxLayoutSettings::BottomBorderHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, TopBorderPadding) == 0x000008, "Member 'FLetterboxLayoutSettings::TopBorderPadding' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, BottomBorderPadding) == 0x000018, "Member 'FLetterboxLayoutSettings::BottomBorderPadding' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, TopBorderBackground) == 0x000030, "Member 'FLetterboxLayoutSettings::TopBorderBackground' has a wrong offset!");
static_assert(offsetof(FLetterboxLayoutSettings, BottomBorderBackground) == 0x000100, "Member 'FLetterboxLayoutSettings::BottomBorderBackground' has a wrong offset!");

// ScriptStruct LoadingScreen.SidebarLayoutSettings
// 0x0100 (0x0100 - 0x0000)
struct FSidebarLayoutSettings final
{
public:
	bool                                          bIsWidgetAtRight;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoadingWidgetAtTop;                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Space;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       LoadingWidgetAlignment;                            // 0x0009(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FWidgetAlignment                       TipAlignment;                                      // 0x000B(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EVerticalAlignment                            BorderVerticalAlignment;                           // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BorderHorizontalOffset;                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                BorderPadding;                                     // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BorderBackground;                                  // 0x0030(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSidebarLayoutSettings) == 0x000010, "Wrong alignment on FSidebarLayoutSettings");
static_assert(sizeof(FSidebarLayoutSettings) == 0x000100, "Wrong size on FSidebarLayoutSettings");
