#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocationServicesBPLibrary

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "LocationServicesBPLibrary_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LocationServicesBPLibrary.LocationServices
// 0x0000 (0x0028 - 0x0028)
class ULocationServices final : public UBlueprintFunctionLibrary
{
public:
	static bool AreLocationServicesEnabled()	 // 0x52e8518;
	static struct FLocationServicesData GetLastKnownLocation()	 // 0x52e8554;
	static class ULocationServicesImpl* GetLocationServicesImpl()	 // 0x52e85ac;
	static bool InitLocationServices(ELocationAccuracy Accuracy, float UpdateFrequency, float MinDistanceFilter)	 // 0x52e85c4;
	static bool IsLocationAccuracyAvailable(ELocationAccuracy Accuracy)	 // 0x52e8794;
	static bool StartLocationServices()	 // 0x52e8868;
	static bool StopLocationServices()	 // 0x52e88a4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LocationServices">();
	}
	static class ULocationServices* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULocationServices>();
	}
};
static_assert(alignof(ULocationServices) == 0x000008, "Wrong alignment on ULocationServices");
static_assert(sizeof(ULocationServices) == 0x000028, "Wrong size on ULocationServices");

// Class LocationServicesBPLibrary.LocationServicesImpl
// 0x0010 (0x0038 - 0x0028)
class ULocationServicesImpl final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FLocationServicesData& LocationData)> OnLocationChanged; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LocationServicesImpl">();
	}
	static class ULocationServicesImpl* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULocationServicesImpl>();
	}
};
static_assert(alignof(ULocationServicesImpl) == 0x000008, "Wrong alignment on ULocationServicesImpl");
static_assert(sizeof(ULocationServicesImpl) == 0x000038, "Wrong size on ULocationServicesImpl");
static_assert(offsetof(ULocationServicesImpl, OnLocationChanged) == 0x000028, "Member 'ULocationServicesImpl::OnLocationChanged' has a wrong offset!");

}

