#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function MainMenu.P2LegalLicensesWidget.OnCloseBtnClicked
// 0x0001 (0x0001 - 0x0000)
struct P2LegalLicensesWidget_OnCloseBtnClicked final
{
public:
	EPopupButtonID                                InPopupButtonID;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2LegalLicensesWidget_OnCloseBtnClicked) == 0x000001, "Wrong alignment on P2LegalLicensesWidget_OnCloseBtnClicked");
static_assert(sizeof(P2LegalLicensesWidget_OnCloseBtnClicked) == 0x000001, "Wrong size on P2LegalLicensesWidget_OnCloseBtnClicked");
static_assert(offsetof(P2LegalLicensesWidget_OnCloseBtnClicked, InPopupButtonID) == 0x000000, "Member 'P2LegalLicensesWidget_OnCloseBtnClicked::InPopupButtonID' has a wrong offset!");

// Function MainMenu.P2MainMenu.BP_OnAccountArchivedResponse
// 0x0001 (0x0001 - 0x0000)
struct P2MainMenu_BP_OnAccountArchivedResponse final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_BP_OnAccountArchivedResponse) == 0x000001, "Wrong alignment on P2MainMenu_BP_OnAccountArchivedResponse");
static_assert(sizeof(P2MainMenu_BP_OnAccountArchivedResponse) == 0x000001, "Wrong size on P2MainMenu_BP_OnAccountArchivedResponse");
static_assert(offsetof(P2MainMenu_BP_OnAccountArchivedResponse, bSuccess) == 0x000000, "Member 'P2MainMenu_BP_OnAccountArchivedResponse::bSuccess' has a wrong offset!");

// Function MainMenu.P2MainMenu.ChangePreviewData
// 0x0004 (0x0004 - 0x0000)
struct P2MainMenu_ChangePreviewData final
{
public:
	int32                                         InNextIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_ChangePreviewData) == 0x000004, "Wrong alignment on P2MainMenu_ChangePreviewData");
static_assert(sizeof(P2MainMenu_ChangePreviewData) == 0x000004, "Wrong size on P2MainMenu_ChangePreviewData");
static_assert(offsetof(P2MainMenu_ChangePreviewData, InNextIndex) == 0x000000, "Member 'P2MainMenu_ChangePreviewData::InNextIndex' has a wrong offset!");

// Function MainMenu.P2MainMenu.GetPreviewDataNum
// 0x0004 (0x0004 - 0x0000)
struct P2MainMenu_GetPreviewDataNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_GetPreviewDataNum) == 0x000004, "Wrong alignment on P2MainMenu_GetPreviewDataNum");
static_assert(sizeof(P2MainMenu_GetPreviewDataNum) == 0x000004, "Wrong size on P2MainMenu_GetPreviewDataNum");
static_assert(offsetof(P2MainMenu_GetPreviewDataNum, ReturnValue) == 0x000000, "Member 'P2MainMenu_GetPreviewDataNum::ReturnValue' has a wrong offset!");

// Function MainMenu.P2MainMenu.OnCharacterArchivedResponse
// 0x0018 (0x0018 - 0x0000)
struct P2MainMenu_OnCharacterArchivedResponse final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InCharacterId;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_OnCharacterArchivedResponse) == 0x000008, "Wrong alignment on P2MainMenu_OnCharacterArchivedResponse");
static_assert(sizeof(P2MainMenu_OnCharacterArchivedResponse) == 0x000018, "Wrong size on P2MainMenu_OnCharacterArchivedResponse");
static_assert(offsetof(P2MainMenu_OnCharacterArchivedResponse, bSuccess) == 0x000000, "Member 'P2MainMenu_OnCharacterArchivedResponse::bSuccess' has a wrong offset!");
static_assert(offsetof(P2MainMenu_OnCharacterArchivedResponse, InCharacterId) == 0x000008, "Member 'P2MainMenu_OnCharacterArchivedResponse::InCharacterId' has a wrong offset!");

// Function MainMenu.P2MainMenu.OnCharacterConnectionDataReceived
// 0x0010 (0x0010 - 0x0000)
struct P2MainMenu_OnCharacterConnectionDataReceived final
{
public:
	TArray<struct FP2CharacterConnectionInfo>     CharacterConnectionData;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_OnCharacterConnectionDataReceived) == 0x000008, "Wrong alignment on P2MainMenu_OnCharacterConnectionDataReceived");
static_assert(sizeof(P2MainMenu_OnCharacterConnectionDataReceived) == 0x000010, "Wrong size on P2MainMenu_OnCharacterConnectionDataReceived");
static_assert(offsetof(P2MainMenu_OnCharacterConnectionDataReceived, CharacterConnectionData) == 0x000000, "Member 'P2MainMenu_OnCharacterConnectionDataReceived::CharacterConnectionData' has a wrong offset!");

// Function MainMenu.P2MainMenu.OnLowSpecPopupButtonPressed
// 0x0001 (0x0001 - 0x0000)
struct P2MainMenu_OnLowSpecPopupButtonPressed final
{
public:
	EPopupButtonID                                InButtonID;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_OnLowSpecPopupButtonPressed) == 0x000001, "Wrong alignment on P2MainMenu_OnLowSpecPopupButtonPressed");
static_assert(sizeof(P2MainMenu_OnLowSpecPopupButtonPressed) == 0x000001, "Wrong size on P2MainMenu_OnLowSpecPopupButtonPressed");
static_assert(offsetof(P2MainMenu_OnLowSpecPopupButtonPressed, InButtonID) == 0x000000, "Member 'P2MainMenu_OnLowSpecPopupButtonPressed::InButtonID' has a wrong offset!");

// Function MainMenu.P2MainMenu.OnSkinBuildEnded
// 0x0008 (0x0008 - 0x0000)
struct P2MainMenu_OnSkinBuildEnded final
{
public:
	class USkeletalMesh*                          OutputMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_OnSkinBuildEnded) == 0x000008, "Wrong alignment on P2MainMenu_OnSkinBuildEnded");
static_assert(sizeof(P2MainMenu_OnSkinBuildEnded) == 0x000008, "Wrong size on P2MainMenu_OnSkinBuildEnded");
static_assert(offsetof(P2MainMenu_OnSkinBuildEnded, OutputMesh) == 0x000000, "Member 'P2MainMenu_OnSkinBuildEnded::OutputMesh' has a wrong offset!");

// Function MainMenu.P2MainMenu.RequestCharacterRemoval
// 0x0010 (0x0010 - 0x0000)
struct P2MainMenu_RequestCharacterRemoval final
{
public:
	class FString                                 InCharacterId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_RequestCharacterRemoval) == 0x000008, "Wrong alignment on P2MainMenu_RequestCharacterRemoval");
static_assert(sizeof(P2MainMenu_RequestCharacterRemoval) == 0x000010, "Wrong size on P2MainMenu_RequestCharacterRemoval");
static_assert(offsetof(P2MainMenu_RequestCharacterRemoval, InCharacterId) == 0x000000, "Member 'P2MainMenu_RequestCharacterRemoval::InCharacterId' has a wrong offset!");

// Function MainMenu.P2MainMenu.GetCurrentCharacterId
// 0x0010 (0x0010 - 0x0000)
struct P2MainMenu_GetCurrentCharacterId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_GetCurrentCharacterId) == 0x000008, "Wrong alignment on P2MainMenu_GetCurrentCharacterId");
static_assert(sizeof(P2MainMenu_GetCurrentCharacterId) == 0x000010, "Wrong size on P2MainMenu_GetCurrentCharacterId");
static_assert(offsetof(P2MainMenu_GetCurrentCharacterId, ReturnValue) == 0x000000, "Member 'P2MainMenu_GetCurrentCharacterId::ReturnValue' has a wrong offset!");

// Function MainMenu.P2MainMenu.GetCurrentCharacterIndex
// 0x0004 (0x0004 - 0x0000)
struct P2MainMenu_GetCurrentCharacterIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MainMenu_GetCurrentCharacterIndex) == 0x000004, "Wrong alignment on P2MainMenu_GetCurrentCharacterIndex");
static_assert(sizeof(P2MainMenu_GetCurrentCharacterIndex) == 0x000004, "Wrong size on P2MainMenu_GetCurrentCharacterIndex");
static_assert(offsetof(P2MainMenu_GetCurrentCharacterIndex, ReturnValue) == 0x000000, "Member 'P2MainMenu_GetCurrentCharacterIndex::ReturnValue' has a wrong offset!");

}

