#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// Class MainMenu.P2LegalLicensesWidget
// 0x0008 (0x0588 - 0x0580)
class UP2LegalLicensesWidget : public UP2CommonActivatableWidget
{
public:
	class UP2CommonButtonWidget*                  CommonButton_Close;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCloseBtnClicked(EPopupButtonID InPopupButtonID)	 // 0x4c333dc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2LegalLicensesWidget">();
	}
	static class UP2LegalLicensesWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2LegalLicensesWidget>();
	}
};
static_assert(alignof(UP2LegalLicensesWidget) == 0x000008, "Wrong alignment on UP2LegalLicensesWidget");
static_assert(sizeof(UP2LegalLicensesWidget) == 0x000588, "Wrong size on UP2LegalLicensesWidget");
static_assert(offsetof(UP2LegalLicensesWidget, CommonButton_Close) == 0x000580, "Member 'UP2LegalLicensesWidget::CommonButton_Close' has a wrong offset!");

// Class MainMenu.P2MainMenu
// 0x0088 (0x0608 - 0x0580)
class UP2MainMenu : public UP2CommonActivatableWidget
{
public:
	class FName                                   FPPCharacterTag;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AP2MannequinCharacter*                  FPPCharacterMannequin;                             // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTutorialCompleted;                                // 0x0590(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             FPPNickname_Text;                                  // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Level_Text;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Status_Text;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B0[0x18];                                     // 0x05B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Button*                              Btn_LegalLicenses;                                 // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2LegalLicensesWidget>     LegalLicensesWidgetClass;                          // 0x05D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LegalLicensesZorder;                               // 0x05D8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         HB_Region;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Txt_Region;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F0[0x18];                                     // 0x05F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnAccountArchivedResponse(bool bSuccess)	 // 0xae1e64;
	void BP_OnPreviewDataReceived()	 // 0xae1e64;
	void BP_OnUpdatePreviewData()	 // 0xae1e64;
	void ChangePreviewData(int32 InNextIndex)	 // 0x4eaa1d8;
	int32 GetPreviewDataNum()	 // 0x17fbc74;
	void OnCharacterArchivedResponse(bool bSuccess, const class FString& InCharacterId)	 // 0x4eaa2b0;
	void OnCharacterConnectionDataReceived(const TArray<struct FP2CharacterConnectionInfo>& CharacterConnectionData)	 // 0x175ab48;
	void OnLegalLicensesBtnClick()	 // 0x4eaa420;
	void OnLoginSuccess()	 // 0x175a210;
	void OnLowSpecPopupButtonPressed(EPopupButtonID InButtonID)	 // 0x2fca280;
	void OnPreviewDataApplied()	 // 0xae1e64;
	void OnSkinBuildEnded(class USkeletalMesh* OutputMesh)	 // 0x180aa20;
	void RequestCharacterRemoval(const class FString& InCharacterId)	 // 0x4eaa434;
	void StopMeshBuild()	 // 0x4eaa504;

	class FString GetCurrentCharacterId() const	 // 0x180ac28;
	int32 GetCurrentCharacterIndex() const	 // 0x4eaa298;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2MainMenu">();
	}
	static class UP2MainMenu* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2MainMenu>();
	}
};
static_assert(alignof(UP2MainMenu) == 0x000008, "Wrong alignment on UP2MainMenu");
static_assert(sizeof(UP2MainMenu) == 0x000608, "Wrong size on UP2MainMenu");
static_assert(offsetof(UP2MainMenu, FPPCharacterTag) == 0x000580, "Member 'UP2MainMenu::FPPCharacterTag' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, FPPCharacterMannequin) == 0x000588, "Member 'UP2MainMenu::FPPCharacterMannequin' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, bTutorialCompleted) == 0x000590, "Member 'UP2MainMenu::bTutorialCompleted' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, FPPNickname_Text) == 0x000598, "Member 'UP2MainMenu::FPPNickname_Text' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, Level_Text) == 0x0005A0, "Member 'UP2MainMenu::Level_Text' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, Status_Text) == 0x0005A8, "Member 'UP2MainMenu::Status_Text' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, Btn_LegalLicenses) == 0x0005C8, "Member 'UP2MainMenu::Btn_LegalLicenses' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, LegalLicensesWidgetClass) == 0x0005D0, "Member 'UP2MainMenu::LegalLicensesWidgetClass' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, LegalLicensesZorder) == 0x0005D8, "Member 'UP2MainMenu::LegalLicensesZorder' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, HB_Region) == 0x0005E0, "Member 'UP2MainMenu::HB_Region' has a wrong offset!");
static_assert(offsetof(UP2MainMenu, Txt_Region) == 0x0005E8, "Member 'UP2MainMenu::Txt_Region' has a wrong offset!");

}

