#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapStatCollector

#include "Basic.hpp"

#include "MapStatCollector_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MapStatCollector.MapStatCollectorSettings
// 0x0118 (0x0140 - 0x0028)
class UMapStatCollectorSettings final : public UObject
{
public:
	bool                                          bEnableExportInsights;                             // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetFPS;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InitialDelay;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLogs;                                       // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRetryDumpStats;                             // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUnstableDumpStats;                          // 0x0042(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DurationUnstableDump;                              // 0x0048(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFixedScalability;                           // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox2D                                 OverrideWorldBounds;                               // 0x0058(0x0028)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         SetupCommandList;                                  // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         OnStartCommandList;                                // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExitCommandList;                                   // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FCustomMinimapEntry>            CustomMinimapList;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         SamplingAngleCount;                                // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingRetryLimit;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DelayTimeMove;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DelayTimeRotate;                                   // 0x00D0(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DurationPreSampling;                               // 0x00D8(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DurationInSampling;                                // 0x00E0(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomStatEntry>               CustomStatEntries;                                 // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	double                                        ToleranceForCUSUM;                                 // 0x00F8(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ThresholdForCUSUM;                                 // 0x0100(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ThresholdForStdDev;                                // 0x0108(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ThresholdForHitch;                                 // 0x0110(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ThresholdForSigma;                                 // 0x0118(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPointGeneratorSettings>        GeneratorSettings;                                 // 0x0120(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FPointGeneratorDetailOptionEntry> GeneratorDetailOptions;                          // 0x0130(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MapStatCollectorSettings">();
	}
	static class UMapStatCollectorSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMapStatCollectorSettings>();
	}
};
static_assert(alignof(UMapStatCollectorSettings) == 0x000008, "Wrong alignment on UMapStatCollectorSettings");
static_assert(sizeof(UMapStatCollectorSettings) == 0x000140, "Wrong size on UMapStatCollectorSettings");
static_assert(offsetof(UMapStatCollectorSettings, bEnableExportInsights) == 0x000028, "Member 'UMapStatCollectorSettings::bEnableExportInsights' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, TargetFPS) == 0x000030, "Member 'UMapStatCollectorSettings::TargetFPS' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, InitialDelay) == 0x000038, "Member 'UMapStatCollectorSettings::InitialDelay' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, bEnableLogs) == 0x000040, "Member 'UMapStatCollectorSettings::bEnableLogs' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, bEnableRetryDumpStats) == 0x000041, "Member 'UMapStatCollectorSettings::bEnableRetryDumpStats' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, bEnableUnstableDumpStats) == 0x000042, "Member 'UMapStatCollectorSettings::bEnableUnstableDumpStats' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, DurationUnstableDump) == 0x000048, "Member 'UMapStatCollectorSettings::DurationUnstableDump' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, bEnableFixedScalability) == 0x000050, "Member 'UMapStatCollectorSettings::bEnableFixedScalability' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, OverrideWorldBounds) == 0x000058, "Member 'UMapStatCollectorSettings::OverrideWorldBounds' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, SetupCommandList) == 0x000080, "Member 'UMapStatCollectorSettings::SetupCommandList' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, OnStartCommandList) == 0x000090, "Member 'UMapStatCollectorSettings::OnStartCommandList' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ExitCommandList) == 0x0000A0, "Member 'UMapStatCollectorSettings::ExitCommandList' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, CustomMinimapList) == 0x0000B0, "Member 'UMapStatCollectorSettings::CustomMinimapList' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, SamplingAngleCount) == 0x0000C0, "Member 'UMapStatCollectorSettings::SamplingAngleCount' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, SamplingRetryLimit) == 0x0000C4, "Member 'UMapStatCollectorSettings::SamplingRetryLimit' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, DelayTimeMove) == 0x0000C8, "Member 'UMapStatCollectorSettings::DelayTimeMove' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, DelayTimeRotate) == 0x0000D0, "Member 'UMapStatCollectorSettings::DelayTimeRotate' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, DurationPreSampling) == 0x0000D8, "Member 'UMapStatCollectorSettings::DurationPreSampling' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, DurationInSampling) == 0x0000E0, "Member 'UMapStatCollectorSettings::DurationInSampling' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, CustomStatEntries) == 0x0000E8, "Member 'UMapStatCollectorSettings::CustomStatEntries' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ToleranceForCUSUM) == 0x0000F8, "Member 'UMapStatCollectorSettings::ToleranceForCUSUM' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ThresholdForCUSUM) == 0x000100, "Member 'UMapStatCollectorSettings::ThresholdForCUSUM' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ThresholdForStdDev) == 0x000108, "Member 'UMapStatCollectorSettings::ThresholdForStdDev' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ThresholdForHitch) == 0x000110, "Member 'UMapStatCollectorSettings::ThresholdForHitch' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, ThresholdForSigma) == 0x000118, "Member 'UMapStatCollectorSettings::ThresholdForSigma' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, GeneratorSettings) == 0x000120, "Member 'UMapStatCollectorSettings::GeneratorSettings' has a wrong offset!");
static_assert(offsetof(UMapStatCollectorSettings, GeneratorDetailOptions) == 0x000130, "Member 'UMapStatCollectorSettings::GeneratorDetailOptions' has a wrong offset!");

// Class MapStatCollector.MapStatTrigger
// 0x0000 (0x02B0 - 0x02B0)
class AMapStatTrigger final : public AActor
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MapStatTrigger">();
	}
	static class AMapStatTrigger* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AMapStatTrigger>();
	}
};
static_assert(alignof(AMapStatTrigger) == 0x000008, "Wrong alignment on AMapStatTrigger");
static_assert(sizeof(AMapStatTrigger) == 0x0002B0, "Wrong size on AMapStatTrigger");

}

