#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mercuna

#include "Basic.hpp"

#include "Mercuna_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "StructUtils_structs.hpp"
#include "PhysicsCore_classes.hpp"


namespace SDK
{

// Class Mercuna.Mercuna2DQueryTest
// 0x0008 (0x0210 - 0x0208)
class UMercuna2DQueryTest : public UEnvQueryTest
{
public:
	uint8                                         Pad_208[0x8];                                      // 0x0208(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna2DQueryTest">();
	}
	static class UMercuna2DQueryTest* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna2DQueryTest>();
	}
};
static_assert(alignof(UMercuna2DQueryTest) == 0x000008, "Wrong alignment on UMercuna2DQueryTest");
static_assert(sizeof(UMercuna2DQueryTest) == 0x000210, "Wrong size on UMercuna2DQueryTest");

// Class Mercuna.EnvQueryTest_Mercuna2D_Project
// 0x0048 (0x0258 - 0x0210)
class UEnvQueryTest_Mercuna2D_Project : public UMercuna2DQueryTest
{
public:
	TSubclassOf<class APawn>                      AgentClass;                                        // 0x0210(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              MaxProjectionDistance;                             // 0x0218(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EMercunaProjectionType                        ProjectionType;                                    // 0x0250(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryTest_Mercuna2D_Project">();
	}
	static class UEnvQueryTest_Mercuna2D_Project* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryTest_Mercuna2D_Project>();
	}
};
static_assert(alignof(UEnvQueryTest_Mercuna2D_Project) == 0x000008, "Wrong alignment on UEnvQueryTest_Mercuna2D_Project");
static_assert(sizeof(UEnvQueryTest_Mercuna2D_Project) == 0x000258, "Wrong size on UEnvQueryTest_Mercuna2D_Project");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_Project, AgentClass) == 0x000210, "Member 'UEnvQueryTest_Mercuna2D_Project::AgentClass' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_Project, MaxProjectionDistance) == 0x000218, "Member 'UEnvQueryTest_Mercuna2D_Project::MaxProjectionDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_Project, ProjectionType) == 0x000250, "Member 'UEnvQueryTest_Mercuna2D_Project::ProjectionType' has a wrong offset!");

// Class Mercuna.EnvQueryTest_MercunaGround_Project
// 0x0000 (0x0258 - 0x0258)
class UEnvQueryTest_MercunaGround_Project final : public UEnvQueryTest_Mercuna2D_Project
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryTest_MercunaGround_Project">();
	}
	static class UEnvQueryTest_MercunaGround_Project* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryTest_MercunaGround_Project>();
	}
};
static_assert(alignof(UEnvQueryTest_MercunaGround_Project) == 0x000008, "Wrong alignment on UEnvQueryTest_MercunaGround_Project");
static_assert(sizeof(UEnvQueryTest_MercunaGround_Project) == 0x000258, "Wrong size on UEnvQueryTest_MercunaGround_Project");

// Class Mercuna.MercunaNavigationComponent
// 0x00D0 (0x0190 - 0x00C0)
class UMercunaNavigationComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const struct FAIRequestID& RequestID, const EMercunaMoveResult Result)> OnMoveCompleted; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x14];                                      // 0x00D0(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	EMercunaAvoidanceMode                         AvoidanceMode;                                     // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMercunaContextualSteeringActorParameters DefaultContextSteeringParameters;               // 0x00E8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class AActor>, struct FMercunaContextualSteeringActorParameters> ContextSteeringParameters; // 0x00F8(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          DynamicAvoidance;                                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AvoidanceWeightMultiplier;                         // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMercunaUsageSpec                      UsageSpec;                                         // 0x0150(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x30];                                     // 0x0158(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CurrentController;                                 // 0x0188(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaNavigationComponent">();
	}
	static class UMercunaNavigationComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercunaNavigationComponent>();
	}
};
static_assert(alignof(UMercunaNavigationComponent) == 0x000008, "Wrong alignment on UMercunaNavigationComponent");
static_assert(sizeof(UMercunaNavigationComponent) == 0x000190, "Wrong size on UMercunaNavigationComponent");
static_assert(offsetof(UMercunaNavigationComponent, OnMoveCompleted) == 0x0000C0, "Member 'UMercunaNavigationComponent::OnMoveCompleted' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, AvoidanceMode) == 0x0000E4, "Member 'UMercunaNavigationComponent::AvoidanceMode' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, DefaultContextSteeringParameters) == 0x0000E8, "Member 'UMercunaNavigationComponent::DefaultContextSteeringParameters' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, ContextSteeringParameters) == 0x0000F8, "Member 'UMercunaNavigationComponent::ContextSteeringParameters' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, DynamicAvoidance) == 0x000148, "Member 'UMercunaNavigationComponent::DynamicAvoidance' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, AvoidanceWeightMultiplier) == 0x00014C, "Member 'UMercunaNavigationComponent::AvoidanceWeightMultiplier' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, UsageSpec) == 0x000150, "Member 'UMercunaNavigationComponent::UsageSpec' has a wrong offset!");
static_assert(offsetof(UMercunaNavigationComponent, CurrentController) == 0x000188, "Member 'UMercunaNavigationComponent::CurrentController' has a wrong offset!");

// Class Mercuna.Mercuna3DNavigationComponent
// 0x0070 (0x0200 - 0x0190)
class UMercuna3DNavigationComponent : public UMercunaNavigationComponent
{
public:
	struct FMercuna3DNavigationConfiguration      Configuration;                                     // 0x0190(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMercunaNavOctree*                      NavOctree;                                         // 0x01B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutomaticRadius;                                  // 0x01B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NavigationRadius;                                  // 0x01BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Pathfinding;                                       // 0x01C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C1[0x3F];                                     // 0x01C1(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDestinationLocation(const struct FVector& NextDestination)	 // 0x48475fc;
	void CancelLookAt()	 // 0x48476d8;
	void CancelMovement()	 // 0x48476ec;
	void ClearAvoidanceExclusions()	 // 0x1203138;
	void Configure(const struct FMercuna3DNavigationConfiguration& NewConfiguration)	 // 0x4847720;
	void ConfigureMovement(bool bUsePathfinding, EMercunaAvoidanceMode NewAvoidanceMode)	 // 0x4847804;
	void GetPathInfo(bool* Valid, float* DistanceToEnd)	 // 0x484796c;
	float GetRemainingPathLength()	 // 0x4847a4c;
	void InvalidateContextualSteeringParams()	 // 0x476124c;
	void InvalidateContextualSteeringParamsAgainstActor(class AActor* Actor)	 // 0x4847c20;
	void IsReachable(const struct FVector& Point, bool* Success, class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo)	 // 0x4847ce4;
	void LookAlongAcceleration(float MaxPitch)	 // 0x4847f2c;
	void LookAt(class AActor* Actor, float MaxPitch)	 // 0x4847ff0;
	void LookInDirection(const struct FVector& Direction, float MaxPitch)	 // 0x4848130;
	void MoveToActor(class AActor* Actor, float EndDistance, float Speed, bool UsePartialPath)	 // 0x48489e0;
	void MoveToLocation(const struct FVector& Destination, float EndDistance, float Speed, bool UsePartialPath)	 // 0x4848f10;
	void MoveToLocations(const TArray<struct FVector>& Destinations, float EndDistance, float Speed, bool UsePartialPath)	 // 0x4849554;
	bool OverrideSpeedMultiplier(const float NewSpeedMultiplier)	 // 0x4849c64;
	void PauseNavigation()	 // 0x4849d3c;
	void ResumeNavigation()	 // 0x4849db0;
	void SetAvoidanceAgainst(class AActor* Actor, bool Enable)	 // 0x4849dc4;
	void SetNavOctree(class AMercunaNavOctree* NavOctree_0)	 // 0x4849fc8;
	void SetNavOctreeToBest()	 // 0x484a088;
	void SetUsageSpec(const struct FMercunaUsageSpec& NewUsageSpec)	 // 0x484a09c;
	void Stop()	 // 0x484a160;
	void TrackActor(class AActor* Actor, float Distance, float Speed, const struct FVector& Offset)	 // 0x484a174;

	class AMercunaNavOctree* GetNavOctree() const	 // 0x4847954;
	const struct FMercunaUsageSpec GetUsageSpec() const	 // 0x4847a78;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna3DNavigationComponent">();
	}
	static class UMercuna3DNavigationComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna3DNavigationComponent>();
	}
};
static_assert(alignof(UMercuna3DNavigationComponent) == 0x000008, "Wrong alignment on UMercuna3DNavigationComponent");
static_assert(sizeof(UMercuna3DNavigationComponent) == 0x000200, "Wrong size on UMercuna3DNavigationComponent");
static_assert(offsetof(UMercuna3DNavigationComponent, Configuration) == 0x000190, "Member 'UMercuna3DNavigationComponent::Configuration' has a wrong offset!");
static_assert(offsetof(UMercuna3DNavigationComponent, NavOctree) == 0x0001B0, "Member 'UMercuna3DNavigationComponent::NavOctree' has a wrong offset!");
static_assert(offsetof(UMercuna3DNavigationComponent, bAutomaticRadius) == 0x0001B8, "Member 'UMercuna3DNavigationComponent::bAutomaticRadius' has a wrong offset!");
static_assert(offsetof(UMercuna3DNavigationComponent, NavigationRadius) == 0x0001BC, "Member 'UMercuna3DNavigationComponent::NavigationRadius' has a wrong offset!");
static_assert(offsetof(UMercuna3DNavigationComponent, Pathfinding) == 0x0001C0, "Member 'UMercuna3DNavigationComponent::Pathfinding' has a wrong offset!");

// Class Mercuna.MercunaNavLink
// 0x0230 (0x04E0 - 0x02B0)
#pragma pack(push, 0x1)
class alignas(0x10) AMercunaNavLink : public AActor
{
public:
	struct FMercunaNavigationLink                 Link;                                              // 0x02B0(0x00E0)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	struct FMercunaSupportedAgentTypes            SupportedAgentTypes;                               // 0x0390(0x00A8)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bAutoRotation;                                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TypeTag;                                           // 0x043C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APawn* Pawn, EMercunaNavigationLinkDirection Direction, const struct FVector& Destination)> OnNavLinkStart; // 0x0448(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bApplyToAllNavGrids;                               // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMercunaNavGraph2D*                     NavGrid;                                           // 0x0460(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMercunaUsageTypes                     UsageTypes;                                        // 0x0468(0x0004)(Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x046C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterGridLink;                                    // 0x046D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AMercunaNavGraph2D>      LeftNavGrid;                                       // 0x0470(0x0030)(Edit, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class AMercunaNavGraph2D>      RightNavGrid;                                      // 0x04A0(0x0030)(Edit, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D0[0x8];                                      // 0x04D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddBetweenNavGrids(class AMercunaNavGraph2D* LeftNavGrid_0, class AMercunaNavGraph2D* RightNavGrid_0)	 // 0x485fba0;
	void AddToAllGrids()	 // 0x4860128;
	void AddToNavGrid(class AMercunaNavGraph2D* NavGrid_0)	 // 0x486087c;
	void ReceiveNavLinkEnd(class APawn* Pawn)	 // 0xae1e64;
	void ReceiveNavLinkStart(class APawn* Pawn, EMercunaNavigationLinkDirection Direction, const struct FVector& Destination)	 // 0xae1e64;
	void SetEnabled(bool bEnabled_0, const class FString& Reason)	 // 0x48647e4;

	struct FVector GetLeftPosition() const	 // 0x4862cc0;
	struct FRotator GetLeftRotation() const	 // 0x4862cf8;
	struct FTransform GetLeftTransform() const	 // 0x4862d30;
	struct FVector GetRightPosition() const	 // 0x4862dac;
	struct FRotator GetRightRotation() const	 // 0x4862de4;
	struct FTransform GetRightTransform() const	 // 0x4862e1c;
	bool InUse() const	 // 0x4862f0c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaNavLink">();
	}
	static class AMercunaNavLink* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AMercunaNavLink>();
	}
};
#pragma pack(pop)
static_assert(alignof(AMercunaNavLink) == 0x000010, "Wrong alignment on AMercunaNavLink");
static_assert(sizeof(AMercunaNavLink) == 0x0004E0, "Wrong size on AMercunaNavLink");
static_assert(offsetof(AMercunaNavLink, Link) == 0x0002B0, "Member 'AMercunaNavLink::Link' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, SupportedAgentTypes) == 0x000390, "Member 'AMercunaNavLink::SupportedAgentTypes' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, bAutoRotation) == 0x000438, "Member 'AMercunaNavLink::bAutoRotation' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, TypeTag) == 0x00043C, "Member 'AMercunaNavLink::TypeTag' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, OnNavLinkStart) == 0x000448, "Member 'AMercunaNavLink::OnNavLinkStart' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, bApplyToAllNavGrids) == 0x000458, "Member 'AMercunaNavLink::bApplyToAllNavGrids' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, NavGrid) == 0x000460, "Member 'AMercunaNavLink::NavGrid' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, UsageTypes) == 0x000468, "Member 'AMercunaNavLink::UsageTypes' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, bEnabled) == 0x00046C, "Member 'AMercunaNavLink::bEnabled' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, bInterGridLink) == 0x00046D, "Member 'AMercunaNavLink::bInterGridLink' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, LeftNavGrid) == 0x000470, "Member 'AMercunaNavLink::LeftNavGrid' has a wrong offset!");
static_assert(offsetof(AMercunaNavLink, RightNavGrid) == 0x0004A0, "Member 'AMercunaNavLink::RightNavGrid' has a wrong offset!");

// Class Mercuna.MercunaGroundTask_MoveTo
// 0x00A8 (0x0118 - 0x0070)
class UMercunaGroundTask_MoveTo final : public UAITask
{
public:
	TMulticastInlineDelegate<void()>              OnRequestFailed;                                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(EMercunaMoveResult Result, class AAIController* AIController)> OnMoveFinished; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x88];                                      // 0x0090(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UMercunaGroundTask_MoveTo* MoveTo(class AAIController* Controller, const struct FVector& GoalLocation, class AActor* GoalActor, float EndDistance, bool AcceptPartialPath, bool bLockAILogic)	 // 0x485b450;

	void OnMoveComplete(const struct FAIRequestID& RequestID, EMercunaMoveResult Result)	 // 0x48499e0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaGroundTask_MoveTo">();
	}
	static class UMercunaGroundTask_MoveTo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercunaGroundTask_MoveTo>();
	}
};
static_assert(alignof(UMercunaGroundTask_MoveTo) == 0x000008, "Wrong alignment on UMercunaGroundTask_MoveTo");
static_assert(sizeof(UMercunaGroundTask_MoveTo) == 0x000118, "Wrong size on UMercunaGroundTask_MoveTo");
static_assert(offsetof(UMercunaGroundTask_MoveTo, OnRequestFailed) == 0x000070, "Member 'UMercunaGroundTask_MoveTo::OnRequestFailed' has a wrong offset!");
static_assert(offsetof(UMercunaGroundTask_MoveTo, OnMoveFinished) == 0x000080, "Member 'UMercunaGroundTask_MoveTo::OnMoveFinished' has a wrong offset!");

// Class Mercuna.BTTask_MercunaGround_MoveTo
// 0x0010 (0x00A8 - 0x0098)
class UBTTask_MercunaGround_MoveTo : public UBTTask_BlackboardBase
{
public:
	float                                         Speed;                                             // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bObserveBlackboardValue : 1;                       // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPartialPath : 1;                             // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAvoidTargetActor : 1;                             // 0x00A0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"BTTask_MercunaGround_MoveTo">();
	}
	static class UBTTask_MercunaGround_MoveTo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBTTask_MercunaGround_MoveTo>();
	}
};
static_assert(alignof(UBTTask_MercunaGround_MoveTo) == 0x000008, "Wrong alignment on UBTTask_MercunaGround_MoveTo");
static_assert(sizeof(UBTTask_MercunaGround_MoveTo) == 0x0000A8, "Wrong size on UBTTask_MercunaGround_MoveTo");
static_assert(offsetof(UBTTask_MercunaGround_MoveTo, Speed) == 0x000098, "Member 'UBTTask_MercunaGround_MoveTo::Speed' has a wrong offset!");
static_assert(offsetof(UBTTask_MercunaGround_MoveTo, EndDistance) == 0x00009C, "Member 'UBTTask_MercunaGround_MoveTo::EndDistance' has a wrong offset!");

// Class Mercuna.Mercuna3DMoveToProxy
// 0x0070 (0x00A0 - 0x0030)
class UMercuna3DMoveToProxy final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn;                                              // 0x0050(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x48];                                      // 0x0058(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UMercuna3DMoveToProxy* MoveToActor(class UObject* WorldContextObject, class APawn* Pawn_0, class AActor* Actor, float EndDistance, float Speed, bool UsePartialPath)	 // 0x48486ac;
	static class UMercuna3DMoveToProxy* MoveToLocation(class UObject* WorldContextObject, class APawn* Pawn_0, const struct FVector& Destination, float EndDistance, float Speed, bool UsePartialPath)	 // 0x4848c18;
	static class UMercuna3DMoveToProxy* MoveToLocations(class UObject* WorldContextObject, class APawn* Pawn_0, const TArray<struct FVector>& Destinations, float EndDistance, float Speed, bool UsePartialPath)	 // 0x4849128;

	void OnMoveComplete(const struct FAIRequestID& RequestID, EMercunaMoveResult Result)	 // 0x48498a0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna3DMoveToProxy">();
	}
	static class UMercuna3DMoveToProxy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna3DMoveToProxy>();
	}
};
static_assert(alignof(UMercuna3DMoveToProxy) == 0x000008, "Wrong alignment on UMercuna3DMoveToProxy");
static_assert(sizeof(UMercuna3DMoveToProxy) == 0x0000A0, "Wrong size on UMercuna3DMoveToProxy");
static_assert(offsetof(UMercuna3DMoveToProxy, OnSuccess) == 0x000030, "Member 'UMercuna3DMoveToProxy::OnSuccess' has a wrong offset!");
static_assert(offsetof(UMercuna3DMoveToProxy, OnFailure) == 0x000040, "Member 'UMercuna3DMoveToProxy::OnFailure' has a wrong offset!");
static_assert(offsetof(UMercuna3DMoveToProxy, Pawn) == 0x000050, "Member 'UMercuna3DMoveToProxy::Pawn' has a wrong offset!");

// Class Mercuna.Mercuna3DQueryTest
// 0x0000 (0x0208 - 0x0208)
class UMercuna3DQueryTest : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna3DQueryTest">();
	}
	static class UMercuna3DQueryTest* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna3DQueryTest>();
	}
};
static_assert(alignof(UMercuna3DQueryTest) == 0x000008, "Wrong alignment on UMercuna3DQueryTest");
static_assert(sizeof(UMercuna3DQueryTest) == 0x000208, "Wrong size on UMercuna3DQueryTest");

// Class Mercuna.EnvQueryTest_Mercuna3D_ProjectInDir
// 0x0088 (0x0290 - 0x0208)
class UEnvQueryTest_Mercuna3D_ProjectInDir final : public UMercuna3DQueryTest
{
public:
	struct FAIDataProviderFloatValue              MaxProjectDistance;                                // 0x0208(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               ProjectToNavigable;                                // 0x0240(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FVector                                ProjectDirection;                                  // 0x0278(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryTest_Mercuna3D_ProjectInDir">();
	}
	static class UEnvQueryTest_Mercuna3D_ProjectInDir* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryTest_Mercuna3D_ProjectInDir>();
	}
};
static_assert(alignof(UEnvQueryTest_Mercuna3D_ProjectInDir) == 0x000008, "Wrong alignment on UEnvQueryTest_Mercuna3D_ProjectInDir");
static_assert(sizeof(UEnvQueryTest_Mercuna3D_ProjectInDir) == 0x000290, "Wrong size on UEnvQueryTest_Mercuna3D_ProjectInDir");
static_assert(offsetof(UEnvQueryTest_Mercuna3D_ProjectInDir, MaxProjectDistance) == 0x000208, "Member 'UEnvQueryTest_Mercuna3D_ProjectInDir::MaxProjectDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna3D_ProjectInDir, ProjectToNavigable) == 0x000240, "Member 'UEnvQueryTest_Mercuna3D_ProjectInDir::ProjectToNavigable' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna3D_ProjectInDir, ProjectDirection) == 0x000278, "Member 'UEnvQueryTest_Mercuna3D_ProjectInDir::ProjectDirection' has a wrong offset!");

// Class Mercuna.Mercuna2DNavigationComponent
// 0x00C0 (0x0250 - 0x0190)
class UMercuna2DNavigationComponent : public UMercunaNavigationComponent
{
public:
	TMulticastInlineDelegate<void(const struct FVector& StartPosition, const struct FVector& EndPosition, const struct FVector& SuggestedLaunchVelocity)> OnJumpStarted; // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UActorComponent*                        MovementComponent;                                 // 0x01A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x58];                                     // 0x01A8(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       QueryFilter;                                       // 0x0200(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_210[0x40];                                     // 0x0210(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna2DNavigationComponent">();
	}
	static class UMercuna2DNavigationComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna2DNavigationComponent>();
	}
};
static_assert(alignof(UMercuna2DNavigationComponent) == 0x000008, "Wrong alignment on UMercuna2DNavigationComponent");
static_assert(sizeof(UMercuna2DNavigationComponent) == 0x000250, "Wrong size on UMercuna2DNavigationComponent");
static_assert(offsetof(UMercuna2DNavigationComponent, OnJumpStarted) == 0x000190, "Member 'UMercuna2DNavigationComponent::OnJumpStarted' has a wrong offset!");
static_assert(offsetof(UMercuna2DNavigationComponent, MovementComponent) == 0x0001A0, "Member 'UMercuna2DNavigationComponent::MovementComponent' has a wrong offset!");
static_assert(offsetof(UMercuna2DNavigationComponent, QueryFilter) == 0x000200, "Member 'UMercuna2DNavigationComponent::QueryFilter' has a wrong offset!");

// Class Mercuna.MercunaGroundNavigationComponent
// 0x0080 (0x02D0 - 0x0250)
class UMercunaGroundNavigationComponent : public UMercuna2DNavigationComponent
{
public:
	TMulticastInlineDelegate<void()>              OnSwimStarted;                                     // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSwimStopped;                                     // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AMercunaNavGroundGrid*                  NavGrid;                                           // 0x0270(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMercunaGroundAgentType                AgentType;                                         // 0x0278(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutomaticSteeringParameters;                      // 0x0284(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMercunaGroundNavigationSteeringParameters SteeringParameters;                            // 0x0288(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bSetCharacterControllerRotation;                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMercunaGroundNavigationConfiguration  Configuration;                                     // 0x02AC(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDestinationLocation(const struct FVector& NextDestination, bool bSmoothTransition)	 // 0x484d898;
	void CancelMovement()	 // 0x48476ec;
	void ClearAvoidanceExclusions()	 // 0x1203138;
	void Configure(const struct FMercunaGroundNavigationConfiguration& NewConfiguration)	 // 0x484da00;
	void ConfigureMovement(EMercunaAvoidanceMode NewAvoidanceMode)	 // 0x484daac;
	void ConfigureSteering(const struct FMercunaGroundNavigationSteeringParameters& NewSteering)	 // 0x484db6c;
	struct FVector GetLookDirection()	 // 0x484dd14;
	void GetPathInfo(bool* Valid, float* DistanceToEnd)	 // 0x484796c;
	float GetRemainingPathLength()	 // 0x4847a4c;
	void InvalidateContextualSteeringParams()	 // 0x476124c;
	void InvalidateContextualSteeringParamsAgainstActor(class AActor* Actor)	 // 0x4847c20;
	void MoveToActor(class AActor* Actor, float EndDistance, float Speed, bool UsePartialPath)	 // 0x484e7f4;
	void MoveToLocation(const struct FVector& Destination, const struct FVector& EndDirection, float EndDistance, float Speed, bool UsePartialPath)	 // 0x484edc8;
	void MoveToLocations(const TArray<struct FVector>& Destinations, const struct FVector& EndDirection, float EndDistance, float Speed, bool UsePartialPath)	 // 0x484f59c;
	void NavLinkComplete()	 // 0x484f9dc;
	bool OverrideSpeedMultiplier(const float NewSpeedMultiplier)	 // 0x4849c64;
	void PauseNavigation()	 // 0x484fc74;
	void ResumeNavigation()	 // 0x484fc8c;
	void SetAgentType(const struct FMercunaGroundAgentType& NewAgentType)	 // 0x484fca4;
	void SetAvoidanceAgainst(class AActor* Actor, bool Enable)	 // 0x4849dc4;
	void SetNavGrid(class AMercunaNavGroundGrid* NavGrid_0)	 // 0x484fd80;
	void SetNavGridToBest()	 // 0x484fe40;
	void SetUsageSpec(const struct FMercunaUsageSpec& NewUsageSpec)	 // 0x484a09c;
	void Stop()	 // 0x484fe54;
	void TrackActor(class AActor* Actor, float Distance, float Speed, const struct FVector& Offset, bool UsePartialPath)	 // 0x484fe78;
	void UpdateDynamicSteeringParams(const struct FMercunaGroundNavigationDynamicSteeringParameters& NewDynamicSteeringParams)	 // 0x485050c;

	struct FMercunaGroundNavigationConfiguration GetConfiguration() const	 // 0x484dc28;
	struct FMercunaGroundNavigationDynamicSteeringParameters GetDynamicSteeringParameters() const	 // 0x484dc5c;
	struct FVector GetLastInputVector() const	 // 0x484dcec;
	class AMercunaNavGroundGrid* GetNavGrid() const	 // 0x484dd50;
	void GetNextNavLink(bool* bNextNavLinkFound, float* DistanceToNextNavLink, float* TimeToNextNavLink, struct FVector* TraversalStart, struct FVector* TraversalEnd, bool* bIsAutoGenerated, class AMercunaNavLink** NavLink, struct FMercunaAutoNavLink* AutoGeneratedNavLink, float MaxLookAhead) const	 // 0x484dd68;
	struct FMercunaGroundNavigationSteeringParameters GetSteeringParameters() const	 // 0x484e138;
	EMerNavigationTrajectory GetTrajectory(struct FTrajectorySampleRange* TrajectorySampleRange, float LookAhead, int32 SampleRate, bool ReturnAbsoluteTimes) const	 // 0x484e160;
	const struct FMercunaUsageSpec GetUsageSpec() const	 // 0x4847a78;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaGroundNavigationComponent">();
	}
	static class UMercunaGroundNavigationComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercunaGroundNavigationComponent>();
	}
};
static_assert(alignof(UMercunaGroundNavigationComponent) == 0x000008, "Wrong alignment on UMercunaGroundNavigationComponent");
static_assert(sizeof(UMercunaGroundNavigationComponent) == 0x0002D0, "Wrong size on UMercunaGroundNavigationComponent");
static_assert(offsetof(UMercunaGroundNavigationComponent, OnSwimStarted) == 0x000250, "Member 'UMercunaGroundNavigationComponent::OnSwimStarted' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, OnSwimStopped) == 0x000260, "Member 'UMercunaGroundNavigationComponent::OnSwimStopped' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, NavGrid) == 0x000270, "Member 'UMercunaGroundNavigationComponent::NavGrid' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, AgentType) == 0x000278, "Member 'UMercunaGroundNavigationComponent::AgentType' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, bAutomaticSteeringParameters) == 0x000284, "Member 'UMercunaGroundNavigationComponent::bAutomaticSteeringParameters' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, SteeringParameters) == 0x000288, "Member 'UMercunaGroundNavigationComponent::SteeringParameters' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, bSetCharacterControllerRotation) == 0x0002A8, "Member 'UMercunaGroundNavigationComponent::bSetCharacterControllerRotation' has a wrong offset!");
static_assert(offsetof(UMercunaGroundNavigationComponent, Configuration) == 0x0002AC, "Member 'UMercunaGroundNavigationComponent::Configuration' has a wrong offset!");

// Class Mercuna.Mercuna2DQueryGenerator
// 0x0010 (0x0060 - 0x0050)
class UMercuna2DQueryGenerator : public UEnvQueryGenerator
{
public:
	TSubclassOf<class APawn>                      AgentClass;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna2DQueryGenerator">();
	}
	static class UMercuna2DQueryGenerator* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna2DQueryGenerator>();
	}
};
static_assert(alignof(UMercuna2DQueryGenerator) == 0x000008, "Wrong alignment on UMercuna2DQueryGenerator");
static_assert(sizeof(UMercuna2DQueryGenerator) == 0x000060, "Wrong size on UMercuna2DQueryGenerator");
static_assert(offsetof(UMercuna2DQueryGenerator, AgentClass) == 0x000050, "Member 'UMercuna2DQueryGenerator::AgentClass' has a wrong offset!");

// Class Mercuna.EnvQueryGenerator_Mercuna_2DNavGrid
// 0x00E8 (0x0148 - 0x0060)
class UEnvQueryGenerator_Mercuna_2DNavGrid : public UMercuna2DQueryGenerator
{
public:
	struct FAIDataProviderFloatValue              MaxDistance;                                       // 0x0060(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               MaxDistanceIsPathDistance;                         // 0x0098(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              SpaceBetween;                                      // 0x00D0(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Centre;                                            // 0x0108(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderBoolValue               AlignPointsToCenter;                               // 0x0110(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryGenerator_Mercuna_2DNavGrid">();
	}
	static class UEnvQueryGenerator_Mercuna_2DNavGrid* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_Mercuna_2DNavGrid>();
	}
};
static_assert(alignof(UEnvQueryGenerator_Mercuna_2DNavGrid) == 0x000008, "Wrong alignment on UEnvQueryGenerator_Mercuna_2DNavGrid");
static_assert(sizeof(UEnvQueryGenerator_Mercuna_2DNavGrid) == 0x000148, "Wrong size on UEnvQueryGenerator_Mercuna_2DNavGrid");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_2DNavGrid, MaxDistance) == 0x000060, "Member 'UEnvQueryGenerator_Mercuna_2DNavGrid::MaxDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_2DNavGrid, MaxDistanceIsPathDistance) == 0x000098, "Member 'UEnvQueryGenerator_Mercuna_2DNavGrid::MaxDistanceIsPathDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_2DNavGrid, SpaceBetween) == 0x0000D0, "Member 'UEnvQueryGenerator_Mercuna_2DNavGrid::SpaceBetween' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_2DNavGrid, Centre) == 0x000108, "Member 'UEnvQueryGenerator_Mercuna_2DNavGrid::Centre' has a wrong offset!");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_2DNavGrid, AlignPointsToCenter) == 0x000110, "Member 'UEnvQueryGenerator_Mercuna_2DNavGrid::AlignPointsToCenter' has a wrong offset!");

// Class Mercuna.EnvQueryGenerator_Mercuna_GroundNavGrid
// 0x0008 (0x0150 - 0x0148)
class UEnvQueryGenerator_Mercuna_GroundNavGrid final : public UEnvQueryGenerator_Mercuna_2DNavGrid
{
public:
	EMercunaNavLinkQueryMode                      FollowNavLinks;                                    // 0x0148(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryGenerator_Mercuna_GroundNavGrid">();
	}
	static class UEnvQueryGenerator_Mercuna_GroundNavGrid* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryGenerator_Mercuna_GroundNavGrid>();
	}
};
static_assert(alignof(UEnvQueryGenerator_Mercuna_GroundNavGrid) == 0x000008, "Wrong alignment on UEnvQueryGenerator_Mercuna_GroundNavGrid");
static_assert(sizeof(UEnvQueryGenerator_Mercuna_GroundNavGrid) == 0x000150, "Wrong size on UEnvQueryGenerator_Mercuna_GroundNavGrid");
static_assert(offsetof(UEnvQueryGenerator_Mercuna_GroundNavGrid, FollowNavLinks) == 0x000148, "Member 'UEnvQueryGenerator_Mercuna_GroundNavGrid::FollowNavLinks' has a wrong offset!");

// Class Mercuna.MercunaNavGraph
// 0x01F0 (0x04A0 - 0x02B0)
class AMercunaNavGraph : public AActor
{
public:
	float                                         CellSize;                                          // 0x02B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             GeometryCollisionChannel;                          // 0x02B4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExcludeTag;                                        // 0x02B8(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeverSave;                                        // 0x02C0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowNavGraphMerging;                             // 0x02C1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisablePartitionOfNavData;                        // 0x02C2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             GenerationBoxesPerChunk;                           // 0x02C4(0x000C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecordGeometryCollectionStatistics;               // 0x02D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0xF];                                      // 0x02D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBuildAsSublevel;                                  // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsingChunks;                                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsRebuild;                                     // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E3[0xD];                                      // 0x02E3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             BuildTransform;                                    // 0x02F0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0xF8];                                     // 0x0350(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UMerNavGraphRenderingComponent*         MerNavGraphRenderingComponent;                     // 0x0448(0x0008)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_450[0x50];                                     // 0x0450(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SaveToFile(const class FString& Filename) const	 // 0x485d030;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaNavGraph">();
	}
	static class AMercunaNavGraph* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AMercunaNavGraph>();
	}
};
static_assert(alignof(AMercunaNavGraph) == 0x000010, "Wrong alignment on AMercunaNavGraph");
static_assert(sizeof(AMercunaNavGraph) == 0x0004A0, "Wrong size on AMercunaNavGraph");
static_assert(offsetof(AMercunaNavGraph, CellSize) == 0x0002B0, "Member 'AMercunaNavGraph::CellSize' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, GeometryCollisionChannel) == 0x0002B4, "Member 'AMercunaNavGraph::GeometryCollisionChannel' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, ExcludeTag) == 0x0002B8, "Member 'AMercunaNavGraph::ExcludeTag' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bNeverSave) == 0x0002C0, "Member 'AMercunaNavGraph::bNeverSave' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bAllowNavGraphMerging) == 0x0002C1, "Member 'AMercunaNavGraph::bAllowNavGraphMerging' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bDisablePartitionOfNavData) == 0x0002C2, "Member 'AMercunaNavGraph::bDisablePartitionOfNavData' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, GenerationBoxesPerChunk) == 0x0002C4, "Member 'AMercunaNavGraph::GenerationBoxesPerChunk' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bRecordGeometryCollectionStatistics) == 0x0002D0, "Member 'AMercunaNavGraph::bRecordGeometryCollectionStatistics' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bBuildAsSublevel) == 0x0002E0, "Member 'AMercunaNavGraph::bBuildAsSublevel' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bUsingChunks) == 0x0002E1, "Member 'AMercunaNavGraph::bUsingChunks' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, bNeedsRebuild) == 0x0002E2, "Member 'AMercunaNavGraph::bNeedsRebuild' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, BuildTransform) == 0x0002F0, "Member 'AMercunaNavGraph::BuildTransform' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph, MerNavGraphRenderingComponent) == 0x000448, "Member 'AMercunaNavGraph::MerNavGraphRenderingComponent' has a wrong offset!");

// Class Mercuna.EnvQueryTest_Mercuna2D_PathLength
// 0x0080 (0x0290 - 0x0210)
class UEnvQueryTest_Mercuna2D_PathLength : public UMercuna2DQueryTest
{
public:
	TSubclassOf<class APawn>                      AgentClass;                                        // 0x0210(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              MaxPathDistance;                                   // 0x0218(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIDataProviderFloatValue              ClampDistance;                                     // 0x0250(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x0288(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryTest_Mercuna2D_PathLength">();
	}
	static class UEnvQueryTest_Mercuna2D_PathLength* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryTest_Mercuna2D_PathLength>();
	}
};
static_assert(alignof(UEnvQueryTest_Mercuna2D_PathLength) == 0x000008, "Wrong alignment on UEnvQueryTest_Mercuna2D_PathLength");
static_assert(sizeof(UEnvQueryTest_Mercuna2D_PathLength) == 0x000290, "Wrong size on UEnvQueryTest_Mercuna2D_PathLength");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_PathLength, AgentClass) == 0x000210, "Member 'UEnvQueryTest_Mercuna2D_PathLength::AgentClass' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_PathLength, MaxPathDistance) == 0x000218, "Member 'UEnvQueryTest_Mercuna2D_PathLength::MaxPathDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_PathLength, ClampDistance) == 0x000250, "Member 'UEnvQueryTest_Mercuna2D_PathLength::ClampDistance' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_Mercuna2D_PathLength, Context) == 0x000288, "Member 'UEnvQueryTest_Mercuna2D_PathLength::Context' has a wrong offset!");

// Class Mercuna.EnvQueryTest_MercunaGround_PathLength
// 0x0008 (0x0298 - 0x0290)
class UEnvQueryTest_MercunaGround_PathLength final : public UEnvQueryTest_Mercuna2D_PathLength
{
public:
	EMercunaNavLinkQueryMode                      FollowNavLinks;                                    // 0x0290(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvQueryTest_MercunaGround_PathLength">();
	}
	static class UEnvQueryTest_MercunaGround_PathLength* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvQueryTest_MercunaGround_PathLength>();
	}
};
static_assert(alignof(UEnvQueryTest_MercunaGround_PathLength) == 0x000008, "Wrong alignment on UEnvQueryTest_MercunaGround_PathLength");
static_assert(sizeof(UEnvQueryTest_MercunaGround_PathLength) == 0x000298, "Wrong size on UEnvQueryTest_MercunaGround_PathLength");
static_assert(offsetof(UEnvQueryTest_MercunaGround_PathLength, FollowNavLinks) == 0x000290, "Member 'UEnvQueryTest_MercunaGround_PathLength::FollowNavLinks' has a wrong offset!");

// Class Mercuna.MercunaNavGraph2D
// 0x01B0 (0x0650 - 0x04A0)
#pragma pack(push, 0x1)
class alignas(0x10) AMercunaNavGraph2D : public AMercunaNavGraph
{
public:
	bool                                          bUsePhysicalMaterials;                             // 0x04A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicalMaterial*>              PhysicalMaterialPriorities;                        // 0x04A8(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FMercunaSupportedAgentTypes            SupportedAgentTypes;                               // 0x04B8(0x00A8)(Edit, BlueprintVisible, BlueprintReadOnly, Config, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          bUseNavSeeds;                                      // 0x0560(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBeforeEditorBuild;                               // 0x0568(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool Success)>  OnBuildComplete;                                   // 0x0578(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* Volume, bool Success)> OnRebuildComplete;      // 0x0588(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadComplete;                                    // 0x0598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FBox& Bounds)> OnChunkAdded;                          // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	EMerGridDebugDrawMode                         DebugDrawMode;                                     // 0x05B8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMerGridDebugDrawSubmode                      DebugDrawSubmode;                                  // 0x05B9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5BA[0x2];                                      // 0x05BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMercunaAgentType                      DebugDrawAgentType;                                // 0x05BC(0x000C)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class AMercunaNavLink>> NavLinks;                                          // 0x05C8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint32                                        NextMaterialId;                                    // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UPhysicalMaterial*, uint32>        SurfaceMaterials;                                  // 0x05E0(0x0050)(Protected, NativeAccessSpecifierProtected)
	struct FVector                                NavLinkBorder;                                     // 0x0630(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MercunaNavGraph2D">();
	}
	static class AMercunaNavGraph2D* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AMercunaNavGraph2D>();
	}
};
#pragma pack(pop)
static_assert(alignof(AMercunaNavGraph2D) == 0x000010, "Wrong alignment on AMercunaNavGraph2D");
static_assert(sizeof(AMercunaNavGraph2D) == 0x000650, "Wrong size on AMercunaNavGraph2D");
static_assert(offsetof(AMercunaNavGraph2D, bUsePhysicalMaterials) == 0x0004A0, "Member 'AMercunaNavGraph2D::bUsePhysicalMaterials' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, PhysicalMaterialPriorities) == 0x0004A8, "Member 'AMercunaNavGraph2D::PhysicalMaterialPriorities' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, SupportedAgentTypes) == 0x0004B8, "Member 'AMercunaNavGraph2D::SupportedAgentTypes' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, bUseNavSeeds) == 0x000560, "Member 'AMercunaNavGraph2D::bUseNavSeeds' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, OnBeforeEditorBuild) == 0x000568, "Member 'AMercunaNavGraph2D::OnBeforeEditorBuild' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, OnBuildComplete) == 0x000578, "Member 'AMercunaNavGraph2D::OnBuildComplete' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, OnRebuildComplete) == 0x000588, "Member 'AMercunaNavGraph2D::OnRebuildComplete' has a wrong offset!");
static_assert(offsetof(AMercunaNavGraph2D, OnLoadComplete) == 0x000598, "Member 'AMercunaNavGraph2D::OnLoadComplete' has a wrong offset!");
