#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mercuna

#include "Basic.hpp"

#include "Mercuna_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function Mercuna.Mercuna3DNavigationComponent.AddDestinationLocation
// 0x0018 (0x0018 - 0x0000)
struct Mercuna3DNavigationComponent_AddDestinationLocation final
{
public:
	struct FVector                                NextDestination;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_AddDestinationLocation) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_AddDestinationLocation");
static_assert(sizeof(Mercuna3DNavigationComponent_AddDestinationLocation) == 0x000018, "Wrong size on Mercuna3DNavigationComponent_AddDestinationLocation");
static_assert(offsetof(Mercuna3DNavigationComponent_AddDestinationLocation, NextDestination) == 0x000000, "Member 'Mercuna3DNavigationComponent_AddDestinationLocation::NextDestination' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.Configure
// 0x001C (0x001C - 0x0000)
struct Mercuna3DNavigationComponent_Configure final
{
public:
	struct FMercuna3DNavigationConfiguration      NewConfiguration;                                  // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_Configure) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_Configure");
static_assert(sizeof(Mercuna3DNavigationComponent_Configure) == 0x00001C, "Wrong size on Mercuna3DNavigationComponent_Configure");
static_assert(offsetof(Mercuna3DNavigationComponent_Configure, NewConfiguration) == 0x000000, "Member 'Mercuna3DNavigationComponent_Configure::NewConfiguration' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.ConfigureMovement
// 0x0002 (0x0002 - 0x0000)
struct Mercuna3DNavigationComponent_ConfigureMovement final
{
public:
	bool                                          bUsePathfinding;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMercunaAvoidanceMode                         NewAvoidanceMode;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_ConfigureMovement) == 0x000001, "Wrong alignment on Mercuna3DNavigationComponent_ConfigureMovement");
static_assert(sizeof(Mercuna3DNavigationComponent_ConfigureMovement) == 0x000002, "Wrong size on Mercuna3DNavigationComponent_ConfigureMovement");
static_assert(offsetof(Mercuna3DNavigationComponent_ConfigureMovement, bUsePathfinding) == 0x000000, "Member 'Mercuna3DNavigationComponent_ConfigureMovement::bUsePathfinding' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_ConfigureMovement, NewAvoidanceMode) == 0x000001, "Member 'Mercuna3DNavigationComponent_ConfigureMovement::NewAvoidanceMode' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.GetPathInfo
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_GetPathInfo final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToEnd;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_GetPathInfo) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_GetPathInfo");
static_assert(sizeof(Mercuna3DNavigationComponent_GetPathInfo) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_GetPathInfo");
static_assert(offsetof(Mercuna3DNavigationComponent_GetPathInfo, Valid) == 0x000000, "Member 'Mercuna3DNavigationComponent_GetPathInfo::Valid' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_GetPathInfo, DistanceToEnd) == 0x000004, "Member 'Mercuna3DNavigationComponent_GetPathInfo::DistanceToEnd' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.GetRemainingPathLength
// 0x0004 (0x0004 - 0x0000)
struct Mercuna3DNavigationComponent_GetRemainingPathLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_GetRemainingPathLength) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_GetRemainingPathLength");
static_assert(sizeof(Mercuna3DNavigationComponent_GetRemainingPathLength) == 0x000004, "Wrong size on Mercuna3DNavigationComponent_GetRemainingPathLength");
static_assert(offsetof(Mercuna3DNavigationComponent_GetRemainingPathLength, ReturnValue) == 0x000000, "Member 'Mercuna3DNavigationComponent_GetRemainingPathLength::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.InvalidateContextualSteeringParamsAgainstActor
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor");
static_assert(sizeof(Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor");
static_assert(offsetof(Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor, Actor) == 0x000000, "Member 'Mercuna3DNavigationComponent_InvalidateContextualSteeringParamsAgainstActor::Actor' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.IsReachable
// 0x0040 (0x0040 - 0x0000)
struct Mercuna3DNavigationComponent_IsReachable final
{
public:
	struct FVector                                Point;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Success;                                           // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                WorldContextObject;                                // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0028(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_IsReachable) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_IsReachable");
static_assert(sizeof(Mercuna3DNavigationComponent_IsReachable) == 0x000040, "Wrong size on Mercuna3DNavigationComponent_IsReachable");
static_assert(offsetof(Mercuna3DNavigationComponent_IsReachable, Point) == 0x000000, "Member 'Mercuna3DNavigationComponent_IsReachable::Point' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_IsReachable, Success) == 0x000018, "Member 'Mercuna3DNavigationComponent_IsReachable::Success' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_IsReachable, WorldContextObject) == 0x000020, "Member 'Mercuna3DNavigationComponent_IsReachable::WorldContextObject' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_IsReachable, LatentInfo) == 0x000028, "Member 'Mercuna3DNavigationComponent_IsReachable::LatentInfo' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.LookAlongAcceleration
// 0x0004 (0x0004 - 0x0000)
struct Mercuna3DNavigationComponent_LookAlongAcceleration final
{
public:
	float                                         MaxPitch;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_LookAlongAcceleration) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_LookAlongAcceleration");
static_assert(sizeof(Mercuna3DNavigationComponent_LookAlongAcceleration) == 0x000004, "Wrong size on Mercuna3DNavigationComponent_LookAlongAcceleration");
static_assert(offsetof(Mercuna3DNavigationComponent_LookAlongAcceleration, MaxPitch) == 0x000000, "Member 'Mercuna3DNavigationComponent_LookAlongAcceleration::MaxPitch' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.LookAt
// 0x0010 (0x0010 - 0x0000)
struct Mercuna3DNavigationComponent_LookAt final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitch;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_LookAt) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_LookAt");
static_assert(sizeof(Mercuna3DNavigationComponent_LookAt) == 0x000010, "Wrong size on Mercuna3DNavigationComponent_LookAt");
static_assert(offsetof(Mercuna3DNavigationComponent_LookAt, Actor) == 0x000000, "Member 'Mercuna3DNavigationComponent_LookAt::Actor' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_LookAt, MaxPitch) == 0x000008, "Member 'Mercuna3DNavigationComponent_LookAt::MaxPitch' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.LookInDirection
// 0x0020 (0x0020 - 0x0000)
struct Mercuna3DNavigationComponent_LookInDirection final
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitch;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_LookInDirection) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_LookInDirection");
static_assert(sizeof(Mercuna3DNavigationComponent_LookInDirection) == 0x000020, "Wrong size on Mercuna3DNavigationComponent_LookInDirection");
static_assert(offsetof(Mercuna3DNavigationComponent_LookInDirection, Direction) == 0x000000, "Member 'Mercuna3DNavigationComponent_LookInDirection::Direction' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_LookInDirection, MaxPitch) == 0x000018, "Member 'Mercuna3DNavigationComponent_LookInDirection::MaxPitch' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.MoveToActor
// 0x0018 (0x0018 - 0x0000)
struct Mercuna3DNavigationComponent_MoveToActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_MoveToActor) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_MoveToActor");
static_assert(sizeof(Mercuna3DNavigationComponent_MoveToActor) == 0x000018, "Wrong size on Mercuna3DNavigationComponent_MoveToActor");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToActor, Actor) == 0x000000, "Member 'Mercuna3DNavigationComponent_MoveToActor::Actor' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToActor, EndDistance) == 0x000008, "Member 'Mercuna3DNavigationComponent_MoveToActor::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToActor, Speed) == 0x00000C, "Member 'Mercuna3DNavigationComponent_MoveToActor::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToActor, UsePartialPath) == 0x000010, "Member 'Mercuna3DNavigationComponent_MoveToActor::UsePartialPath' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.MoveToLocation
// 0x0028 (0x0028 - 0x0000)
struct Mercuna3DNavigationComponent_MoveToLocation final
{
public:
	struct FVector                                Destination;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_MoveToLocation) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_MoveToLocation");
static_assert(sizeof(Mercuna3DNavigationComponent_MoveToLocation) == 0x000028, "Wrong size on Mercuna3DNavigationComponent_MoveToLocation");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocation, Destination) == 0x000000, "Member 'Mercuna3DNavigationComponent_MoveToLocation::Destination' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocation, EndDistance) == 0x000018, "Member 'Mercuna3DNavigationComponent_MoveToLocation::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocation, Speed) == 0x00001C, "Member 'Mercuna3DNavigationComponent_MoveToLocation::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocation, UsePartialPath) == 0x000020, "Member 'Mercuna3DNavigationComponent_MoveToLocation::UsePartialPath' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.MoveToLocations
// 0x0020 (0x0020 - 0x0000)
struct Mercuna3DNavigationComponent_MoveToLocations final
{
public:
	TArray<struct FVector>                        Destinations;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_MoveToLocations) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_MoveToLocations");
static_assert(sizeof(Mercuna3DNavigationComponent_MoveToLocations) == 0x000020, "Wrong size on Mercuna3DNavigationComponent_MoveToLocations");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocations, Destinations) == 0x000000, "Member 'Mercuna3DNavigationComponent_MoveToLocations::Destinations' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocations, EndDistance) == 0x000010, "Member 'Mercuna3DNavigationComponent_MoveToLocations::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocations, Speed) == 0x000014, "Member 'Mercuna3DNavigationComponent_MoveToLocations::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_MoveToLocations, UsePartialPath) == 0x000018, "Member 'Mercuna3DNavigationComponent_MoveToLocations::UsePartialPath' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.OverrideSpeedMultiplier
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_OverrideSpeedMultiplier final
{
public:
	float                                         NewSpeedMultiplier;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_OverrideSpeedMultiplier) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_OverrideSpeedMultiplier");
static_assert(sizeof(Mercuna3DNavigationComponent_OverrideSpeedMultiplier) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_OverrideSpeedMultiplier");
static_assert(offsetof(Mercuna3DNavigationComponent_OverrideSpeedMultiplier, NewSpeedMultiplier) == 0x000000, "Member 'Mercuna3DNavigationComponent_OverrideSpeedMultiplier::NewSpeedMultiplier' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_OverrideSpeedMultiplier, ReturnValue) == 0x000004, "Member 'Mercuna3DNavigationComponent_OverrideSpeedMultiplier::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.SetAvoidanceAgainst
// 0x0010 (0x0010 - 0x0000)
struct Mercuna3DNavigationComponent_SetAvoidanceAgainst final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enable;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DNavigationComponent_SetAvoidanceAgainst) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_SetAvoidanceAgainst");
static_assert(sizeof(Mercuna3DNavigationComponent_SetAvoidanceAgainst) == 0x000010, "Wrong size on Mercuna3DNavigationComponent_SetAvoidanceAgainst");
static_assert(offsetof(Mercuna3DNavigationComponent_SetAvoidanceAgainst, Actor) == 0x000000, "Member 'Mercuna3DNavigationComponent_SetAvoidanceAgainst::Actor' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_SetAvoidanceAgainst, Enable) == 0x000008, "Member 'Mercuna3DNavigationComponent_SetAvoidanceAgainst::Enable' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.SetNavOctree
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_SetNavOctree final
{
public:
	class AMercunaNavOctree*                      NavOctree_0;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_SetNavOctree) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_SetNavOctree");
static_assert(sizeof(Mercuna3DNavigationComponent_SetNavOctree) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_SetNavOctree");
static_assert(offsetof(Mercuna3DNavigationComponent_SetNavOctree, NavOctree_0) == 0x000000, "Member 'Mercuna3DNavigationComponent_SetNavOctree::NavOctree_0' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.SetUsageSpec
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_SetUsageSpec final
{
public:
	struct FMercunaUsageSpec                      NewUsageSpec;                                      // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_SetUsageSpec) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_SetUsageSpec");
static_assert(sizeof(Mercuna3DNavigationComponent_SetUsageSpec) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_SetUsageSpec");
static_assert(offsetof(Mercuna3DNavigationComponent_SetUsageSpec, NewUsageSpec) == 0x000000, "Member 'Mercuna3DNavigationComponent_SetUsageSpec::NewUsageSpec' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.TrackActor
// 0x0028 (0x0028 - 0x0000)
struct Mercuna3DNavigationComponent_TrackActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_TrackActor) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_TrackActor");
static_assert(sizeof(Mercuna3DNavigationComponent_TrackActor) == 0x000028, "Wrong size on Mercuna3DNavigationComponent_TrackActor");
static_assert(offsetof(Mercuna3DNavigationComponent_TrackActor, Actor) == 0x000000, "Member 'Mercuna3DNavigationComponent_TrackActor::Actor' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_TrackActor, Distance) == 0x000008, "Member 'Mercuna3DNavigationComponent_TrackActor::Distance' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_TrackActor, Speed) == 0x00000C, "Member 'Mercuna3DNavigationComponent_TrackActor::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DNavigationComponent_TrackActor, Offset) == 0x000010, "Member 'Mercuna3DNavigationComponent_TrackActor::Offset' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.GetNavOctree
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_GetNavOctree final
{
public:
	class AMercunaNavOctree*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_GetNavOctree) == 0x000008, "Wrong alignment on Mercuna3DNavigationComponent_GetNavOctree");
static_assert(sizeof(Mercuna3DNavigationComponent_GetNavOctree) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_GetNavOctree");
static_assert(offsetof(Mercuna3DNavigationComponent_GetNavOctree, ReturnValue) == 0x000000, "Member 'Mercuna3DNavigationComponent_GetNavOctree::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DNavigationComponent.GetUsageSpec
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DNavigationComponent_GetUsageSpec final
{
public:
	struct FMercunaUsageSpec                      ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DNavigationComponent_GetUsageSpec) == 0x000004, "Wrong alignment on Mercuna3DNavigationComponent_GetUsageSpec");
static_assert(sizeof(Mercuna3DNavigationComponent_GetUsageSpec) == 0x000008, "Wrong size on Mercuna3DNavigationComponent_GetUsageSpec");
static_assert(offsetof(Mercuna3DNavigationComponent_GetUsageSpec, ReturnValue) == 0x000000, "Member 'Mercuna3DNavigationComponent_GetUsageSpec::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.AddBetweenNavGrids
// 0x0010 (0x0010 - 0x0000)
struct MercunaNavLink_AddBetweenNavGrids final
{
public:
	class AMercunaNavGraph2D*                     LeftNavGrid_0;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMercunaNavGraph2D*                     RightNavGrid_0;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_AddBetweenNavGrids) == 0x000008, "Wrong alignment on MercunaNavLink_AddBetweenNavGrids");
static_assert(sizeof(MercunaNavLink_AddBetweenNavGrids) == 0x000010, "Wrong size on MercunaNavLink_AddBetweenNavGrids");
static_assert(offsetof(MercunaNavLink_AddBetweenNavGrids, LeftNavGrid_0) == 0x000000, "Member 'MercunaNavLink_AddBetweenNavGrids::LeftNavGrid_0' has a wrong offset!");
static_assert(offsetof(MercunaNavLink_AddBetweenNavGrids, RightNavGrid_0) == 0x000008, "Member 'MercunaNavLink_AddBetweenNavGrids::RightNavGrid_0' has a wrong offset!");

// Function Mercuna.MercunaNavLink.AddToNavGrid
// 0x0008 (0x0008 - 0x0000)
struct MercunaNavLink_AddToNavGrid final
{
public:
	class AMercunaNavGraph2D*                     NavGrid_0;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_AddToNavGrid) == 0x000008, "Wrong alignment on MercunaNavLink_AddToNavGrid");
static_assert(sizeof(MercunaNavLink_AddToNavGrid) == 0x000008, "Wrong size on MercunaNavLink_AddToNavGrid");
static_assert(offsetof(MercunaNavLink_AddToNavGrid, NavGrid_0) == 0x000000, "Member 'MercunaNavLink_AddToNavGrid::NavGrid_0' has a wrong offset!");

// Function Mercuna.MercunaNavLink.ReceiveNavLinkEnd
// 0x0008 (0x0008 - 0x0000)
struct MercunaNavLink_ReceiveNavLinkEnd final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_ReceiveNavLinkEnd) == 0x000008, "Wrong alignment on MercunaNavLink_ReceiveNavLinkEnd");
static_assert(sizeof(MercunaNavLink_ReceiveNavLinkEnd) == 0x000008, "Wrong size on MercunaNavLink_ReceiveNavLinkEnd");
static_assert(offsetof(MercunaNavLink_ReceiveNavLinkEnd, Pawn) == 0x000000, "Member 'MercunaNavLink_ReceiveNavLinkEnd::Pawn' has a wrong offset!");

// Function Mercuna.MercunaNavLink.ReceiveNavLinkStart
// 0x0028 (0x0028 - 0x0000)
struct MercunaNavLink_ReceiveNavLinkStart final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMercunaNavigationLinkDirection               Direction;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Destination;                                       // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_ReceiveNavLinkStart) == 0x000008, "Wrong alignment on MercunaNavLink_ReceiveNavLinkStart");
static_assert(sizeof(MercunaNavLink_ReceiveNavLinkStart) == 0x000028, "Wrong size on MercunaNavLink_ReceiveNavLinkStart");
static_assert(offsetof(MercunaNavLink_ReceiveNavLinkStart, Pawn) == 0x000000, "Member 'MercunaNavLink_ReceiveNavLinkStart::Pawn' has a wrong offset!");
static_assert(offsetof(MercunaNavLink_ReceiveNavLinkStart, Direction) == 0x000008, "Member 'MercunaNavLink_ReceiveNavLinkStart::Direction' has a wrong offset!");
static_assert(offsetof(MercunaNavLink_ReceiveNavLinkStart, Destination) == 0x000010, "Member 'MercunaNavLink_ReceiveNavLinkStart::Destination' has a wrong offset!");

// Function Mercuna.MercunaNavLink.SetEnabled
// 0x0018 (0x0018 - 0x0000)
struct MercunaNavLink_SetEnabled final
{
public:
	bool                                          bEnabled_0;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Reason;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_SetEnabled) == 0x000008, "Wrong alignment on MercunaNavLink_SetEnabled");
static_assert(sizeof(MercunaNavLink_SetEnabled) == 0x000018, "Wrong size on MercunaNavLink_SetEnabled");
static_assert(offsetof(MercunaNavLink_SetEnabled, bEnabled_0) == 0x000000, "Member 'MercunaNavLink_SetEnabled::bEnabled_0' has a wrong offset!");
static_assert(offsetof(MercunaNavLink_SetEnabled, Reason) == 0x000008, "Member 'MercunaNavLink_SetEnabled::Reason' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetLeftPosition
// 0x0018 (0x0018 - 0x0000)
struct MercunaNavLink_GetLeftPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetLeftPosition) == 0x000008, "Wrong alignment on MercunaNavLink_GetLeftPosition");
static_assert(sizeof(MercunaNavLink_GetLeftPosition) == 0x000018, "Wrong size on MercunaNavLink_GetLeftPosition");
static_assert(offsetof(MercunaNavLink_GetLeftPosition, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetLeftPosition::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetLeftRotation
// 0x0018 (0x0018 - 0x0000)
struct MercunaNavLink_GetLeftRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetLeftRotation) == 0x000008, "Wrong alignment on MercunaNavLink_GetLeftRotation");
static_assert(sizeof(MercunaNavLink_GetLeftRotation) == 0x000018, "Wrong size on MercunaNavLink_GetLeftRotation");
static_assert(offsetof(MercunaNavLink_GetLeftRotation, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetLeftRotation::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetLeftTransform
// 0x0060 (0x0060 - 0x0000)
struct MercunaNavLink_GetLeftTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetLeftTransform) == 0x000010, "Wrong alignment on MercunaNavLink_GetLeftTransform");
static_assert(sizeof(MercunaNavLink_GetLeftTransform) == 0x000060, "Wrong size on MercunaNavLink_GetLeftTransform");
static_assert(offsetof(MercunaNavLink_GetLeftTransform, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetLeftTransform::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetRightPosition
// 0x0018 (0x0018 - 0x0000)
struct MercunaNavLink_GetRightPosition final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetRightPosition) == 0x000008, "Wrong alignment on MercunaNavLink_GetRightPosition");
static_assert(sizeof(MercunaNavLink_GetRightPosition) == 0x000018, "Wrong size on MercunaNavLink_GetRightPosition");
static_assert(offsetof(MercunaNavLink_GetRightPosition, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetRightPosition::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetRightRotation
// 0x0018 (0x0018 - 0x0000)
struct MercunaNavLink_GetRightRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetRightRotation) == 0x000008, "Wrong alignment on MercunaNavLink_GetRightRotation");
static_assert(sizeof(MercunaNavLink_GetRightRotation) == 0x000018, "Wrong size on MercunaNavLink_GetRightRotation");
static_assert(offsetof(MercunaNavLink_GetRightRotation, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetRightRotation::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.GetRightTransform
// 0x0060 (0x0060 - 0x0000)
struct MercunaNavLink_GetRightTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_GetRightTransform) == 0x000010, "Wrong alignment on MercunaNavLink_GetRightTransform");
static_assert(sizeof(MercunaNavLink_GetRightTransform) == 0x000060, "Wrong size on MercunaNavLink_GetRightTransform");
static_assert(offsetof(MercunaNavLink_GetRightTransform, ReturnValue) == 0x000000, "Member 'MercunaNavLink_GetRightTransform::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaNavLink.InUse
// 0x0001 (0x0001 - 0x0000)
struct MercunaNavLink_InUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaNavLink_InUse) == 0x000001, "Wrong alignment on MercunaNavLink_InUse");
static_assert(sizeof(MercunaNavLink_InUse) == 0x000001, "Wrong size on MercunaNavLink_InUse");
static_assert(offsetof(MercunaNavLink_InUse, ReturnValue) == 0x000000, "Member 'MercunaNavLink_InUse::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaGroundTask_MoveTo.MoveTo
// 0x0038 (0x0038 - 0x0000)
struct MercunaGroundTask_MoveTo_MoveTo final
{
public:
	class AAIController*                          Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GoalLocation;                                      // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 GoalActor;                                         // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AcceptPartialPath;                                 // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockAILogic;                                      // 0x002D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMercunaGroundTask_MoveTo*              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundTask_MoveTo_MoveTo) == 0x000008, "Wrong alignment on MercunaGroundTask_MoveTo_MoveTo");
static_assert(sizeof(MercunaGroundTask_MoveTo_MoveTo) == 0x000038, "Wrong size on MercunaGroundTask_MoveTo_MoveTo");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, Controller) == 0x000000, "Member 'MercunaGroundTask_MoveTo_MoveTo::Controller' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, GoalLocation) == 0x000008, "Member 'MercunaGroundTask_MoveTo_MoveTo::GoalLocation' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, GoalActor) == 0x000020, "Member 'MercunaGroundTask_MoveTo_MoveTo::GoalActor' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, EndDistance) == 0x000028, "Member 'MercunaGroundTask_MoveTo_MoveTo::EndDistance' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, AcceptPartialPath) == 0x00002C, "Member 'MercunaGroundTask_MoveTo_MoveTo::AcceptPartialPath' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, bLockAILogic) == 0x00002D, "Member 'MercunaGroundTask_MoveTo_MoveTo::bLockAILogic' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_MoveTo, ReturnValue) == 0x000030, "Member 'MercunaGroundTask_MoveTo_MoveTo::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaGroundTask_MoveTo.OnMoveComplete
// 0x0008 (0x0008 - 0x0000)
struct MercunaGroundTask_MoveTo_OnMoveComplete final
{
public:
	struct FAIRequestID                           RequestID;                                         // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EMercunaMoveResult                            Result;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MercunaGroundTask_MoveTo_OnMoveComplete) == 0x000004, "Wrong alignment on MercunaGroundTask_MoveTo_OnMoveComplete");
static_assert(sizeof(MercunaGroundTask_MoveTo_OnMoveComplete) == 0x000008, "Wrong size on MercunaGroundTask_MoveTo_OnMoveComplete");
static_assert(offsetof(MercunaGroundTask_MoveTo_OnMoveComplete, RequestID) == 0x000000, "Member 'MercunaGroundTask_MoveTo_OnMoveComplete::RequestID' has a wrong offset!");
static_assert(offsetof(MercunaGroundTask_MoveTo_OnMoveComplete, Result) == 0x000004, "Member 'MercunaGroundTask_MoveTo_OnMoveComplete::Result' has a wrong offset!");

// Function Mercuna.Mercuna3DMoveToProxy.MoveToActor
// 0x0030 (0x0030 - 0x0000)
struct Mercuna3DMoveToProxy_MoveToActor final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMercuna3DMoveToProxy*                  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DMoveToProxy_MoveToActor) == 0x000008, "Wrong alignment on Mercuna3DMoveToProxy_MoveToActor");
static_assert(sizeof(Mercuna3DMoveToProxy_MoveToActor) == 0x000030, "Wrong size on Mercuna3DMoveToProxy_MoveToActor");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, WorldContextObject) == 0x000000, "Member 'Mercuna3DMoveToProxy_MoveToActor::WorldContextObject' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, Pawn_0) == 0x000008, "Member 'Mercuna3DMoveToProxy_MoveToActor::Pawn_0' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, Actor) == 0x000010, "Member 'Mercuna3DMoveToProxy_MoveToActor::Actor' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, EndDistance) == 0x000018, "Member 'Mercuna3DMoveToProxy_MoveToActor::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, Speed) == 0x00001C, "Member 'Mercuna3DMoveToProxy_MoveToActor::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, UsePartialPath) == 0x000020, "Member 'Mercuna3DMoveToProxy_MoveToActor::UsePartialPath' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToActor, ReturnValue) == 0x000028, "Member 'Mercuna3DMoveToProxy_MoveToActor::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DMoveToProxy.MoveToLocation
// 0x0040 (0x0040 - 0x0000)
struct Mercuna3DMoveToProxy_MoveToLocation final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Destination;                                       // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMercuna3DMoveToProxy*                  ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DMoveToProxy_MoveToLocation) == 0x000008, "Wrong alignment on Mercuna3DMoveToProxy_MoveToLocation");
static_assert(sizeof(Mercuna3DMoveToProxy_MoveToLocation) == 0x000040, "Wrong size on Mercuna3DMoveToProxy_MoveToLocation");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, WorldContextObject) == 0x000000, "Member 'Mercuna3DMoveToProxy_MoveToLocation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, Pawn_0) == 0x000008, "Member 'Mercuna3DMoveToProxy_MoveToLocation::Pawn_0' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, Destination) == 0x000010, "Member 'Mercuna3DMoveToProxy_MoveToLocation::Destination' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, EndDistance) == 0x000028, "Member 'Mercuna3DMoveToProxy_MoveToLocation::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, Speed) == 0x00002C, "Member 'Mercuna3DMoveToProxy_MoveToLocation::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, UsePartialPath) == 0x000030, "Member 'Mercuna3DMoveToProxy_MoveToLocation::UsePartialPath' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocation, ReturnValue) == 0x000038, "Member 'Mercuna3DMoveToProxy_MoveToLocation::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DMoveToProxy.MoveToLocations
// 0x0038 (0x0038 - 0x0000)
struct Mercuna3DMoveToProxy_MoveToLocations final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  Pawn_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Destinations;                                      // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePartialPath;                                    // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMercuna3DMoveToProxy*                  ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Mercuna3DMoveToProxy_MoveToLocations) == 0x000008, "Wrong alignment on Mercuna3DMoveToProxy_MoveToLocations");
static_assert(sizeof(Mercuna3DMoveToProxy_MoveToLocations) == 0x000038, "Wrong size on Mercuna3DMoveToProxy_MoveToLocations");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, WorldContextObject) == 0x000000, "Member 'Mercuna3DMoveToProxy_MoveToLocations::WorldContextObject' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, Pawn_0) == 0x000008, "Member 'Mercuna3DMoveToProxy_MoveToLocations::Pawn_0' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, Destinations) == 0x000010, "Member 'Mercuna3DMoveToProxy_MoveToLocations::Destinations' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, EndDistance) == 0x000020, "Member 'Mercuna3DMoveToProxy_MoveToLocations::EndDistance' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, Speed) == 0x000024, "Member 'Mercuna3DMoveToProxy_MoveToLocations::Speed' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, UsePartialPath) == 0x000028, "Member 'Mercuna3DMoveToProxy_MoveToLocations::UsePartialPath' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_MoveToLocations, ReturnValue) == 0x000030, "Member 'Mercuna3DMoveToProxy_MoveToLocations::ReturnValue' has a wrong offset!");

// Function Mercuna.Mercuna3DMoveToProxy.OnMoveComplete
// 0x0008 (0x0008 - 0x0000)
struct Mercuna3DMoveToProxy_OnMoveComplete final
{
public:
	struct FAIRequestID                           RequestID;                                         // 0x0000(0x0004)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EMercunaMoveResult                            Result;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Mercuna3DMoveToProxy_OnMoveComplete) == 0x000004, "Wrong alignment on Mercuna3DMoveToProxy_OnMoveComplete");
static_assert(sizeof(Mercuna3DMoveToProxy_OnMoveComplete) == 0x000008, "Wrong size on Mercuna3DMoveToProxy_OnMoveComplete");
static_assert(offsetof(Mercuna3DMoveToProxy_OnMoveComplete, RequestID) == 0x000000, "Member 'Mercuna3DMoveToProxy_OnMoveComplete::RequestID' has a wrong offset!");
static_assert(offsetof(Mercuna3DMoveToProxy_OnMoveComplete, Result) == 0x000004, "Member 'Mercuna3DMoveToProxy_OnMoveComplete::Result' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.AddDestinationLocation
// 0x0020 (0x0020 - 0x0000)
struct MercunaGroundNavigationComponent_AddDestinationLocation final
{
public:
	struct FVector                                NextDestination;                                   // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSmoothTransition;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MercunaGroundNavigationComponent_AddDestinationLocation) == 0x000008, "Wrong alignment on MercunaGroundNavigationComponent_AddDestinationLocation");
static_assert(sizeof(MercunaGroundNavigationComponent_AddDestinationLocation) == 0x000020, "Wrong size on MercunaGroundNavigationComponent_AddDestinationLocation");
static_assert(offsetof(MercunaGroundNavigationComponent_AddDestinationLocation, NextDestination) == 0x000000, "Member 'MercunaGroundNavigationComponent_AddDestinationLocation::NextDestination' has a wrong offset!");
static_assert(offsetof(MercunaGroundNavigationComponent_AddDestinationLocation, bSmoothTransition) == 0x000018, "Member 'MercunaGroundNavigationComponent_AddDestinationLocation::bSmoothTransition' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.Configure
// 0x001C (0x001C - 0x0000)
struct MercunaGroundNavigationComponent_Configure final
{
public:
	struct FMercunaGroundNavigationConfiguration  NewConfiguration;                                  // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundNavigationComponent_Configure) == 0x000004, "Wrong alignment on MercunaGroundNavigationComponent_Configure");
static_assert(sizeof(MercunaGroundNavigationComponent_Configure) == 0x00001C, "Wrong size on MercunaGroundNavigationComponent_Configure");
static_assert(offsetof(MercunaGroundNavigationComponent_Configure, NewConfiguration) == 0x000000, "Member 'MercunaGroundNavigationComponent_Configure::NewConfiguration' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.ConfigureMovement
// 0x0001 (0x0001 - 0x0000)
struct MercunaGroundNavigationComponent_ConfigureMovement final
{
public:
	EMercunaAvoidanceMode                         NewAvoidanceMode;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundNavigationComponent_ConfigureMovement) == 0x000001, "Wrong alignment on MercunaGroundNavigationComponent_ConfigureMovement");
static_assert(sizeof(MercunaGroundNavigationComponent_ConfigureMovement) == 0x000001, "Wrong size on MercunaGroundNavigationComponent_ConfigureMovement");
static_assert(offsetof(MercunaGroundNavigationComponent_ConfigureMovement, NewAvoidanceMode) == 0x000000, "Member 'MercunaGroundNavigationComponent_ConfigureMovement::NewAvoidanceMode' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.ConfigureSteering
// 0x0020 (0x0020 - 0x0000)
struct MercunaGroundNavigationComponent_ConfigureSteering final
{
public:
	struct FMercunaGroundNavigationSteeringParameters NewSteering;                                   // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundNavigationComponent_ConfigureSteering) == 0x000004, "Wrong alignment on MercunaGroundNavigationComponent_ConfigureSteering");
static_assert(sizeof(MercunaGroundNavigationComponent_ConfigureSteering) == 0x000020, "Wrong size on MercunaGroundNavigationComponent_ConfigureSteering");
static_assert(offsetof(MercunaGroundNavigationComponent_ConfigureSteering, NewSteering) == 0x000000, "Member 'MercunaGroundNavigationComponent_ConfigureSteering::NewSteering' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.GetLookDirection
// 0x0018 (0x0018 - 0x0000)
struct MercunaGroundNavigationComponent_GetLookDirection final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundNavigationComponent_GetLookDirection) == 0x000008, "Wrong alignment on MercunaGroundNavigationComponent_GetLookDirection");
static_assert(sizeof(MercunaGroundNavigationComponent_GetLookDirection) == 0x000018, "Wrong size on MercunaGroundNavigationComponent_GetLookDirection");
static_assert(offsetof(MercunaGroundNavigationComponent_GetLookDirection, ReturnValue) == 0x000000, "Member 'MercunaGroundNavigationComponent_GetLookDirection::ReturnValue' has a wrong offset!");

// Function Mercuna.MercunaGroundNavigationComponent.GetPathInfo
// 0x0008 (0x0008 - 0x0000)
struct MercunaGroundNavigationComponent_GetPathInfo final
{
public:
	bool                                          Valid;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToEnd;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MercunaGroundNavigationComponent_GetPathInfo) == 0x000004, "Wrong alignment on MercunaGroundNavigationComponent_GetPathInfo");
static_assert(sizeof(MercunaGroundNavigationComponent_GetPathInfo) == 0x000008, "Wrong size on MercunaGroundNavigationComponent_GetPathInfo");
