#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mercuna3DMovement

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Mercuna3DMovement_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Mercuna3DMovement.Mercuna3DMovementComponent
// 0x00D8 (0x0250 - 0x0178)
class alignas(0x10) UMercuna3DMovementComponent : public UPawnMovementComponent
{
public:
	uint8                                         Pad_178[0x20];                                     // 0x0178(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMercuna3DMovementProperties           MovementProperties;                                // 0x0198(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bPositionCorrected : 1;                            // 0x01C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PendingImpulseToApply;                             // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Acceleration;                                      // 0x01E0(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                AngularVelocity;                                   // 0x01F8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_210[0x40];                                     // 0x0210(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddImpulse(const struct FVector& Impulse)	 // 0x4a14a78;
	void SetAngularVelocity(const struct FVector& NewAngVel)	 // 0x4a14b8c;
	void SetMovementProperties(const struct FMercuna3DMovementProperties& NewMovementProperties)	 // 0x4a14c78;
	void SetVelocitiesFromPhysics()	 // 0x4a14d10;
	void SetVelocity(const struct FVector& NewVelocity)	 // 0x4a14d24;

	struct FRotator GetLocalRotationRate() const	 // 0x4a14b4c;
	struct FVector GetLocalVelocity() const	 // 0x159e4cc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna3DMovementComponent">();
	}
	static class UMercuna3DMovementComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMercuna3DMovementComponent>();
	}
};
static_assert(alignof(UMercuna3DMovementComponent) == 0x000010, "Wrong alignment on UMercuna3DMovementComponent");
static_assert(sizeof(UMercuna3DMovementComponent) == 0x000250, "Wrong size on UMercuna3DMovementComponent");
static_assert(offsetof(UMercuna3DMovementComponent, MovementProperties) == 0x000198, "Member 'UMercuna3DMovementComponent::MovementProperties' has a wrong offset!");
static_assert(offsetof(UMercuna3DMovementComponent, PendingImpulseToApply) == 0x0001C8, "Member 'UMercuna3DMovementComponent::PendingImpulseToApply' has a wrong offset!");
static_assert(offsetof(UMercuna3DMovementComponent, Acceleration) == 0x0001E0, "Member 'UMercuna3DMovementComponent::Acceleration' has a wrong offset!");
static_assert(offsetof(UMercuna3DMovementComponent, AngularVelocity) == 0x0001F8, "Member 'UMercuna3DMovementComponent::AngularVelocity' has a wrong offset!");

// Class Mercuna3DMovement.Mercuna3DMovementInterface
// 0x0000 (0x0000 - 0x0000)
class IMercuna3DMovementInterface final
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Mercuna3DMovementInterface">();
	}
	static class IMercuna3DMovementInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IMercuna3DMovementInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMercuna3DMovementInterface) == 0x000001, "Wrong alignment on IMercuna3DMovementInterface");
static_assert(sizeof(IMercuna3DMovementInterface) == 0x000001, "Wrong size on IMercuna3DMovementInterface");

}

