#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MobilePatchingUtils

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MobilePatchingUtils.MobileInstalledContent
// 0x0020 (0x0048 - 0x0028)
class UMobileInstalledContent : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetDiskFreeSpace()	 // 0x55a866c;
	float GetInstalledContentSize()	 // 0x55a8870;
	bool Mount(int32 PakOrder, const class FString& MountPoint)	 // 0x55a896c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MobileInstalledContent">();
	}
	static class UMobileInstalledContent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMobileInstalledContent>();
	}
};
static_assert(alignof(UMobileInstalledContent) == 0x000008, "Wrong alignment on UMobileInstalledContent");
static_assert(sizeof(UMobileInstalledContent) == 0x000048, "Wrong size on UMobileInstalledContent");

// Class MobilePatchingUtils.MobilePendingContent
// 0x0040 (0x0088 - 0x0048)
class UMobilePendingContent final : public UMobileInstalledContent
{
public:
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetDownloadSize()	 // 0x55a8694;
	float GetDownloadSpeed()	 // 0x55a86bc;
	class FText GetDownloadStatusText()	 // 0x55a8704;
	float GetInstallProgress()	 // 0x55a8768;
	float GetRequiredDiskSpace()	 // 0x55a8898;
	float GetTotalDownloadedSize()	 // 0x55a8944;
	void StartInstall(TDelegate<void()> OnSucceeded, TDelegate<void(class FText ErrorText, int32 ErrorCode)> OnFailed)	 // 0x55a9060;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MobilePendingContent">();
	}
	static class UMobilePendingContent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMobilePendingContent>();
	}
};
static_assert(alignof(UMobilePendingContent) == 0x000008, "Wrong alignment on UMobilePendingContent");
static_assert(sizeof(UMobilePendingContent) == 0x000088, "Wrong size on UMobilePendingContent");

// Class MobilePatchingUtils.MobilePatchingLibrary
// 0x0000 (0x0028 - 0x0028)
class UMobilePatchingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetActiveDeviceProfileName()	 // 0x55a862c;
	static class UMobileInstalledContent* GetInstalledContent(const class FString& InstallDirectory)	 // 0x55a87a0;
	static TArray<class FString> GetSupportedPlatformNames()	 // 0x55a88c0;
	static bool HasActiveWiFiConnection()	 // 0x16463d4;
	static void RequestContent(const class FString& RemoteManifestURL, const class FString& CloudURL, const class FString& InstallDirectory, TDelegate<void(class UMobilePendingContent* MobilePendingContent)> OnSucceeded, TDelegate<void(class FText ErrorText, int32 ErrorCode)> OnFailed)	 // 0x55a8adc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MobilePatchingLibrary">();
	}
	static class UMobilePatchingLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMobilePatchingLibrary>();
	}
};
static_assert(alignof(UMobilePatchingLibrary) == 0x000008, "Wrong alignment on UMobilePatchingLibrary");
static_assert(sizeof(UMobilePatchingLibrary) == 0x000028, "Wrong size on UMobilePatchingLibrary");

}

