#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"
#include "OpenColorIO_structs.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MoviePipelineSetting
// 0x0020 (0x0048 - 0x0028)
class UMoviePipelineSetting : public UObject
{
public:
	TWeakObjectPtr<class UMoviePipeline>          CachedPipeline;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsEnabled(bool bInEnabled)	 // 0x476c6fc;

	void BuildNewProcessCommandLine(class FString& InOutUnrealURLParams, class FString& InOutCommandLineArgs) const	 // 0x4f1aeec;
	void BuildNewProcessCommandLineArgs(TArray<class FString>& InOutUnrealURLParams, TArray<class FString>& InOutCommandLineArgs, TArray<class FString>& InOutDeviceProfileCvars, TArray<class FString>& InOutExecCmds) const	 // 0x4f1b004;
	bool IsEnabled() const	 // 0x1768c8c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineSetting">();
	}
	static class UMoviePipelineSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineSetting>();
	}
};
static_assert(alignof(UMoviePipelineSetting) == 0x000008, "Wrong alignment on UMoviePipelineSetting");
static_assert(sizeof(UMoviePipelineSetting) == 0x000048, "Wrong size on UMoviePipelineSetting");
static_assert(offsetof(UMoviePipelineSetting, CachedPipeline) == 0x000028, "Member 'UMoviePipelineSetting::CachedPipeline' has a wrong offset!");
static_assert(offsetof(UMoviePipelineSetting, bEnabled) == 0x000030, "Member 'UMoviePipelineSetting::bEnabled' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCameraSetting
// 0x0010 (0x0058 - 0x0048)
class UMoviePipelineCameraSetting final : public UMoviePipelineSetting
{
public:
	EMoviePipelineShutterTiming                   ShutterTiming;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanPercentage;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderAllCameras;                                 // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineCameraSetting">();
	}
	static class UMoviePipelineCameraSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineCameraSetting>();
	}
};
static_assert(alignof(UMoviePipelineCameraSetting) == 0x000008, "Wrong alignment on UMoviePipelineCameraSetting");
static_assert(sizeof(UMoviePipelineCameraSetting) == 0x000058, "Wrong size on UMoviePipelineCameraSetting");
static_assert(offsetof(UMoviePipelineCameraSetting, ShutterTiming) == 0x000048, "Member 'UMoviePipelineCameraSetting::ShutterTiming' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCameraSetting, OverscanPercentage) == 0x00004C, "Member 'UMoviePipelineCameraSetting::OverscanPercentage' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCameraSetting, bRenderAllCameras) == 0x000050, "Member 'UMoviePipelineCameraSetting::bRenderAllCameras' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineGameMode
// 0x0000 (0x0350 - 0x0350)
class AMoviePipelineGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineGameMode">();
	}
	static class AMoviePipelineGameMode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AMoviePipelineGameMode>();
	}
};
static_assert(alignof(AMoviePipelineGameMode) == 0x000008, "Wrong alignment on AMoviePipelineGameMode");
static_assert(sizeof(AMoviePipelineGameMode) == 0x000350, "Wrong size on AMoviePipelineGameMode");

// Class MovieRenderPipelineCore.MoviePipelineHighResSetting
// 0x0020 (0x0068 - 0x0048)
class UMoviePipelineHighResSetting final : public UMoviePipelineSetting
{
public:
	int32                                         TileCount;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextureSharpnessBias;                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlapRatio;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSubSurfaceScattering;                     // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BurleySampleCount;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllocateHistoryPerTile;                           // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0xB];                                       // 0x005D(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineHighResSetting">();
	}
	static class UMoviePipelineHighResSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineHighResSetting>();
	}
};
static_assert(alignof(UMoviePipelineHighResSetting) == 0x000008, "Wrong alignment on UMoviePipelineHighResSetting");
static_assert(sizeof(UMoviePipelineHighResSetting) == 0x000068, "Wrong size on UMoviePipelineHighResSetting");
static_assert(offsetof(UMoviePipelineHighResSetting, TileCount) == 0x000048, "Member 'UMoviePipelineHighResSetting::TileCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, TextureSharpnessBias) == 0x00004C, "Member 'UMoviePipelineHighResSetting::TextureSharpnessBias' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, OverlapRatio) == 0x000050, "Member 'UMoviePipelineHighResSetting::OverlapRatio' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, bOverrideSubSurfaceScattering) == 0x000054, "Member 'UMoviePipelineHighResSetting::bOverrideSubSurfaceScattering' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, BurleySampleCount) == 0x000058, "Member 'UMoviePipelineHighResSetting::BurleySampleCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, bAllocateHistoryPerTile) == 0x00005C, "Member 'UMoviePipelineHighResSetting::bAllocateHistoryPerTile' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineInProcessExecutorSettings
// 0x0030 (0x0068 - 0x0038)
class UMoviePipelineInProcessExecutorSettings final : public UDeveloperSettings
{
public:
	bool                                          bCloseEditor;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdditionalCommandLineArguments;                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InheritedCommandLineArguments;                     // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialDelayFrameCount;                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineInProcessExecutorSettings">();
	}
	static class UMoviePipelineInProcessExecutorSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineInProcessExecutorSettings>();
	}
};
static_assert(alignof(UMoviePipelineInProcessExecutorSettings) == 0x000008, "Wrong alignment on UMoviePipelineInProcessExecutorSettings");
static_assert(sizeof(UMoviePipelineInProcessExecutorSettings) == 0x000068, "Wrong size on UMoviePipelineInProcessExecutorSettings");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, bCloseEditor) == 0x000038, "Member 'UMoviePipelineInProcessExecutorSettings::bCloseEditor' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, AdditionalCommandLineArguments) == 0x000040, "Member 'UMoviePipelineInProcessExecutorSettings::AdditionalCommandLineArguments' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, InheritedCommandLineArguments) == 0x000050, "Member 'UMoviePipelineInProcessExecutorSettings::InheritedCommandLineArguments' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, InitialDelayFrameCount) == 0x000060, "Member 'UMoviePipelineInProcessExecutorSettings::InitialDelayFrameCount' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineOutputBase
// 0x0000 (0x0048 - 0x0048)
class UMoviePipelineOutputBase : public UMoviePipelineSetting
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineOutputBase">();
	}
	static class UMoviePipelineOutputBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineOutputBase>();
	}
};
static_assert(alignof(UMoviePipelineOutputBase) == 0x000008, "Wrong alignment on UMoviePipelineOutputBase");
static_assert(sizeof(UMoviePipelineOutputBase) == 0x000048, "Wrong size on UMoviePipelineOutputBase");

// Class MovieRenderPipelineCore.MoviePipelineSetting_BlueprintBase
// 0x0020 (0x0068 - 0x0048)
class UMoviePipelineSetting_BlueprintBase final : public UMoviePipelineSetting
{
public:
	class FText                                   CategoryText;                                      // 0x0048(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsValidOnPrimary;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsValidOnShots;                                   // 0x0061(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBeDisabled;                                    // 0x0062(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEngineTickBeginFrame()	 // 0xae1e64;
	void ReceiveSetupForPipelineImpl(class UMoviePipeline* InPipeline)	 // 0xae1e64;
	void ReceiveTeardownForPipelineImpl(class UMoviePipeline* InPipeline)	 // 0xae1e64;

	struct FMoviePipelineFormatArgs ReceiveGetFormatArguments(struct FMoviePipelineFormatArgs& InOutFormatArgs) const	 // 0x4f1e8d8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineSetting_BlueprintBase">();
	}
	static class UMoviePipelineSetting_BlueprintBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineSetting_BlueprintBase>();
	}
};
static_assert(alignof(UMoviePipelineSetting_BlueprintBase) == 0x000008, "Wrong alignment on UMoviePipelineSetting_BlueprintBase");
static_assert(sizeof(UMoviePipelineSetting_BlueprintBase) == 0x000068, "Wrong size on UMoviePipelineSetting_BlueprintBase");
static_assert(offsetof(UMoviePipelineSetting_BlueprintBase, CategoryText) == 0x000048, "Member 'UMoviePipelineSetting_BlueprintBase::CategoryText' has a wrong offset!");
static_assert(offsetof(UMoviePipelineSetting_BlueprintBase, bIsValidOnPrimary) == 0x000060, "Member 'UMoviePipelineSetting_BlueprintBase::bIsValidOnPrimary' has a wrong offset!");
static_assert(offsetof(UMoviePipelineSetting_BlueprintBase, bIsValidOnShots) == 0x000061, "Member 'UMoviePipelineSetting_BlueprintBase::bIsValidOnShots' has a wrong offset!");
static_assert(offsetof(UMoviePipelineSetting_BlueprintBase, bCanBeDisabled) == 0x000062, "Member 'UMoviePipelineSetting_BlueprintBase::bCanBeDisabled' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineViewFamilySetting
// 0x0000 (0x0048 - 0x0048)
class UMoviePipelineViewFamilySetting final : public UMoviePipelineSetting
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineViewFamilySetting">();
	}
	static class UMoviePipelineViewFamilySetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineViewFamilySetting>();
	}
};
static_assert(alignof(UMoviePipelineViewFamilySetting) == 0x000008, "Wrong alignment on UMoviePipelineViewFamilySetting");
static_assert(sizeof(UMoviePipelineViewFamilySetting) == 0x000048, "Wrong size on UMoviePipelineViewFamilySetting");

// Class MovieRenderPipelineCore.MovieRenderDebugWidget
// 0x0000 (0x0280 - 0x0280)
class UMovieRenderDebugWidget final : public UUserWidget
{
public:
	void OnInitializedForPipeline(class UMoviePipeline* ForPipeline)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieRenderDebugWidget">();
	}
	static class UMovieRenderDebugWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieRenderDebugWidget>();
	}
};
static_assert(alignof(UMovieRenderDebugWidget) == 0x000008, "Wrong alignment on UMovieRenderDebugWidget");
static_assert(sizeof(UMovieRenderDebugWidget) == 0x000280, "Wrong size on UMovieRenderDebugWidget");

// Class MovieRenderPipelineCore.MoviePipelineOutputSetting
// 0x0068 (0x00B0 - 0x0048)
class UMoviePipelineOutputSetting final : public UMoviePipelineSetting
{
public:
	struct FDirectoryPath                         OutputDirectory;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileNameFormat;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              OutputResolution;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomFrameRate;                               // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             OutputFrameRate;                                   // 0x0074(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bOverrideExistingOutput;                           // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HandleFrameCount;                                  // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputFrameStep;                                   // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomPlaybackRange;                           // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomStartFrame;                                  // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomEndFrame;                                    // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VersionNumber;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoVersion;                                      // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZeroPadFrameNumbers;                               // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameNumberOffset;                                 // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushDiskWritesPerShot;                           // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineOutputSetting">();
	}
	static class UMoviePipelineOutputSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineOutputSetting>();
	}
};
static_assert(alignof(UMoviePipelineOutputSetting) == 0x000008, "Wrong alignment on UMoviePipelineOutputSetting");
static_assert(sizeof(UMoviePipelineOutputSetting) == 0x0000B0, "Wrong size on UMoviePipelineOutputSetting");
static_assert(offsetof(UMoviePipelineOutputSetting, OutputDirectory) == 0x000048, "Member 'UMoviePipelineOutputSetting::OutputDirectory' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, FileNameFormat) == 0x000058, "Member 'UMoviePipelineOutputSetting::FileNameFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, OutputResolution) == 0x000068, "Member 'UMoviePipelineOutputSetting::OutputResolution' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, bUseCustomFrameRate) == 0x000070, "Member 'UMoviePipelineOutputSetting::bUseCustomFrameRate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, OutputFrameRate) == 0x000074, "Member 'UMoviePipelineOutputSetting::OutputFrameRate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, bOverrideExistingOutput) == 0x000080, "Member 'UMoviePipelineOutputSetting::bOverrideExistingOutput' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, HandleFrameCount) == 0x000084, "Member 'UMoviePipelineOutputSetting::HandleFrameCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, OutputFrameStep) == 0x000088, "Member 'UMoviePipelineOutputSetting::OutputFrameStep' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, bUseCustomPlaybackRange) == 0x00008C, "Member 'UMoviePipelineOutputSetting::bUseCustomPlaybackRange' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, CustomStartFrame) == 0x000090, "Member 'UMoviePipelineOutputSetting::CustomStartFrame' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, CustomEndFrame) == 0x000094, "Member 'UMoviePipelineOutputSetting::CustomEndFrame' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, VersionNumber) == 0x000098, "Member 'UMoviePipelineOutputSetting::VersionNumber' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, bAutoVersion) == 0x00009C, "Member 'UMoviePipelineOutputSetting::bAutoVersion' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, ZeroPadFrameNumbers) == 0x0000A0, "Member 'UMoviePipelineOutputSetting::ZeroPadFrameNumbers' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, FrameNumberOffset) == 0x0000A4, "Member 'UMoviePipelineOutputSetting::FrameNumberOffset' has a wrong offset!");
static_assert(offsetof(UMoviePipelineOutputSetting, bFlushDiskWritesPerShot) == 0x0000A8, "Member 'UMoviePipelineOutputSetting::bFlushDiskWritesPerShot' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipeline
// 0x03E8 (0x0410 - 0x0028)
class UMoviePipeline final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UMoviePipeline* MoviePipeline, bool bFatalError)> OnMoviePipelineFinishedDelegate; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnMoviePipelineWorkFinishedDelegate; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMoviePipelineOutputData& Results)> OnMoviePipelineShotWorkFinishedDelegate; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMoviePipelineCustomTimeStep*           CustomTimeStep;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEngineCustomTimeStep*                  CachedPrevCustomTimeStep;                          // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelSequence*                         TargetSequence;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieRenderDebugWidget*                DebugWidget;                                       // 0x0088(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               PreviewTexture;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x288];                                     // 0x0098(0x0288)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMovieRenderDebugWidget>    DebugWidgetClass;                                  // 0x0320(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorJob*              CurrentJob;                                        // 0x0328(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_330[0xE0];                                     // 0x0330(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class UMoviePipelineExecutorJob* InJob)	 // 0x4f1e39c;
	void OnMoviePipelineFinishedImpl()	 // 0xf79a00;
	void RequestShutdown(bool bIsError)	 // 0x4f1ec5c;
	void SetInitializationTime(const struct FDateTime& InDateTime)	 // 0x4f1f924;
	void Shutdown(bool bError)	 // 0x4f20748;

	class UMoviePipelineExecutorJob* GetCurrentJob() const	 // 0x159f79c;
	struct FDateTime GetInitializationTime() const	 // 0x15cd114;
	class UMoviePipelinePrimaryConfig* GetPipelineMasterConfig() const	 // 0x4f1df70;
	class UMoviePipelinePrimaryConfig* GetPipelinePrimaryConfig() const	 // 0x4f1df70;
	class UTexture* GetPreviewTexture() const	 // 0x3fe25fc;
	bool IsShutdownRequested() const	 // 0x4f1e50c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipeline">();
	}
	static class UMoviePipeline* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipeline>();
	}
};
static_assert(alignof(UMoviePipeline) == 0x000008, "Wrong alignment on UMoviePipeline");
static_assert(sizeof(UMoviePipeline) == 0x000410, "Wrong size on UMoviePipeline");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineFinishedDelegate) == 0x000028, "Member 'UMoviePipeline::OnMoviePipelineFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineWorkFinishedDelegate) == 0x000038, "Member 'UMoviePipeline::OnMoviePipelineWorkFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineShotWorkFinishedDelegate) == 0x000048, "Member 'UMoviePipeline::OnMoviePipelineShotWorkFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CustomTimeStep) == 0x000058, "Member 'UMoviePipeline::CustomTimeStep' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CachedPrevCustomTimeStep) == 0x000070, "Member 'UMoviePipeline::CachedPrevCustomTimeStep' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, TargetSequence) == 0x000078, "Member 'UMoviePipeline::TargetSequence' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, LevelSequenceActor) == 0x000080, "Member 'UMoviePipeline::LevelSequenceActor' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, DebugWidget) == 0x000088, "Member 'UMoviePipeline::DebugWidget' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, PreviewTexture) == 0x000090, "Member 'UMoviePipeline::PreviewTexture' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, DebugWidgetClass) == 0x000320, "Member 'UMoviePipeline::DebugWidgetClass' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CurrentJob) == 0x000328, "Member 'UMoviePipeline::CurrentJob' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineDebugSettings
// 0x0010 (0x0058 - 0x0048)
class UMoviePipelineDebugSettings final : public UMoviePipelineSetting
{
public:
	bool                                          bWriteAllSamples;                                  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureFramesWithRenderDoc;                       // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CaptureFrame;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureUnrealInsightsTrace;                       // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineDebugSettings">();
	}
	static class UMoviePipelineDebugSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineDebugSettings>();
	}
};
static_assert(alignof(UMoviePipelineDebugSettings) == 0x000008, "Wrong alignment on UMoviePipelineDebugSettings");
static_assert(sizeof(UMoviePipelineDebugSettings) == 0x000058, "Wrong size on UMoviePipelineDebugSettings");
static_assert(offsetof(UMoviePipelineDebugSettings, bWriteAllSamples) == 0x000048, "Member 'UMoviePipelineDebugSettings::bWriteAllSamples' has a wrong offset!");
static_assert(offsetof(UMoviePipelineDebugSettings, bCaptureFramesWithRenderDoc) == 0x000049, "Member 'UMoviePipelineDebugSettings::bCaptureFramesWithRenderDoc' has a wrong offset!");
static_assert(offsetof(UMoviePipelineDebugSettings, CaptureFrame) == 0x00004C, "Member 'UMoviePipelineDebugSettings::CaptureFrame' has a wrong offset!");
static_assert(offsetof(UMoviePipelineDebugSettings, bCaptureUnrealInsightsTrace) == 0x000050, "Member 'UMoviePipelineDebugSettings::bCaptureUnrealInsightsTrace' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCustomTimeStep
// 0x0010 (0x0038 - 0x0028)
class UMoviePipelineCustomTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineCustomTimeStep">();
	}
	static class UMoviePipelineCustomTimeStep* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineCustomTimeStep>();
	}
};
static_assert(alignof(UMoviePipelineCustomTimeStep) == 0x000008, "Wrong alignment on UMoviePipelineCustomTimeStep");
static_assert(sizeof(UMoviePipelineCustomTimeStep) == 0x000038, "Wrong size on UMoviePipelineCustomTimeStep");

// Class MovieRenderPipelineCore.MoviePipelineAntiAliasingSetting
// 0x0020 (0x0068 - 0x0048)
class UMoviePipelineAntiAliasingSetting final : public UMoviePipelineSetting
{
public:
	int32                                         SpatialSampleCount;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TemporalSampleCount;                               // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAntiAliasing;                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAntiAliasingMethod                           AntiAliasingMethod;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RenderWarmUpCount;                                 // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCameraCutForWarmUp;                            // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EngineWarmUpCount;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderWarmUpFrames;                               // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineAntiAliasingSetting">();
	}
	static class UMoviePipelineAntiAliasingSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineAntiAliasingSetting>();
	}
};
static_assert(alignof(UMoviePipelineAntiAliasingSetting) == 0x000008, "Wrong alignment on UMoviePipelineAntiAliasingSetting");
static_assert(sizeof(UMoviePipelineAntiAliasingSetting) == 0x000068, "Wrong size on UMoviePipelineAntiAliasingSetting");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, SpatialSampleCount) == 0x000048, "Member 'UMoviePipelineAntiAliasingSetting::SpatialSampleCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, TemporalSampleCount) == 0x00004C, "Member 'UMoviePipelineAntiAliasingSetting::TemporalSampleCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bOverrideAntiAliasing) == 0x000050, "Member 'UMoviePipelineAntiAliasingSetting::bOverrideAntiAliasing' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, AntiAliasingMethod) == 0x000051, "Member 'UMoviePipelineAntiAliasingSetting::AntiAliasingMethod' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, RenderWarmUpCount) == 0x000054, "Member 'UMoviePipelineAntiAliasingSetting::RenderWarmUpCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bUseCameraCutForWarmUp) == 0x000058, "Member 'UMoviePipelineAntiAliasingSetting::bUseCameraCutForWarmUp' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, EngineWarmUpCount) == 0x00005C, "Member 'UMoviePipelineAntiAliasingSetting::EngineWarmUpCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bRenderWarmUpFrames) == 0x000060, "Member 'UMoviePipelineAntiAliasingSetting::bRenderWarmUpFrames' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMoviePipelineBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneSequence* DuplicateSequence(class UObject* Outer_0, class UMovieSceneSequence* InSequence)	 // 0x4f1b7f4;
	static class UMoviePipelineSetting* FindOrGetDefaultSettingForShot(TSubclassOf<class UMoviePipelineSetting> InSettingType, const class UMoviePipelinePrimaryConfig* InPrimaryConfig, const class UMoviePipelineExecutorShot* InShot)	 // 0x4f1bd28;
	static float GetCompletionPercentage(const class UMoviePipeline* InPipeline)	 // 0x4f1c4f0;
	static float GetCurrentAperture(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1c670;
	static class UMoviePipelineExecutorShot* GetCurrentExecutorShot(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1c794;
	static float GetCurrentFocalLength(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1c874;
	static float GetCurrentFocusDistance(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1c9a0;
	static void GetCurrentSegmentName(class UMoviePipeline* InMoviePipeline, class FText* OutOuterName, class FText* OutInnerName)	 // 0x4f1cacc;
	static EMovieRenderShotState GetCurrentSegmentState(class UMoviePipeline* InMoviePipeline)	 // 0x4f1cce8;
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1cdcc;
	static class ULevelSequence* GetCurrentSequence(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1cf18;
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1cfe0;
	static struct FTimecode GetCurrentShotTimecode(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1d0dc;
	static struct FIntPoint GetEffectiveOutputResolution(class UMoviePipelinePrimaryConfig* InPrimaryConfig, class UMoviePipelineExecutorShot* InPipelineExecutorShot)	 // 0x4f1d274;
	static bool GetEstimatedTimeRemaining(const class UMoviePipeline* InPipeline, struct FTimespan* OutEstimate)	 // 0x4f1d3bc;
	static class FText GetJobAuthor(class UMoviePipeline* InMoviePipeline)	 // 0x4f1d54c;
	static struct FDateTime GetJobInitializationTime(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1d66c;
	static class FText GetJobName(class UMoviePipeline* InMoviePipeline)	 // 0x4f1d738;
	static class FString GetMapPackageName(class UMoviePipelineExecutorJob* InJob)	 // 0x4f1d8c4;
	static struct FFrameNumber GetMasterFrameNumber(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1d9b4;
	static struct FTimecode GetMasterTimecode(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1dac8;
	static class FText GetMoviePipelineEngineChangelistLabel(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1db9c;
	static void GetOverallOutputFrames(const class UMoviePipeline* InMoviePipeline, int32* OutCurrentIndex, int32* OutTotalCount)	 // 0x4f1dc88;
	static void GetOverallSegmentCounts(const class UMoviePipeline* InMoviePipeline, int32* OutCurrentIndex, int32* OutTotalCount)	 // 0x4f1de18;
	static EMovieRenderPipelineState GetPipelineState(const class UMoviePipeline* InPipeline)	 // 0x4f1df90;
	static struct FFrameNumber GetRootFrameNumber(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1d9b4;
	static struct FTimecode GetRootTimecode(const class UMoviePipeline* InMoviePipeline)	 // 0x4f1e0e8;
	static class UMoviePipelineQueue* LoadManifestFileFromString(const class FString& InManifestFilePath)	 // 0x4f1e554;
	static void ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMoviePipelineFilenameResolveParams& InParams, class FString* OutFinalPath, struct FMoviePipelineFormatArgs* OutMergedFormatArgs)	 // 0x4f1ed20;
	static int32 ResolveVersionNumber(const struct FMoviePipelineFilenameResolveParams& InParams, bool bGetNextVersion)	 // 0x4f1ef44;
	static void UpdateJobShotListFromSequence(class ULevelSequence* InSequence, class UMoviePipelineExecutorJob* InJob, bool* bShotsChanged)	 // 0x4f2080c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineBlueprintLibrary">();
	}
	static class UMoviePipelineBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineBlueprintLibrary>();
	}
};
static_assert(alignof(UMoviePipelineBlueprintLibrary) == 0x000008, "Wrong alignment on UMoviePipelineBlueprintLibrary");
static_assert(sizeof(UMoviePipelineBlueprintLibrary) == 0x000028, "Wrong size on UMoviePipelineBlueprintLibrary");

// Class MovieRenderPipelineCore.MoviePipelineColorSetting
// 0x00A8 (0x00F0 - 0x0048)
class UMoviePipelineColorSetting final : public UMoviePipelineSetting
{
public:
	struct FOpenColorIODisplayConfiguration       OCIOConfiguration;                                 // 0x0048(0x00A0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bDisableToneCurve;                                 // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineColorSetting">();
	}
	static class UMoviePipelineColorSetting* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineColorSetting>();
	}
};
static_assert(alignof(UMoviePipelineColorSetting) == 0x000008, "Wrong alignment on UMoviePipelineColorSetting");
static_assert(sizeof(UMoviePipelineColorSetting) == 0x0000F0, "Wrong size on UMoviePipelineColorSetting");
static_assert(offsetof(UMoviePipelineColorSetting, OCIOConfiguration) == 0x000048, "Member 'UMoviePipelineColorSetting::OCIOConfiguration' has a wrong offset!");
static_assert(offsetof(UMoviePipelineColorSetting, bDisableToneCurve) == 0x0000E8, "Member 'UMoviePipelineColorSetting::bDisableToneCurve' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineExecutorBase
// 0x00F0 (0x0118 - 0x0028)
class UMoviePipelineExecutorBase : public UObject
{
public:
	TMulticastInlineDelegate<void(class UMoviePipelineExecutorBase* PipelineExecutor, bool bSuccess)> OnExecutorFinishedDelegate; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UMoviePipelineExecutorBase* PipelineExecutor, class UMoviePipeline* PipelineWithError, bool bIsFatal, class FText ErrorText)> OnExecutorErroredDelegate; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& Message)> SocketMessageRecievedDelegate;      // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(int32 RequestIndex, int32 ResponseCode, const class FString& Message)> HTTPResponseRecievedDelegate; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMovieRenderDebugWidget>    DebugWidgetClass;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserData;                                          // 0x00B8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMoviePipeline>             TargetPipelineClass;                               // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0x48];                                      // 0x00D0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelAllJobs()	 // 0x4f1b27c;
	void CancelCurrentJob()	 // 0x3dd0a7c;
	bool ConnectSocket(const class FString& InHostName, const int32 InPort)	 // 0x4f1b294;
	void DisconnectSocket()	 // 0x4f1b634;
	void Execute(class UMoviePipelineQueue* InPipelineQueue)	 // 0x4776f68;
	void OnBeginFrame()	 // 0x115cedc;
	void OnExecutorErroredImpl(class UMoviePipeline* ErroredPipeline, bool bFatal, const class FText& ErrorReason)	 // 0x4f1e624;
	void OnExecutorFinishedImpl()	 // 0xf79a00;
	int32 SendHTTPRequest(const class FString& InURL, const class FString& InVerb, const class FString& InMessage, const TMap<class FString, class FString>& InHeaders)	 // 0x4f1f0dc;
	bool SendSocketMessage(const class FString& InMessage)	 // 0x4f1f37c;
	void SetMoviePipelineClass(class UClass* InPipelineClass)	 // 0x4f1fbb4;
	void SetStatusMessage(const class FString& InStatus)	 // 0x4f20410;
	void SetStatusProgress(const float InProgress)	 // 0x4f205b8;

	class FString GetStatusMessage() const	 // 0x4f1e1fc;
	float GetStatusProgress() const	 // 0x4152170;
	bool IsRendering() const	 // 0x4f1e4c0;
	bool IsSocketConnected() const	 // 0x4f1e530;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineExecutorBase">();
	}
	static class UMoviePipelineExecutorBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineExecutorBase>();
	}
};
static_assert(alignof(UMoviePipelineExecutorBase) == 0x000008, "Wrong alignment on UMoviePipelineExecutorBase");
static_assert(sizeof(UMoviePipelineExecutorBase) == 0x000118, "Wrong size on UMoviePipelineExecutorBase");
static_assert(offsetof(UMoviePipelineExecutorBase, OnExecutorFinishedDelegate) == 0x000028, "Member 'UMoviePipelineExecutorBase::OnExecutorFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, OnExecutorErroredDelegate) == 0x000050, "Member 'UMoviePipelineExecutorBase::OnExecutorErroredDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, SocketMessageRecievedDelegate) == 0x000080, "Member 'UMoviePipelineExecutorBase::SocketMessageRecievedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, HTTPResponseRecievedDelegate) == 0x000090, "Member 'UMoviePipelineExecutorBase::HTTPResponseRecievedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, DebugWidgetClass) == 0x0000A0, "Member 'UMoviePipelineExecutorBase::DebugWidgetClass' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, UserData) == 0x0000B8, "Member 'UMoviePipelineExecutorBase::UserData' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, TargetPipelineClass) == 0x0000C8, "Member 'UMoviePipelineExecutorBase::TargetPipelineClass' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineLinearExecutorBase
// 0x0028 (0x0140 - 0x0118)
class UMoviePipelineLinearExecutorBase : public UMoviePipelineExecutorBase
{
public:
	class UMoviePipelineQueue*                    Queue;                                             // 0x0118(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipeline*                         ActiveMoviePipeline;                               // 0x0120(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x18];                                     // 0x0128(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineLinearExecutorBase">();
	}
	static class UMoviePipelineLinearExecutorBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineLinearExecutorBase>();
	}
};
static_assert(alignof(UMoviePipelineLinearExecutorBase) == 0x000008, "Wrong alignment on UMoviePipelineLinearExecutorBase");
static_assert(sizeof(UMoviePipelineLinearExecutorBase) == 0x000140, "Wrong size on UMoviePipelineLinearExecutorBase");
static_assert(offsetof(UMoviePipelineLinearExecutorBase, Queue) == 0x000118, "Member 'UMoviePipelineLinearExecutorBase::Queue' has a wrong offset!");
static_assert(offsetof(UMoviePipelineLinearExecutorBase, ActiveMoviePipeline) == 0x000120, "Member 'UMoviePipelineLinearExecutorBase::ActiveMoviePipeline' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCommandLineEncoder
// 0x0040 (0x0088 - 0x0048)
class UMoviePipelineCommandLineEncoder final : public UMoviePipelineSetting
{
public:
	class FString                                 FileNameFormatOverride;                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineEncodeQuality                   Quality;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdditionalCommandLineArgs;                         // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWriteEachFrameDuration;                           // 0x0072(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x15];                                      // 0x0073(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineCommandLineEncoder">();
	}
	static class UMoviePipelineCommandLineEncoder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineCommandLineEncoder>();
	}
};
static_assert(alignof(UMoviePipelineCommandLineEncoder) == 0x000008, "Wrong alignment on UMoviePipelineCommandLineEncoder");
static_assert(sizeof(UMoviePipelineCommandLineEncoder) == 0x000088, "Wrong size on UMoviePipelineCommandLineEncoder");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, FileNameFormatOverride) == 0x000048, "Member 'UMoviePipelineCommandLineEncoder::FileNameFormatOverride' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, Quality) == 0x000058, "Member 'UMoviePipelineCommandLineEncoder::Quality' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, AdditionalCommandLineArgs) == 0x000060, "Member 'UMoviePipelineCommandLineEncoder::AdditionalCommandLineArgs' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, bDeleteSourceFiles) == 0x000070, "Member 'UMoviePipelineCommandLineEncoder::bDeleteSourceFiles' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, bSkipEncodeOnRenderCanceled) == 0x000071, "Member 'UMoviePipelineCommandLineEncoder::bSkipEncodeOnRenderCanceled' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, bWriteEachFrameDuration) == 0x000072, "Member 'UMoviePipelineCommandLineEncoder::bWriteEachFrameDuration' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCommandLineEncoderSettings
// 0x00C8 (0x0100 - 0x0038)
class UMoviePipelineCommandLineEncoderSettings final : public UDeveloperSettings
{
public:
	class FString                                 ExecutablePath;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CodecHelpText;                                     // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FString                                 VideoCodec;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Low;                                // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Med;                                // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_High;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Epic;                               // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MoviePipelineCommandLineEncoderSettings">();
	}
	static class UMoviePipelineCommandLineEncoderSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMoviePipelineCommandLineEncoderSettings>();
	}
};
static_assert(alignof(UMoviePipelineCommandLineEncoderSettings) == 0x000008, "Wrong alignment on UMoviePipelineCommandLineEncoderSettings");
static_assert(sizeof(UMoviePipelineCommandLineEncoderSettings) == 0x000100, "Wrong size on UMoviePipelineCommandLineEncoderSettings");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, ExecutablePath) == 0x000038, "Member 'UMoviePipelineCommandLineEncoderSettings::ExecutablePath' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, CodecHelpText) == 0x000048, "Member 'UMoviePipelineCommandLineEncoderSettings::CodecHelpText' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, VideoCodec) == 0x000060, "Member 'UMoviePipelineCommandLineEncoderSettings::VideoCodec' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, AudioCodec) == 0x000070, "Member 'UMoviePipelineCommandLineEncoderSettings::AudioCodec' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, OutputFileExtension) == 0x000080, "Member 'UMoviePipelineCommandLineEncoderSettings::OutputFileExtension' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, CommandLineFormat) == 0x000090, "Member 'UMoviePipelineCommandLineEncoderSettings::CommandLineFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, VideoInputStringFormat) == 0x0000A0, "Member 'UMoviePipelineCommandLineEncoderSettings::VideoInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, AudioInputStringFormat) == 0x0000B0, "Member 'UMoviePipelineCommandLineEncoderSettings::AudioInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_Low) == 0x0000C0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_Low' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_Med) == 0x0000D0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_Med' has a wrong offset!");
