#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct MultiWorld.MultiWorldLoadParameters
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMultiWorldLoadParameters final
{
public:
	class FName                                   WorldName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoInitializeWorld;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartWithTickEnabled;                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoHandleWidgets;                                // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateDedicatedAudioDevice;                       // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAddNavigationSystem;                              // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bManageLocalPlayers;                               // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x12];                                       // 0x000E(0x0012)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMultiWorldLoadParameters) == 0x000008, "Wrong alignment on FMultiWorldLoadParameters");
static_assert(sizeof(FMultiWorldLoadParameters) == 0x000020, "Wrong size on FMultiWorldLoadParameters");
static_assert(offsetof(FMultiWorldLoadParameters, WorldName) == 0x000000, "Member 'FMultiWorldLoadParameters::WorldName' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bAutoInitializeWorld) == 0x000008, "Member 'FMultiWorldLoadParameters::bAutoInitializeWorld' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bStartWithTickEnabled) == 0x000009, "Member 'FMultiWorldLoadParameters::bStartWithTickEnabled' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bAutoHandleWidgets) == 0x00000A, "Member 'FMultiWorldLoadParameters::bAutoHandleWidgets' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bCreateDedicatedAudioDevice) == 0x00000B, "Member 'FMultiWorldLoadParameters::bCreateDedicatedAudioDevice' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bAddNavigationSystem) == 0x00000C, "Member 'FMultiWorldLoadParameters::bAddNavigationSystem' has a wrong offset!");
static_assert(offsetof(FMultiWorldLoadParameters, bManageLocalPlayers) == 0x00000D, "Member 'FMultiWorldLoadParameters::bManageLocalPlayers' has a wrong offset!");

// ScriptStruct MultiWorld.MultiWorldHandle
// 0x0008 (0x0008 - 0x0000)
struct FMultiWorldHandle final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMultiWorldHandle) == 0x000008, "Wrong alignment on FMultiWorldHandle");
static_assert(sizeof(FMultiWorldHandle) == 0x000008, "Wrong size on FMultiWorldHandle");
static_assert(offsetof(FMultiWorldHandle, World) == 0x000000, "Member 'FMultiWorldHandle::World' has a wrong offset!");

// ScriptStruct MultiWorld.MultiWorldTransferActorParameters
// 0x0080 (0x0080 - 0x0000)
struct FMultiWorldTransferActorParameters final
{
public:
	bool                                          bSetPhysicsActorTransform;                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeleportType                                 Teleport;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0xF];                                       // 0x0071(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMultiWorldTransferActorParameters) == 0x000010, "Wrong alignment on FMultiWorldTransferActorParameters");
static_assert(sizeof(FMultiWorldTransferActorParameters) == 0x000080, "Wrong size on FMultiWorldTransferActorParameters");
static_assert(offsetof(FMultiWorldTransferActorParameters, bSetPhysicsActorTransform) == 0x000000, "Member 'FMultiWorldTransferActorParameters::bSetPhysicsActorTransform' has a wrong offset!");
static_assert(offsetof(FMultiWorldTransferActorParameters, Transform) == 0x000010, "Member 'FMultiWorldTransferActorParameters::Transform' has a wrong offset!");
static_assert(offsetof(FMultiWorldTransferActorParameters, Teleport) == 0x000070, "Member 'FMultiWorldTransferActorParameters::Teleport' has a wrong offset!");

}

