#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiUserClientLibrary

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MultiUserClientLibrary_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MultiUserClientLibrary.MultiUserClientSyncDatabase
// 0x0010 (0x0038 - 0x0028)
class UMultiUserClientSyncDatabase final : public UObject
{
public:
	TMulticastInlineDelegate<void(class FName PackageName)> OnPackageSaved;                          // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MultiUserClientSyncDatabase">();
	}
	static class UMultiUserClientSyncDatabase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMultiUserClientSyncDatabase>();
	}
};
static_assert(alignof(UMultiUserClientSyncDatabase) == 0x000008, "Wrong alignment on UMultiUserClientSyncDatabase");
static_assert(sizeof(UMultiUserClientSyncDatabase) == 0x000038, "Wrong size on UMultiUserClientSyncDatabase");
static_assert(offsetof(UMultiUserClientSyncDatabase, OnPackageSaved) == 0x000028, "Member 'UMultiUserClientSyncDatabase::OnPackageSaved' has a wrong offset!");

// Class MultiUserClientLibrary.MultiUserClientStatics
// 0x0000 (0x0028 - 0x0028)
class UMultiUserClientStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool ConfigureMultiUserClient(const struct FMultiUserClientConfig& ClientConfig)	 // 0x4fc6fbc;
	static TArray<class FName> GatherSessionChanges(bool IgnorePersisted)	 // 0x4fc7084;
	static class UMultiUserClientSyncDatabase* GetConcertSyncDatabase()	 // 0x3fa3450;
	static struct FMultiUserConnectionError GetLastMultiUserConnectionError()	 // 0x4fc715c;
	static struct FMultiUserClientInfo GetLocalMultiUserClientInfo()	 // 0x4fc71c0;
	static bool GetMultiUserClientInfoByName(const class FString& ClientName, struct FMultiUserClientInfo* ClientInfo)	 // 0x4fc723c;
	static bool GetMultiUserConnectionStatus()	 // 0x1645584;
	static EMultiUserConnectionStatus GetMultiUserConnectionStatusDetail()	 // 0x4fc7394;
	static struct FTransform GetMultiUserPresenceTransform(const struct FGuid& ClientEndpointId)	 // 0x4fc73a8;
	static bool GetRemoteMultiUserClientInfos(TArray<struct FMultiUserClientInfo>* ClientInfos)	 // 0x4fc7470;
	static void JumpToMultiUserPresence(const class FString& OtherUserName, const struct FTransform& TransformOffset)	 // 0x4fc74f4;
	static void PersistMultiUserSessionChanges()	 // 0x17c7f2c;
	static void PersistSpecifiedPackages(const TArray<class FName>& PackagesToPersist)	 // 0x4fc76a4;
	static void SetMultiUserPresenceEnabled(const bool IsEnabled)	 // 0x4bc8ec0;
	static void SetMultiUserPresenceVisibility(const class FString& Name_0, bool Visibility, bool PropagateToAll)	 // 0x4fc7720;
	static void SetMultiUserPresenceVisibilityById(const struct FGuid& ClientEndpointId, bool Visibility, bool PropagateToAll)	 // 0x4fc78d8;
	static bool StartMultiUserDefaultConnection()	 // 0x1645584;
	static void UpdateWorkspaceModifiedPackages()	 // 0x17c7f2c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MultiUserClientStatics">();
	}
	static class UMultiUserClientStatics* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMultiUserClientStatics>();
	}
};
static_assert(alignof(UMultiUserClientStatics) == 0x000008, "Wrong alignment on UMultiUserClientStatics");
static_assert(sizeof(UMultiUserClientStatics) == 0x000028, "Wrong size on UMultiUserClientStatics");

}

