#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiWorldAccessRuntime

#include "Basic.hpp"

#include "MultiWorld_structs.hpp"


namespace SDK::Params
{

// Function MultiWorldAccessRuntime.P2MultiWorldAccessSubsystem.CallOnLoadWorldCompleted
// 0x0030 (0x0030 - 0x0000)
struct P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMultiWorldHandle                      WorldHandle;                                       // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMultiWorldLoadParameters              LoadParams;                                        // 0x0010(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted) == 0x000008, "Wrong alignment on P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted");
static_assert(sizeof(P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted) == 0x000030, "Wrong size on P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted, Success) == 0x000000, "Member 'P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted::Success' has a wrong offset!");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted, WorldHandle) == 0x000008, "Member 'P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted::WorldHandle' has a wrong offset!");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted, LoadParams) == 0x000010, "Member 'P2MultiWorldAccessSubsystem_CallOnLoadWorldCompleted::LoadParams' has a wrong offset!");

// Function MultiWorldAccessRuntime.P2MultiWorldAccessSubsystem.CallOnPreWorldEnded
// 0x0008 (0x0008 - 0x0000)
struct P2MultiWorldAccessSubsystem_CallOnPreWorldEnded final
{
public:
	struct FMultiWorldHandle                      WorldToEnd;                                        // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MultiWorldAccessSubsystem_CallOnPreWorldEnded) == 0x000008, "Wrong alignment on P2MultiWorldAccessSubsystem_CallOnPreWorldEnded");
static_assert(sizeof(P2MultiWorldAccessSubsystem_CallOnPreWorldEnded) == 0x000008, "Wrong size on P2MultiWorldAccessSubsystem_CallOnPreWorldEnded");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnPreWorldEnded, WorldToEnd) == 0x000000, "Member 'P2MultiWorldAccessSubsystem_CallOnPreWorldEnded::WorldToEnd' has a wrong offset!");

// Function MultiWorldAccessRuntime.P2MultiWorldAccessSubsystem.CallOnWorldSwitched
// 0x0010 (0x0010 - 0x0000)
struct P2MultiWorldAccessSubsystem_CallOnWorldSwitched final
{
public:
	struct FMultiWorldHandle                      OldWorld;                                          // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMultiWorldHandle                      NewWorld;                                          // 0x0008(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2MultiWorldAccessSubsystem_CallOnWorldSwitched) == 0x000008, "Wrong alignment on P2MultiWorldAccessSubsystem_CallOnWorldSwitched");
static_assert(sizeof(P2MultiWorldAccessSubsystem_CallOnWorldSwitched) == 0x000010, "Wrong size on P2MultiWorldAccessSubsystem_CallOnWorldSwitched");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnWorldSwitched, OldWorld) == 0x000000, "Member 'P2MultiWorldAccessSubsystem_CallOnWorldSwitched::OldWorld' has a wrong offset!");
static_assert(offsetof(P2MultiWorldAccessSubsystem_CallOnWorldSwitched, NewWorld) == 0x000008, "Member 'P2MultiWorldAccessSubsystem_CallOnWorldSwitched::NewWorld' has a wrong offset!");

}

