#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraAkAudio

#include "Basic.hpp"

#include "Niagara_classes.hpp"


namespace SDK
{

// Class NiagaraAkAudio.NiagaraDataInterfaceAkAudio
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAkAudio final : public UNiagaraDataInterface
{
public:
	class UAkAudioEvent*                          Event;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitPlaysPerTick;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlaysPerTick;                                   // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"NiagaraDataInterfaceAkAudio">();
	}
	static class UNiagaraDataInterfaceAkAudio* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAkAudio>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAkAudio) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAkAudio");
static_assert(sizeof(UNiagaraDataInterfaceAkAudio) == 0x000048, "Wrong size on UNiagaraDataInterfaceAkAudio");
static_assert(offsetof(UNiagaraDataInterfaceAkAudio, Event) == 0x000038, "Member 'UNiagaraDataInterfaceAkAudio::Event' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAkAudio, bLimitPlaysPerTick) == 0x000040, "Member 'UNiagaraDataInterfaceAkAudio::bLimitPlaysPerTick' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAkAudio, MaxPlaysPerTick) == 0x000044, "Member 'UNiagaraDataInterfaceAkAudio::MaxPlaysPerTick' has a wrong offset!");

}

