#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSC

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "OSC_structs.hpp"


namespace SDK
{

// Class OSC.OSCClient
// 0x0008 (0x0030 - 0x0028)
class UOSCClient final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetSendIPAddress(class FString& IPAddress, int32& Port)	 // 0x4fcc9f8;
	void SendOSCBundle(struct FOSCBundle& Bundle)	 // 0x4fcdc0c;
	void SendOSCMessage(struct FOSCMessage& Message)	 // 0x4fcdca8;
	bool SetSendIPAddress(const class FString& IPAddress, const int32 Port)	 // 0x4fce400;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"OSCClient">();
	}
	static class UOSCClient* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UOSCClient>();
	}
};
static_assert(alignof(UOSCClient) == 0x000008, "Wrong alignment on UOSCClient");
static_assert(sizeof(UOSCClient) == 0x000030, "Wrong size on UOSCClient");

// Class OSC.OSCManager
// 0x0000 (0x0028 - 0x0028)
class UOSCManager final : public UBlueprintFunctionLibrary
{
public:
	static struct FOSCMessage AddAddress(struct FOSCMessage& Message, const struct FOSCAddress& Value)	 // 0x4fc94a0;
	static struct FOSCMessage AddBlob(struct FOSCMessage& Message, const TArray<uint8>& Value)	 // 0x4fc9684;
	static struct FOSCMessage AddBool(struct FOSCMessage& Message, bool Value)	 // 0x4fc979c;
	static struct FOSCBundle AddBundleToBundle(const struct FOSCBundle& InBundle, struct FOSCBundle& OutBundle)	 // 0x4fc9930;
	static struct FOSCMessage AddFloat(struct FOSCMessage& Message, float Value)	 // 0x4fc9a40;
	static struct FOSCMessage AddInt32(struct FOSCMessage& Message, int32 Value)	 // 0x4fc9bd4;
	static struct FOSCMessage AddInt64(struct FOSCMessage& Message, int64 Value)	 // 0x4fc9d64;
	static struct FOSCBundle AddMessageToBundle(const struct FOSCMessage& Message, struct FOSCBundle& Bundle)	 // 0x4fc9ef8;
	static struct FOSCMessage AddString(struct FOSCMessage& Message, class FString& Value)	 // 0x4fca008;
	static struct FOSCBundle ClearBundle(struct FOSCBundle& Bundle)	 // 0x4fca250;
	static struct FOSCMessage ClearMessage(struct FOSCMessage& Message)	 // 0x4fca324;
	static struct FOSCAddress ClearOSCAddressContainers(struct FOSCAddress& Address)	 // 0x4fca3c8;
	static struct FOSCAddress ConvertStringToOSCAddress(const class FString& String)	 // 0x4fca480;
	static class UOSCClient* CreateOSCClient(const class FString& SendIPAddress, int32 Port, const class FString& ClientName, class UObject* Outer_0)	 // 0x4fca56c;
	static class UOSCServer* CreateOSCServer(const class FString& ReceiveIPAddress, int32 Port, bool bMulticastLoopback, bool bStartListening, const class FString& ServerName, class UObject* Outer_0)	 // 0x4fca7e8;
	static class UObject* FindObjectAtOSCAddress(const struct FOSCAddress& Address)	 // 0x4fcab78;
	static bool GetAddress(const struct FOSCMessage& Message, const int32 Index_0, struct FOSCAddress* Value)	 // 0x4fcac14;
	static void GetAllAddresses(const struct FOSCMessage& Message, TArray<struct FOSCAddress>* Values)	 // 0x4fcadf0;
	static void GetAllBools(const struct FOSCMessage& Message, TArray<bool>* Values)	 // 0x4fcaee8;
	static void GetAllFloats(const struct FOSCMessage& Message, TArray<float>* Values)	 // 0x4fcafe8;
	static void GetAllInt32s(const struct FOSCMessage& Message, TArray<int32>* Values)	 // 0x4fcb0e8;
	static void GetAllInt64s(const struct FOSCMessage& Message, TArray<int64>* Values)	 // 0x4fcb1e8;
	static void GetAllStrings(const struct FOSCMessage& Message, TArray<class FString>* Values)	 // 0x4fcb2e8;
	static bool GetBlob(const struct FOSCMessage& Message, const int32 Index_0, TArray<uint8>* Value)	 // 0x4fcb484;
	static bool GetBool(const struct FOSCMessage& Message, const int32 Index_0, bool* Value)	 // 0x4fcb644;
	static TArray<struct FOSCBundle> GetBundlesFromBundle(const struct FOSCBundle& Bundle)	 // 0x4fcb904;
	static bool GetFloat(const struct FOSCMessage& Message, const int32 Index_0, float* Value)	 // 0x4fcba04;
	static bool GetInt32(const struct FOSCMessage& Message, const int32 Index_0, int32* Value)	 // 0x4fcbc20;
	static bool GetInt64(const struct FOSCMessage& Message, const int32 Index_0, int64* Value)	 // 0x4fcbe3c;
	static struct FOSCMessage GetMessageFromBundle(const struct FOSCBundle& Bundle, int32 Index_0, bool* bSucceeded)	 // 0x4fcc0e8;
	static TArray<struct FOSCMessage> GetMessagesFromBundle(const struct FOSCBundle& Bundle)	 // 0x4fcc308;
	static class FString GetOSCAddressContainer(const struct FOSCAddress& Address, const int32 Index_0)	 // 0x4fcc430;
	static class FString GetOSCAddressContainerPath(const struct FOSCAddress& Address)	 // 0x4fcc600;
	static TArray<class FString> GetOSCAddressContainers(const struct FOSCAddress& Address)	 // 0x4fcc6b4;
	static class FString GetOSCAddressFullPath(const struct FOSCAddress& Address)	 // 0x4fcc7a8;
	static class FString GetOSCAddressMethod(const struct FOSCAddress& Address)	 // 0x4fcc85c;
	static struct FOSCAddress GetOSCMessageAddress(const struct FOSCMessage& Message)	 // 0x4fcc914;
	static bool GetString(const struct FOSCMessage& Message, const int32 Index_0, class FString* Value)	 // 0x4fccaf4;
	static class FString ObjectPathFromOSCAddress(const struct FOSCAddress& Address)	 // 0x4fcda88;
	static struct FOSCAddress OSCAddressFromObjectPath(class UObject* Object)	 // 0x4fcccec;
	static struct FOSCAddress OSCAddressFromObjectPathString(const class FString& PathName)	 // 0x4fcce14;
	static bool OSCAddressIsValidPath(const struct FOSCAddress& Address)	 // 0x4fccefc;
	static bool OSCAddressIsValidPattern(const struct FOSCAddress& Address)	 // 0x4fccf94;
	static bool OSCAddressPathMatchesPattern(const struct FOSCAddress& Pattern, const struct FOSCAddress& Path)	 // 0x4fcd02c;
	static class FString OSCAddressPopContainer(struct FOSCAddress& Address)	 // 0x4fcd134;
	static TArray<class FString> OSCAddressPopContainers(struct FOSCAddress& Address, int32 NumContainers)	 // 0x4fcd1e8;
	static struct FOSCAddress OSCAddressPushContainer(struct FOSCAddress& Address, const class FString& Container)	 // 0x4fcd4c8;
	static struct FOSCAddress OSCAddressPushContainers(struct FOSCAddress& Address, const TArray<class FString>& Containers)	 // 0x4fcd67c;
	static struct FOSCAddress OSCAddressRemoveContainers(struct FOSCAddress& Address, int32 Index_0, int32 Count)	 // 0x4fcd7b8;
	static struct FOSCAddress SetOSCAddressMethod(struct FOSCAddress& Address, const class FString& Method)	 // 0x4fce03c;
	static struct FOSCMessage SetOSCMessageAddress(struct FOSCMessage& Message, const struct FOSCAddress& Address)	 // 0x4fce2a0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"OSCManager">();
	}
	static class UOSCManager* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UOSCManager>();
	}
};
static_assert(alignof(UOSCManager) == 0x000008, "Wrong alignment on UOSCManager");
static_assert(sizeof(UOSCManager) == 0x000028, "Wrong size on UOSCManager");

// Class OSC.OSCServer
// 0x00B8 (0x00E0 - 0x0028)
class alignas(0x10) UOSCServer final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FOSCMessage& Message, const class FString& IPAddress, int32 Port)> OnOscMessageReceived; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FOSCBundle& Bundle, const class FString& IPAddress, int32 Port)> OnOscBundleReceived; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x80];                                      // 0x0060(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAllowlistedClient(const class FString& IPAddress)	 // 0x4fc95b0;
	void BindEventToOnOSCAddressPatternMatchesPath(const struct FOSCAddress& OSCAddressPattern, const TDelegate<void(const struct FOSCAddress& AddressPattern, const struct FOSCMessage& Message, const class FString& IPAddress, int32 Port)>& Event)	 // 0x4fca12c;
	void ClearAllowlistedClients()	 // 0x4fca238;
	void Listen()	 // 0x4fcccd8;
	void RemoveAllowlistedClient(const class FString& IPAddress)	 // 0x4fcdb38;
	bool SetAddress(const class FString& ReceiveIPAddress, int32 Port)	 // 0x4fcdd44;
	void SetAllowlistClientsEnabled(bool bEnabled)	 // 0x4fcdeb4;
	void SetMulticastLoopback(bool bMulticastLoopback)	 // 0x4fcdf78;
	void Stop()	 // 0x4fce570;
	void UnbindAllEventsFromOnOSCAddressPatternMatchesPath(const struct FOSCAddress& OSCAddressPattern)	 // 0x4fce584;
	void UnbindAllEventsFromOnOSCAddressPatternMatching()	 // 0x4fce624;
	void UnbindEventFromOnOSCAddressPatternMatchesPath(const struct FOSCAddress& OSCAddressPattern, const TDelegate<void(const struct FOSCAddress& AddressPattern, const struct FOSCMessage& Message, const class FString& IPAddress, int32 Port)>& Event)	 // 0x4fce638;

	TSet<class FString> GetAllowlistedClients() const	 // 0x4fcb40c;
	TArray<struct FOSCAddress> GetBoundOSCAddressPatterns() const	 // 0x4fcb868;
	class FString GetIpAddress(bool bIncludePort) const	 // 0x4fcc000;
	bool GetMulticastLoopback() const	 // 0x4fcc408;
	int32 GetPort() const	 // 0x4fcc9d0;
	bool IsActive() const	 // 0x4fcccb4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"OSCServer">();
	}
	static class UOSCServer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UOSCServer>();
	}
};
static_assert(alignof(UOSCServer) == 0x000010, "Wrong alignment on UOSCServer");
static_assert(sizeof(UOSCServer) == 0x0000E0, "Wrong size on UOSCServer");
static_assert(offsetof(UOSCServer, OnOscMessageReceived) == 0x000028, "Member 'UOSCServer::OnOscMessageReceived' has a wrong offset!");
static_assert(offsetof(UOSCServer, OnOscBundleReceived) == 0x000050, "Member 'UOSCServer::OnOscBundleReceived' has a wrong offset!");

}

