#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2AnimNotify_Ladder

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function P2AnimNotify_Ladder.P2AnimNotify_Ladder_C.FindSurfaceTag
// 0x0078 (0x0078 - 0x0000)
struct P2AnimNotify_Ladder_C_FindSurfaceTag final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0010(0x0020)(ConstParm)
	class AP2SplineMoveActor*                     CallFunc_GetSplineMoveActor_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SplineMoveActor_Ladder_C*           K2Node_DynamicCast_AsBP_Spline_Move_Actor_Ladder;  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_GetPhysicalMaterial_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2PhysicalMaterial*                    K2Node_DynamicCast_AsP2Physical_Material;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_FindFirstTagByFilterContainer_OutFoundTag; // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFirstTagByFilterContainer_ReturnValue; // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(P2AnimNotify_Ladder_C_FindSurfaceTag) == 0x000008, "Wrong alignment on P2AnimNotify_Ladder_C_FindSurfaceTag");
static_assert(sizeof(P2AnimNotify_Ladder_C_FindSurfaceTag) == 0x000078, "Wrong size on P2AnimNotify_Ladder_C_FindSurfaceTag");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, MeshComp) == 0x000000, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::MeshComp' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, ReturnValue) == 0x000008, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::ReturnValue' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, Temp_struct_Variable) == 0x000010, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_GetSplineMoveActor_ReturnValue) == 0x000030, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_GetSplineMoveActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, K2Node_DynamicCast_AsBP_Spline_Move_Actor_Ladder) == 0x000040, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::K2Node_DynamicCast_AsBP_Spline_Move_Actor_Ladder' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_GetMaterial_ReturnValue) == 0x000050, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_GetPhysicalMaterial_ReturnValue) == 0x000058, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_GetPhysicalMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, K2Node_DynamicCast_AsP2Physical_Material) == 0x000060, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::K2Node_DynamicCast_AsP2Physical_Material' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_FindFirstTagByFilterContainer_OutFoundTag) == 0x00006C, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_FindFirstTagByFilterContainer_OutFoundTag' has a wrong offset!");
static_assert(offsetof(P2AnimNotify_Ladder_C_FindSurfaceTag, CallFunc_FindFirstTagByFilterContainer_ReturnValue) == 0x000074, "Member 'P2AnimNotify_Ladder_C_FindSurfaceTag::CallFunc_FindFirstTagByFilterContainer_ReturnValue' has a wrong offset!");

}

