#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2GridOcclusion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class P2GridOcclusion.P2GridOcclusionActor
// 0x02A8 (0x0558 - 0x02B0)
class AP2GridOcclusionActor : public AActor
{
public:
	class USceneCaptureComponent2D*               SceneCaptureComponent;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              CaptureArea;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              CaptureOffset;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExcludeCapturedTiles;                             // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CaptureMinMaxZ;                                    // 0x02CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SamplesPerMeter;                                   // 0x02D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SuperSampling;                                     // 0x02D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DepthThreshold;                                    // 0x02DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              MaxSamplingRangeAndDepth;                          // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              MinMaxRangeWorld;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              MinMaxRangeFoliage;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxSegmentationSteps;                              // 0x02F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SegmentationStepHeight;                            // 0x02FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxSamplesPerPixelPPLL;                            // 0x0300(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint16>                                TileBaseDepth;                                     // 0x0308(0x0010)(ZeroConstructor, NonTransactional, Protected, NativeAccessSpecifierProtected)
	TArray<struct FIntVector4>                    BulkDataRanges;                                    // 0x0318(0x0010)(ZeroConstructor, NonTransactional, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x70];                                     // 0x0328(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	class UPPLLShadowComponent*                   PPLLShadowComponent;                               // 0x0398(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0x1B8];                                    // 0x03A0(0x01B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginOnDemandCapturing()	 // 0x17c7f2c;
	void CaptureRegion(int32 CaptureNearCameraRadius, bool bAsync)	 // 0x4e8a9ec;
	void ClearData(bool bModify)	 // 0x4bc8ec0;
	void ConvertToBulkData()	 // 0x4e8ab18;
	void ConvertToTempData()	 // 0x4e8ab2c;
	void EndOnDemandCapturing()	 // 0x17c7f2c;
	void ForceStreamTiles(int32 Mip)	 // 0x4e8ab40;

	struct FIntVector GetOnDemandCaptureProgress() const	 // 0x4e8ac00;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GridOcclusionActor">();
	}
	static class AP2GridOcclusionActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2GridOcclusionActor>();
	}
};
static_assert(alignof(AP2GridOcclusionActor) == 0x000008, "Wrong alignment on AP2GridOcclusionActor");
static_assert(sizeof(AP2GridOcclusionActor) == 0x000558, "Wrong size on AP2GridOcclusionActor");
static_assert(offsetof(AP2GridOcclusionActor, SceneCaptureComponent) == 0x0002B0, "Member 'AP2GridOcclusionActor::SceneCaptureComponent' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, CaptureArea) == 0x0002B8, "Member 'AP2GridOcclusionActor::CaptureArea' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, CaptureOffset) == 0x0002C0, "Member 'AP2GridOcclusionActor::CaptureOffset' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, bExcludeCapturedTiles) == 0x0002C8, "Member 'AP2GridOcclusionActor::bExcludeCapturedTiles' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, CaptureMinMaxZ) == 0x0002CC, "Member 'AP2GridOcclusionActor::CaptureMinMaxZ' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, SamplesPerMeter) == 0x0002D4, "Member 'AP2GridOcclusionActor::SamplesPerMeter' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, SuperSampling) == 0x0002D8, "Member 'AP2GridOcclusionActor::SuperSampling' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, DepthThreshold) == 0x0002DC, "Member 'AP2GridOcclusionActor::DepthThreshold' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, MaxSamplingRangeAndDepth) == 0x0002E0, "Member 'AP2GridOcclusionActor::MaxSamplingRangeAndDepth' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, MinMaxRangeWorld) == 0x0002E8, "Member 'AP2GridOcclusionActor::MinMaxRangeWorld' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, MinMaxRangeFoliage) == 0x0002F0, "Member 'AP2GridOcclusionActor::MinMaxRangeFoliage' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, MaxSegmentationSteps) == 0x0002F8, "Member 'AP2GridOcclusionActor::MaxSegmentationSteps' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, SegmentationStepHeight) == 0x0002FC, "Member 'AP2GridOcclusionActor::SegmentationStepHeight' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, MaxSamplesPerPixelPPLL) == 0x000300, "Member 'AP2GridOcclusionActor::MaxSamplesPerPixelPPLL' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, TileBaseDepth) == 0x000308, "Member 'AP2GridOcclusionActor::TileBaseDepth' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, BulkDataRanges) == 0x000318, "Member 'AP2GridOcclusionActor::BulkDataRanges' has a wrong offset!");
static_assert(offsetof(AP2GridOcclusionActor, PPLLShadowComponent) == 0x000398, "Member 'AP2GridOcclusionActor::PPLLShadowComponent' has a wrong offset!");

}

