#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2GridOcclusion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function P2GridOcclusion.P2GridOcclusionActor.CaptureRegion
// 0x0008 (0x0008 - 0x0000)
struct P2GridOcclusionActor_CaptureRegion final
{
public:
	int32                                         CaptureNearCameraRadius;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsync;                                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(P2GridOcclusionActor_CaptureRegion) == 0x000004, "Wrong alignment on P2GridOcclusionActor_CaptureRegion");
static_assert(sizeof(P2GridOcclusionActor_CaptureRegion) == 0x000008, "Wrong size on P2GridOcclusionActor_CaptureRegion");
static_assert(offsetof(P2GridOcclusionActor_CaptureRegion, CaptureNearCameraRadius) == 0x000000, "Member 'P2GridOcclusionActor_CaptureRegion::CaptureNearCameraRadius' has a wrong offset!");
static_assert(offsetof(P2GridOcclusionActor_CaptureRegion, bAsync) == 0x000004, "Member 'P2GridOcclusionActor_CaptureRegion::bAsync' has a wrong offset!");

// Function P2GridOcclusion.P2GridOcclusionActor.ClearData
// 0x0001 (0x0001 - 0x0000)
struct P2GridOcclusionActor_ClearData final
{
public:
	bool                                          bModify;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GridOcclusionActor_ClearData) == 0x000001, "Wrong alignment on P2GridOcclusionActor_ClearData");
static_assert(sizeof(P2GridOcclusionActor_ClearData) == 0x000001, "Wrong size on P2GridOcclusionActor_ClearData");
static_assert(offsetof(P2GridOcclusionActor_ClearData, bModify) == 0x000000, "Member 'P2GridOcclusionActor_ClearData::bModify' has a wrong offset!");

// Function P2GridOcclusion.P2GridOcclusionActor.ForceStreamTiles
// 0x0004 (0x0004 - 0x0000)
struct P2GridOcclusionActor_ForceStreamTiles final
{
public:
	int32                                         Mip;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GridOcclusionActor_ForceStreamTiles) == 0x000004, "Wrong alignment on P2GridOcclusionActor_ForceStreamTiles");
static_assert(sizeof(P2GridOcclusionActor_ForceStreamTiles) == 0x000004, "Wrong size on P2GridOcclusionActor_ForceStreamTiles");
static_assert(offsetof(P2GridOcclusionActor_ForceStreamTiles, Mip) == 0x000000, "Member 'P2GridOcclusionActor_ForceStreamTiles::Mip' has a wrong offset!");

// Function P2GridOcclusion.P2GridOcclusionActor.GetOnDemandCaptureProgress
// 0x000C (0x000C - 0x0000)
struct P2GridOcclusionActor_GetOnDemandCaptureProgress final
{
public:
	struct FIntVector                             ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GridOcclusionActor_GetOnDemandCaptureProgress) == 0x000004, "Wrong alignment on P2GridOcclusionActor_GetOnDemandCaptureProgress");
static_assert(sizeof(P2GridOcclusionActor_GetOnDemandCaptureProgress) == 0x00000C, "Wrong size on P2GridOcclusionActor_GetOnDemandCaptureProgress");
static_assert(offsetof(P2GridOcclusionActor_GetOnDemandCaptureProgress, ReturnValue) == 0x000000, "Member 'P2GridOcclusionActor_GetOnDemandCaptureProgress::ReturnValue' has a wrong offset!");

}

