#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2MaterialFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "P2MaterialFX_structs.hpp"


namespace SDK
{

// Class P2MaterialFX.P2MaterialFXManager
// 0x0170 (0x01B0 - 0x0040)
class UP2MaterialFXManager final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x90];                                      // 0x0040(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint64, class UP2MaterialFXData*>        MaterialFXData;                                    // 0x00D0(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x90];                                     // 0x0120(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2MaterialFXManager">();
	}
	static class UP2MaterialFXManager* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2MaterialFXManager>();
	}
};
static_assert(alignof(UP2MaterialFXManager) == 0x000008, "Wrong alignment on UP2MaterialFXManager");
static_assert(sizeof(UP2MaterialFXManager) == 0x0001B0, "Wrong size on UP2MaterialFXManager");
static_assert(offsetof(UP2MaterialFXManager, MaterialFXData) == 0x0000D0, "Member 'UP2MaterialFXManager::MaterialFXData' has a wrong offset!");

// Class P2MaterialFX.P2MaterialFXCurves
// 0x0400 (0x0430 - 0x0030)
class UP2MaterialFXCurves final : public UCurveBase
{
public:
	struct FRichCurve                             FadeOutTime[0x8];                                  // 0x0030(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2MaterialFXCurves">();
	}
	static class UP2MaterialFXCurves* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2MaterialFXCurves>();
	}
};
static_assert(alignof(UP2MaterialFXCurves) == 0x000008, "Wrong alignment on UP2MaterialFXCurves");
static_assert(sizeof(UP2MaterialFXCurves) == 0x000430, "Wrong size on UP2MaterialFXCurves");
static_assert(offsetof(UP2MaterialFXCurves, FadeOutTime) == 0x000030, "Member 'UP2MaterialFXCurves::FadeOutTime' has a wrong offset!");

// Class P2MaterialFX.P2MaterialFXData
// 0x0250 (0x0280 - 0x0030)
class UP2MaterialFXData final : public UDataAsset
{
public:
	struct FP2MaterialFXLayerSettings             Layers[0x8];                                       // 0x0030(0x0040)(Edit, NativeAccessSpecifierPublic)
	class UP2MaterialFXCurves*                    Curves;                                            // 0x0230(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MaterialFXDetailLevel                      RootDetailLevel;                                   // 0x0238(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RootPhysMatStrength;                               // 0x023C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplePointSize;                                   // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinCollisionDepth;                                 // 0x0244(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionRadiusScale;                              // 0x0248(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysMatRangeScale;                                 // 0x024C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysMatVelocityScale;                              // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysMatFadeInTimeScale;                            // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipTriangleListMerge;                            // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2PhysicalMaterialMFXData*             WaterPMData;                                       // 0x0260(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FP2MaterialFXSamplingPoint>     SamplingPointsCPU;                                 // 0x0268(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2MaterialFXData">();
	}
	static class UP2MaterialFXData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2MaterialFXData>();
	}
};
static_assert(alignof(UP2MaterialFXData) == 0x000010, "Wrong alignment on UP2MaterialFXData");
static_assert(sizeof(UP2MaterialFXData) == 0x000280, "Wrong size on UP2MaterialFXData");
static_assert(offsetof(UP2MaterialFXData, Layers) == 0x000030, "Member 'UP2MaterialFXData::Layers' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, Curves) == 0x000230, "Member 'UP2MaterialFXData::Curves' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, RootDetailLevel) == 0x000238, "Member 'UP2MaterialFXData::RootDetailLevel' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, RootPhysMatStrength) == 0x00023C, "Member 'UP2MaterialFXData::RootPhysMatStrength' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, SamplePointSize) == 0x000240, "Member 'UP2MaterialFXData::SamplePointSize' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, MinCollisionDepth) == 0x000244, "Member 'UP2MaterialFXData::MinCollisionDepth' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, CollisionRadiusScale) == 0x000248, "Member 'UP2MaterialFXData::CollisionRadiusScale' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, PhysMatRangeScale) == 0x00024C, "Member 'UP2MaterialFXData::PhysMatRangeScale' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, PhysMatVelocityScale) == 0x000250, "Member 'UP2MaterialFXData::PhysMatVelocityScale' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, PhysMatFadeInTimeScale) == 0x000254, "Member 'UP2MaterialFXData::PhysMatFadeInTimeScale' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, bSkipTriangleListMerge) == 0x000258, "Member 'UP2MaterialFXData::bSkipTriangleListMerge' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, WaterPMData) == 0x000260, "Member 'UP2MaterialFXData::WaterPMData' has a wrong offset!");
static_assert(offsetof(UP2MaterialFXData, SamplingPointsCPU) == 0x000268, "Member 'UP2MaterialFXData::SamplingPointsCPU' has a wrong offset!");

// Class P2MaterialFX.P2PhysicalMaterialMFXCurves
// 0x0200 (0x0230 - 0x0030)
class UP2PhysicalMaterialMFXCurves final : public UCurveBase
{
public:
	struct FRichCurve                             MaxStrength;                                       // 0x0030(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             CollisionBias;                                     // 0x00B0(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             CollisionFadeRange;                                // 0x0130(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             CollisionFadeInTime;                               // 0x01B0(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2PhysicalMaterialMFXCurves">();
	}
	static class UP2PhysicalMaterialMFXCurves* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2PhysicalMaterialMFXCurves>();
	}
};
static_assert(alignof(UP2PhysicalMaterialMFXCurves) == 0x000008, "Wrong alignment on UP2PhysicalMaterialMFXCurves");
static_assert(sizeof(UP2PhysicalMaterialMFXCurves) == 0x000230, "Wrong size on UP2PhysicalMaterialMFXCurves");
static_assert(offsetof(UP2PhysicalMaterialMFXCurves, MaxStrength) == 0x000030, "Member 'UP2PhysicalMaterialMFXCurves::MaxStrength' has a wrong offset!");
static_assert(offsetof(UP2PhysicalMaterialMFXCurves, CollisionBias) == 0x0000B0, "Member 'UP2PhysicalMaterialMFXCurves::CollisionBias' has a wrong offset!");
static_assert(offsetof(UP2PhysicalMaterialMFXCurves, CollisionFadeRange) == 0x000130, "Member 'UP2PhysicalMaterialMFXCurves::CollisionFadeRange' has a wrong offset!");
static_assert(offsetof(UP2PhysicalMaterialMFXCurves, CollisionFadeInTime) == 0x0001B0, "Member 'UP2PhysicalMaterialMFXCurves::CollisionFadeInTime' has a wrong offset!");

// Class P2MaterialFX.P2PhysicalMaterialMFXData
// 0x0048 (0x0078 - 0x0030)
class UP2PhysicalMaterialMFXData final : public UPrimaryDataAsset
{
public:
	class UP2PhysicalMaterialMFXCurves*           Curves[0x8];                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinStrengthOnRootMesh;                             // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2PhysicalMaterialMFXData">();
	}
	static class UP2PhysicalMaterialMFXData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2PhysicalMaterialMFXData>();
	}
};
static_assert(alignof(UP2PhysicalMaterialMFXData) == 0x000008, "Wrong alignment on UP2PhysicalMaterialMFXData");
static_assert(sizeof(UP2PhysicalMaterialMFXData) == 0x000078, "Wrong size on UP2PhysicalMaterialMFXData");
static_assert(offsetof(UP2PhysicalMaterialMFXData, Curves) == 0x000030, "Member 'UP2PhysicalMaterialMFXData::Curves' has a wrong offset!");
static_assert(offsetof(UP2PhysicalMaterialMFXData, MinStrengthOnRootMesh) == 0x000070, "Member 'UP2PhysicalMaterialMFXData::MinStrengthOnRootMesh' has a wrong offset!");

}

