#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2MaterialFX

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum P2MaterialFX.EP2MaterialFXDetailLevel
// NumValues: 0x0006
enum class EP2MaterialFXDetailLevel : uint8
{
	Disabled                                 = 0,
	PersistentMasksOnly                      = 1,
	TraceHighFrequency                       = 2,
	TraceLowFrequency                        = 3,
	TraceOnStoppedMoving                     = 4,
	EP2MaterialFXDetailLevel_MAX             = 5,
};

// Enum P2MaterialFX.EP2MaterialFXLayerResolution
// NumValues: 0x0005
enum class EP2MaterialFXLayerResolution : uint8
{
	H                                        = 0,
	M                                        = 1,
	L                                        = 2,
	Off                                      = 3,
	EP2MaterialFXLayerResolution_MAX         = 4,
};

// Enum P2MaterialFX.EMFXLayer
// NumValues: 0x0009
enum class EMFXLayer : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	White                                    = 3,
	Cyan                                     = 4,
	Magenta                                  = 5,
	Yellow                                   = 6,
	Black                                    = 7,
	Max                                      = 8,
};

// Enum P2MaterialFX.EMFXLayerBit
// NumValues: 0x000A
enum class EMFXLayerBit : uint8
{
	None                                     = 0,
	Red                                      = 1,
	Green                                    = 2,
	Blue                                     = 4,
	White                                    = 8,
	Cyan                                     = 16,
	Magenta                                  = 32,
	Yellow                                   = 64,
	Black                                    = 128,
	EMFXLayerBit_MAX                         = 129,
};

// ScriptStruct P2MaterialFX.P2MaterialFXFloorData
// 0x0060 (0x0060 - 0x0000)
struct FP2MaterialFXFloorData final
{
public:
	class UP2PhysicalMaterialMFXData*             PhysMatMFXData;                                    // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x58];                                       // 0x0008(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2MaterialFXFloorData) == 0x000008, "Wrong alignment on FP2MaterialFXFloorData");
static_assert(sizeof(FP2MaterialFXFloorData) == 0x000060, "Wrong size on FP2MaterialFXFloorData");
static_assert(offsetof(FP2MaterialFXFloorData, PhysMatMFXData) == 0x000000, "Member 'FP2MaterialFXFloorData::PhysMatMFXData' has a wrong offset!");

// ScriptStruct P2MaterialFX.P2MaterialFXLayerSettings
// 0x0040 (0x0040 - 0x0000)
struct FP2MaterialFXLayerSettings final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistent;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MaterialFXLayerResolution                  MinResolution;                                     // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EP2MaterialFXLayerResolution                  MaxResolution;                                     // 0x0012(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0xD];                                       // 0x0013(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              MaxRenderDistance;                                 // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              UpscaleMinMaxPointSize;                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              UpscaleMinMaxPointWeight;                          // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FP2MaterialFXLayerSettings) == 0x000010, "Wrong alignment on FP2MaterialFXLayerSettings");
static_assert(sizeof(FP2MaterialFXLayerSettings) == 0x000040, "Wrong size on FP2MaterialFXLayerSettings");
static_assert(offsetof(FP2MaterialFXLayerSettings, Description) == 0x000000, "Member 'FP2MaterialFXLayerSettings::Description' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, bPersistent) == 0x000010, "Member 'FP2MaterialFXLayerSettings::bPersistent' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, MinResolution) == 0x000011, "Member 'FP2MaterialFXLayerSettings::MinResolution' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, MaxResolution) == 0x000012, "Member 'FP2MaterialFXLayerSettings::MaxResolution' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, MaxRenderDistance) == 0x000020, "Member 'FP2MaterialFXLayerSettings::MaxRenderDistance' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, UpscaleMinMaxPointSize) == 0x000030, "Member 'FP2MaterialFXLayerSettings::UpscaleMinMaxPointSize' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXLayerSettings, UpscaleMinMaxPointWeight) == 0x000038, "Member 'FP2MaterialFXLayerSettings::UpscaleMinMaxPointWeight' has a wrong offset!");

// ScriptStruct P2MaterialFX.P2MaterialFXSamplingPoint
// 0x0010 (0x0010 - 0x0000)
struct FP2MaterialFXSamplingPoint final
{
public:
	struct FVector3f                              LocalPosition;                                     // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMFXLayer                                     Layer;                                             // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FP2MaterialFXSamplingPoint) == 0x000004, "Wrong alignment on FP2MaterialFXSamplingPoint");
static_assert(sizeof(FP2MaterialFXSamplingPoint) == 0x000010, "Wrong size on FP2MaterialFXSamplingPoint");
static_assert(offsetof(FP2MaterialFXSamplingPoint, LocalPosition) == 0x000000, "Member 'FP2MaterialFXSamplingPoint::LocalPosition' has a wrong offset!");
static_assert(offsetof(FP2MaterialFXSamplingPoint, Layer) == 0x00000C, "Member 'FP2MaterialFXSamplingPoint::Layer' has a wrong offset!");

}

