#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P2TestRunnerRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class P2TestRunnerRuntime.P2TestInterface
// 0x0000 (0x0000 - 0x0000)
class IP2TestInterface final
{
public:
	void OnMatchStarted(class AP2GameMode* GameMode)	 // 0x4e80908;
	void OnTestEnd()	 // 0x4a8c26c;
	void OnTestStart()	 // 0x4e809c8;
	bool OnTestTick()	 // 0x17d9ef0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestInterface">();
	}
	static class IP2TestInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IP2TestInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IP2TestInterface) == 0x000001, "Wrong alignment on IP2TestInterface");
static_assert(sizeof(IP2TestInterface) == 0x000001, "Wrong size on IP2TestInterface");

// Class P2TestRunnerRuntime.P2TestBase
// 0x0008 (0x02B8 - 0x02B0)
class AP2TestBase final : public AActor
{
public:
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestBase">();
	}
	static class AP2TestBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2TestBase>();
	}
};
static_assert(alignof(AP2TestBase) == 0x000008, "Wrong alignment on AP2TestBase");
static_assert(sizeof(AP2TestBase) == 0x0002B8, "Wrong size on AP2TestBase");

// Class P2TestRunnerRuntime.P2TestRunnerSubsystem
// 0x0018 (0x0058 - 0x0040)
class UP2TestRunnerSubsystem final : public UTickableWorldSubsystem
{
public:
	TScriptInterface<class IP2TestInterface>      ActiveTest;                                        // 0x0040(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestRunnerSubsystem">();
	}
	static class UP2TestRunnerSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TestRunnerSubsystem>();
	}
};
static_assert(alignof(UP2TestRunnerSubsystem) == 0x000008, "Wrong alignment on UP2TestRunnerSubsystem");
static_assert(sizeof(UP2TestRunnerSubsystem) == 0x000058, "Wrong size on UP2TestRunnerSubsystem");
static_assert(offsetof(UP2TestRunnerSubsystem, ActiveTest) == 0x000040, "Member 'UP2TestRunnerSubsystem::ActiveTest' has a wrong offset!");

// Class P2TestRunnerRuntime.P2TestStatics
// 0x0000 (0x0028 - 0x0028)
class UP2TestStatics final : public UBlueprintFunctionLibrary
{
public:
	static void BeginTrace(const class UObject* Context)	 // 0x4e8065c;
	static void EndTrace(const class UObject* Context)	 // 0x4e80808;
	static void ReportTestError(const class FString& Reason)	 // 0x48482b0;
	static void RequestExit(const class UObject* Context)	 // 0x4e809dc;
	static class AP2HeroCharacter* SpawnHeroBot(class UObject* Context, const struct FTransform& Transform, const class UP2BotData* BotData, TSubclassOf<class UP2BotCommandScript> CommandScriptClass, bool bSimulateNetConnection)	 // 0x4e80aa4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TestStatics">();
	}
	static class UP2TestStatics* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TestStatics>();
	}
};
static_assert(alignof(UP2TestStatics) == 0x000008, "Wrong alignment on UP2TestStatics");
static_assert(sizeof(UP2TestStatics) == 0x000028, "Wrong size on UP2TestStatics");

}

