#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PixelStreaming

#include "Basic.hpp"

#include "AudioMixer_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PixelStreaming.PixelStreamingAudioComponent
// 0x0050 (0x0820 - 0x07D0)
class UPixelStreamingAudioComponent final : public USynthComponent
{
public:
	uint8                                         Pad_7D0[0x8];                                      // 0x07D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StreamerToHear;                                    // 0x07D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerToHear;                                      // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoFindPeer;                                     // 0x07F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F9[0x27];                                     // 0x07F9(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsListeningToPlayer()	 // 0x507275c;
	bool ListenTo(const class FString& PlayerToListenTo)	 // 0x5072858;
	void Reset()	 // 0x5072944;
	bool StreamerListenTo(const class FString& StreamerId, const class FString& PlayerToListenTo)	 // 0x50731cc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PixelStreamingAudioComponent">();
	}
	static class UPixelStreamingAudioComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPixelStreamingAudioComponent>();
	}
};
static_assert(alignof(UPixelStreamingAudioComponent) == 0x000010, "Wrong alignment on UPixelStreamingAudioComponent");
static_assert(sizeof(UPixelStreamingAudioComponent) == 0x000820, "Wrong size on UPixelStreamingAudioComponent");
static_assert(offsetof(UPixelStreamingAudioComponent, StreamerToHear) == 0x0007D8, "Member 'UPixelStreamingAudioComponent::StreamerToHear' has a wrong offset!");
static_assert(offsetof(UPixelStreamingAudioComponent, PlayerToHear) == 0x0007E8, "Member 'UPixelStreamingAudioComponent::PlayerToHear' has a wrong offset!");
static_assert(offsetof(UPixelStreamingAudioComponent, bAutoFindPeer) == 0x0007F8, "Member 'UPixelStreamingAudioComponent::bAutoFindPeer' has a wrong offset!");

// Class PixelStreaming.PixelStreamingBlueprints
// 0x0000 (0x0028 - 0x0028)
class UPixelStreamingBlueprints final : public UBlueprintFunctionLibrary
{
public:
	static void ForceKeyFrame()	 // 0x507234c;
	static void FreezeFrame(class UTexture2D* Texture)	 // 0x50723cc;
	static class FString GetDefaultStreamerID()	 // 0x507247c;
	static class UPixelStreamingDelegates* GetPixelStreamingDelegates()	 // 0x5072738;
	static void KickPlayer(const class FString& PlayerId)	 // 0x5072788;
	static void SendFile(const class FString& FilePath, const class FString& MimeType, const class FString& FileExtension)	 // 0x5072958;
	static void SendFileAsByteArray(const TArray<uint8>& ByteArray, const class FString& MimeType, const class FString& FileExtension)	 // 0x5072b84;
	static void StreamerFreezeStream(const class FString& StreamerId, class UTexture2D* Texture)	 // 0x5072eac;
	static void StreamerKickPlayer(const class FString& StreamerId, const class FString& PlayerId)	 // 0x5073048;
	static void StreamerSendFile(const class FString& StreamerId, const class FString& FilePath, const class FString& MimeType, const class FString& FileExtension)	 // 0x5073370;
	static void StreamerSendFileAsByteArray(const class FString& StreamerId, const TArray<uint8>& ByteArray, const class FString& MimeType, const class FString& FileExtension)	 // 0x5073638;
	static void StreamerUnfreezeStream(const class FString& StreamerId)	 // 0x5073928;
	static void UnfreezeFrame()	 // 0x5073a3c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PixelStreamingBlueprints">();
	}
	static class UPixelStreamingBlueprints* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPixelStreamingBlueprints>();
	}
};
static_assert(alignof(UPixelStreamingBlueprints) == 0x000008, "Wrong alignment on UPixelStreamingBlueprints");
static_assert(sizeof(UPixelStreamingBlueprints) == 0x000028, "Wrong size on UPixelStreamingBlueprints");

// Class PixelStreaming.PixelStreamingDelegates
// 0x0160 (0x0188 - 0x0028)
class UPixelStreamingDelegates final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnConnectedToSignallingServer;                     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnDisconnectedFromSignallingServer;                // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& StreamerId, const class FString& PlayerId, bool qualityController)> OnNewConnection; // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& StreamerId, const class FString& PlayerId, bool WasQualityController)> OnClosedConnection; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& StreamerId)> OnAllConnectionsClosed;          // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x60];                                      // 0x00D8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& PlayerId, class FName StatName, float StatValue)> OnStatChanged; // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x18];                                     // 0x0148(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFallbackToSoftwareEncodering;                    // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x18];                                     // 0x0170(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PixelStreamingDelegates">();
	}
	static class UPixelStreamingDelegates* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPixelStreamingDelegates>();
	}
};
static_assert(alignof(UPixelStreamingDelegates) == 0x000008, "Wrong alignment on UPixelStreamingDelegates");
static_assert(sizeof(UPixelStreamingDelegates) == 0x000188, "Wrong size on UPixelStreamingDelegates");
static_assert(offsetof(UPixelStreamingDelegates, OnConnectedToSignallingServer) == 0x000028, "Member 'UPixelStreamingDelegates::OnConnectedToSignallingServer' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnDisconnectedFromSignallingServer) == 0x000050, "Member 'UPixelStreamingDelegates::OnDisconnectedFromSignallingServer' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnNewConnection) == 0x000078, "Member 'UPixelStreamingDelegates::OnNewConnection' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnClosedConnection) == 0x0000A0, "Member 'UPixelStreamingDelegates::OnClosedConnection' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnAllConnectionsClosed) == 0x0000C8, "Member 'UPixelStreamingDelegates::OnAllConnectionsClosed' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnStatChanged) == 0x000138, "Member 'UPixelStreamingDelegates::OnStatChanged' has a wrong offset!");
static_assert(offsetof(UPixelStreamingDelegates, OnFallbackToSoftwareEncodering) == 0x000160, "Member 'UPixelStreamingDelegates::OnFallbackToSoftwareEncodering' has a wrong offset!");

// Class PixelStreaming.PixelStreamingInput
// 0x0018 (0x00D8 - 0x00C0)
class UPixelStreamingInput final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const class FString& Descriptor)> OnInputEvent;                    // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddJsonStringValue(const class FString& Descriptor, const class FString& FieldName, const class FString& StringValue, class FString* NewDescriptor, bool* Success)	 // 0x5072054;
	void GetJsonStringValue(const class FString& Descriptor, const class FString& FieldName, class FString* StringValue, bool* Success)	 // 0x50724cc;
	void SendPixelStreamingResponse(const class FString& Descriptor)	 // 0x5072ddc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PixelStreamingInput">();
	}
	static class UPixelStreamingInput* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPixelStreamingInput>();
	}
};
static_assert(alignof(UPixelStreamingInput) == 0x000008, "Wrong alignment on UPixelStreamingInput");
static_assert(sizeof(UPixelStreamingInput) == 0x0000D8, "Wrong size on UPixelStreamingInput");
static_assert(offsetof(UPixelStreamingInput, OnInputEvent) == 0x0000C0, "Member 'UPixelStreamingInput::OnInputEvent' has a wrong offset!");

}

