#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralMeshComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class ProceduralMeshComponent.KismetProceduralMeshLibrary
// 0x0000 (0x0028 - 0x0028)
class UKismetProceduralMeshLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CalculateTangentsForMesh(const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector2D>& UVs, TArray<struct FVector>* Normals, TArray<struct FProcMeshTangent>* Tangents)	 // 0x4b95f78;
	static void ConvertQuadToTriangles(TArray<int32>& Triangles, int32 Vert0, int32 Vert1, int32 Vert2, int32 Vert3)	 // 0x4b962a8;
	static void CopyProceduralMeshFromStaticMeshComponent(class UStaticMeshComponent* StaticMeshComponent, int32 LODIndex, class UProceduralMeshComponent* ProcMeshComponent, bool bCreateCollision)	 // 0x4b966c0;
	static void CreateGridMeshSplit(int32 NumX, int32 NumY, TArray<int32>* Triangles, TArray<struct FVector>* Vertices, TArray<struct FVector2D>* UVs, TArray<struct FVector2D>* UV1s, float GridSpacing)	 // 0x4b96b00;
	static void CreateGridMeshTriangles(int32 NumX, int32 NumY, bool bWinding, TArray<int32>* Triangles)	 // 0x4b96e98;
	static void CreateGridMeshWelded(int32 NumX, int32 NumY, TArray<int32>* Triangles, TArray<struct FVector>* Vertices, TArray<struct FVector2D>* UVs, float GridSpacing)	 // 0x4b97124;
	static void GenerateBoxMesh(const struct FVector& BoxRadius, TArray<struct FVector>* Vertices, TArray<int32>* Triangles, TArray<struct FVector>* Normals, TArray<struct FVector2D>* UVs, TArray<struct FProcMeshTangent>* Tangents)	 // 0x4b98194;
	static void GetSectionFromProceduralMesh(class UProceduralMeshComponent* InProcMesh, int32 SectionIndex, TArray<struct FVector>* Vertices, TArray<int32>* Triangles, TArray<struct FVector>* Normals, TArray<struct FVector2D>* UVs, TArray<struct FProcMeshTangent>* Tangents)	 // 0x4b9844c;
	static void GetSectionFromStaticMesh(class UStaticMesh* InMesh, int32 LODIndex, int32 SectionIndex, TArray<struct FVector>* Vertices, TArray<int32>* Triangles, TArray<struct FVector>* Normals, TArray<struct FVector2D>* UVs, TArray<struct FProcMeshTangent>* Tangents)	 // 0x4b98888;
	static void SliceProceduralMesh(class UProceduralMeshComponent* InProcMesh, const struct FVector& PlanePosition, const struct FVector& PlaneNormal, bool bCreateOtherHalf, class UProceduralMeshComponent** OutOtherHalfProcMesh, EProcMeshSliceCapOption CapOption, class UMaterialInterface* CapMaterial)	 // 0x4b98e40;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"KismetProceduralMeshLibrary">();
	}
	static class UKismetProceduralMeshLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UKismetProceduralMeshLibrary>();
	}
};
static_assert(alignof(UKismetProceduralMeshLibrary) == 0x000008, "Wrong alignment on UKismetProceduralMeshLibrary");
static_assert(sizeof(UKismetProceduralMeshLibrary) == 0x000028, "Wrong size on UKismetProceduralMeshLibrary");

// Class ProceduralMeshComponent.ProceduralMeshComponent
// 0x0080 (0x0660 - 0x05E0)
class UProceduralMeshComponent : public UMeshComponent
{
public:
	uint8                                         Pad_5E0[0x8];                                      // 0x05E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseComplexAsSimpleCollision;                      // 0x05E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsyncCooking;                                  // 0x05E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5EA[0x6];                                      // 0x05EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodySetup*                             ProcMeshBodySetup;                                 // 0x05F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FProcMeshSection>               ProcMeshSections;                                  // 0x05F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FKConvexElem>                   CollisionConvexElems;                              // 0x0608(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       LocalBounds;                                       // 0x0618(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UBodySetup*>                     AsyncBodySetupQueue;                               // 0x0650(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void AddCollisionConvexMesh(const TArray<struct FVector>& ConvexVerts)	 // 0x4b95e98;
	void ClearAllMeshSections()	 // 0x4b961c0;
	void ClearCollisionConvexMeshes()	 // 0x4b961d4;
	void ClearMeshSection(int32 SectionIndex)	 // 0x4b961e8;
	void CreateMeshSection(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FColor>& VertexColors, const TArray<struct FProcMeshTangent>& Tangents, bool bCreateCollision)	 // 0x4b9777c;
	void CreateMeshSection_LinearColor(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<int32>& Triangles, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FProcMeshTangent>& Tangents, bool bCreateCollision, bool bSRGBConversion)	 // 0x4b97b84;
	void SetMeshSectionVisible(int32 SectionIndex, bool bNewVisibility)	 // 0x4b98d00;
	void UpdateMeshSection(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FColor>& VertexColors, const TArray<struct FProcMeshTangent>& Tangents)	 // 0x4b99298;
	void UpdateMeshSection_LinearColor(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<struct FVector>& Normals, const TArray<struct FVector2D>& UV0, const TArray<struct FVector2D>& UV1, const TArray<struct FVector2D>& UV2, const TArray<struct FVector2D>& UV3, const TArray<struct FLinearColor>& VertexColors, const TArray<struct FProcMeshTangent>& Tangents, bool bSRGBConversion)	 // 0x4b9956c;

	int32 GetNumSections() const	 // 0x164639c;
	bool IsMeshSectionVisible(int32 SectionIndex) const	 // 0x4b98c18;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ProceduralMeshComponent">();
	}
	static class UProceduralMeshComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UProceduralMeshComponent>();
	}
};
static_assert(alignof(UProceduralMeshComponent) == 0x000010, "Wrong alignment on UProceduralMeshComponent");
static_assert(sizeof(UProceduralMeshComponent) == 0x000660, "Wrong size on UProceduralMeshComponent");
static_assert(offsetof(UProceduralMeshComponent, bUseComplexAsSimpleCollision) == 0x0005E8, "Member 'UProceduralMeshComponent::bUseComplexAsSimpleCollision' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, bUseAsyncCooking) == 0x0005E9, "Member 'UProceduralMeshComponent::bUseAsyncCooking' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, ProcMeshBodySetup) == 0x0005F0, "Member 'UProceduralMeshComponent::ProcMeshBodySetup' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, ProcMeshSections) == 0x0005F8, "Member 'UProceduralMeshComponent::ProcMeshSections' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, CollisionConvexElems) == 0x000608, "Member 'UProceduralMeshComponent::CollisionConvexElems' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, LocalBounds) == 0x000618, "Member 'UProceduralMeshComponent::LocalBounds' has a wrong offset!");
static_assert(offsetof(UProceduralMeshComponent, AsyncBodySetupQueue) == 0x000650, "Member 'UProceduralMeshComponent::AsyncBodySetupQueue' has a wrong offset!");

}

