#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RaidLogging

#include "Basic.hpp"


namespace SDK::Params
{

// Function RaidLogging.P2TelemetrySchema.InventoryToJSON
// 0x0018 (0x0018 - 0x0000)
struct P2TelemetrySchema_InventoryToJSON final
{
public:
	const class AP2HeroCharacter*                 InPlayer;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2TelemetrySchema_InventoryToJSON) == 0x000008, "Wrong alignment on P2TelemetrySchema_InventoryToJSON");
static_assert(sizeof(P2TelemetrySchema_InventoryToJSON) == 0x000018, "Wrong size on P2TelemetrySchema_InventoryToJSON");
static_assert(offsetof(P2TelemetrySchema_InventoryToJSON, InPlayer) == 0x000000, "Member 'P2TelemetrySchema_InventoryToJSON::InPlayer' has a wrong offset!");
static_assert(offsetof(P2TelemetrySchema_InventoryToJSON, ReturnValue) == 0x000008, "Member 'P2TelemetrySchema_InventoryToJSON::ReturnValue' has a wrong offset!");

// Function RaidLogging.P2TelemetrySchema.ItemToJSON
// 0x0018 (0x0018 - 0x0000)
struct P2TelemetrySchema_ItemToJSON final
{
public:
	const class UP2Item*                          Item;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2TelemetrySchema_ItemToJSON) == 0x000008, "Wrong alignment on P2TelemetrySchema_ItemToJSON");
static_assert(sizeof(P2TelemetrySchema_ItemToJSON) == 0x000018, "Wrong size on P2TelemetrySchema_ItemToJSON");
static_assert(offsetof(P2TelemetrySchema_ItemToJSON, Item) == 0x000000, "Member 'P2TelemetrySchema_ItemToJSON::Item' has a wrong offset!");
static_assert(offsetof(P2TelemetrySchema_ItemToJSON, ReturnValue) == 0x000008, "Member 'P2TelemetrySchema_ItemToJSON::ReturnValue' has a wrong offset!");

// Function RaidLogging.P2Telemetry_Raid.OnPlayerFinishActivateInitialExtensions
// 0x0008 (0x0008 - 0x0000)
struct P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions final
{
public:
	const class AP2PlayerState*                   InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions) == 0x000008, "Wrong alignment on P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions");
static_assert(sizeof(P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions) == 0x000008, "Wrong size on P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions");
static_assert(offsetof(P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions, InPlayerState) == 0x000000, "Member 'P2Telemetry_Raid_OnPlayerFinishActivateInitialExtensions::InPlayerState' has a wrong offset!");

}

