#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReliefMapping

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ReliefMapping_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class ReliefMapping.ReliefMapUserData
// 0x0060 (0x0088 - 0x0028)
class UReliefMapUserData final : public UAssetUserData
{
public:
	EReliefMapping_Type                           ReliefMapType;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              HeightMap;                                         // 0x0030(0x0030)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReliefMapping_LinearColorChannels            HeightMapChannel;                                  // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EReliefMapping_CommonSizes                    CommonResolutions;                                 // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              Resolution;                                        // 0x0064(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationBucketSize;                               // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlackPoint;                                        // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WhitePoint;                                        // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         floor;                                             // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ceiling;                                           // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bias;                                              // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinHeight;                                         // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ReliefMapUserData">();
	}
	static class UReliefMapUserData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UReliefMapUserData>();
	}
};
static_assert(alignof(UReliefMapUserData) == 0x000008, "Wrong alignment on UReliefMapUserData");
static_assert(sizeof(UReliefMapUserData) == 0x000088, "Wrong size on UReliefMapUserData");
static_assert(offsetof(UReliefMapUserData, ReliefMapType) == 0x000028, "Member 'UReliefMapUserData::ReliefMapType' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, HeightMap) == 0x000030, "Member 'UReliefMapUserData::HeightMap' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, HeightMapChannel) == 0x000060, "Member 'UReliefMapUserData::HeightMapChannel' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, CommonResolutions) == 0x000061, "Member 'UReliefMapUserData::CommonResolutions' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, Resolution) == 0x000064, "Member 'UReliefMapUserData::Resolution' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, IterationBucketSize) == 0x00006C, "Member 'UReliefMapUserData::IterationBucketSize' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, BlackPoint) == 0x000070, "Member 'UReliefMapUserData::BlackPoint' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, WhitePoint) == 0x000074, "Member 'UReliefMapUserData::WhitePoint' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, floor) == 0x000078, "Member 'UReliefMapUserData::floor' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, ceiling) == 0x00007C, "Member 'UReliefMapUserData::ceiling' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, Bias) == 0x000080, "Member 'UReliefMapUserData::Bias' has a wrong offset!");
static_assert(offsetof(UReliefMapUserData, MinHeight) == 0x000084, "Member 'UReliefMapUserData::MinHeight' has a wrong offset!");

}

