#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControlLogic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RemoteControl_classes.hpp"
#include "RemoteControlLogic_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class RemoteControlLogic.RCAction
// 0x0028 (0x0050 - 0x0028)
class URCAction : public UObject
{
public:
	struct FGuid                                  ExposedFieldId;                                    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class URemoteControlPreset>    PresetWeakPtr;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCAction">();
	}
	static class URCAction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCAction>();
	}
};
static_assert(alignof(URCAction) == 0x000008, "Wrong alignment on URCAction");
static_assert(sizeof(URCAction) == 0x000050, "Wrong size on URCAction");
static_assert(offsetof(URCAction, ExposedFieldId) == 0x000028, "Member 'URCAction::ExposedFieldId' has a wrong offset!");
static_assert(offsetof(URCAction, ID) == 0x000038, "Member 'URCAction::ID' has a wrong offset!");
static_assert(offsetof(URCAction, PresetWeakPtr) == 0x000048, "Member 'URCAction::PresetWeakPtr' has a wrong offset!");

// Class RemoteControlLogic.RCActionContainer
// 0x00C0 (0x00E8 - 0x0028)
class URCActionContainer final : public UObject
{
public:
	TSet<class URCActionContainer*>               ActionContainers;                                  // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class URemoteControlPreset>    PresetWeakPtr;                                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class URCAction*>                        Actions;                                           // 0x0098(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCActionContainer">();
	}
	static class URCActionContainer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCActionContainer>();
	}
};
static_assert(alignof(URCActionContainer) == 0x000008, "Wrong alignment on URCActionContainer");
static_assert(sizeof(URCActionContainer) == 0x0000E8, "Wrong size on URCActionContainer");
static_assert(offsetof(URCActionContainer, ActionContainers) == 0x000028, "Member 'URCActionContainer::ActionContainers' has a wrong offset!");
static_assert(offsetof(URCActionContainer, PresetWeakPtr) == 0x000078, "Member 'URCActionContainer::PresetWeakPtr' has a wrong offset!");
static_assert(offsetof(URCActionContainer, Actions) == 0x000098, "Member 'URCActionContainer::Actions' has a wrong offset!");

// Class RemoteControlLogic.RCBehaviour
// 0x0060 (0x0088 - 0x0028)
class URCBehaviour : public UObject
{
public:
	TSubclassOf<class URCBehaviourNode>           BehaviourNodeClass;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         OverrideBehaviourBlueprintClassPath;               // 0x0030(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URCActionContainer*                     ActionContainer;                                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class URCController>           ControllerWeakPtr;                                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x8];                                       // 0x0070(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URCBehaviourNode*                       CachedBehaviourNode;                               // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsEnabled;                                        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecuteBehavioursDuringPreChange;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviour">();
	}
	static class URCBehaviour* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviour>();
	}
};
static_assert(alignof(URCBehaviour) == 0x000008, "Wrong alignment on URCBehaviour");
static_assert(sizeof(URCBehaviour) == 0x000088, "Wrong size on URCBehaviour");
static_assert(offsetof(URCBehaviour, BehaviourNodeClass) == 0x000028, "Member 'URCBehaviour::BehaviourNodeClass' has a wrong offset!");
static_assert(offsetof(URCBehaviour, OverrideBehaviourBlueprintClassPath) == 0x000030, "Member 'URCBehaviour::OverrideBehaviourBlueprintClassPath' has a wrong offset!");
static_assert(offsetof(URCBehaviour, ID) == 0x000050, "Member 'URCBehaviour::ID' has a wrong offset!");
static_assert(offsetof(URCBehaviour, ActionContainer) == 0x000060, "Member 'URCBehaviour::ActionContainer' has a wrong offset!");
static_assert(offsetof(URCBehaviour, ControllerWeakPtr) == 0x000068, "Member 'URCBehaviour::ControllerWeakPtr' has a wrong offset!");
static_assert(offsetof(URCBehaviour, CachedBehaviourNode) == 0x000078, "Member 'URCBehaviour::CachedBehaviourNode' has a wrong offset!");
static_assert(offsetof(URCBehaviour, bIsEnabled) == 0x000080, "Member 'URCBehaviour::bIsEnabled' has a wrong offset!");
static_assert(offsetof(URCBehaviour, bExecuteBehavioursDuringPreChange) == 0x000081, "Member 'URCBehaviour::bExecuteBehavioursDuringPreChange' has a wrong offset!");

// Class RemoteControlLogic.RCBehaviourBind
// 0x0008 (0x0090 - 0x0088)
class URCBehaviourBind final : public URCBehaviour
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourBind">();
	}
	static class URCBehaviourBind* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourBind>();
	}
};
static_assert(alignof(URCBehaviourBind) == 0x000008, "Wrong alignment on URCBehaviourBind");
static_assert(sizeof(URCBehaviourBind) == 0x000090, "Wrong size on URCBehaviourBind");

// Class RemoteControlLogic.RCBehaviourNode
// 0x0030 (0x0058 - 0x0028)
class URCBehaviourNode : public UObject
{
public:
	class FText                                   DisplayName;                                       // 0x0028(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   BehaviorDescription;                               // 0x0040(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourNode">();
	}
	static class URCBehaviourNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourNode>();
	}
};
static_assert(alignof(URCBehaviourNode) == 0x000008, "Wrong alignment on URCBehaviourNode");
static_assert(sizeof(URCBehaviourNode) == 0x000058, "Wrong size on URCBehaviourNode");
static_assert(offsetof(URCBehaviourNode, DisplayName) == 0x000028, "Member 'URCBehaviourNode::DisplayName' has a wrong offset!");
static_assert(offsetof(URCBehaviourNode, BehaviorDescription) == 0x000040, "Member 'URCBehaviourNode::BehaviorDescription' has a wrong offset!");

// Class RemoteControlLogic.RCBehaviourBindNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourBindNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda764;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda83c;
	void OnPassed(class URCBehaviour* InBehaviour) const	 // 0x4a8c408;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourBindNode">();
	}
	static class URCBehaviourBindNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourBindNode>();
	}
};
static_assert(alignof(URCBehaviourBindNode) == 0x000008, "Wrong alignment on URCBehaviourBindNode");
static_assert(sizeof(URCBehaviourBindNode) == 0x000058, "Wrong size on URCBehaviourBindNode");

// Class RemoteControlLogic.RCBehaviourBlueprintNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourBlueprintNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda764;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda914;
	void OnPassed(class URCBehaviour* InBehaviour) const	 // 0x4a8c408;
	void PreExecute(class URCBehaviour* InBehaviour) const	 // 0x4a8c4cc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourBlueprintNode">();
	}
	static class URCBehaviourBlueprintNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourBlueprintNode>();
	}
};
static_assert(alignof(URCBehaviourBlueprintNode) == 0x000008, "Wrong alignment on URCBehaviourBlueprintNode");
static_assert(sizeof(URCBehaviourBlueprintNode) == 0x000058, "Wrong size on URCBehaviourBlueprintNode");

// Class RemoteControlLogic.RCBehaviourConditional
// 0x0058 (0x00E0 - 0x0088)
class URCBehaviourConditional final : public URCBehaviour
{
public:
	TMap<class URCAction*, struct FRCBehaviourCondition> Conditions;                                 // 0x0088(0x0050)(NativeAccessSpecifierPublic)
	class URCVirtualPropertySelfContainer*        Comparand;                                         // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourConditional">();
	}
	static class URCBehaviourConditional* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourConditional>();
	}
};
static_assert(alignof(URCBehaviourConditional) == 0x000008, "Wrong alignment on URCBehaviourConditional");
static_assert(sizeof(URCBehaviourConditional) == 0x0000E0, "Wrong size on URCBehaviourConditional");
static_assert(offsetof(URCBehaviourConditional, Conditions) == 0x000088, "Member 'URCBehaviourConditional::Conditions' has a wrong offset!");
static_assert(offsetof(URCBehaviourConditional, Comparand) == 0x0000D8, "Member 'URCBehaviourConditional::Comparand' has a wrong offset!");

// Class RemoteControlLogic.RCBehaviourConditionalNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourConditionalNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda764;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda83c;
	void OnPassed(class URCBehaviour* InBehaviour) const	 // 0x4a8c408;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourConditionalNode">();
	}
	static class URCBehaviourConditionalNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourConditionalNode>();
	}
};
static_assert(alignof(URCBehaviourConditionalNode) == 0x000008, "Wrong alignment on URCBehaviourConditionalNode");
static_assert(sizeof(URCBehaviourConditionalNode) == 0x000058, "Wrong size on URCBehaviourConditionalNode");

// Class RemoteControlLogic.RCBehaviourOnValueChangedNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourOnValueChangedNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda83c;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda9ec;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourOnValueChangedNode">();
	}
	static class URCBehaviourOnValueChangedNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourOnValueChangedNode>();
	}
};
static_assert(alignof(URCBehaviourOnValueChangedNode) == 0x000008, "Wrong alignment on URCBehaviourOnValueChangedNode");
static_assert(sizeof(URCBehaviourOnValueChangedNode) == 0x000058, "Wrong size on URCBehaviourOnValueChangedNode");

// Class RemoteControlLogic.RCBehaviourRangeMapNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourRangeMapNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda764;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda83c;
	void OnPassed(class URCBehaviour* InBehaviour) const	 // 0x4a8c408;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourRangeMapNode">();
	}
	static class URCBehaviourRangeMapNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourRangeMapNode>();
	}
};
static_assert(alignof(URCBehaviourRangeMapNode) == 0x000008, "Wrong alignment on URCBehaviourRangeMapNode");
static_assert(sizeof(URCBehaviourRangeMapNode) == 0x000058, "Wrong size on URCBehaviourRangeMapNode");

// Class RemoteControlLogic.RCBehaviourSetAssetByPathNode
// 0x0000 (0x0058 - 0x0058)
class URCBehaviourSetAssetByPathNode final : public URCBehaviourNode
{
public:
	bool Execute(class URCBehaviour* InBehaviour) const	 // 0x4dda83c;
	bool IsSupported(class URCBehaviour* InBehaviour) const	 // 0x4dda9ec;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCBehaviourSetAssetByPathNode">();
	}
	static class URCBehaviourSetAssetByPathNode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCBehaviourSetAssetByPathNode>();
	}
};
static_assert(alignof(URCBehaviourSetAssetByPathNode) == 0x000008, "Wrong alignment on URCBehaviourSetAssetByPathNode");
static_assert(sizeof(URCBehaviourSetAssetByPathNode) == 0x000058, "Wrong size on URCBehaviourSetAssetByPathNode");

// Class RemoteControlLogic.RCController
// 0x0068 (0x0118 - 0x00B0)
class URCController final : public URCVirtualPropertyInContainer
{
public:
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class URCBehaviour*>                     Behaviours;                                        // 0x00C8(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCController">();
	}
	static class URCController* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCController>();
	}
};
static_assert(alignof(URCController) == 0x000008, "Wrong alignment on URCController");
static_assert(sizeof(URCController) == 0x000118, "Wrong size on URCController");
static_assert(offsetof(URCController, Behaviours) == 0x0000C8, "Member 'URCController::Behaviours' has a wrong offset!");

// Class RemoteControlLogic.RCControllerContainer
// 0x0060 (0x0108 - 0x00A8)
class URCControllerContainer final : public URCVirtualPropertyContainerBase
{
public:
	float                                         VectorSliderDelta;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VectorLinearDeltaSensitivity;                      // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RotatorSliderDelta;                                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RotatorLinearDeltaSensitivity;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class URCActionContainer*>               SharedActionContainers;                            // 0x00B8(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCControllerContainer">();
	}
	static class URCControllerContainer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCControllerContainer>();
	}
};
static_assert(alignof(URCControllerContainer) == 0x000008, "Wrong alignment on URCControllerContainer");
static_assert(sizeof(URCControllerContainer) == 0x000108, "Wrong size on URCControllerContainer");
static_assert(offsetof(URCControllerContainer, VectorSliderDelta) == 0x0000A8, "Member 'URCControllerContainer::VectorSliderDelta' has a wrong offset!");
static_assert(offsetof(URCControllerContainer, VectorLinearDeltaSensitivity) == 0x0000AC, "Member 'URCControllerContainer::VectorLinearDeltaSensitivity' has a wrong offset!");
static_assert(offsetof(URCControllerContainer, RotatorSliderDelta) == 0x0000B0, "Member 'URCControllerContainer::RotatorSliderDelta' has a wrong offset!");
static_assert(offsetof(URCControllerContainer, RotatorLinearDeltaSensitivity) == 0x0000B4, "Member 'URCControllerContainer::RotatorLinearDeltaSensitivity' has a wrong offset!");
static_assert(offsetof(URCControllerContainer, SharedActionContainers) == 0x0000B8, "Member 'URCControllerContainer::SharedActionContainers' has a wrong offset!");

// Class RemoteControlLogic.RCFunctionAction
// 0x0000 (0x0050 - 0x0050)
class URCFunctionAction final : public URCAction
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCFunctionAction">();
	}
	static class URCFunctionAction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCFunctionAction>();
	}
};
static_assert(alignof(URCFunctionAction) == 0x000008, "Wrong alignment on URCFunctionAction");
static_assert(sizeof(URCFunctionAction) == 0x000050, "Wrong size on URCFunctionAction");

// Class RemoteControlLogic.RCPropertyAction
// 0x0008 (0x0058 - 0x0050)
class URCPropertyAction : public URCAction
{
public:
	class URCVirtualPropertySelfContainer*        PropertySelfContainer;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCPropertyAction">();
	}
	static class URCPropertyAction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCPropertyAction>();
	}
};
static_assert(alignof(URCPropertyAction) == 0x000008, "Wrong alignment on URCPropertyAction");
static_assert(sizeof(URCPropertyAction) == 0x000058, "Wrong size on URCPropertyAction");
static_assert(offsetof(URCPropertyAction, PropertySelfContainer) == 0x000050, "Member 'URCPropertyAction::PropertySelfContainer' has a wrong offset!");

// Class RemoteControlLogic.RCPropertyBindAction
// 0x0008 (0x0060 - 0x0058)
class URCPropertyBindAction final : public URCPropertyAction
{
public:
	class URCController*                          Controller;                                        // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCPropertyBindAction">();
	}
	static class URCPropertyBindAction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCPropertyBindAction>();
	}
};
static_assert(alignof(URCPropertyBindAction) == 0x000008, "Wrong alignment on URCPropertyBindAction");
static_assert(sizeof(URCPropertyBindAction) == 0x000060, "Wrong size on URCPropertyBindAction");
static_assert(offsetof(URCPropertyBindAction, Controller) == 0x000058, "Member 'URCPropertyBindAction::Controller' has a wrong offset!");

// Class RemoteControlLogic.RCRangeMapBehaviour
// 0x0070 (0x00F8 - 0x0088)
class URCRangeMapBehaviour final : public URCBehaviour
{
public:
	class URCVirtualPropertyContainerBase*        PropertyContainer;                                 // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class URCAction*, struct FRCRangeMapInput> RangeMapActionContainer;                         // 0x0090(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x18];                                      // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCRangeMapBehaviour">();
	}
	static class URCRangeMapBehaviour* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCRangeMapBehaviour>();
	}
};
static_assert(alignof(URCRangeMapBehaviour) == 0x000008, "Wrong alignment on URCRangeMapBehaviour");
static_assert(sizeof(URCRangeMapBehaviour) == 0x0000F8, "Wrong size on URCRangeMapBehaviour");
static_assert(offsetof(URCRangeMapBehaviour, PropertyContainer) == 0x000088, "Member 'URCRangeMapBehaviour::PropertyContainer' has a wrong offset!");
static_assert(offsetof(URCRangeMapBehaviour, RangeMapActionContainer) == 0x000090, "Member 'URCRangeMapBehaviour::RangeMapActionContainer' has a wrong offset!");

// Class RemoteControlLogic.RCSetAssetByPathBehaviour
// 0x0048 (0x00D0 - 0x0088)
class URCSetAssetByPathBehaviour final : public URCBehaviour
{
public:
	class URCVirtualPropertyContainerBase*        PropertyInContainer;                               // 0x0088(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    AssetClass;                                        // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRCSetAssetPath                        PathStruct;                                        // 0x0098(0x0010)(NativeAccessSpecifierPublic)
	bool                                          bInternal;                                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TargetEntityId;                                    // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BC[0x14];                                      // 0x00BC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCSetAssetByPathBehaviour">();
	}
	static class URCSetAssetByPathBehaviour* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCSetAssetByPathBehaviour>();
	}
};
static_assert(alignof(URCSetAssetByPathBehaviour) == 0x000008, "Wrong alignment on URCSetAssetByPathBehaviour");
static_assert(sizeof(URCSetAssetByPathBehaviour) == 0x0000D0, "Wrong size on URCSetAssetByPathBehaviour");
static_assert(offsetof(URCSetAssetByPathBehaviour, PropertyInContainer) == 0x000088, "Member 'URCSetAssetByPathBehaviour::PropertyInContainer' has a wrong offset!");
static_assert(offsetof(URCSetAssetByPathBehaviour, AssetClass) == 0x000090, "Member 'URCSetAssetByPathBehaviour::AssetClass' has a wrong offset!");
static_assert(offsetof(URCSetAssetByPathBehaviour, PathStruct) == 0x000098, "Member 'URCSetAssetByPathBehaviour::PathStruct' has a wrong offset!");
static_assert(offsetof(URCSetAssetByPathBehaviour, bInternal) == 0x0000A8, "Member 'URCSetAssetByPathBehaviour::bInternal' has a wrong offset!");
static_assert(offsetof(URCSetAssetByPathBehaviour, TargetEntityId) == 0x0000AC, "Member 'URCSetAssetByPathBehaviour::TargetEntityId' has a wrong offset!");

// Class RemoteControlLogic.RemoteControlLogicConfig
// 0x0020 (0x0048 - 0x0028)
class URemoteControlLogicConfig final : public UObject
{
public:
	TArray<EPropertyBagPropertyType>              SupportedControllerTypes;                          // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           SupportedControllerStructTypes;                    // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RemoteControlLogicConfig">();
	}
	static class URemoteControlLogicConfig* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URemoteControlLogicConfig>();
	}
};
static_assert(alignof(URemoteControlLogicConfig) == 0x000008, "Wrong alignment on URemoteControlLogicConfig");
static_assert(sizeof(URemoteControlLogicConfig) == 0x000048, "Wrong size on URemoteControlLogicConfig");
static_assert(offsetof(URemoteControlLogicConfig, SupportedControllerTypes) == 0x000028, "Member 'URemoteControlLogicConfig::SupportedControllerTypes' has a wrong offset!");
static_assert(offsetof(URemoteControlLogicConfig, SupportedControllerStructTypes) == 0x000038, "Member 'URemoteControlLogicConfig::SupportedControllerStructTypes' has a wrong offset!");

// Class RemoteControlLogic.RemoteControlLogicTestData
// 0x0008 (0x0030 - 0x0028)
class URemoteControlLogicTestData final : public UObject
{
public:
	struct FColor                                 Color;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TestInt;                                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void TestIntFunction()	 // 0x4ddaac4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RemoteControlLogicTestData">();
	}
	static class URemoteControlLogicTestData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URemoteControlLogicTestData>();
	}
};
static_assert(alignof(URemoteControlLogicTestData) == 0x000008, "Wrong alignment on URemoteControlLogicTestData");
static_assert(sizeof(URemoteControlLogicTestData) == 0x000030, "Wrong size on URemoteControlLogicTestData");
static_assert(offsetof(URemoteControlLogicTestData, Color) == 0x000028, "Member 'URemoteControlLogicTestData::Color' has a wrong offset!");
static_assert(offsetof(URemoteControlLogicTestData, TestInt) == 0x00002C, "Member 'URemoteControlLogicTestData::TestInt' has a wrong offset!");

}

