#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RemoteControlCommon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RemoteControlCommon_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class RemoteControlCommon.RCPropertyContainerBase
// 0x0028 (0x0050 - 0x0028)
class URCPropertyContainerBase final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCPropertyContainerBase">();
	}
	static class URCPropertyContainerBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCPropertyContainerBase>();
	}
};
static_assert(alignof(URCPropertyContainerBase) == 0x000008, "Wrong alignment on URCPropertyContainerBase");
static_assert(sizeof(URCPropertyContainerBase) == 0x000050, "Wrong size on URCPropertyContainerBase");

// Class RemoteControlCommon.RCPropertyContainerRegistry
// 0x0050 (0x0080 - 0x0030)
class URCPropertyContainerRegistry final : public UEngineSubsystem
{
public:
	TMap<struct FRCPropertyContainerKey, TSubclassOf<class URCPropertyContainerBase>> CachedContainerClasses; // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RCPropertyContainerRegistry">();
	}
	static class URCPropertyContainerRegistry* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URCPropertyContainerRegistry>();
	}
};
static_assert(alignof(URCPropertyContainerRegistry) == 0x000008, "Wrong alignment on URCPropertyContainerRegistry");
static_assert(sizeof(URCPropertyContainerRegistry) == 0x000080, "Wrong size on URCPropertyContainerRegistry");
static_assert(offsetof(URCPropertyContainerRegistry, CachedContainerClasses) == 0x000030, "Member 'URCPropertyContainerRegistry::CachedContainerClasses' has a wrong offset!");

// Class RemoteControlCommon.PropertyContainerTestObject
// 0x0090 (0x00B8 - 0x0028)
class UPropertyContainerTestObject final : public UObject
{
public:
	bool                                          bSomeBool;                                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SomeUInt32;                                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeFloat;                                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SomeVector;                                        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               SomeRotator;                                       // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SomeClampedInt;                                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SomeClampedInt2;                                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SomeUIClampedInt;                                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeClampedFloat;                                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeUIClampedFloat;                                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SomeClampedFloat2;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SomeString;                                        // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SomeText;                                          // 0x0090(0x0018)(NativeAccessSpecifierPublic)
	TArray<float>                                 SomeFloatArray;                                    // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PropertyContainerTestObject">();
	}
	static class UPropertyContainerTestObject* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPropertyContainerTestObject>();
	}
};
static_assert(alignof(UPropertyContainerTestObject) == 0x000008, "Wrong alignment on UPropertyContainerTestObject");
static_assert(sizeof(UPropertyContainerTestObject) == 0x0000B8, "Wrong size on UPropertyContainerTestObject");
static_assert(offsetof(UPropertyContainerTestObject, bSomeBool) == 0x000028, "Member 'UPropertyContainerTestObject::bSomeBool' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeUInt32) == 0x00002C, "Member 'UPropertyContainerTestObject::SomeUInt32' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeFloat) == 0x000030, "Member 'UPropertyContainerTestObject::SomeFloat' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeVector) == 0x000038, "Member 'UPropertyContainerTestObject::SomeVector' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeRotator) == 0x000050, "Member 'UPropertyContainerTestObject::SomeRotator' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeClampedInt) == 0x000068, "Member 'UPropertyContainerTestObject::SomeClampedInt' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeClampedInt2) == 0x00006C, "Member 'UPropertyContainerTestObject::SomeClampedInt2' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeUIClampedInt) == 0x000070, "Member 'UPropertyContainerTestObject::SomeUIClampedInt' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeClampedFloat) == 0x000074, "Member 'UPropertyContainerTestObject::SomeClampedFloat' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeUIClampedFloat) == 0x000078, "Member 'UPropertyContainerTestObject::SomeUIClampedFloat' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeClampedFloat2) == 0x00007C, "Member 'UPropertyContainerTestObject::SomeClampedFloat2' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeString) == 0x000080, "Member 'UPropertyContainerTestObject::SomeString' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeText) == 0x000090, "Member 'UPropertyContainerTestObject::SomeText' has a wrong offset!");
static_assert(offsetof(UPropertyContainerTestObject, SomeFloatArray) == 0x0000A8, "Member 'UPropertyContainerTestObject::SomeFloatArray' has a wrong offset!");

// Class RemoteControlCommon.RemoteControlSettings
// 0x00D0 (0x0108 - 0x0038)
class URemoteControlSettings final : public UDeveloperSettings
{
public:
	bool                                          bProtocolsGenerateTransactions;                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RemoteControlWebInterfaceBindAddress;              // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RemoteControlWebInterfacePort;                     // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceWebAppBuildAtStartup;                        // 0x0054(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWebAppLogRequestDuration;                         // 0x0055(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStartWebServer;                               // 0x0056(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoStartWebSocketServer;                         // 0x0057(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RemoteControlHttpServerPort;                       // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RemoteControlWebsocketServerBindAddress;           // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RemoteControlWebSocketServerPort;                  // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayInEditorOnlyWarnings;                      // 0x0074(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TreeBindingSplitRatio;                             // 0x0078(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRebindingContext;                              // 0x007C(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreProtectedCheck;                             // 0x007D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreGetterSetterCheck;                          // 0x007E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreWarnings;                                   // 0x007F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestrictServerAccess;                             // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRemotePythonExecution;                      // 0x0081(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FRCNetworkAddressRange>           AllowlistedClients;                                // 0x0088(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 AllowedOrigin;                                     // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforcePassphraseForRemoteClients;                // 0x00E8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRCPassphrase>                  Passphrases;                                       // 0x00F0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bShowPassphraseDisabledWarning;                    // 0x0100(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSecuritySettingsReviewed;                         // 0x0101(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RemoteControlSettings">();
	}
	static class URemoteControlSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URemoteControlSettings>();
	}
};
static_assert(alignof(URemoteControlSettings) == 0x000008, "Wrong alignment on URemoteControlSettings");
static_assert(sizeof(URemoteControlSettings) == 0x000108, "Wrong size on URemoteControlSettings");
static_assert(offsetof(URemoteControlSettings, bProtocolsGenerateTransactions) == 0x000038, "Member 'URemoteControlSettings::bProtocolsGenerateTransactions' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, RemoteControlWebInterfaceBindAddress) == 0x000040, "Member 'URemoteControlSettings::RemoteControlWebInterfaceBindAddress' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, RemoteControlWebInterfacePort) == 0x000050, "Member 'URemoteControlSettings::RemoteControlWebInterfacePort' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bForceWebAppBuildAtStartup) == 0x000054, "Member 'URemoteControlSettings::bForceWebAppBuildAtStartup' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bWebAppLogRequestDuration) == 0x000055, "Member 'URemoteControlSettings::bWebAppLogRequestDuration' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bAutoStartWebServer) == 0x000056, "Member 'URemoteControlSettings::bAutoStartWebServer' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bAutoStartWebSocketServer) == 0x000057, "Member 'URemoteControlSettings::bAutoStartWebSocketServer' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, RemoteControlHttpServerPort) == 0x000058, "Member 'URemoteControlSettings::RemoteControlHttpServerPort' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, RemoteControlWebsocketServerBindAddress) == 0x000060, "Member 'URemoteControlSettings::RemoteControlWebsocketServerBindAddress' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, RemoteControlWebSocketServerPort) == 0x000070, "Member 'URemoteControlSettings::RemoteControlWebSocketServerPort' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bDisplayInEditorOnlyWarnings) == 0x000074, "Member 'URemoteControlSettings::bDisplayInEditorOnlyWarnings' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, TreeBindingSplitRatio) == 0x000078, "Member 'URemoteControlSettings::TreeBindingSplitRatio' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bUseRebindingContext) == 0x00007C, "Member 'URemoteControlSettings::bUseRebindingContext' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bIgnoreProtectedCheck) == 0x00007D, "Member 'URemoteControlSettings::bIgnoreProtectedCheck' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bIgnoreGetterSetterCheck) == 0x00007E, "Member 'URemoteControlSettings::bIgnoreGetterSetterCheck' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bIgnoreWarnings) == 0x00007F, "Member 'URemoteControlSettings::bIgnoreWarnings' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bRestrictServerAccess) == 0x000080, "Member 'URemoteControlSettings::bRestrictServerAccess' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bEnableRemotePythonExecution) == 0x000081, "Member 'URemoteControlSettings::bEnableRemotePythonExecution' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, AllowlistedClients) == 0x000088, "Member 'URemoteControlSettings::AllowlistedClients' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, AllowedOrigin) == 0x0000D8, "Member 'URemoteControlSettings::AllowedOrigin' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bEnforcePassphraseForRemoteClients) == 0x0000E8, "Member 'URemoteControlSettings::bEnforcePassphraseForRemoteClients' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, Passphrases) == 0x0000F0, "Member 'URemoteControlSettings::Passphrases' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bShowPassphraseDisabledWarning) == 0x000100, "Member 'URemoteControlSettings::bShowPassphraseDisabledWarning' has a wrong offset!");
static_assert(offsetof(URemoteControlSettings, bSecuritySettingsReviewed) == 0x000101, "Member 'URemoteControlSettings::bSecuritySettingsReviewed' has a wrong offset!");

}

