#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Renderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Renderer.RuntimeImposter
// 0x00A0 (0x00C8 - 0x0028)
class URuntimeImposter final : public UObject
{
public:
	struct FSoftObjectPath                        HorizontalImposterMaterial;                        // 0x0028(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HorizontalImposterMaterialSSS;                     // 0x0048(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HorizontalImposterMaterialColorVariation;          // 0x0068(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HemisphereOctahedralImposterMaterial;              // 0x0088(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SphereOctahedralImposterMaterial;                  // 0x00A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RuntimeImposter">();
	}
	static class URuntimeImposter* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URuntimeImposter>();
	}
};
static_assert(alignof(URuntimeImposter) == 0x000008, "Wrong alignment on URuntimeImposter");
static_assert(sizeof(URuntimeImposter) == 0x0000C8, "Wrong size on URuntimeImposter");
static_assert(offsetof(URuntimeImposter, HorizontalImposterMaterial) == 0x000028, "Member 'URuntimeImposter::HorizontalImposterMaterial' has a wrong offset!");
static_assert(offsetof(URuntimeImposter, HorizontalImposterMaterialSSS) == 0x000048, "Member 'URuntimeImposter::HorizontalImposterMaterialSSS' has a wrong offset!");
static_assert(offsetof(URuntimeImposter, HorizontalImposterMaterialColorVariation) == 0x000068, "Member 'URuntimeImposter::HorizontalImposterMaterialColorVariation' has a wrong offset!");
static_assert(offsetof(URuntimeImposter, HemisphereOctahedralImposterMaterial) == 0x000088, "Member 'URuntimeImposter::HemisphereOctahedralImposterMaterial' has a wrong offset!");
static_assert(offsetof(URuntimeImposter, SphereOctahedralImposterMaterial) == 0x0000A8, "Member 'URuntimeImposter::SphereOctahedralImposterMaterial' has a wrong offset!");

// Class Renderer.P2AnomalyWithFogData
// 0x01C0 (0x01F0 - 0x0030)
class UP2AnomalyWithFogData final : public UDataAsset
{
public:
	class UCurveFloat*                            HeightOpacity;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DistanceOpacity;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EarlyGameDistanceFadeScale;                        // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EarlyGameDistanceFadeEnd;                          // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogGradient;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            FogDepthAtDistance;                                // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogModulationNearLandscape;                        // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogPhaseCurveGreenColor;                           // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogPhaseCurveGreen;                                // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              FogPhaseCurveYellowColor;                          // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogPhaseCurveYellow;                               // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              FogPhaseCurveRedColor;                             // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogPhaseCurveRed;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              FogPhaseCurveBlackColor;                           // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogPhaseCurveBlack;                                // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               FogVariationOffsetTexture;                         // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               FogVariationNoiseTexture;                          // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              FogVariationOffset1_Tiling;                        // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationOffset1_Movement;                      // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationOffset2_Tiling;                        // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationOffset2_Movement;                      // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise1_Tiling;                         // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise1_Movement;                       // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise2_Tiling;                         // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise2_Movement;                       // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise_Offsets;                         // 0x0170(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise_HSVLow;                          // 0x0180(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise_HSVHigh;                         // 0x0190(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise_HSVLowMoving;                    // 0x01A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4f                              FogVariationNoise_HSVHighMoving;                   // 0x01B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2f                              BlurRadius;                                        // 0x01C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlurRefraction;                                    // 0x01C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlurDepthFade;                                     // 0x01CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlurDepthFadePow;                                  // 0x01D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BlurMip;                                           // 0x01D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlurMipFade;                                       // 0x01D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlurMipScaleHalf;                                  // 0x01DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlurMipScaleQuarter;                               // 0x01E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0xC];                                      // 0x01E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AnomalyWithFogData">();
	}
	static class UP2AnomalyWithFogData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AnomalyWithFogData>();
	}
};
static_assert(alignof(UP2AnomalyWithFogData) == 0x000010, "Wrong alignment on UP2AnomalyWithFogData");
static_assert(sizeof(UP2AnomalyWithFogData) == 0x0001F0, "Wrong size on UP2AnomalyWithFogData");
static_assert(offsetof(UP2AnomalyWithFogData, HeightOpacity) == 0x000030, "Member 'UP2AnomalyWithFogData::HeightOpacity' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, DistanceOpacity) == 0x000038, "Member 'UP2AnomalyWithFogData::DistanceOpacity' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, EarlyGameDistanceFadeScale) == 0x000040, "Member 'UP2AnomalyWithFogData::EarlyGameDistanceFadeScale' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, EarlyGameDistanceFadeEnd) == 0x000044, "Member 'UP2AnomalyWithFogData::EarlyGameDistanceFadeEnd' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogGradient) == 0x000048, "Member 'UP2AnomalyWithFogData::FogGradient' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogDepthAtDistance) == 0x000050, "Member 'UP2AnomalyWithFogData::FogDepthAtDistance' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogModulationNearLandscape) == 0x000058, "Member 'UP2AnomalyWithFogData::FogModulationNearLandscape' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveGreenColor) == 0x000060, "Member 'UP2AnomalyWithFogData::FogPhaseCurveGreenColor' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveGreen) == 0x000070, "Member 'UP2AnomalyWithFogData::FogPhaseCurveGreen' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveYellowColor) == 0x000080, "Member 'UP2AnomalyWithFogData::FogPhaseCurveYellowColor' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveYellow) == 0x000090, "Member 'UP2AnomalyWithFogData::FogPhaseCurveYellow' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveRedColor) == 0x0000A0, "Member 'UP2AnomalyWithFogData::FogPhaseCurveRedColor' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveRed) == 0x0000B0, "Member 'UP2AnomalyWithFogData::FogPhaseCurveRed' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveBlackColor) == 0x0000C0, "Member 'UP2AnomalyWithFogData::FogPhaseCurveBlackColor' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogPhaseCurveBlack) == 0x0000D0, "Member 'UP2AnomalyWithFogData::FogPhaseCurveBlack' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationOffsetTexture) == 0x0000D8, "Member 'UP2AnomalyWithFogData::FogVariationOffsetTexture' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoiseTexture) == 0x0000E0, "Member 'UP2AnomalyWithFogData::FogVariationNoiseTexture' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationOffset1_Tiling) == 0x0000F0, "Member 'UP2AnomalyWithFogData::FogVariationOffset1_Tiling' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationOffset1_Movement) == 0x000100, "Member 'UP2AnomalyWithFogData::FogVariationOffset1_Movement' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationOffset2_Tiling) == 0x000110, "Member 'UP2AnomalyWithFogData::FogVariationOffset2_Tiling' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationOffset2_Movement) == 0x000120, "Member 'UP2AnomalyWithFogData::FogVariationOffset2_Movement' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise1_Tiling) == 0x000130, "Member 'UP2AnomalyWithFogData::FogVariationNoise1_Tiling' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise1_Movement) == 0x000140, "Member 'UP2AnomalyWithFogData::FogVariationNoise1_Movement' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise2_Tiling) == 0x000150, "Member 'UP2AnomalyWithFogData::FogVariationNoise2_Tiling' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise2_Movement) == 0x000160, "Member 'UP2AnomalyWithFogData::FogVariationNoise2_Movement' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise_Offsets) == 0x000170, "Member 'UP2AnomalyWithFogData::FogVariationNoise_Offsets' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise_HSVLow) == 0x000180, "Member 'UP2AnomalyWithFogData::FogVariationNoise_HSVLow' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise_HSVHigh) == 0x000190, "Member 'UP2AnomalyWithFogData::FogVariationNoise_HSVHigh' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise_HSVLowMoving) == 0x0001A0, "Member 'UP2AnomalyWithFogData::FogVariationNoise_HSVLowMoving' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, FogVariationNoise_HSVHighMoving) == 0x0001B0, "Member 'UP2AnomalyWithFogData::FogVariationNoise_HSVHighMoving' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurRadius) == 0x0001C0, "Member 'UP2AnomalyWithFogData::BlurRadius' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurRefraction) == 0x0001C8, "Member 'UP2AnomalyWithFogData::BlurRefraction' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurDepthFade) == 0x0001CC, "Member 'UP2AnomalyWithFogData::BlurDepthFade' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurDepthFadePow) == 0x0001D0, "Member 'UP2AnomalyWithFogData::BlurDepthFadePow' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurMip) == 0x0001D4, "Member 'UP2AnomalyWithFogData::BlurMip' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurMipFade) == 0x0001D8, "Member 'UP2AnomalyWithFogData::BlurMipFade' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurMipScaleHalf) == 0x0001DC, "Member 'UP2AnomalyWithFogData::BlurMipScaleHalf' has a wrong offset!");
static_assert(offsetof(UP2AnomalyWithFogData, BlurMipScaleQuarter) == 0x0001E0, "Member 'UP2AnomalyWithFogData::BlurMipScaleQuarter' has a wrong offset!");

// Class Renderer.P2RenderSubsystem
// 0x05D0 (0x0610 - 0x0040)
class alignas(0x10) UP2RenderSubsystem final : public UTickableWorldSubsystem
{
public:
	class UTextureRenderTarget2D*                 WaterInfoTextureDepth;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 WaterInfoTextureColor;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x240];                                     // 0x0050(0x0240)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CopyViewportTarget;                                // 0x0290(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTexture*>                       VolumetricNoiseTextureAssets;                      // 0x0298(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0xD8];                                     // 0x02A8(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               FogVariationOffsetTexture;                         // 0x0380(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               FogVariationNoiseTexture;                          // 0x0388(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x280];                                    // 0x0390(0x0280)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIndoorCoverageScreenCenterWeight(int32 Weight)	 // 0x160b8e4;
	void SetNamedValue(class FName Name_0, float Value)	 // 0x1174328;
	void UpdateZone(float Zone)	 // 0x1606f58;

	float GetIndoorCoverage() const	 // 0x164639c;
	float GetNamedValue(class FName Name_0, float DefaultValue) const	 // 0x5cbad18;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2RenderSubsystem">();
	}
	static class UP2RenderSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2RenderSubsystem>();
	}
};
static_assert(alignof(UP2RenderSubsystem) == 0x000010, "Wrong alignment on UP2RenderSubsystem");
static_assert(sizeof(UP2RenderSubsystem) == 0x000610, "Wrong size on UP2RenderSubsystem");
static_assert(offsetof(UP2RenderSubsystem, WaterInfoTextureDepth) == 0x000040, "Member 'UP2RenderSubsystem::WaterInfoTextureDepth' has a wrong offset!");
static_assert(offsetof(UP2RenderSubsystem, WaterInfoTextureColor) == 0x000048, "Member 'UP2RenderSubsystem::WaterInfoTextureColor' has a wrong offset!");
static_assert(offsetof(UP2RenderSubsystem, CopyViewportTarget) == 0x000290, "Member 'UP2RenderSubsystem::CopyViewportTarget' has a wrong offset!");
static_assert(offsetof(UP2RenderSubsystem, VolumetricNoiseTextureAssets) == 0x000298, "Member 'UP2RenderSubsystem::VolumetricNoiseTextureAssets' has a wrong offset!");
static_assert(offsetof(UP2RenderSubsystem, FogVariationOffsetTexture) == 0x000380, "Member 'UP2RenderSubsystem::FogVariationOffsetTexture' has a wrong offset!");
static_assert(offsetof(UP2RenderSubsystem, FogVariationNoiseTexture) == 0x000388, "Member 'UP2RenderSubsystem::FogVariationNoiseTexture' has a wrong offset!");

// Class Renderer.SparseVolumeTextureViewerComponent
// 0x0020 (0x05D0 - 0x05B0)
class USparseVolumeTextureViewerComponent final : public UPrimitiveComponent
{
public:
	class USparseVolumeTexture*                   SparseVolumeTexturePreview;                        // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAnimate : 1;                                      // 0x05B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimationFrame;                                    // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameRate;                                         // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationTime;                                     // 0x05BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentToVisualize;                              // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C4[0xC];                                      // 0x05C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SparseVolumeTextureViewerComponent">();
	}
	static class USparseVolumeTextureViewerComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USparseVolumeTextureViewerComponent>();
	}
};
static_assert(alignof(USparseVolumeTextureViewerComponent) == 0x000010, "Wrong alignment on USparseVolumeTextureViewerComponent");
static_assert(sizeof(USparseVolumeTextureViewerComponent) == 0x0005D0, "Wrong size on USparseVolumeTextureViewerComponent");
static_assert(offsetof(USparseVolumeTextureViewerComponent, SparseVolumeTexturePreview) == 0x0005A8, "Member 'USparseVolumeTextureViewerComponent::SparseVolumeTexturePreview' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, AnimationFrame) == 0x0005B4, "Member 'USparseVolumeTextureViewerComponent::AnimationFrame' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, FrameRate) == 0x0005B8, "Member 'USparseVolumeTextureViewerComponent::FrameRate' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, AnimationTime) == 0x0005BC, "Member 'USparseVolumeTextureViewerComponent::AnimationTime' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, ComponentToVisualize) == 0x0005C0, "Member 'USparseVolumeTextureViewerComponent::ComponentToVisualize' has a wrong offset!");

// Class Renderer.SparseVolumeTextureViewer
// 0x0008 (0x02B8 - 0x02B0)
class ASparseVolumeTextureViewer final : public AInfo
{
public:
	class USparseVolumeTextureViewerComponent*    SparseVolumeTextureViewerComponent;                // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SparseVolumeTextureViewer">();
	}
	static class ASparseVolumeTextureViewer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ASparseVolumeTextureViewer>();
	}
};
static_assert(alignof(ASparseVolumeTextureViewer) == 0x000008, "Wrong alignment on ASparseVolumeTextureViewer");
static_assert(sizeof(ASparseVolumeTextureViewer) == 0x0002B8, "Wrong size on ASparseVolumeTextureViewer");
static_assert(offsetof(ASparseVolumeTextureViewer, SparseVolumeTextureViewerComponent) == 0x0002B0, "Member 'ASparseVolumeTextureViewer::SparseVolumeTextureViewerComponent' has a wrong offset!");

}

