#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RIG_Spectre

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass RIG_Spectre.RIG_Spectre_C
// 0x0020 (0x0418 - 0x03F8)
class URIG_Spectre_C final : public UControlRig
{
public:
	TArray<struct FRigElementKey>                 FK_Spine_CTRLS;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigElementKey                         SpawnControl_1_1_Parent;                           // 0x0408(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"RIG_Spectre_C">();
	}
	static class URIG_Spectre_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URIG_Spectre_C>();
	}
};
static_assert(alignof(URIG_Spectre_C) == 0x000008, "Wrong alignment on URIG_Spectre_C");
static_assert(sizeof(URIG_Spectre_C) == 0x000418, "Wrong size on URIG_Spectre_C");
static_assert(offsetof(URIG_Spectre_C, FK_Spine_CTRLS) == 0x0003F8, "Member 'URIG_Spectre_C::FK_Spine_CTRLS' has a wrong offset!");
static_assert(offsetof(URIG_Spectre_C, SpawnControl_1_1_Parent) == 0x000408, "Member 'URIG_Spectre_C::SpawnControl_1_1_Parent' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass RIG_Spectre.RigVMMemory_Literal
// 0x0B98 (0x0BC0 - 0x0028)
class RIG_Spectre::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_3_Item__Const;          // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_3_Space__Const;         // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_3_bInitial__Const;      // 0x0035(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_3_Value__Const;         // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_GetTransform_7_bInitial__Const; // 0x00A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_5_Item__Const;           // 0x00A4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Strength__Const;         // 0x00B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_CriticalDamping__Const;  // 0x00B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_Force__Const;            // 0x00B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_TargetVelocityAmount__Const; // 0x00D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x00D4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const; // 0x00E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const; // 0x00EC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const; // 0x00F8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const; // 0x0108(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const; // 0x0120(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Make_Absolute_1_Local__Const;         // 0x0140(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Mode__Const; // 0x01A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Color__Const; // 0x01A4(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Thickness__Const; // 0x01B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorKind__Const; // 0x01B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorSpace__Const; // 0x01BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_1_StretchStartRatio__Const; // 0x01C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_1_StretchMaximumRatio__Const; // 0x01CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemALength__Const; // 0x01D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0xC];                                      // 0x01D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_1_DebugSettings__Const; // 0x01E0(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_1_Item__Const;        // 0x0250(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_Item__Const;         // 0x025C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x0268(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0xC];                                      // 0x0274(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_Value__Const;  // 0x0280(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;  // 0x02E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const;  // 0x02EC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_EffectorItem__Const; // 0x02F8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const; // 0x0308(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___Make_Absolute_Local__Const;           // 0x0320(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_Mode__Const; // 0x0380(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x0381(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0384(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_1_Space__Const;         // 0x0390(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_1_3_Item__Const;         // 0x0394(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_2_1_1_RotationOrder__Const; // 0x03A0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___RigVMFunction_VerletIntegrateVector_1_Strength__Const; // 0x03A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_VerletIntegrateVector_1_Damp__Const; // 0x03A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_VerletIntegrateVector_1_Blend__Const; // 0x03AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_Weight__Const;        // 0x03B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_Item__Const;        // 0x03B4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_Item__Const;         // 0x03C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpQuaternionV2_2_Strength__Const; // 0x03CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___SpringInterpQuaternionV2_2_Current__Const; // 0x03D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_Item__Const;      // 0x03F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_2_Item__Const;         // 0x03FC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_2_Item__Const;        // 0x0408(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_2_Weight__Const;      // 0x0414(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_2_Item__Const;      // 0x0418(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_Item__Const;    // 0x0424(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_3_Item__Const;        // 0x0430(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     RigVMModel___RigVMFunction_AnimEvalRichCurve_Curve__Const; // 0x0440(0x0088)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMinimum__Const; // 0x04C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMaximum__Const; // 0x04CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_InRange__Const;           // 0x04D0(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___SpringInterpQuaternionV2_CriticalDamping__Const; // 0x04D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_1_3_Weight__Const;      // 0x04DC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_3_Item__Const;      // 0x04E0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_Item__Const;       // 0x04EC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpQuaternionV2_1_1_Strength__Const; // 0x04F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_2_Item__Const;    // 0x04FC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_2_1_Item__Const;       // 0x0508(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterpQuaternionV2_1_Strength__Const; // 0x0514(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_2_1_Item__Const;      // 0x0518(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_AnimEvalRichCurve_1_Value__Const; // 0x0524(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_2_1_Item__Const;    // 0x0528(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_Item__Const;  // 0x0534(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_2_1_1_Item__Const;    // 0x0540(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_2_1_1_Item__Const;  // 0x054C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_1_1_1_1_Item__Const; // 0x0558(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0xC];                                      // 0x0564(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_Value__Const;    // 0x0570(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_Parent__Const;           // 0x05D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_Name__Const;             // 0x05DC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathTransformFromSRT_Rotation__Const; // 0x05E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathTransformFromSRT_RotationOrder__Const; // 0x0600(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathTransformFromSRT_Scale__Const; // 0x0608(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_Settings__Const; // 0x0620(0x00C0)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathTransformFromSRT_1_Rotation__Const; // 0x06E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathTransformFromSRT_1_RotationOrder__Const; // 0x06F8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathTransformFromSRT_1_Scale__Const; // 0x0700(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_1_Name__Const;           // 0x0718(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathTransformFromSRT_2_RotationOrder__Const; // 0x0720(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathTransformFromSRT_2_Scale__Const; // 0x0728(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathTransformFromSRT_1_1_RotationOrder__Const; // 0x0740(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigElementKey>                 RigVMModel___RigUnit_ItemArray_Items__Const;       // 0x0748(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigElementKey>                 LocalVariableDefault__ContructFKControls_ThoseControls__Const; // 0x0758(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         LocalVariableDefault__ContructFKControls_ThisParent__Const; // 0x0768(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LocalVariableDefault__ContructFKControls_Entry_size__Const; // 0x0778(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContructFKControls_1_1___ContructFKControls_Replace_Old__Const; // 0x0780(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ContructFKControls_1_1___ContructFKControls_Replace_New__Const; // 0x0788(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ContructFKControls_1_1___ContructFKControls_SpawnControl_OffsetTransform__Const; // 0x0790(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings ContructFKControls_1_1___ContructFKControls_SpawnControl_Settings__Const; // 0x07F0(0x00C0)(Edit, EditConst, NonTransactional)
	struct FVector                                ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x08B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x08C8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Space__Const; // 0x08C9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_bInitial__Const; // 0x08CA(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CB[0x1];                                      // 0x08CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Weight__Const; // 0x08CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SpawnControl_1_1_Parent__Const;       // 0x08D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_1_1_Name__Const;         // 0x08DC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0xC];                                      // 0x08E4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___SpawnControl_1_1_OffsetTransform__Const; // 0x08F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_HierarchyAddControlTransform_Settings RigVMModel___SpawnControl_1_1_Settings__Const; // 0x0950(0x00C0)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___GetTransform_1_5_1_Item__Const;       // 0x0A10(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1C[0x4];                                      // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___MathTransformMul_1_1_B__Const;        // 0x0A20(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___HierarchyAddNull_1_Parent__Const;     // 0x0A80(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___HierarchyAddNull_1_Name__Const;       // 0x0A8C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_1_1_Name__Const;       // 0x0A94(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9C[0x4];                                      // 0x0A9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_HierarchyAddControlVector_Settings RigVMModel___SpawnControl_2_1_1_Settings__Const; // 0x0AA0(0x0110)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___HierarchyAddNull_1_1_Name__Const;     // 0x0BB0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SpawnControl_2_1_1_1_Name__Const;     // 0x0BB8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass RIG_Spectre.RigVMMemory_Literal", true>();
	}
	static class RIG_Spectre::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<RIG_Spectre::URigVMMemory_Literal>();
	}
};
static_assert(alignof(RIG_Spectre::URigVMMemory_Literal) == 0x000010, "Wrong alignment on RIG_Spectre::URigVMMemory_Literal");
static_assert(sizeof(RIG_Spectre::URigVMMemory_Literal) == 0x000BC0, "Wrong size on RIG_Spectre::URigVMMemory_Literal");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_3_Item__Const) == 0x000028, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_3_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_3_Space__Const) == 0x000034, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_3_Space__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_3_bInitial__Const) == 0x000035, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_3_bInitial__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_3_Value__Const) == 0x000040, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_3_Value__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_7_bInitial__Const) == 0x0000A0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_7_bInitial__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_5_Item__Const) == 0x0000A4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_5_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterp_Strength__Const) == 0x0000B0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterp_Strength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterp_CriticalDamping__Const) == 0x0000B4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterp_CriticalDamping__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterp_Force__Const) == 0x0000B8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterp_Force__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterp_TargetVelocityAmount__Const) == 0x0000D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterp_TargetVelocityAmount__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_Item__Const) == 0x0000D4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const) == 0x0000E0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const) == 0x0000EC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const) == 0x0000F8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const) == 0x000108, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const) == 0x000120, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Make_Absolute_1_Local__Const) == 0x000140, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Make_Absolute_1_Local__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Mode__Const) == 0x0001A0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Mode__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Color__Const) == 0x0001A4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Color__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Thickness__Const) == 0x0001B4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_1_Thickness__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorKind__Const) == 0x0001B8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorSpace__Const) == 0x0001BC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_PoleVectorSpace__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_StretchStartRatio__Const) == 0x0001C8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_StretchStartRatio__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_StretchMaximumRatio__Const) == 0x0001CC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_StretchMaximumRatio__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_ItemALength__Const) == 0x0001D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_ItemALength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_1_DebugSettings__Const) == 0x0001E0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_1_DebugSettings__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_3_1_Item__Const) == 0x000250, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_3_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_5_1_Item__Const) == 0x00025C, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Item__Const) == 0x000268, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Value__Const) == 0x000280, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Value__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const) == 0x0002E0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const) == 0x0002EC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_EffectorItem__Const) == 0x0002F8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_EffectorItem__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const) == 0x000308, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Make_Absolute_Local__Const) == 0x000320, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Make_Absolute_Local__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_Mode__Const) == 0x000380, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VisualDebugVectorNoSpace_Mode__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const) == 0x000381, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_Item__Const) == 0x000384, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_Space__Const) == 0x000390, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_Space__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_3_Item__Const) == 0x000394, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathQuaternionToEuler_2_1_1_RotationOrder__Const) == 0x0003A0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathQuaternionToEuler_2_1_1_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VerletIntegrateVector_1_Strength__Const) == 0x0003A4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VerletIntegrateVector_1_Strength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VerletIntegrateVector_1_Damp__Const) == 0x0003A8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VerletIntegrateVector_1_Damp__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_VerletIntegrateVector_1_Blend__Const) == 0x0003AC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_VerletIntegrateVector_1_Blend__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_Weight__Const) == 0x0003B0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_Weight__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_Item__Const) == 0x0003B4, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_Item__Const) == 0x0003C0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterpQuaternionV2_2_Strength__Const) == 0x0003CC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterpQuaternionV2_2_Strength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterpQuaternionV2_2_Current__Const) == 0x0003D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterpQuaternionV2_2_Current__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_1_Item__Const) == 0x0003F0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_2_Item__Const) == 0x0003FC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_2_Item__Const) == 0x000408, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_2_Weight__Const) == 0x000414, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_2_Weight__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_2_Item__Const) == 0x000418, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_1_1_Item__Const) == 0x000424, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_3_Item__Const) == 0x000430, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_AnimEvalRichCurve_Curve__Const) == 0x000440, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_AnimEvalRichCurve_Curve__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMinimum__Const) == 0x0004C8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMinimum__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMaximum__Const) == 0x0004CC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_AnimEvalRichCurve_TargetMaximum__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___AlphaInterp_InRange__Const) == 0x0004D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___AlphaInterp_InRange__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterpQuaternionV2_CriticalDamping__Const) == 0x0004D8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterpQuaternionV2_CriticalDamping__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_3_Weight__Const) == 0x0004DC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_3_Weight__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_3_Item__Const) == 0x0004E0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_3_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_Item__Const) == 0x0004EC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterpQuaternionV2_1_1_Strength__Const) == 0x0004F8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterpQuaternionV2_1_1_Strength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_1_2_Item__Const) == 0x0004FC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_2_1_Item__Const) == 0x000508, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpringInterpQuaternionV2_1_Strength__Const) == 0x000514, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpringInterpQuaternionV2_1_Strength__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_2_1_Item__Const) == 0x000518, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_AnimEvalRichCurve_1_Value__Const) == 0x000524, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_AnimEvalRichCurve_1_Value__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_2_1_Item__Const) == 0x000528, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_1_1_1_Item__Const) == 0x000534, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_2_1_1_Item__Const) == 0x000540, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_2_1_1_Item__Const) == 0x00054C, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___Set_Transform_1_1_1_1_1_1_Item__Const) == 0x000558, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___Set_Transform_1_1_1_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_Value__Const) == 0x000570, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_Value__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_Parent__Const) == 0x0005D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_Parent__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_Name__Const) == 0x0005DC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_Rotation__Const) == 0x0005E8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_Rotation__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_RotationOrder__Const) == 0x000600, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_Scale__Const) == 0x000608, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_Scale__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_Settings__Const) == 0x000620, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_Settings__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_1_Rotation__Const) == 0x0006E0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_1_Rotation__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_1_RotationOrder__Const) == 0x0006F8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_1_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_1_Scale__Const) == 0x000700, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_1_Scale__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_1_Name__Const) == 0x000718, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_1_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_2_RotationOrder__Const) == 0x000720, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_2_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_2_Scale__Const) == 0x000728, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_2_Scale__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathTransformFromSRT_1_1_RotationOrder__Const) == 0x000740, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathTransformFromSRT_1_1_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___RigUnit_ItemArray_Items__Const) == 0x000748, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___RigUnit_ItemArray_Items__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, LocalVariableDefault__ContructFKControls_ThoseControls__Const) == 0x000758, "Member 'RIG_Spectre::URigVMMemory_Literal::LocalVariableDefault__ContructFKControls_ThoseControls__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, LocalVariableDefault__ContructFKControls_ThisParent__Const) == 0x000768, "Member 'RIG_Spectre::URigVMMemory_Literal::LocalVariableDefault__ContructFKControls_ThisParent__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, LocalVariableDefault__ContructFKControls_Entry_size__Const) == 0x000778, "Member 'RIG_Spectre::URigVMMemory_Literal::LocalVariableDefault__ContructFKControls_Entry_size__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_Replace_Old__Const) == 0x000780, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_Replace_Old__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_Replace_New__Const) == 0x000788, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_Replace_New__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_SpawnControl_OffsetTransform__Const) == 0x000790, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_SpawnControl_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_SpawnControl_Settings__Const) == 0x0007F0, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_SpawnControl_Settings__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_Euler__Const) == 0x0008B0, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_Euler__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const) == 0x0008C8, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Space__Const) == 0x0008C9, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Space__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_bInitial__Const) == 0x0008CA, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_bInitial__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Weight__Const) == 0x0008CC, "Member 'RIG_Spectre::URigVMMemory_Literal::ContructFKControls_1_1___ContructFKControls_SetTransformItemArray_Weight__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_Parent__Const) == 0x0008D0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_Parent__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_Name__Const) == 0x0008DC, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_OffsetTransform__Const) == 0x0008F0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_1_1_Settings__Const) == 0x000950, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___GetTransform_1_5_1_Item__Const) == 0x000A10, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___GetTransform_1_5_1_Item__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___MathTransformMul_1_1_B__Const) == 0x000A20, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___MathTransformMul_1_1_B__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___HierarchyAddNull_1_Parent__Const) == 0x000A80, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___HierarchyAddNull_1_Parent__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___HierarchyAddNull_1_Name__Const) == 0x000A8C, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___HierarchyAddNull_1_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_2_1_1_Name__Const) == 0x000A94, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_2_1_1_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_2_1_1_Settings__Const) == 0x000AA0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_2_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___HierarchyAddNull_1_1_Name__Const) == 0x000BB0, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___HierarchyAddNull_1_1_Name__Const' has a wrong offset!");
static_assert(offsetof(RIG_Spectre::URigVMMemory_Literal, RigVMModel___SpawnControl_2_1_1_1_Name__Const) == 0x000BB8, "Member 'RIG_Spectre::URigVMMemory_Literal::RigVMModel___SpawnControl_2_1_1_1_Name__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass RIG_Spectre.RigVMMemory_Work
// 0x18A8 (0x18D0 - 0x0028)
class RIG_Spectre::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_Transform;     // 0x0030(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_CachedIndex;   // 0x0090(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___SpringInterp_Result;                  // 0x00A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_5_Transform;             // 0x00C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_5_CachedIndex;           // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___SpringInterp_Target;                  // 0x0130(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
