#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rig_FakeBody

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass Rig_FakeBody.Rig_FakeBody_C
// 0x0098 (0x0490 - 0x03F8)
class URig_FakeBody_C final : public UControlRig
{
public:
	bool                                          IsCrouching;                                       // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpineOffset;                                       // 0x0400(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PelvisOffset;                                      // 0x0418(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             HeadTM;                                            // 0x0430(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"Rig_FakeBody_C">();
	}
	static class URig_FakeBody_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URig_FakeBody_C>();
	}
};
static_assert(alignof(URig_FakeBody_C) == 0x000010, "Wrong alignment on URig_FakeBody_C");
static_assert(sizeof(URig_FakeBody_C) == 0x000490, "Wrong size on URig_FakeBody_C");
static_assert(offsetof(URig_FakeBody_C, IsCrouching) == 0x0003F8, "Member 'URig_FakeBody_C::IsCrouching' has a wrong offset!");
static_assert(offsetof(URig_FakeBody_C, SpineOffset) == 0x000400, "Member 'URig_FakeBody_C::SpineOffset' has a wrong offset!");
static_assert(offsetof(URig_FakeBody_C, PelvisOffset) == 0x000418, "Member 'URig_FakeBody_C::PelvisOffset' has a wrong offset!");
static_assert(offsetof(URig_FakeBody_C, HeadTM) == 0x000430, "Member 'URig_FakeBody_C::HeadTM' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_FakeBody.RigVMMemory_Literal
// 0x0160 (0x0188 - 0x0028)
class Rig_FakeBody::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FVector                                RigVMModel___If_1_True__Const;                     // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_1_False__Const;                    // 0x0040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Strength__Const;         // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_CriticalDamping__Const;  // 0x005C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_Force__Const;            // 0x0060(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SpringInterp_bUseCurrentInput__Const; // 0x0078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___SpringInterp_TargetVelocityAmount__Const; // 0x007C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SpringInterp_bInitializeFromTarget__Const; // 0x0080(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___If_1_1_True__Const;                   // 0x0088(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_1_1_False__Const;                  // 0x00A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_Root__Const;                   // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__Const;              // 0x00C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x00D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_2_1_1_Space__Const;      // 0x00DC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Subtract_A__Const;                    // 0x00E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_Item__Const;           // 0x00F8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_Item__Const;         // 0x0104(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_1_Item__Const;       // 0x0110(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Scale_Factor__Const;                  // 0x011C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_BoneSettings__Const;           // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_1_ExcludedBones__Const;          // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_Settings__Const;               // 0x0140(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_Debug__Const;                  // 0x017C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_FakeBody.RigVMMemory_Literal", true>();
	}
	static class Rig_FakeBody::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_FakeBody::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Rig_FakeBody::URigVMMemory_Literal) == 0x000008, "Wrong alignment on Rig_FakeBody::URigVMMemory_Literal");
static_assert(sizeof(Rig_FakeBody::URigVMMemory_Literal) == 0x000188, "Wrong size on Rig_FakeBody::URigVMMemory_Literal");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___If_1_True__Const) == 0x000028, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___If_1_True__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___If_1_False__Const) == 0x000040, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___If_1_False__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_Strength__Const) == 0x000058, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_Strength__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_CriticalDamping__Const) == 0x00005C, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_CriticalDamping__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_Force__Const) == 0x000060, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_Force__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_bUseCurrentInput__Const) == 0x000078, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_bUseCurrentInput__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_TargetVelocityAmount__Const) == 0x00007C, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_TargetVelocityAmount__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___SpringInterp_bInitializeFromTarget__Const) == 0x000080, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___SpringInterp_bInitializeFromTarget__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___If_1_1_True__Const) == 0x000088, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___If_1_1_True__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___If_1_1_False__Const) == 0x0000A0, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___If_1_1_False__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_Root__Const) == 0x0000B8, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_Root__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_Effectors__Const) == 0x0000C0, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_1_Item__Const) == 0x0000D0, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_1_Space__Const) == 0x0000DC, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_1_Space__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___Subtract_A__Const) == 0x0000E0, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___Subtract_A__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___GetTransform_1_Item__Const) == 0x0000F8, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_Item__Const) == 0x000104, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_1_Item__Const) == 0x000110, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___Scale_Factor__Const) == 0x00011C, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___Scale_Factor__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_BoneSettings__Const) == 0x000120, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_ExcludedBones__Const) == 0x000130, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_Settings__Const) == 0x000140, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Literal, RigVMModel___PBIK_1_Debug__Const) == 0x00017C, "Member 'Rig_FakeBody::URigVMMemory_Literal::RigVMModel___PBIK_1_Debug__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_FakeBody.RigVMMemory_Work
// 0x0618 (0x0640 - 0x0028)
class Rig_FakeBody::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FVector                                RigVMModel___SpringInterp_Result;                  // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_1_Result;                          // 0x0040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_Velocity;                // 0x0058(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterp_SimulatedResult;         // 0x0070(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterp_SpringState;             // 0x0080(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___SpringInterp_1_Result;                // 0x0090(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___If_1_1_Result;                        // 0x00A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___SpringInterp_1_Velocity;              // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        RigVMModel___SpringInterp_1_SimulatedResult;       // 0x00D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FVectorSpringState>             RigVMModel___SpringInterp_1_SpringState;           // 0x00E8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigVMFunction_MathTransformMake_Result; // 0x0100(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_1_Result;                         // 0x0160(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_Result;                           // 0x0178(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_2_1_1_Transform;         // 0x0190(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_1_CachedIndex;       // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Add_A;                                // 0x0200(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_Result;                      // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_2_1_Transform;           // 0x0230(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_CachedIndex;         // 0x0290(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Subtract_A__IO;                       // 0x02A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_B__IO;                       // 0x02B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___RigVMFunction_MathTransformMake_Rotation; // 0x02D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_1_Transform;             // 0x02F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_CachedIndex;           // 0x0350(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_Transform;           // 0x0360(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_CachedIndex;         // 0x03C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_1_1_1_Transform;         // 0x03D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_1_CachedIndex;       // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Add_2_Add_2_1_Result;                 // 0x0440(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_2_Add_2_Result;                   // 0x0458(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_2_Add_2_A;                        // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Scale_Result;                         // 0x0488(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Subtract_1_Result;                    // 0x04A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_2_1_2_Transform;         // 0x04C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_2_CachedIndex;       // 0x0520(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Subtract_1_A__IO;                     // 0x0530(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_2_1_1_1_Transform;       // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_1_1_CachedIndex;     // 0x05B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Subtract_1_B__IO;                     // 0x05C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_Effectors__IO;                 // 0x05D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_EffectorSolverIndices;         // 0x05E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_BoneSettingToSolverBoneIndex;  // 0x05F8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_SolverBoneToElementIndex;      // 0x0608(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    RigVMModel___PBIK_1_Solver;                        // 0x0618(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___PBIK_1_bNeedsInit;                    // 0x0628(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_FakeBody.RigVMMemory_Work", true>();
	}
	static class Rig_FakeBody::URigVMMemory_Work* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_FakeBody::URigVMMemory_Work>();
	}
};
static_assert(alignof(Rig_FakeBody::URigVMMemory_Work) == 0x000010, "Wrong alignment on Rig_FakeBody::URigVMMemory_Work");
static_assert(sizeof(Rig_FakeBody::URigVMMemory_Work) == 0x000640, "Wrong size on Rig_FakeBody::URigVMMemory_Work");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Work, RigVMModel___SpringInterp_Result) == 0x000028, "Member 'Rig_FakeBody::URigVMMemory_Work::RigVMModel___SpringInterp_Result' has a wrong offset!");
static_assert(offsetof(Rig_FakeBody::URigVMMemory_Work, RigVMModel___If_1_Result) == 0x000040, "Member 'Rig_FakeBody::URigVMMemory_Work::RigVMModel___If_1_Result' has a wrong offset!");
