#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rig_HandGrip_FPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "PBIK_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Rig_HandGrip_FPP.Rig_HandGrip_FPP_C
// 0x0108 (0x0500 - 0x03F8)
class URig_HandGrip_FPP_C final : public UControlRig
{
public:
	TArray<struct FRigElementKey>                 LH_FabrikArray;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRigElementKey>                 RH_FabrikArray;                                    // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        IK_L;                                              // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_R;                                              // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IK_L_CurveName;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RT_Gun;                                            // 0x0430(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigPose                               PLSD_Cache;                                        // 0x0490(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"Rig_HandGrip_FPP_C">();
	}
	static class URig_HandGrip_FPP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URig_HandGrip_FPP_C>();
	}
};
static_assert(alignof(URig_HandGrip_FPP_C) == 0x000010, "Wrong alignment on URig_HandGrip_FPP_C");
static_assert(sizeof(URig_HandGrip_FPP_C) == 0x000500, "Wrong size on URig_HandGrip_FPP_C");
static_assert(offsetof(URig_HandGrip_FPP_C, LH_FabrikArray) == 0x0003F8, "Member 'URig_HandGrip_FPP_C::LH_FabrikArray' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, RH_FabrikArray) == 0x000408, "Member 'URig_HandGrip_FPP_C::RH_FabrikArray' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, IK_L) == 0x000418, "Member 'URig_HandGrip_FPP_C::IK_L' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, IK_R) == 0x000420, "Member 'URig_HandGrip_FPP_C::IK_R' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, IK_L_CurveName) == 0x000428, "Member 'URig_HandGrip_FPP_C::IK_L_CurveName' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, RT_Gun) == 0x000430, "Member 'URig_HandGrip_FPP_C::RT_Gun' has a wrong offset!");
static_assert(offsetof(URig_HandGrip_FPP_C, PLSD_Cache) == 0x000490, "Member 'URig_HandGrip_FPP_C::PLSD_Cache' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_HandGrip_FPP.RigVMMemory_Literal
// 0x0698 (0x06C0 - 0x0028)
class Rig_HandGrip_FPP::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_OffsetTransformForItem_1_Item__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_OffsetTransformForItem_1_OffsetTransform__Const; // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlFloat_1_Control__Const; // 0x00A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_OffsetTransformForItem_1_bPropagateToChildren__Const; // 0x00A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Clamp_Arms_Rotation_Condition__Const; // 0x00AC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Clamp_Arms_Rotation_Look_Down_Min__Const; // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Clamp_Arms_Rotation_Look_Up_Max__Const; // 0x00C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const; // 0x00C8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const; // 0x00D4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const; // 0x00E0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Clamp_Arms_Rotation___Clamp_Arms_Rotation_Multiply_2_B__Const; // 0x00F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0150(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const; // 0x0168(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMinimum__Const; // 0x0170(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMaximum__Const; // 0x0174(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_bClamp__Const; // 0x0178(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const; // 0x017C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const; // 0x0180(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x0184(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const; // 0x0188(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const; // 0x018C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const; // 0x0194(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Clamp_Arms_Rotation_1_Condition__Const; // 0x0198(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Clamp_Arms_Rotation_1_Look_Down_Min__Const; // 0x01A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Clamp_Arms_Rotation_1_Look_Up_Max__Const; // 0x01B0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const; // 0x01B8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const; // 0x01C4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const; // 0x01D0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0xF];                                      // 0x01D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Multiply_2_B__Const; // 0x01E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x0240(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const; // 0x0258(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMinimum__Const; // 0x0260(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMaximum__Const; // 0x0264(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_bClamp__Const; // 0x0268(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const; // 0x026C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const; // 0x0270(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const; // 0x0274(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const; // 0x0278(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const; // 0x027C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const; // 0x0284(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_1_Root__Const;                 // 0x0288(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__Const;            // 0x0290(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_Item__Const;         // 0x02A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_2_1_Space__Const;        // 0x02AC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_2_1_bInitial__Const;     // 0x02AD(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AE[0x2];                                      // 0x02AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_2_Item__Const;       // 0x02B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_1_BoneSettings__Const;         // 0x02C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_1_1_ExcludedBones__Const;        // 0x02D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_1_Settings__Const;             // 0x02E0(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_1_Debug__Const;                // 0x031C(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetRelativeTransformForItem_Parent__Const; // 0x0324(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Rotation_Range__Const; // 0x0330(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Range__Const; // 0x0338(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Change_Frequency__Const; // 0x0348(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Strength_Range__Const; // 0x0350(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Strength_Change_Frequency__Const; // 0x0360(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Damp_Range__Const; // 0x0368(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RandomOffsetRotations_2_1_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const; // 0x0380(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RandomOffsetRotations_2_1_1___RandomOffsetRotations_Cast_2_1_Value__Const; // 0x03E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_Seed__Const; // 0x03F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_2_Seed__Const; // 0x03FC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_Seed__Const; // 0x0400(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const; // 0x0404(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_3_Seed__Const; // 0x0408(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_Seed__Const; // 0x040C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_Seed__Const; // 0x0410(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Scale__Const; // 0x0414(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Bias__Const; // 0x0418(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bMapRange__Const; // 0x041C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRange                            RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_InRange__Const; // 0x0420(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	bool                                          RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bInterpResult__Const; // 0x0428(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_1_Seed__Const; // 0x042C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Torque__Const; // 0x0430(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Current__Const; // 0x0450(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Item__Const; // 0x0470(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Time_Change_Frequency__Const; // 0x0480(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Strength_Change_Frequency__Const; // 0x0488(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Interp_Damp_Range__Const; // 0x0490(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RandomOffsetRotations_2_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const; // 0x04A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RandomOffsetRotations_2_1___RandomOffsetRotations_Cast_2_1_Value__Const; // 0x0500(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_Seed__Const; // 0x0518(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_2_Seed__Const; // 0x051C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_Seed__Const; // 0x0520(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const; // 0x0524(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_3_Seed__Const; // 0x0528(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_2_2_Seed__Const; // 0x052C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_2_2_1_1_Seed__Const; // 0x0530(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2_1___RandomOffsetRotations_AlphaInterp_1_Scale__Const; // 0x0534(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2_1___RandomOffsetRotations_AlphaInterp_1_Bias__Const; // 0x0538(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomOffsetRotations_2_1___RandomOffsetRotations_AlphaInterp_1_bMapRange__Const; // 0x053C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRange                            RandomOffsetRotations_2_1___RandomOffsetRotations_AlphaInterp_1_InRange__Const; // 0x0540(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	bool                                          RandomOffsetRotations_2_1___RandomOffsetRotations_AlphaInterp_1_bInterpResult__Const; // 0x0548(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomOffsetRotations_2_1___RandomOffsetRotations_Random_2_2_1_1_1_Seed__Const; // 0x054C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomOffsetRotations_2_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Torque__Const; // 0x0550(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RandomOffsetRotations_2_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Current__Const; // 0x0570(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_Rotation_Range__Const; // 0x0590(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_Time_Range__Const; // 0x0598(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Dbno_Shake_RandomOffsetRotations_2_Time_Change_Frequency__Const; // 0x05A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RigVMModel___Dbno_Shake_RandomOffsetRotations_2_Interp_Strength_Range__Const; // 0x05B0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RandomOffsetRotations_2___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const; // 0x05C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RandomOffsetRotations_2___RandomOffsetRotations_Cast_2_1_Value__Const; // 0x0620(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_1_1_Seed__Const; // 0x0638(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_1_2_Seed__Const; // 0x063C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_1_1_1_Seed__Const; // 0x0640(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_1_1_1_1_Seed__Const; // 0x0644(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_3_Seed__Const; // 0x0648(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_2_2_Seed__Const; // 0x064C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_2_2_1_1_Seed__Const; // 0x0650(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2___RandomOffsetRotations_AlphaInterp_1_Scale__Const; // 0x0654(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffsetRotations_2___RandomOffsetRotations_AlphaInterp_1_Bias__Const; // 0x0658(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomOffsetRotations_2___RandomOffsetRotations_AlphaInterp_1_bMapRange__Const; // 0x065C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65D[0x3];                                      // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputRange                            RandomOffsetRotations_2___RandomOffsetRotations_AlphaInterp_1_InRange__Const; // 0x0660(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	bool                                          RandomOffsetRotations_2___RandomOffsetRotations_AlphaInterp_1_bInterpResult__Const; // 0x0668(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomOffsetRotations_2___RandomOffsetRotations_Random_2_2_1_1_1_Seed__Const; // 0x066C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomOffsetRotations_2___RandomOffsetRotations_SpringInterpQuaternionV2_1_Torque__Const; // 0x0670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RandomOffsetRotations_2___RandomOffsetRotations_SpringInterpQuaternionV2_1_Current__Const; // 0x0690(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetRelativeTransformForItem_Weight__Const; // 0x06B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_HandGrip_FPP.RigVMMemory_Literal", true>();
	}
	static class Rig_HandGrip_FPP::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_HandGrip_FPP::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Rig_HandGrip_FPP::URigVMMemory_Literal) == 0x000010, "Wrong alignment on Rig_HandGrip_FPP::URigVMMemory_Literal");
static_assert(sizeof(Rig_HandGrip_FPP::URigVMMemory_Literal) == 0x0006C0, "Wrong size on Rig_HandGrip_FPP::URigVMMemory_Literal");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_1_Item__Const) == 0x000028, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_1_OffsetTransform__Const) == 0x000040, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_1_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlFloat_1_Control__Const) == 0x0000A0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlFloat_1_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_1_bPropagateToChildren__Const) == 0x0000A8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_1_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_Condition__Const) == 0x0000AC, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_Condition__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_Look_Down_Min__Const) == 0x0000B8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_Look_Down_Min__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_Look_Up_Max__Const) == 0x0000C0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_Look_Up_Max__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const) == 0x0000C8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const) == 0x0000D4, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const) == 0x0000E0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Multiply_2_B__Const) == 0x0000F0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Multiply_2_B__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const) == 0x000150, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const) == 0x000168, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMinimum__Const) == 0x000170, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMinimum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMaximum__Const) == 0x000174, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_bClamp__Const) == 0x000178, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_bClamp__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const) == 0x00017C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const) == 0x000180, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const) == 0x000184, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const) == 0x000188, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const) == 0x00018C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const) == 0x000194, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_1_Condition__Const) == 0x000198, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_1_Condition__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_1_Look_Down_Min__Const) == 0x0001A8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_1_Look_Down_Min__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Clamp_Arms_Rotation_1_Look_Up_Max__Const) == 0x0001B0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Clamp_Arms_Rotation_1_Look_Up_Max__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const) == 0x0001B8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Child__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const) == 0x0001C4, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_Parent__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const) == 0x0001D0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Set_Relative_Transform_bParentInitial__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Multiply_2_B__Const) == 0x0001E0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Multiply_2_B__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const) == 0x000240, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_Euler__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const) == 0x000258, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigUnit_GetControlFloat_2_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMinimum__Const) == 0x000260, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMinimum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMaximum__Const) == 0x000264, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_bClamp__Const) == 0x000268, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_bClamp__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const) == 0x00026C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMinimum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const) == 0x000270, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_Remap_2_SourceMaximum__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const) == 0x000274, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_MathQuaternionFromEuler_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const) == 0x000278, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_Scale__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const) == 0x00027C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InRange__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const) == 0x000284, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::Clamp_Arms_Rotation_1___Clamp_Arms_Rotation_RigVMFunction_AlphaInterp_InterpSpeedIncreasing__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Root__Const) == 0x000288, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Effectors__Const) == 0x000290, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_Item__Const) == 0x0002A0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_Space__Const) == 0x0002AC, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_Space__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_bInitial__Const) == 0x0002AD, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_bInitial__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_2_Item__Const) == 0x0002B0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_BoneSettings__Const) == 0x0002C0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_ExcludedBones__Const) == 0x0002D0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Settings__Const) == 0x0002E0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Debug__Const) == 0x00031C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Debug__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetRelativeTransformForItem_Parent__Const) == 0x000324, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetRelativeTransformForItem_Parent__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Rotation_Range__Const) == 0x000330, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Rotation_Range__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Range__Const) == 0x000338, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Range__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Change_Frequency__Const) == 0x000348, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Time_Change_Frequency__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Strength_Range__Const) == 0x000350, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Strength_Range__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Strength_Change_Frequency__Const) == 0x000360, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Strength_Change_Frequency__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Damp_Range__Const) == 0x000368, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_1_Interp_Damp_Range__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const) == 0x000380, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Cast_2_1_Value__Const) == 0x0003E0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Cast_2_1_Value__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_Seed__Const) == 0x0003F8, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_2_Seed__Const) == 0x0003FC, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_2_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_Seed__Const) == 0x000400, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const) == 0x000404, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_3_Seed__Const) == 0x000408, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_3_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_Seed__Const) == 0x00040C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_Seed__Const) == 0x000410, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Scale__Const) == 0x000414, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Scale__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Bias__Const) == 0x000418, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_Bias__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bMapRange__Const) == 0x00041C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bMapRange__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_InRange__Const) == 0x000420, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_InRange__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bInterpResult__Const) == 0x000428, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_AlphaInterp_1_bInterpResult__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_1_Seed__Const) == 0x00042C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_Random_2_2_1_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Torque__Const) == 0x000430, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Torque__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Current__Const) == 0x000450, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1_1___RandomOffsetRotations_SpringInterpQuaternionV2_1_Current__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Item__Const) == 0x000470, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Time_Change_Frequency__Const) == 0x000480, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Time_Change_Frequency__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Strength_Change_Frequency__Const) == 0x000488, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Strength_Change_Frequency__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Interp_Damp_Range__Const) == 0x000490, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RigVMModel___Dbno_Shake_RandomOffsetRotations_2_1_Interp_Damp_Range__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const) == 0x0004A0, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_RigUnit_OffsetTransformForItem_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_Cast_2_1_Value__Const) == 0x000500, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_Cast_2_1_Value__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_Seed__Const) == 0x000518, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_2_Seed__Const) == 0x00051C, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_2_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_Seed__Const) == 0x000520, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_Seed__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandGrip_FPP::URigVMMemory_Literal, RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const) == 0x000524, "Member 'Rig_HandGrip_FPP::URigVMMemory_Literal::RandomOffsetRotations_2_1___RandomOffsetRotations_Random_1_1_1_1_Seed__Const' has a wrong offset!");
