#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rig_PLSD_FPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Rig_PLSD_FPP.Rig_PLSD_FPP_C
// 0x0108 (0x0500 - 0x03F8)
class URig_PLSD_FPP_C final : public UControlRig
{
public:
	TArray<struct FRigElementKey>                 LH_FabrikArray;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FRigElementKey>                 RH_FabrikArray;                                    // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        IK_L;                                              // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IK_R;                                              // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IK_L_CurveName;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RT_Gun;                                            // 0x0430(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigPose                               PLSD_Cache;                                        // 0x0490(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"Rig_PLSD_FPP_C">();
	}
	static class URig_PLSD_FPP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URig_PLSD_FPP_C>();
	}
};
static_assert(alignof(URig_PLSD_FPP_C) == 0x000010, "Wrong alignment on URig_PLSD_FPP_C");
static_assert(sizeof(URig_PLSD_FPP_C) == 0x000500, "Wrong size on URig_PLSD_FPP_C");
static_assert(offsetof(URig_PLSD_FPP_C, LH_FabrikArray) == 0x0003F8, "Member 'URig_PLSD_FPP_C::LH_FabrikArray' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, RH_FabrikArray) == 0x000408, "Member 'URig_PLSD_FPP_C::RH_FabrikArray' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, IK_L) == 0x000418, "Member 'URig_PLSD_FPP_C::IK_L' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, IK_R) == 0x000420, "Member 'URig_PLSD_FPP_C::IK_R' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, IK_L_CurveName) == 0x000428, "Member 'URig_PLSD_FPP_C::IK_L_CurveName' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, RT_Gun) == 0x000430, "Member 'URig_PLSD_FPP_C::RT_Gun' has a wrong offset!");
static_assert(offsetof(URig_PLSD_FPP_C, PLSD_Cache) == 0x000490, "Member 'URig_PLSD_FPP_C::PLSD_Cache' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_PLSD_FPP.RigVMMemory_Literal
// 0x0208 (0x0230 - 0x0028)
class Rig_PLSD_FPP::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_OffsetTransformForItem_2_Item__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_OffsetTransformForItem_2_OffsetTransform__Const; // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_OffsetTransformForItem_2_Weight__Const; // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_OffsetTransformForItem_2_bPropagateToChildren__Const; // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RigVMModel___GetCurveValue_1_2_1_Curve__Const;     // 0x00A8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_1_Item__Const;   // 0x00B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_1_Space__Const;  // 0x00BC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_1_bInitial__Const; // 0x00BD(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         DISPATCH_RigVMDispatch_SelectInt32_1_Values_0__Const; // 0x00C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         DISPATCH_RigVMDispatch_SelectInt32_1_Values_1__Const; // 0x00CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         DISPATCH_RigVMDispatch_SelectInt32_1_Values_2__Const; // 0x00D8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         DISPATCH_RigVMDispatch_SelectInt32_1_Values_3__Const; // 0x00E4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_1_1_Root__Const;               // 0x00F0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_1_Effectors__Const;          // 0x00F8(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___GetTransform_1_1_2_1_1_Item__Const;   // 0x0108(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_1_1_1_BoneSettings__Const;       // 0x0118(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_1_1_1_ExcludedBones__Const;      // 0x0128(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_1_1_1_Settings__Const;           // 0x0138(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_1_1_1_Debug__Const;              // 0x0174(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__Const; // 0x0180(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlVector_Control__Const; // 0x01E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_1_1_Root__Const;                 // 0x01E8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__Const;            // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x0200(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___Add_1_B__Const;                       // 0x0210(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_PLSD_FPP.RigVMMemory_Literal", true>();
	}
	static class Rig_PLSD_FPP::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_PLSD_FPP::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Rig_PLSD_FPP::URigVMMemory_Literal) == 0x000010, "Wrong alignment on Rig_PLSD_FPP::URigVMMemory_Literal");
static_assert(sizeof(Rig_PLSD_FPP::URigVMMemory_Literal) == 0x000230, "Wrong size on Rig_PLSD_FPP::URigVMMemory_Literal");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_2_Item__Const) == 0x000028, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_2_OffsetTransform__Const) == 0x000040, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_2_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_2_Weight__Const) == 0x0000A0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_2_Weight__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_2_bPropagateToChildren__Const) == 0x0000A4, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_2_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___GetCurveValue_1_2_1_Curve__Const) == 0x0000A8, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___GetCurveValue_1_2_1_Curve__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_Item__Const) == 0x0000B0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_Space__Const) == 0x0000BC, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_Space__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_1_bInitial__Const) == 0x0000BD, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_1_bInitial__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, DISPATCH_RigVMDispatch_SelectInt32_1_Values_0__Const) == 0x0000C0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::DISPATCH_RigVMDispatch_SelectInt32_1_Values_0__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, DISPATCH_RigVMDispatch_SelectInt32_1_Values_1__Const) == 0x0000CC, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::DISPATCH_RigVMDispatch_SelectInt32_1_Values_1__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, DISPATCH_RigVMDispatch_SelectInt32_1_Values_2__Const) == 0x0000D8, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::DISPATCH_RigVMDispatch_SelectInt32_1_Values_2__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, DISPATCH_RigVMDispatch_SelectInt32_1_Values_3__Const) == 0x0000E4, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::DISPATCH_RigVMDispatch_SelectInt32_1_Values_3__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_Root__Const) == 0x0000F0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_Effectors__Const) == 0x0000F8, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_1_1_2_1_1_Item__Const) == 0x000108, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_1_1_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_BoneSettings__Const) == 0x000118, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_BoneSettings__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_ExcludedBones__Const) == 0x000128, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_ExcludedBones__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_Settings__Const) == 0x000138, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_Settings__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_1_Debug__Const) == 0x000174, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_1_Debug__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___OffsetTransformForItem_OffsetTransform__Const) == 0x000180, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___OffsetTransformForItem_OffsetTransform__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlVector_Control__Const) == 0x0001E0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlVector_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Root__Const) == 0x0001E8, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Root__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___PBIK_1_1_Effectors__Const) == 0x0001F0, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___PBIK_1_1_Effectors__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___GetTransform_2_1_1_Item__Const) == 0x000200, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___GetTransform_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Literal, RigVMModel___Add_1_B__Const) == 0x000210, "Member 'Rig_PLSD_FPP::URigVMMemory_Literal::RigVMModel___Add_1_B__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_PLSD_FPP.RigVMMemory_Work
// 0x0438 (0x0460 - 0x0028)
class Rig_PLSD_FPP::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_OffsetTransformForItem_2_CachedIndex; // 0x0028(0x0010)(Edit, EditConst, NonTransactional)
	bool                                          RigVMModel___GetCurveValue_1_2_1_Valid;            // 0x0038(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___GetCurveValue_1_2_1_Value;            // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_1_2_1_CachedCurveIndex; // 0x0040(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___DISPATCH_RigVMDispatch_SelectInt32_1_Result; // 0x00B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___Ceiling_1_Int;                        // 0x00BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___GetCurveValue_1_2_2_Value;            // 0x00C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetCurveValue_1_2_2_Valid;            // 0x00C4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___GetCurveValue_1_2_2_CachedCurveIndex; // 0x00C8(0x0010)(Edit, EditConst, NonTransactional)
	double                                        RigVMModel___Ceiling_1_Value;                      // 0x00D8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Ceiling_1_Result;                     // 0x00E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x00E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_CachedIndex;   // 0x00F8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___GetTransform_1_1_2_1_1_Transform;     // 0x0110(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_2_1_1_CachedIndex;   // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_1_Effectors__IO;             // 0x0180(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_1_EffectorSolverIndices;     // 0x0190(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_1_BoneSettingToSolverBoneIndex; // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_1_SolverBoneToElementIndex;  // 0x01B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    RigVMModel___PBIK_1_1_1_Solver;                    // 0x01C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___PBIK_1_1_1_bNeedsInit;                // 0x01D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigUnit_GetControlVector_Vector;      // 0x01E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigUnit_GetControlVector_Minimum;     // 0x01F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigUnit_GetControlVector_Maximum;     // 0x0210(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlVector_CachedControlIndex; // 0x0228(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__IO; // 0x0240(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_CachedIndex;   // 0x02A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___GetTransform_2_1_1_Transform;         // 0x02B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_1_CachedIndex;       // 0x0310(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Add_1_Result;                         // 0x0320(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_1_A;                              // 0x0338(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_1_1_2_1_Transform;       // 0x0350(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_1_1_2_1_CachedIndex;     // 0x03B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___Add_1_1_Result;                       // 0x03C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Add_1_1_A;                            // 0x03D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_1_1_Effectors__IO;               // 0x03F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_EffectorSolverIndices;       // 0x0400(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_BoneSettingToSolverBoneIndex; // 0x0410(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_1_1_SolverBoneToElementIndex;    // 0x0420(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    RigVMModel___PBIK_1_1_Solver;                      // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___PBIK_1_1_bNeedsInit;                  // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0450(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_PLSD_FPP.RigVMMemory_Work", true>();
	}
	static class Rig_PLSD_FPP::URigVMMemory_Work* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_PLSD_FPP::URigVMMemory_Work>();
	}
};
static_assert(alignof(Rig_PLSD_FPP::URigVMMemory_Work) == 0x000010, "Wrong alignment on Rig_PLSD_FPP::URigVMMemory_Work");
static_assert(sizeof(Rig_PLSD_FPP::URigVMMemory_Work) == 0x000460, "Wrong size on Rig_PLSD_FPP::URigVMMemory_Work");
static_assert(offsetof(Rig_PLSD_FPP::URigVMMemory_Work, RigVMModel___RigUnit_OffsetTransformForItem_2_CachedIndex) == 0x000028, "Member 'Rig_PLSD_FPP::URigVMMemory_Work::RigVMModel___RigUnit_OffsetTransformForItem_2_CachedIndex' has a wrong offset!");
