#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rig_HandIKRetargeting

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass Rig_HandIKRetargeting.Rig_HandIKRetargeting_C
// 0x00C8 (0x04C0 - 0x03F8)
class URig_HandIKRetargeting_C final : public UControlRig
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RT_IK_Gun;                                         // 0x0400(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RT_IK_LH;                                          // 0x0460(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"Rig_HandIKRetargeting_C">();
	}
	static class URig_HandIKRetargeting_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URig_HandIKRetargeting_C>();
	}
};
static_assert(alignof(URig_HandIKRetargeting_C) == 0x000010, "Wrong alignment on URig_HandIKRetargeting_C");
static_assert(sizeof(URig_HandIKRetargeting_C) == 0x0004C0, "Wrong size on URig_HandIKRetargeting_C");
static_assert(offsetof(URig_HandIKRetargeting_C, RT_IK_Gun) == 0x000400, "Member 'URig_HandIKRetargeting_C::RT_IK_Gun' has a wrong offset!");
static_assert(offsetof(URig_HandIKRetargeting_C, RT_IK_LH) == 0x000460, "Member 'URig_HandIKRetargeting_C::RT_IK_LH' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_HandIKRetargeting.RigVMMemory_Literal
// 0x0048 (0x0070 - 0x0028)
class Rig_HandIKRetargeting::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Child__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_bChildInitial__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Parent__Const; // 0x0038(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_Child__Const; // 0x0044(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_Space__Const; // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Item__Const; // 0x0054(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Hand_IK_Retargeting_Subtract_A__Const; // 0x0060(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___Hand_IK_Retargeting_GetCurveValue_Curve__Const; // 0x0064(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_bPropagateToChildren__Const; // 0x006C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_HandIKRetargeting.RigVMMemory_Literal", true>();
	}
	static class Rig_HandIKRetargeting::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_HandIKRetargeting::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Rig_HandIKRetargeting::URigVMMemory_Literal) == 0x000008, "Wrong alignment on Rig_HandIKRetargeting::URigVMMemory_Literal");
static_assert(sizeof(Rig_HandIKRetargeting::URigVMMemory_Literal) == 0x000070, "Wrong size on Rig_HandIKRetargeting::URigVMMemory_Literal");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Child__Const) == 0x000028, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Child__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_bChildInitial__Const) == 0x000034, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_bChildInitial__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Parent__Const) == 0x000038, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_Parent__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_Child__Const) == 0x000044, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_Child__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_Space__Const) == 0x000050, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_Space__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Item__Const) == 0x000054, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_Subtract_A__Const) == 0x000060, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_Subtract_A__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_GetCurveValue_Curve__Const) == 0x000064, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_GetCurveValue_Curve__Const' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Literal, RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_bPropagateToChildren__Const) == 0x00006C, "Member 'Rig_HandIKRetargeting::URigVMMemory_Literal::RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_bPropagateToChildren__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_HandIKRetargeting.RigVMMemory_Work
// 0x01E8 (0x0210 - 0x0028)
class Rig_HandIKRetargeting::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_RelativeTransform; // 0x0030(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedChild; // 0x0090(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedParent; // 0x00A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_RelativeTransform; // 0x00B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedChild; // 0x0110(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedParent; // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Transform; // 0x0130(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_CachedIndex; // 0x0190(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___Hand_IK_Retargeting_Subtract_Result;  // 0x01A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Hand_IK_Retargeting_Negate_Result;    // 0x01A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Hand_IK_Retargeting_GetCurveValue_Value; // 0x01A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Hand_IK_Retargeting_GetCurveValue_Valid; // 0x01AC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_GetCurveValue_CachedCurveIndex; // 0x01B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_CachedIndex; // 0x01C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedChild; // 0x01D0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedParent; // 0x01E0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedChild; // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedParent; // 0x0200(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_HandIKRetargeting.RigVMMemory_Work", true>();
	}
	static class Rig_HandIKRetargeting::URigVMMemory_Work* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_HandIKRetargeting::URigVMMemory_Work>();
	}
};
static_assert(alignof(Rig_HandIKRetargeting::URigVMMemory_Work) == 0x000010, "Wrong alignment on Rig_HandIKRetargeting::URigVMMemory_Work");
static_assert(sizeof(Rig_HandIKRetargeting::URigVMMemory_Work) == 0x000210, "Wrong size on Rig_HandIKRetargeting::URigVMMemory_Work");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_RelativeTransform) == 0x000030, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_RelativeTransform' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedChild) == 0x000090, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedChild' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedParent) == 0x0000A0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_CachedParent' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_RelativeTransform) == 0x0000B0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_RelativeTransform' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedChild) == 0x000110, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedChild' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedParent) == 0x000120, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetRelativeTransformForItem_1_CachedParent' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Transform) == 0x000130, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_Transform' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_CachedIndex) == 0x000190, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_RigUnit_GetTransform_1_CachedIndex' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Subtract_Result) == 0x0001A0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Subtract_Result' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Negate_Result) == 0x0001A4, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Negate_Result' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetCurveValue_Value) == 0x0001A8, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetCurveValue_Value' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetCurveValue_Valid) == 0x0001AC, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetCurveValue_Valid' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_GetCurveValue_CachedCurveIndex) == 0x0001B0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_GetCurveValue_CachedCurveIndex' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_CachedIndex) == 0x0001C0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_RigUnit_SetTransform_CachedIndex' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedChild) == 0x0001D0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedChild' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedParent) == 0x0001E0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_CachedParent' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedChild) == 0x0001F0, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedChild' has a wrong offset!");
static_assert(offsetof(Rig_HandIKRetargeting::URigVMMemory_Work, RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedParent) == 0x000200, "Member 'Rig_HandIKRetargeting::URigVMMemory_Work::RigVMModel___Hand_IK_Retargeting_Set_Relative_Transform_1_CachedParent' has a wrong offset!");

}

