#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Rig_AdsReload_FPP

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass Rig_AdsReload_FPP.Rig_AdsReload_FPP_C
// 0x0128 (0x0520 - 0x03F8)
class URig_AdsReload_FPP_C final : public UControlRig
{
public:
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Delta_Reload_IK_Gun;                               // 0x0400(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Ik_Gun_Reload_Relative_to_IronSight;               // 0x0460(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Post_Relaod_IK_HandGun;                            // 0x04C0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"Rig_AdsReload_FPP_C">();
	}
	static class URig_AdsReload_FPP_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<URig_AdsReload_FPP_C>();
	}
};
static_assert(alignof(URig_AdsReload_FPP_C) == 0x000010, "Wrong alignment on URig_AdsReload_FPP_C");
static_assert(sizeof(URig_AdsReload_FPP_C) == 0x000520, "Wrong size on URig_AdsReload_FPP_C");
static_assert(offsetof(URig_AdsReload_FPP_C, Delta_Reload_IK_Gun) == 0x000400, "Member 'URig_AdsReload_FPP_C::Delta_Reload_IK_Gun' has a wrong offset!");
static_assert(offsetof(URig_AdsReload_FPP_C, Ik_Gun_Reload_Relative_to_IronSight) == 0x000460, "Member 'URig_AdsReload_FPP_C::Ik_Gun_Reload_Relative_to_IronSight' has a wrong offset!");
static_assert(offsetof(URig_AdsReload_FPP_C, Post_Relaod_IK_HandGun) == 0x0004C0, "Member 'URig_AdsReload_FPP_C::Post_Relaod_IK_HandGun' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_AdsReload_FPP.RigVMMemory_Literal
// 0x00F8 (0x0120 - 0x0028)
class Rig_AdsReload_FPP::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	class FName                                   RigVMModel___RigUnit_GetControlBool_2_1_Control__Const; // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___RigUnit_GetControlBool_1_2_Control__Const; // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetControlBool_3_BoolValue__Const; // 0x0038(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_2_Item__Const;   // 0x003C(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_2_Space__Const;  // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_Value__Const;  // 0x0050(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_4_2_1_2_Item__Const; // 0x00B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_Item__Const; // 0x00BC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_2_Weight__Const; // 0x00C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_2_bPropagateToChildren__Const; // 0x00CC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_2_1_1_Item__Const; // 0x00D0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const; // 0x00E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         RigVMModel___KalmanFilter_BufferSize__Const;       // 0x00F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x00FC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___RigUnit_OffsetTransformForItem_Weight__Const; // 0x0100(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_1_True__Const; // 0x0104(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_InRange__Const;           // 0x0108(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___RigVMFunction_MathFloatMake_Value__Const; // 0x0110(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_AdsReload_FPP.RigVMMemory_Literal", true>();
	}
	static class Rig_AdsReload_FPP::URigVMMemory_Literal* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_AdsReload_FPP::URigVMMemory_Literal>();
	}
};
static_assert(alignof(Rig_AdsReload_FPP::URigVMMemory_Literal) == 0x000010, "Wrong alignment on Rig_AdsReload_FPP::URigVMMemory_Literal");
static_assert(sizeof(Rig_AdsReload_FPP::URigVMMemory_Literal) == 0x000120, "Wrong size on Rig_AdsReload_FPP::URigVMMemory_Literal");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlBool_2_1_Control__Const) == 0x000028, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlBool_2_1_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetControlBool_1_2_Control__Const) == 0x000030, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetControlBool_1_2_Control__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetControlBool_3_BoolValue__Const) == 0x000038, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetControlBool_3_BoolValue__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Item__Const) == 0x00003C, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Space__Const) == 0x000048, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Space__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Value__Const) == 0x000050, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Value__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_4_2_1_2_Item__Const) == 0x0000B0, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_4_2_1_2_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_1_1_Item__Const) == 0x0000BC, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_Weight__Const) == 0x0000C8, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_Weight__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_SetTransform_2_bPropagateToChildren__Const) == 0x0000CC, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_SetTransform_2_bPropagateToChildren__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_GetTransform_3_2_1_1_Item__Const) == 0x0000D0, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_GetTransform_3_2_1_1_Item__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const) == 0x0000E0, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___KalmanFilter_BufferSize__Const) == 0x0000F8, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___KalmanFilter_BufferSize__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const) == 0x0000FC, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathQuaternionToEuler_RotationOrder__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigUnit_OffsetTransformForItem_Weight__Const) == 0x000100, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigUnit_OffsetTransformForItem_Weight__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___DISPATCH_RigVMDispatch_If_1_True__Const) == 0x000104, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___DISPATCH_RigVMDispatch_If_1_True__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___AlphaInterp_InRange__Const) == 0x000108, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___AlphaInterp_InRange__Const' has a wrong offset!");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Literal, RigVMModel___RigVMFunction_MathFloatMake_Value__Const) == 0x000110, "Member 'Rig_AdsReload_FPP::URigVMMemory_Literal::RigVMModel___RigVMFunction_MathFloatMake_Value__Const' has a wrong offset!");

// RigVMMemoryStorageGeneratorClass Rig_AdsReload_FPP.RigVMMemory_Work
// 0x0768 (0x0790 - 0x0028)
class Rig_AdsReload_FPP::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	bool                                          RigVMModel___RigUnit_GetControlBool_2_1_BoolValue; // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlBool_2_1_CachedControlIndex; // 0x0030(0x0010)(Edit, EditConst, NonTransactional)
	bool                                          RigVMModel___RigUnit_GetControlBool_1_2_BoolValue; // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlBool_1_2_CachedControlIndex; // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	bool                                          RigVMModel___RigUnit_SetControlBool_3_BoolValue__IO; // 0x0058(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetControlBool_3_CachedControlIndex; // 0x0060(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                RigVMModel___RigVMFunction_MathVectorMake_1_Result; // 0x0070(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_2_1_2_Transform; // 0x0090(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_2_1_2_CachedIndex; // 0x00F0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___RigVMFunction_MathVectorMake_1_X;     // 0x0100(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0xC];                                      // 0x0104(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_1_Transform;   // 0x0110(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_1_CachedIndex; // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___RigVMFunction_MathVectorMake_1_Y;     // 0x0180(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigVMFunction_MathVectorMake_1_Z;     // 0x0184(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_2_Value__IO;     // 0x0190(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_2_CachedIndex;   // 0x01F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___DeltaFromPrevious_Delta;              // 0x0200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_2_1_1_Transform; // 0x0260(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_2_1_1_CachedIndex; // 0x02C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___DeltaFromPrevious_PreviousValue;      // 0x02D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     RigVMModel___DeltaFromPrevious_Cache;              // 0x0330(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___DeltaFromPrevious_bIsInitialized;     // 0x0340(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_2_1_1_1_Transform; // 0x0350(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_2_1_1_1_CachedIndex; // 0x03B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_2_CachedIndex; // 0x03C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetRelativeTransformForItem_1_RelativeTransform; // 0x03D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedChild; // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetRelativeTransformForItem_1_CachedParent; // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionFromEuler_Result; // 0x0450(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionToEuler_Result; // 0x0470(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___KalmanFilter_Result;                  // 0x0490(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<TArray<struct FTransform>>             RigVMModel___KalmanFilter_Buffer;                  // 0x04F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<int32>                                 RigVMModel___KalmanFilter_LastInsertIndex;         // 0x0500(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionToEuler_Value; // 0x0510(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___RigVMFunction_MathQuaternionFromEuler_Euler__IO; // 0x0530(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_OffsetTransformForItem_OffsetTransform__IO; // 0x0550(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_OffsetTransformForItem_CachedIndex; // 0x05B0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedChild; // 0x05C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetRelativeTransformForItem_CachedParent; // 0x05D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_2_1_1_1_Transform; // 0x05E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_2_1_1_1_CachedIndex; // 0x0640(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_1_2_BlockToRun; // 0x0650(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetControlBool_3_1_BoolValue__IO; // 0x0658(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetControlBool_3_1_CachedControlIndex; // 0x0660(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___Interpolate_Result;                   // 0x0670(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_2_1_1_1_1_Transform; // 0x06D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_2_1_1_1_1_CachedIndex; // 0x0730(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___AlphaInterp_Result;                   // 0x0740(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DISPATCH_RigVMDispatch_If_1_Result;   // 0x0744(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_GetControlBool_2_1_1_BoolValue; // 0x0748(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetControlBool_2_1_1_CachedControlIndex; // 0x0750(0x0010)(Edit, EditConst, NonTransactional)
	float                                         RigVMModel___RigVMFunction_MathFloatMake_Value__IO; // 0x0760(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_ScaleBiasClamp;           // 0x0768(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_1_2_1_CachedIndex; // 0x0778(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   RigVMModel___RigVMFunction_ControlFlowBranch_2_BlockToRun; // 0x0788(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass Rig_AdsReload_FPP.RigVMMemory_Work", true>();
	}
	static class Rig_AdsReload_FPP::URigVMMemory_Work* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<Rig_AdsReload_FPP::URigVMMemory_Work>();
	}
};
static_assert(alignof(Rig_AdsReload_FPP::URigVMMemory_Work) == 0x000010, "Wrong alignment on Rig_AdsReload_FPP::URigVMMemory_Work");
static_assert(sizeof(Rig_AdsReload_FPP::URigVMMemory_Work) == 0x000790, "Wrong size on Rig_AdsReload_FPP::URigVMMemory_Work");
static_assert(offsetof(Rig_AdsReload_FPP::URigVMMemory_Work, RigVMModel___RigUnit_GetControlBool_2_1_BoolValue) == 0x000028, "Member 'Rig_AdsReload_FPP::URigVMMemory_Work::RigVMModel___RigUnit_GetControlBool_2_1_BoolValue' has a wrong offset!");
