#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeDebugView

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class RuntimeDebugView.RuntimeDebugViewDebugSpectatorPawn
// 0x0000 (0x0360 - 0x0360)
class ARuntimeDebugViewDebugSpectatorPawn final : public ASpectatorPawn
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RuntimeDebugViewDebugSpectatorPawn">();
	}
	static class ARuntimeDebugViewDebugSpectatorPawn* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ARuntimeDebugViewDebugSpectatorPawn>();
	}
};
static_assert(alignof(ARuntimeDebugViewDebugSpectatorPawn) == 0x000008, "Wrong alignment on ARuntimeDebugViewDebugSpectatorPawn");
static_assert(sizeof(ARuntimeDebugViewDebugSpectatorPawn) == 0x000360, "Wrong size on ARuntimeDebugViewDebugSpectatorPawn");

// Class RuntimeDebugView.RuntimeDebugViewDebugCameraController
// 0x0000 (0x09F0 - 0x09F0)
class ARuntimeDebugViewDebugCameraController final : public ADebugCameraController
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"RuntimeDebugViewDebugCameraController">();
	}
	static class ARuntimeDebugViewDebugCameraController* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ARuntimeDebugViewDebugCameraController>();
	}
};
static_assert(alignof(ARuntimeDebugViewDebugCameraController) == 0x000008, "Wrong alignment on ARuntimeDebugViewDebugCameraController");
static_assert(sizeof(ARuntimeDebugViewDebugCameraController) == 0x0009F0, "Wrong size on ARuntimeDebugViewDebugCameraController");

// Class RuntimeDebugView.PreviewSceneCapture2D
// 0x00E8 (0x03B0 - 0x02C8)
class alignas(0x10) APreviewSceneCapture2D final : public ASceneCapture2D
{
public:
	class AActor*                                 PreviewActor;                                      // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 TextureRenderTarget;                               // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0xD8];                                     // 0x02D8(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PreviewSceneCapture2D">();
	}
	static class APreviewSceneCapture2D* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<APreviewSceneCapture2D>();
	}
};
static_assert(alignof(APreviewSceneCapture2D) == 0x000010, "Wrong alignment on APreviewSceneCapture2D");
static_assert(sizeof(APreviewSceneCapture2D) == 0x0003B0, "Wrong size on APreviewSceneCapture2D");
static_assert(offsetof(APreviewSceneCapture2D, PreviewActor) == 0x0002C8, "Member 'APreviewSceneCapture2D::PreviewActor' has a wrong offset!");
static_assert(offsetof(APreviewSceneCapture2D, TextureRenderTarget) == 0x0002D0, "Member 'APreviewSceneCapture2D::TextureRenderTarget' has a wrong offset!");

}

