#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_LocoMotion_Starts

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_LocoMotion_Starts.S_LocoMotion_Starts
// 0x0050 (0x0050 - 0x0000)
struct FS_LocoMotion_Starts final
{
public:
	class UAnimSequence*                          Walk_Start_Fwd_26_E3EFB76E4FD8E906143AA99BEC586060; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Walk_Start_Fwd_L90_27_E2C9482B43B55A2BE1BBE7AC3FAC122F; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Walk_Start_Fwd_L180_28_5DED070844EAFAD1FF96CA80B37185EE; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Walk_Start_Fwd_R90_29_80D371704BE648C7EF2711A25A38B805; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Walk_Start_Fwd_R180_42_52256AF64B194A1CF5863F859EE9B200; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Run_Start_Fwd_48_929A4738451844C03FFBC7ABDFACF76E; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Run_Start_Fwd_L90_44_263135D34342BA35F8CD17A366BD1899; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Run_Start_Fwd_L180_45_761FE403402ED26ED6E2FFA5C3E298BF; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Run_Start_Fwd_R90_46_728915BE4870E0672A912C9BD0A26580; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Run_Start_Fwd_R180_47_229D3BBE44074D9A898FA490128747EF; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_LocoMotion_Starts) == 0x000008, "Wrong alignment on FS_LocoMotion_Starts");
static_assert(sizeof(FS_LocoMotion_Starts) == 0x000050, "Wrong size on FS_LocoMotion_Starts");
static_assert(offsetof(FS_LocoMotion_Starts, Walk_Start_Fwd_26_E3EFB76E4FD8E906143AA99BEC586060) == 0x000000, "Member 'FS_LocoMotion_Starts::Walk_Start_Fwd_26_E3EFB76E4FD8E906143AA99BEC586060' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Walk_Start_Fwd_L90_27_E2C9482B43B55A2BE1BBE7AC3FAC122F) == 0x000008, "Member 'FS_LocoMotion_Starts::Walk_Start_Fwd_L90_27_E2C9482B43B55A2BE1BBE7AC3FAC122F' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Walk_Start_Fwd_L180_28_5DED070844EAFAD1FF96CA80B37185EE) == 0x000010, "Member 'FS_LocoMotion_Starts::Walk_Start_Fwd_L180_28_5DED070844EAFAD1FF96CA80B37185EE' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Walk_Start_Fwd_R90_29_80D371704BE648C7EF2711A25A38B805) == 0x000018, "Member 'FS_LocoMotion_Starts::Walk_Start_Fwd_R90_29_80D371704BE648C7EF2711A25A38B805' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Walk_Start_Fwd_R180_42_52256AF64B194A1CF5863F859EE9B200) == 0x000020, "Member 'FS_LocoMotion_Starts::Walk_Start_Fwd_R180_42_52256AF64B194A1CF5863F859EE9B200' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Run_Start_Fwd_48_929A4738451844C03FFBC7ABDFACF76E) == 0x000028, "Member 'FS_LocoMotion_Starts::Run_Start_Fwd_48_929A4738451844C03FFBC7ABDFACF76E' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Run_Start_Fwd_L90_44_263135D34342BA35F8CD17A366BD1899) == 0x000030, "Member 'FS_LocoMotion_Starts::Run_Start_Fwd_L90_44_263135D34342BA35F8CD17A366BD1899' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Run_Start_Fwd_L180_45_761FE403402ED26ED6E2FFA5C3E298BF) == 0x000038, "Member 'FS_LocoMotion_Starts::Run_Start_Fwd_L180_45_761FE403402ED26ED6E2FFA5C3E298BF' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Run_Start_Fwd_R90_46_728915BE4870E0672A912C9BD0A26580) == 0x000040, "Member 'FS_LocoMotion_Starts::Run_Start_Fwd_R90_46_728915BE4870E0672A912C9BD0A26580' has a wrong offset!");
static_assert(offsetof(FS_LocoMotion_Starts, Run_Start_Fwd_R180_47_229D3BBE44074D9A898FA490128747EF) == 0x000048, "Member 'FS_LocoMotion_Starts::Run_Start_Fwd_R180_47_229D3BBE44074D9A898FA490128747EF' has a wrong offset!");

}

