#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_OrientAnimSet

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_OrientAnimSet.S_OrientAnimSet
// 0x0030 (0x0030 - 0x0000)
struct FS_OrientAnimSet final
{
public:
	class UAnimSequence*                          Orient00L_11_7CC11B2D43706982E29981BDE24926B6;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Orient00R_12_157C3A0E4A791BE8879601AB92682918;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Orient90L_13_D81218ED4975CA326BD09486D57F2F5C;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Orient90R_14_A82D0D614F65EF694FDFB78B2DFDD35A;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Orient180L_16_F15477A04560E29893E14689BB0D11FD;    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Orient180R_17_E57D527E49550A0051D95894C2A915DF;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_OrientAnimSet) == 0x000008, "Wrong alignment on FS_OrientAnimSet");
static_assert(sizeof(FS_OrientAnimSet) == 0x000030, "Wrong size on FS_OrientAnimSet");
static_assert(offsetof(FS_OrientAnimSet, Orient00L_11_7CC11B2D43706982E29981BDE24926B6) == 0x000000, "Member 'FS_OrientAnimSet::Orient00L_11_7CC11B2D43706982E29981BDE24926B6' has a wrong offset!");
static_assert(offsetof(FS_OrientAnimSet, Orient00R_12_157C3A0E4A791BE8879601AB92682918) == 0x000008, "Member 'FS_OrientAnimSet::Orient00R_12_157C3A0E4A791BE8879601AB92682918' has a wrong offset!");
static_assert(offsetof(FS_OrientAnimSet, Orient90L_13_D81218ED4975CA326BD09486D57F2F5C) == 0x000010, "Member 'FS_OrientAnimSet::Orient90L_13_D81218ED4975CA326BD09486D57F2F5C' has a wrong offset!");
static_assert(offsetof(FS_OrientAnimSet, Orient90R_14_A82D0D614F65EF694FDFB78B2DFDD35A) == 0x000018, "Member 'FS_OrientAnimSet::Orient90R_14_A82D0D614F65EF694FDFB78B2DFDD35A' has a wrong offset!");
static_assert(offsetof(FS_OrientAnimSet, Orient180L_16_F15477A04560E29893E14689BB0D11FD) == 0x000020, "Member 'FS_OrientAnimSet::Orient180L_16_F15477A04560E29893E14689BB0D11FD' has a wrong offset!");
static_assert(offsetof(FS_OrientAnimSet, Orient180R_17_E57D527E49550A0051D95894C2A915DF) == 0x000028, "Member 'FS_OrientAnimSet::Orient180R_17_E57D527E49550A0051D95894C2A915DF' has a wrong offset!");

}

