#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_RaidNotification_Message

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_RaidNotification_Message.S_RaidNotification_Message
// 0x0018 (0x0018 - 0x0000)
struct FS_RaidNotification_Message final
{
public:
	double                                        Time_2_47463810405049B393FCE79B24785EF0;           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinSessionDificulty_14_F1FE3DB843D621D94D0BECAB264917B2; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasSent_8_19CB755C45984C23103F4D9319DCC2C0;        // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueTag                        GameplayCue_11_48CA589243313EBFBCF4B4A6B57E2112;   // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor)
};
static_assert(alignof(FS_RaidNotification_Message) == 0x000008, "Wrong alignment on FS_RaidNotification_Message");
static_assert(sizeof(FS_RaidNotification_Message) == 0x000018, "Wrong size on FS_RaidNotification_Message");
static_assert(offsetof(FS_RaidNotification_Message, Time_2_47463810405049B393FCE79B24785EF0) == 0x000000, "Member 'FS_RaidNotification_Message::Time_2_47463810405049B393FCE79B24785EF0' has a wrong offset!");
static_assert(offsetof(FS_RaidNotification_Message, MinSessionDificulty_14_F1FE3DB843D621D94D0BECAB264917B2) == 0x000008, "Member 'FS_RaidNotification_Message::MinSessionDificulty_14_F1FE3DB843D621D94D0BECAB264917B2' has a wrong offset!");
static_assert(offsetof(FS_RaidNotification_Message, WasSent_8_19CB755C45984C23103F4D9319DCC2C0) == 0x00000C, "Member 'FS_RaidNotification_Message::WasSent_8_19CB755C45984C23103F4D9319DCC2C0' has a wrong offset!");
static_assert(offsetof(FS_RaidNotification_Message, GameplayCue_11_48CA589243313EBFBCF4B4A6B57E2112) == 0x000010, "Member 'FS_RaidNotification_Message::GameplayCue_11_48CA589243313EBFBCF4B4A6B57E2112' has a wrong offset!");

}

