#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_Turning_Sequences

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_Turning_Sequences.S_Turning_Sequences
// 0x0020 (0x0020 - 0x0000)
struct FS_Turning_Sequences final
{
public:
	class UAnimSequence*                          Turn_L90_19_E3EFB76E4FD8E906143AA99BEC586060;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Turn_R90_20_E2C9482B43B55A2BE1BBE7AC3FAC122F;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Turn_L180_21_5DED070844EAFAD1FF96CA80B37185EE;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Turn_R180_22_36C544DD4E1078652651D285D21DCBBC;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_Turning_Sequences) == 0x000008, "Wrong alignment on FS_Turning_Sequences");
static_assert(sizeof(FS_Turning_Sequences) == 0x000020, "Wrong size on FS_Turning_Sequences");
static_assert(offsetof(FS_Turning_Sequences, Turn_L90_19_E3EFB76E4FD8E906143AA99BEC586060) == 0x000000, "Member 'FS_Turning_Sequences::Turn_L90_19_E3EFB76E4FD8E906143AA99BEC586060' has a wrong offset!");
static_assert(offsetof(FS_Turning_Sequences, Turn_R90_20_E2C9482B43B55A2BE1BBE7AC3FAC122F) == 0x000008, "Member 'FS_Turning_Sequences::Turn_R90_20_E2C9482B43B55A2BE1BBE7AC3FAC122F' has a wrong offset!");
static_assert(offsetof(FS_Turning_Sequences, Turn_L180_21_5DED070844EAFAD1FF96CA80B37185EE) == 0x000010, "Member 'FS_Turning_Sequences::Turn_L180_21_5DED070844EAFAD1FF96CA80B37185EE' has a wrong offset!");
static_assert(offsetof(FS_Turning_Sequences, Turn_R180_22_36C544DD4E1078652651D285D21DCBBC) == 0x000018, "Member 'FS_Turning_Sequences::Turn_R180_22_36C544DD4E1078652651D285D21DCBBC' has a wrong offset!");

}

