#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeatherZone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeatherZone.S_WeatherZone
// 0x0020 (0x0020 - 0x0000)
struct FS_WeatherZone final
{
public:
	class UBP_P2WeatherType_C*                    WeatherType_9_857565AB4D54CA636D46B3B828273F26;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectionWeight_11_3C8539A940E959A337AE8891D441E287; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TimeInterval_10_5CE8D37C4F2EFA7BC8375683E4ED9B20;  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeatherZone) == 0x000008, "Wrong alignment on FS_WeatherZone");
static_assert(sizeof(FS_WeatherZone) == 0x000020, "Wrong size on FS_WeatherZone");
static_assert(offsetof(FS_WeatherZone, WeatherType_9_857565AB4D54CA636D46B3B828273F26) == 0x000000, "Member 'FS_WeatherZone::WeatherType_9_857565AB4D54CA636D46B3B828273F26' has a wrong offset!");
static_assert(offsetof(FS_WeatherZone, SelectionWeight_11_3C8539A940E959A337AE8891D441E287) == 0x000008, "Member 'FS_WeatherZone::SelectionWeight_11_3C8539A940E959A337AE8891D441E287' has a wrong offset!");
static_assert(offsetof(FS_WeatherZone, TimeInterval_10_5CE8D37C4F2EFA7BC8375683E4ED9B20) == 0x000010, "Member 'FS_WeatherZone::TimeInterval_10_5CE8D37C4F2EFA7BC8375683E4ED9B20' has a wrong offset!");

}

