#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeatherParameterMapping

#include "Basic.hpp"

#include "E_Weather_RainTypes_structs.hpp"
#include "E_Weather_WindTypes_structs.hpp"
#include "E_Weather_FogTypes_structs.hpp"
#include "E_Weather_StormTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_WeatherParameterMapping.S_WeatherParameterMapping
// 0x0140 (0x0140 - 0x0000)
struct FS_WeatherParameterMapping final
{
public:
	TMap<E_Weather_RainTypes, double>             Rain_4_DBD58C0B4E64AFA1ED536594578F0960;           // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<E_Weather_WindTypes, double>             Wind_7_7AD3E5EA4E3CBAF8DCCA8C9F85A6DB27;           // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<E_Weather_FogTypes, double>              Fog_12_C3AE0A7E48231B95CB859C9F4D4EB6DA;           // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<E_Weather_StormTypes, double>            Storm_13_F928C31346E62D31DCC5DC8C290082E3;         // 0x00F0(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_WeatherParameterMapping) == 0x000008, "Wrong alignment on FS_WeatherParameterMapping");
static_assert(sizeof(FS_WeatherParameterMapping) == 0x000140, "Wrong size on FS_WeatherParameterMapping");
static_assert(offsetof(FS_WeatherParameterMapping, Rain_4_DBD58C0B4E64AFA1ED536594578F0960) == 0x000000, "Member 'FS_WeatherParameterMapping::Rain_4_DBD58C0B4E64AFA1ED536594578F0960' has a wrong offset!");
static_assert(offsetof(FS_WeatherParameterMapping, Wind_7_7AD3E5EA4E3CBAF8DCCA8C9F85A6DB27) == 0x000050, "Member 'FS_WeatherParameterMapping::Wind_7_7AD3E5EA4E3CBAF8DCCA8C9F85A6DB27' has a wrong offset!");
static_assert(offsetof(FS_WeatherParameterMapping, Fog_12_C3AE0A7E48231B95CB859C9F4D4EB6DA) == 0x0000A0, "Member 'FS_WeatherParameterMapping::Fog_12_C3AE0A7E48231B95CB859C9F4D4EB6DA' has a wrong offset!");
static_assert(offsetof(FS_WeatherParameterMapping, Storm_13_F928C31346E62D31DCC5DC8C290082E3) == 0x0000F0, "Member 'FS_WeatherParameterMapping::Storm_13_F928C31346E62D31DCC5DC8C290082E3' has a wrong offset!");

}

