#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_WeatherElementValues

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_WeatherElementValues.S_WeatherElementValues
// 0x0020 (0x0020 - 0x0000)
struct FS_WeatherElementValues final
{
public:
	double                                        Rain_25_5270DB9A46BADA943858A6A9353AB525;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wind_27_982935A84993F89F29A7D6B508AE5DF6;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_29_206FBDD544EFAEF01C9F9D87A8C23FC3;           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Storm_31_246F1042423BE58304D5FA8EAA72148D;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_WeatherElementValues) == 0x000008, "Wrong alignment on FS_WeatherElementValues");
static_assert(sizeof(FS_WeatherElementValues) == 0x000020, "Wrong size on FS_WeatherElementValues");
static_assert(offsetof(FS_WeatherElementValues, Rain_25_5270DB9A46BADA943858A6A9353AB525) == 0x000000, "Member 'FS_WeatherElementValues::Rain_25_5270DB9A46BADA943858A6A9353AB525' has a wrong offset!");
static_assert(offsetof(FS_WeatherElementValues, Wind_27_982935A84993F89F29A7D6B508AE5DF6) == 0x000008, "Member 'FS_WeatherElementValues::Wind_27_982935A84993F89F29A7D6B508AE5DF6' has a wrong offset!");
static_assert(offsetof(FS_WeatherElementValues, Fog_29_206FBDD544EFAEF01C9F9D87A8C23FC3) == 0x000010, "Member 'FS_WeatherElementValues::Fog_29_206FBDD544EFAEF01C9F9D87A8C23FC3' has a wrong offset!");
static_assert(offsetof(FS_WeatherElementValues, Storm_31_246F1042423BE58304D5FA8EAA72148D) == 0x000018, "Member 'FS_WeatherElementValues::Storm_31_246F1042423BE58304D5FA8EAA72148D' has a wrong offset!");

}

