#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_ZoneAtmos_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_ZoneAtmos_Settings.S_ZoneAtmos_Settings
// 0x0F90 (0x0F90 - 0x0000)
struct FS_ZoneAtmos_Settings final
{
public:
	double                                        DirLight_Intensity_3_19A3F6964CC6AB2CE4345BB70759BF99; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirLight_Temperature_10_6EB5975E44A8933C8DC0EFBEFA0EFED3; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirLight_IndirectLightingIntensity_55_ECF50BFE41A70004074FDF980A58B52E; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DirLight_VolumetricScatterIntensity_57_E310B99B414960BDFA494B8DE197DB81; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Skylight_Intensity_70_F82610254560262B0D0AC3BD1E0FABF8; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_Density_15_A347438C4A0BB6B5661F7181D9620EDD;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_HeightFalloff_18_0351ED2540645C905B9ABA9130E8B3F6; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Fog_InscatteringColor_11_5F07E75648296468B795AB9721E53A31; // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Fog_DirInscatteringColor_12_845C786E4CA663D5EE3C9E880DD27467; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_VolFogScatteringDistribution_23_B1B813824A8A2B9BE10AAFBCF8BA5E26; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_VolFogExtinctionScale_20_23B5C9C8433232C3514EA3BBBC851163; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_SecondFogDensity_59_820750204FD7569D181010B9F914AFA3; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_SecondFogHeightFallof_61_98C5E77F484C6DBF00D13ABEB34A01E8; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_SecondFogHeightOffset_63_00B7AAF34AB4810E112B73AA78322BD1; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PPV_Settings_26_557169094C3ADE7D63068D8521F975B8;  // 0x0080(0x0740)(Edit, BlueprintVisible)
	struct FPostProcessSettings                   PPV_Settings_Indoor_32_925A2BFF41EC41C285852D842D80DD50; // 0x07C0(0x0740)(Edit, BlueprintVisible)
	double                                        Sky_SpeedBox_48_4EB036CA4ACB633D6E9FA6A37BF8CAAA;  // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sky_SpeedNoise_49_0388A5784A552E57B302DE80A6CF7FF7; // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sky_SpeedTime_50_A62C47F946DA87867F139F9E344715E7; // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sky_ZoneBlend_52_97D3A00E445483FAD768BEA8BA453F0E; // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SkyAtmos_RayleighScattering_64_A4A07FE34FFE5F930913E6A72903DC91; // 0x0F20(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkyAtmos_MieScatteringScale_66_E75692AE483F73D6397B7D85E04DBDBD; // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkyAtmos_MieAbsorptionScale_68_8953CEBE4C6DF4A29DC45DAC3BA74EA5; // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SkyHDRI_Intensity_73_EEBC74064D4558AECF429298361870B5; // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_ZoneMinWetness_96_027CD71D41013BD320DF76A9798F8428; // 0x0F48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_ZoneWetnessCurve_111_F140818F451E29F0366244925A35ABC3; // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_GridOcclusion_Strength_97_E09A29DF4E662663097477AA96C1D2EF; // 0x0F58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_GridOcclusion_MinAttenuation_89_0CFFF1A446D2549F404DFE8065BE03C0; // 0x0F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness_GridOcclusion_Directional_110_0665BAD8422403F2C292CFADB9B85FF8; // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Wetness_Roughness_MulAddMin_99_C2FE6DA6466A448EE03E889BC8805188; // 0x0F70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureCube*                           SkyCubeMap_114_915CB7C9475EF7A5FB58DDB136C390D0;   // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FS_ZoneAtmos_Settings) == 0x000010, "Wrong alignment on FS_ZoneAtmos_Settings");
static_assert(sizeof(FS_ZoneAtmos_Settings) == 0x000F90, "Wrong size on FS_ZoneAtmos_Settings");
static_assert(offsetof(FS_ZoneAtmos_Settings, DirLight_Intensity_3_19A3F6964CC6AB2CE4345BB70759BF99) == 0x000000, "Member 'FS_ZoneAtmos_Settings::DirLight_Intensity_3_19A3F6964CC6AB2CE4345BB70759BF99' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, DirLight_Temperature_10_6EB5975E44A8933C8DC0EFBEFA0EFED3) == 0x000008, "Member 'FS_ZoneAtmos_Settings::DirLight_Temperature_10_6EB5975E44A8933C8DC0EFBEFA0EFED3' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, DirLight_IndirectLightingIntensity_55_ECF50BFE41A70004074FDF980A58B52E) == 0x000010, "Member 'FS_ZoneAtmos_Settings::DirLight_IndirectLightingIntensity_55_ECF50BFE41A70004074FDF980A58B52E' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, DirLight_VolumetricScatterIntensity_57_E310B99B414960BDFA494B8DE197DB81) == 0x000018, "Member 'FS_ZoneAtmos_Settings::DirLight_VolumetricScatterIntensity_57_E310B99B414960BDFA494B8DE197DB81' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Skylight_Intensity_70_F82610254560262B0D0AC3BD1E0FABF8) == 0x000020, "Member 'FS_ZoneAtmos_Settings::Skylight_Intensity_70_F82610254560262B0D0AC3BD1E0FABF8' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_Density_15_A347438C4A0BB6B5661F7181D9620EDD) == 0x000028, "Member 'FS_ZoneAtmos_Settings::Fog_Density_15_A347438C4A0BB6B5661F7181D9620EDD' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_HeightFalloff_18_0351ED2540645C905B9ABA9130E8B3F6) == 0x000030, "Member 'FS_ZoneAtmos_Settings::Fog_HeightFalloff_18_0351ED2540645C905B9ABA9130E8B3F6' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_InscatteringColor_11_5F07E75648296468B795AB9721E53A31) == 0x000038, "Member 'FS_ZoneAtmos_Settings::Fog_InscatteringColor_11_5F07E75648296468B795AB9721E53A31' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_DirInscatteringColor_12_845C786E4CA663D5EE3C9E880DD27467) == 0x000048, "Member 'FS_ZoneAtmos_Settings::Fog_DirInscatteringColor_12_845C786E4CA663D5EE3C9E880DD27467' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_VolFogScatteringDistribution_23_B1B813824A8A2B9BE10AAFBCF8BA5E26) == 0x000058, "Member 'FS_ZoneAtmos_Settings::Fog_VolFogScatteringDistribution_23_B1B813824A8A2B9BE10AAFBCF8BA5E26' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_VolFogExtinctionScale_20_23B5C9C8433232C3514EA3BBBC851163) == 0x000060, "Member 'FS_ZoneAtmos_Settings::Fog_VolFogExtinctionScale_20_23B5C9C8433232C3514EA3BBBC851163' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_SecondFogDensity_59_820750204FD7569D181010B9F914AFA3) == 0x000068, "Member 'FS_ZoneAtmos_Settings::Fog_SecondFogDensity_59_820750204FD7569D181010B9F914AFA3' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_SecondFogHeightFallof_61_98C5E77F484C6DBF00D13ABEB34A01E8) == 0x000070, "Member 'FS_ZoneAtmos_Settings::Fog_SecondFogHeightFallof_61_98C5E77F484C6DBF00D13ABEB34A01E8' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Fog_SecondFogHeightOffset_63_00B7AAF34AB4810E112B73AA78322BD1) == 0x000078, "Member 'FS_ZoneAtmos_Settings::Fog_SecondFogHeightOffset_63_00B7AAF34AB4810E112B73AA78322BD1' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, PPV_Settings_26_557169094C3ADE7D63068D8521F975B8) == 0x000080, "Member 'FS_ZoneAtmos_Settings::PPV_Settings_26_557169094C3ADE7D63068D8521F975B8' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, PPV_Settings_Indoor_32_925A2BFF41EC41C285852D842D80DD50) == 0x0007C0, "Member 'FS_ZoneAtmos_Settings::PPV_Settings_Indoor_32_925A2BFF41EC41C285852D842D80DD50' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Sky_SpeedBox_48_4EB036CA4ACB633D6E9FA6A37BF8CAAA) == 0x000F00, "Member 'FS_ZoneAtmos_Settings::Sky_SpeedBox_48_4EB036CA4ACB633D6E9FA6A37BF8CAAA' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Sky_SpeedNoise_49_0388A5784A552E57B302DE80A6CF7FF7) == 0x000F08, "Member 'FS_ZoneAtmos_Settings::Sky_SpeedNoise_49_0388A5784A552E57B302DE80A6CF7FF7' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Sky_SpeedTime_50_A62C47F946DA87867F139F9E344715E7) == 0x000F10, "Member 'FS_ZoneAtmos_Settings::Sky_SpeedTime_50_A62C47F946DA87867F139F9E344715E7' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Sky_ZoneBlend_52_97D3A00E445483FAD768BEA8BA453F0E) == 0x000F18, "Member 'FS_ZoneAtmos_Settings::Sky_ZoneBlend_52_97D3A00E445483FAD768BEA8BA453F0E' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, SkyAtmos_RayleighScattering_64_A4A07FE34FFE5F930913E6A72903DC91) == 0x000F20, "Member 'FS_ZoneAtmos_Settings::SkyAtmos_RayleighScattering_64_A4A07FE34FFE5F930913E6A72903DC91' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, SkyAtmos_MieScatteringScale_66_E75692AE483F73D6397B7D85E04DBDBD) == 0x000F30, "Member 'FS_ZoneAtmos_Settings::SkyAtmos_MieScatteringScale_66_E75692AE483F73D6397B7D85E04DBDBD' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, SkyAtmos_MieAbsorptionScale_68_8953CEBE4C6DF4A29DC45DAC3BA74EA5) == 0x000F38, "Member 'FS_ZoneAtmos_Settings::SkyAtmos_MieAbsorptionScale_68_8953CEBE4C6DF4A29DC45DAC3BA74EA5' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, SkyHDRI_Intensity_73_EEBC74064D4558AECF429298361870B5) == 0x000F40, "Member 'FS_ZoneAtmos_Settings::SkyHDRI_Intensity_73_EEBC74064D4558AECF429298361870B5' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_ZoneMinWetness_96_027CD71D41013BD320DF76A9798F8428) == 0x000F48, "Member 'FS_ZoneAtmos_Settings::Wetness_ZoneMinWetness_96_027CD71D41013BD320DF76A9798F8428' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_ZoneWetnessCurve_111_F140818F451E29F0366244925A35ABC3) == 0x000F50, "Member 'FS_ZoneAtmos_Settings::Wetness_ZoneWetnessCurve_111_F140818F451E29F0366244925A35ABC3' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_GridOcclusion_Strength_97_E09A29DF4E662663097477AA96C1D2EF) == 0x000F58, "Member 'FS_ZoneAtmos_Settings::Wetness_GridOcclusion_Strength_97_E09A29DF4E662663097477AA96C1D2EF' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_GridOcclusion_MinAttenuation_89_0CFFF1A446D2549F404DFE8065BE03C0) == 0x000F60, "Member 'FS_ZoneAtmos_Settings::Wetness_GridOcclusion_MinAttenuation_89_0CFFF1A446D2549F404DFE8065BE03C0' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_GridOcclusion_Directional_110_0665BAD8422403F2C292CFADB9B85FF8) == 0x000F68, "Member 'FS_ZoneAtmos_Settings::Wetness_GridOcclusion_Directional_110_0665BAD8422403F2C292CFADB9B85FF8' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, Wetness_Roughness_MulAddMin_99_C2FE6DA6466A448EE03E889BC8805188) == 0x000F70, "Member 'FS_ZoneAtmos_Settings::Wetness_Roughness_MulAddMin_99_C2FE6DA6466A448EE03E889BC8805188' has a wrong offset!");
static_assert(offsetof(FS_ZoneAtmos_Settings, SkyCubeMap_114_915CB7C9475EF7A5FB58DDB136C390D0) == 0x000F88, "Member 'FS_ZoneAtmos_Settings::SkyCubeMap_114_915CB7C9475EF7A5FB58DDB136C390D0' has a wrong offset!");

}

