#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sentry

#include "Basic.hpp"

#include "Sentry_structs.hpp"


namespace SDK::Params
{

// Function Sentry.SentryAttachment.InitializeWithData
// 0x0030 (0x0030 - 0x0000)
struct SentryAttachment_InitializeWithData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_InitializeWithData) == 0x000008, "Wrong alignment on SentryAttachment_InitializeWithData");
static_assert(sizeof(SentryAttachment_InitializeWithData) == 0x000030, "Wrong size on SentryAttachment_InitializeWithData");
static_assert(offsetof(SentryAttachment_InitializeWithData, Data) == 0x000000, "Member 'SentryAttachment_InitializeWithData::Data' has a wrong offset!");
static_assert(offsetof(SentryAttachment_InitializeWithData, Filename) == 0x000010, "Member 'SentryAttachment_InitializeWithData::Filename' has a wrong offset!");
static_assert(offsetof(SentryAttachment_InitializeWithData, ContentType) == 0x000020, "Member 'SentryAttachment_InitializeWithData::ContentType' has a wrong offset!");

// Function Sentry.SentryAttachment.InitializeWithPath
// 0x0030 (0x0030 - 0x0000)
struct SentryAttachment_InitializeWithPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_InitializeWithPath) == 0x000008, "Wrong alignment on SentryAttachment_InitializeWithPath");
static_assert(sizeof(SentryAttachment_InitializeWithPath) == 0x000030, "Wrong size on SentryAttachment_InitializeWithPath");
static_assert(offsetof(SentryAttachment_InitializeWithPath, Path) == 0x000000, "Member 'SentryAttachment_InitializeWithPath::Path' has a wrong offset!");
static_assert(offsetof(SentryAttachment_InitializeWithPath, Filename) == 0x000010, "Member 'SentryAttachment_InitializeWithPath::Filename' has a wrong offset!");
static_assert(offsetof(SentryAttachment_InitializeWithPath, ContentType) == 0x000020, "Member 'SentryAttachment_InitializeWithPath::ContentType' has a wrong offset!");

// Function Sentry.SentryAttachment.GetContentType
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetContentType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_GetContentType) == 0x000008, "Wrong alignment on SentryAttachment_GetContentType");
static_assert(sizeof(SentryAttachment_GetContentType) == 0x000010, "Wrong size on SentryAttachment_GetContentType");
static_assert(offsetof(SentryAttachment_GetContentType, ReturnValue) == 0x000000, "Member 'SentryAttachment_GetContentType::ReturnValue' has a wrong offset!");

// Function Sentry.SentryAttachment.GetData
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetData final
{
public:
	TArray<uint8>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_GetData) == 0x000008, "Wrong alignment on SentryAttachment_GetData");
static_assert(sizeof(SentryAttachment_GetData) == 0x000010, "Wrong size on SentryAttachment_GetData");
static_assert(offsetof(SentryAttachment_GetData, ReturnValue) == 0x000000, "Member 'SentryAttachment_GetData::ReturnValue' has a wrong offset!");

// Function Sentry.SentryAttachment.GetFilename
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetFilename final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_GetFilename) == 0x000008, "Wrong alignment on SentryAttachment_GetFilename");
static_assert(sizeof(SentryAttachment_GetFilename) == 0x000010, "Wrong size on SentryAttachment_GetFilename");
static_assert(offsetof(SentryAttachment_GetFilename, ReturnValue) == 0x000000, "Member 'SentryAttachment_GetFilename::ReturnValue' has a wrong offset!");

// Function Sentry.SentryAttachment.GetPath
// 0x0010 (0x0010 - 0x0000)
struct SentryAttachment_GetPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryAttachment_GetPath) == 0x000008, "Wrong alignment on SentryAttachment_GetPath");
static_assert(sizeof(SentryAttachment_GetPath) == 0x000010, "Wrong size on SentryAttachment_GetPath");
static_assert(offsetof(SentryAttachment_GetPath, ReturnValue) == 0x000000, "Member 'SentryAttachment_GetPath::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBeforeBreadcrumbHandler.HandleBeforeBreadcrumb
// 0x0018 (0x0018 - 0x0000)
struct SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb final
{
public:
	class USentryBreadcrumb*                      Breadcrumb;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryHint*                            Hint;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryBreadcrumb*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb) == 0x000008, "Wrong alignment on SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb");
static_assert(sizeof(SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb) == 0x000018, "Wrong size on SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb");
static_assert(offsetof(SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb, Breadcrumb) == 0x000000, "Member 'SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb::Breadcrumb' has a wrong offset!");
static_assert(offsetof(SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb, Hint) == 0x000008, "Member 'SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb::Hint' has a wrong offset!");
static_assert(offsetof(SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb, ReturnValue) == 0x000010, "Member 'SentryBeforeBreadcrumbHandler_HandleBeforeBreadcrumb::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBeforeLogHandler.HandleBeforeLog
// 0x0010 (0x0010 - 0x0000)
struct SentryBeforeLogHandler_HandleBeforeLog final
{
public:
	class USentryLog*                             LogData;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryLog*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBeforeLogHandler_HandleBeforeLog) == 0x000008, "Wrong alignment on SentryBeforeLogHandler_HandleBeforeLog");
static_assert(sizeof(SentryBeforeLogHandler_HandleBeforeLog) == 0x000010, "Wrong size on SentryBeforeLogHandler_HandleBeforeLog");
static_assert(offsetof(SentryBeforeLogHandler_HandleBeforeLog, LogData) == 0x000000, "Member 'SentryBeforeLogHandler_HandleBeforeLog::LogData' has a wrong offset!");
static_assert(offsetof(SentryBeforeLogHandler_HandleBeforeLog, ReturnValue) == 0x000008, "Member 'SentryBeforeLogHandler_HandleBeforeLog::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBeforeSendHandler.HandleBeforeSend
// 0x0018 (0x0018 - 0x0000)
struct SentryBeforeSendHandler_HandleBeforeSend final
{
public:
	class USentryEvent*                           Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryHint*                            Hint;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryEvent*                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBeforeSendHandler_HandleBeforeSend) == 0x000008, "Wrong alignment on SentryBeforeSendHandler_HandleBeforeSend");
static_assert(sizeof(SentryBeforeSendHandler_HandleBeforeSend) == 0x000018, "Wrong size on SentryBeforeSendHandler_HandleBeforeSend");
static_assert(offsetof(SentryBeforeSendHandler_HandleBeforeSend, Event) == 0x000000, "Member 'SentryBeforeSendHandler_HandleBeforeSend::Event' has a wrong offset!");
static_assert(offsetof(SentryBeforeSendHandler_HandleBeforeSend, Hint) == 0x000008, "Member 'SentryBeforeSendHandler_HandleBeforeSend::Hint' has a wrong offset!");
static_assert(offsetof(SentryBeforeSendHandler_HandleBeforeSend, ReturnValue) == 0x000010, "Member 'SentryBeforeSendHandler_HandleBeforeSend::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.SetCategory
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetCategory final
{
public:
	class FString                                 Category;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_SetCategory) == 0x000008, "Wrong alignment on SentryBreadcrumb_SetCategory");
static_assert(sizeof(SentryBreadcrumb_SetCategory) == 0x000010, "Wrong size on SentryBreadcrumb_SetCategory");
static_assert(offsetof(SentryBreadcrumb_SetCategory, Category) == 0x000000, "Member 'SentryBreadcrumb_SetCategory::Category' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.SetData
// 0x0050 (0x0050 - 0x0000)
struct SentryBreadcrumb_SetData final
{
public:
	TMap<class FString, struct FSentryVariant>    Data;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_SetData) == 0x000008, "Wrong alignment on SentryBreadcrumb_SetData");
static_assert(sizeof(SentryBreadcrumb_SetData) == 0x000050, "Wrong size on SentryBreadcrumb_SetData");
static_assert(offsetof(SentryBreadcrumb_SetData, Data) == 0x000000, "Member 'SentryBreadcrumb_SetData::Data' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryBreadcrumb_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_SetLevel) == 0x000001, "Wrong alignment on SentryBreadcrumb_SetLevel");
static_assert(sizeof(SentryBreadcrumb_SetLevel) == 0x000001, "Wrong size on SentryBreadcrumb_SetLevel");
static_assert(offsetof(SentryBreadcrumb_SetLevel, Level) == 0x000000, "Member 'SentryBreadcrumb_SetLevel::Level' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.SetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_SetMessage) == 0x000008, "Wrong alignment on SentryBreadcrumb_SetMessage");
static_assert(sizeof(SentryBreadcrumb_SetMessage) == 0x000010, "Wrong size on SentryBreadcrumb_SetMessage");
static_assert(offsetof(SentryBreadcrumb_SetMessage, Message) == 0x000000, "Member 'SentryBreadcrumb_SetMessage::Message' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.SetType
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_SetType final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_SetType) == 0x000008, "Wrong alignment on SentryBreadcrumb_SetType");
static_assert(sizeof(SentryBreadcrumb_SetType) == 0x000010, "Wrong size on SentryBreadcrumb_SetType");
static_assert(offsetof(SentryBreadcrumb_SetType, Type) == 0x000000, "Member 'SentryBreadcrumb_SetType::Type' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.GetCategory
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetCategory final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_GetCategory) == 0x000008, "Wrong alignment on SentryBreadcrumb_GetCategory");
static_assert(sizeof(SentryBreadcrumb_GetCategory) == 0x000010, "Wrong size on SentryBreadcrumb_GetCategory");
static_assert(offsetof(SentryBreadcrumb_GetCategory, ReturnValue) == 0x000000, "Member 'SentryBreadcrumb_GetCategory::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.GetData
// 0x0050 (0x0050 - 0x0000)
struct SentryBreadcrumb_GetData final
{
public:
	TMap<class FString, struct FSentryVariant>    ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_GetData) == 0x000008, "Wrong alignment on SentryBreadcrumb_GetData");
static_assert(sizeof(SentryBreadcrumb_GetData) == 0x000050, "Wrong size on SentryBreadcrumb_GetData");
static_assert(offsetof(SentryBreadcrumb_GetData, ReturnValue) == 0x000000, "Member 'SentryBreadcrumb_GetData::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.GetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryBreadcrumb_GetLevel final
{
public:
	ESentryLevel                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_GetLevel) == 0x000001, "Wrong alignment on SentryBreadcrumb_GetLevel");
static_assert(sizeof(SentryBreadcrumb_GetLevel) == 0x000001, "Wrong size on SentryBreadcrumb_GetLevel");
static_assert(offsetof(SentryBreadcrumb_GetLevel, ReturnValue) == 0x000000, "Member 'SentryBreadcrumb_GetLevel::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.GetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_GetMessage) == 0x000008, "Wrong alignment on SentryBreadcrumb_GetMessage");
static_assert(sizeof(SentryBreadcrumb_GetMessage) == 0x000010, "Wrong size on SentryBreadcrumb_GetMessage");
static_assert(offsetof(SentryBreadcrumb_GetMessage, ReturnValue) == 0x000000, "Member 'SentryBreadcrumb_GetMessage::ReturnValue' has a wrong offset!");

// Function Sentry.SentryBreadcrumb.GetType
// 0x0010 (0x0010 - 0x0000)
struct SentryBreadcrumb_GetType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryBreadcrumb_GetType) == 0x000008, "Wrong alignment on SentryBreadcrumb_GetType");
static_assert(sizeof(SentryBreadcrumb_GetType) == 0x000010, "Wrong size on SentryBreadcrumb_GetType");
static_assert(offsetof(SentryBreadcrumb_GetType, ReturnValue) == 0x000000, "Member 'SentryBreadcrumb_GetType::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.RemoveContext
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_RemoveContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_RemoveContext) == 0x000008, "Wrong alignment on SentryEvent_RemoveContext");
static_assert(sizeof(SentryEvent_RemoveContext) == 0x000010, "Wrong size on SentryEvent_RemoveContext");
static_assert(offsetof(SentryEvent_RemoveContext, Key) == 0x000000, "Member 'SentryEvent_RemoveContext::Key' has a wrong offset!");

// Function Sentry.SentryEvent.RemoveExtra
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_RemoveExtra final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_RemoveExtra) == 0x000008, "Wrong alignment on SentryEvent_RemoveExtra");
static_assert(sizeof(SentryEvent_RemoveExtra) == 0x000010, "Wrong size on SentryEvent_RemoveExtra");
static_assert(offsetof(SentryEvent_RemoveExtra, Key) == 0x000000, "Member 'SentryEvent_RemoveExtra::Key' has a wrong offset!");

// Function Sentry.SentryEvent.RemoveTag
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_RemoveTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_RemoveTag) == 0x000008, "Wrong alignment on SentryEvent_RemoveTag");
static_assert(sizeof(SentryEvent_RemoveTag) == 0x000010, "Wrong size on SentryEvent_RemoveTag");
static_assert(offsetof(SentryEvent_RemoveTag, Key) == 0x000000, "Member 'SentryEvent_RemoveTag::Key' has a wrong offset!");

// Function Sentry.SentryEvent.SetContext
// 0x0060 (0x0060 - 0x0000)
struct SentryEvent_SetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSentryVariant>    Values;                                            // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetContext) == 0x000008, "Wrong alignment on SentryEvent_SetContext");
static_assert(sizeof(SentryEvent_SetContext) == 0x000060, "Wrong size on SentryEvent_SetContext");
static_assert(offsetof(SentryEvent_SetContext, Key) == 0x000000, "Member 'SentryEvent_SetContext::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_SetContext, Values) == 0x000010, "Member 'SentryEvent_SetContext::Values' has a wrong offset!");

// Function Sentry.SentryEvent.SetExtra
// 0x0030 (0x0030 - 0x0000)
struct SentryEvent_SetExtra final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSentryVariant                         Value;                                             // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetExtra) == 0x000008, "Wrong alignment on SentryEvent_SetExtra");
static_assert(sizeof(SentryEvent_SetExtra) == 0x000030, "Wrong size on SentryEvent_SetExtra");
static_assert(offsetof(SentryEvent_SetExtra, Key) == 0x000000, "Member 'SentryEvent_SetExtra::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_SetExtra, Value) == 0x000010, "Member 'SentryEvent_SetExtra::Value' has a wrong offset!");

// Function Sentry.SentryEvent.SetExtras
// 0x0050 (0x0050 - 0x0000)
struct SentryEvent_SetExtras final
{
public:
	TMap<class FString, struct FSentryVariant>    Extras;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetExtras) == 0x000008, "Wrong alignment on SentryEvent_SetExtras");
static_assert(sizeof(SentryEvent_SetExtras) == 0x000050, "Wrong size on SentryEvent_SetExtras");
static_assert(offsetof(SentryEvent_SetExtras, Extras) == 0x000000, "Member 'SentryEvent_SetExtras::Extras' has a wrong offset!");

// Function Sentry.SentryEvent.SetFingerprint
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_SetFingerprint final
{
public:
	TArray<class FString>                         Fingerprint;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetFingerprint) == 0x000008, "Wrong alignment on SentryEvent_SetFingerprint");
static_assert(sizeof(SentryEvent_SetFingerprint) == 0x000010, "Wrong size on SentryEvent_SetFingerprint");
static_assert(offsetof(SentryEvent_SetFingerprint, Fingerprint) == 0x000000, "Member 'SentryEvent_SetFingerprint::Fingerprint' has a wrong offset!");

// Function Sentry.SentryEvent.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_SetLevel final
{
public:
	ESentryLevel                                  Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetLevel) == 0x000001, "Wrong alignment on SentryEvent_SetLevel");
static_assert(sizeof(SentryEvent_SetLevel) == 0x000001, "Wrong size on SentryEvent_SetLevel");
static_assert(offsetof(SentryEvent_SetLevel, Level) == 0x000000, "Member 'SentryEvent_SetLevel::Level' has a wrong offset!");

// Function Sentry.SentryEvent.SetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetMessage) == 0x000008, "Wrong alignment on SentryEvent_SetMessage");
static_assert(sizeof(SentryEvent_SetMessage) == 0x000010, "Wrong size on SentryEvent_SetMessage");
static_assert(offsetof(SentryEvent_SetMessage, Message) == 0x000000, "Member 'SentryEvent_SetMessage::Message' has a wrong offset!");

// Function Sentry.SentryEvent.SetTag
// 0x0020 (0x0020 - 0x0000)
struct SentryEvent_SetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetTag) == 0x000008, "Wrong alignment on SentryEvent_SetTag");
static_assert(sizeof(SentryEvent_SetTag) == 0x000020, "Wrong size on SentryEvent_SetTag");
static_assert(offsetof(SentryEvent_SetTag, Key) == 0x000000, "Member 'SentryEvent_SetTag::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_SetTag, Value) == 0x000010, "Member 'SentryEvent_SetTag::Value' has a wrong offset!");

// Function Sentry.SentryEvent.SetTags
// 0x0050 (0x0050 - 0x0000)
struct SentryEvent_SetTags final
{
public:
	TMap<class FString, class FString>            Tags;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_SetTags) == 0x000008, "Wrong alignment on SentryEvent_SetTags");
static_assert(sizeof(SentryEvent_SetTags) == 0x000050, "Wrong size on SentryEvent_SetTags");
static_assert(offsetof(SentryEvent_SetTags, Tags) == 0x000000, "Member 'SentryEvent_SetTags::Tags' has a wrong offset!");

// Function Sentry.SentryEvent.GetContext
// 0x0060 (0x0060 - 0x0000)
struct SentryEvent_GetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSentryVariant>    ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetContext) == 0x000008, "Wrong alignment on SentryEvent_GetContext");
static_assert(sizeof(SentryEvent_GetContext) == 0x000060, "Wrong size on SentryEvent_GetContext");
static_assert(offsetof(SentryEvent_GetContext, Key) == 0x000000, "Member 'SentryEvent_GetContext::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_GetContext, ReturnValue) == 0x000010, "Member 'SentryEvent_GetContext::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetExtra
// 0x0030 (0x0030 - 0x0000)
struct SentryEvent_GetExtra final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSentryVariant                         ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetExtra) == 0x000008, "Wrong alignment on SentryEvent_GetExtra");
static_assert(sizeof(SentryEvent_GetExtra) == 0x000030, "Wrong size on SentryEvent_GetExtra");
static_assert(offsetof(SentryEvent_GetExtra, Key) == 0x000000, "Member 'SentryEvent_GetExtra::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_GetExtra, ReturnValue) == 0x000010, "Member 'SentryEvent_GetExtra::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetExtras
// 0x0050 (0x0050 - 0x0000)
struct SentryEvent_GetExtras final
{
public:
	TMap<class FString, struct FSentryVariant>    ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetExtras) == 0x000008, "Wrong alignment on SentryEvent_GetExtras");
static_assert(sizeof(SentryEvent_GetExtras) == 0x000050, "Wrong size on SentryEvent_GetExtras");
static_assert(offsetof(SentryEvent_GetExtras, ReturnValue) == 0x000000, "Member 'SentryEvent_GetExtras::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetFingerprint
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_GetFingerprint final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetFingerprint) == 0x000008, "Wrong alignment on SentryEvent_GetFingerprint");
static_assert(sizeof(SentryEvent_GetFingerprint) == 0x000010, "Wrong size on SentryEvent_GetFingerprint");
static_assert(offsetof(SentryEvent_GetFingerprint, ReturnValue) == 0x000000, "Member 'SentryEvent_GetFingerprint::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetId
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_GetId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetId) == 0x000008, "Wrong alignment on SentryEvent_GetId");
static_assert(sizeof(SentryEvent_GetId) == 0x000010, "Wrong size on SentryEvent_GetId");
static_assert(offsetof(SentryEvent_GetId, ReturnValue) == 0x000000, "Member 'SentryEvent_GetId::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_GetLevel final
{
public:
	ESentryLevel                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetLevel) == 0x000001, "Wrong alignment on SentryEvent_GetLevel");
static_assert(sizeof(SentryEvent_GetLevel) == 0x000001, "Wrong size on SentryEvent_GetLevel");
static_assert(offsetof(SentryEvent_GetLevel, ReturnValue) == 0x000000, "Member 'SentryEvent_GetLevel::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryEvent_GetMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetMessage) == 0x000008, "Wrong alignment on SentryEvent_GetMessage");
static_assert(sizeof(SentryEvent_GetMessage) == 0x000010, "Wrong size on SentryEvent_GetMessage");
static_assert(offsetof(SentryEvent_GetMessage, ReturnValue) == 0x000000, "Member 'SentryEvent_GetMessage::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetTag
// 0x0020 (0x0020 - 0x0000)
struct SentryEvent_GetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetTag) == 0x000008, "Wrong alignment on SentryEvent_GetTag");
static_assert(sizeof(SentryEvent_GetTag) == 0x000020, "Wrong size on SentryEvent_GetTag");
static_assert(offsetof(SentryEvent_GetTag, Key) == 0x000000, "Member 'SentryEvent_GetTag::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_GetTag, ReturnValue) == 0x000010, "Member 'SentryEvent_GetTag::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.GetTags
// 0x0050 (0x0050 - 0x0000)
struct SentryEvent_GetTags final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_GetTags) == 0x000008, "Wrong alignment on SentryEvent_GetTags");
static_assert(sizeof(SentryEvent_GetTags) == 0x000050, "Wrong size on SentryEvent_GetTags");
static_assert(offsetof(SentryEvent_GetTags, ReturnValue) == 0x000000, "Member 'SentryEvent_GetTags::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.IsAnr
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_IsAnr final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_IsAnr) == 0x000001, "Wrong alignment on SentryEvent_IsAnr");
static_assert(sizeof(SentryEvent_IsAnr) == 0x000001, "Wrong size on SentryEvent_IsAnr");
static_assert(offsetof(SentryEvent_IsAnr, ReturnValue) == 0x000000, "Member 'SentryEvent_IsAnr::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.IsCrash
// 0x0001 (0x0001 - 0x0000)
struct SentryEvent_IsCrash final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryEvent_IsCrash) == 0x000001, "Wrong alignment on SentryEvent_IsCrash");
static_assert(sizeof(SentryEvent_IsCrash) == 0x000001, "Wrong size on SentryEvent_IsCrash");
static_assert(offsetof(SentryEvent_IsCrash, ReturnValue) == 0x000000, "Member 'SentryEvent_IsCrash::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.TryGetContext
// 0x0068 (0x0068 - 0x0000)
struct SentryEvent_TryGetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSentryVariant>    Value;                                             // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SentryEvent_TryGetContext) == 0x000008, "Wrong alignment on SentryEvent_TryGetContext");
static_assert(sizeof(SentryEvent_TryGetContext) == 0x000068, "Wrong size on SentryEvent_TryGetContext");
static_assert(offsetof(SentryEvent_TryGetContext, Key) == 0x000000, "Member 'SentryEvent_TryGetContext::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetContext, Value) == 0x000010, "Member 'SentryEvent_TryGetContext::Value' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetContext, ReturnValue) == 0x000060, "Member 'SentryEvent_TryGetContext::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.TryGetExtra
// 0x0038 (0x0038 - 0x0000)
struct SentryEvent_TryGetExtra final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSentryVariant                         Value;                                             // 0x0010(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SentryEvent_TryGetExtra) == 0x000008, "Wrong alignment on SentryEvent_TryGetExtra");
static_assert(sizeof(SentryEvent_TryGetExtra) == 0x000038, "Wrong size on SentryEvent_TryGetExtra");
static_assert(offsetof(SentryEvent_TryGetExtra, Key) == 0x000000, "Member 'SentryEvent_TryGetExtra::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetExtra, Value) == 0x000010, "Member 'SentryEvent_TryGetExtra::Value' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetExtra, ReturnValue) == 0x000030, "Member 'SentryEvent_TryGetExtra::ReturnValue' has a wrong offset!");

// Function Sentry.SentryEvent.TryGetTag
// 0x0028 (0x0028 - 0x0000)
struct SentryEvent_TryGetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SentryEvent_TryGetTag) == 0x000008, "Wrong alignment on SentryEvent_TryGetTag");
static_assert(sizeof(SentryEvent_TryGetTag) == 0x000028, "Wrong size on SentryEvent_TryGetTag");
static_assert(offsetof(SentryEvent_TryGetTag, Key) == 0x000000, "Member 'SentryEvent_TryGetTag::Key' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetTag, Value) == 0x000010, "Member 'SentryEvent_TryGetTag::Value' has a wrong offset!");
static_assert(offsetof(SentryEvent_TryGetTag, ReturnValue) == 0x000020, "Member 'SentryEvent_TryGetTag::ReturnValue' has a wrong offset!");

// Function Sentry.SentryFeedback.Initialize
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_Initialize final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_Initialize) == 0x000008, "Wrong alignment on SentryFeedback_Initialize");
static_assert(sizeof(SentryFeedback_Initialize) == 0x000010, "Wrong size on SentryFeedback_Initialize");
static_assert(offsetof(SentryFeedback_Initialize, Message) == 0x000000, "Member 'SentryFeedback_Initialize::Message' has a wrong offset!");

// Function Sentry.SentryFeedback.SetAssociatedEvent
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_SetAssociatedEvent final
{
public:
	class FString                                 EventId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_SetAssociatedEvent) == 0x000008, "Wrong alignment on SentryFeedback_SetAssociatedEvent");
static_assert(sizeof(SentryFeedback_SetAssociatedEvent) == 0x000010, "Wrong size on SentryFeedback_SetAssociatedEvent");
static_assert(offsetof(SentryFeedback_SetAssociatedEvent, EventId) == 0x000000, "Member 'SentryFeedback_SetAssociatedEvent::EventId' has a wrong offset!");

// Function Sentry.SentryFeedback.SetContactEmail
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_SetContactEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_SetContactEmail) == 0x000008, "Wrong alignment on SentryFeedback_SetContactEmail");
static_assert(sizeof(SentryFeedback_SetContactEmail) == 0x000010, "Wrong size on SentryFeedback_SetContactEmail");
static_assert(offsetof(SentryFeedback_SetContactEmail, Email) == 0x000000, "Member 'SentryFeedback_SetContactEmail::Email' has a wrong offset!");

// Function Sentry.SentryFeedback.SetName
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_SetName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_SetName) == 0x000008, "Wrong alignment on SentryFeedback_SetName");
static_assert(sizeof(SentryFeedback_SetName) == 0x000010, "Wrong size on SentryFeedback_SetName");
static_assert(offsetof(SentryFeedback_SetName, Name_0) == 0x000000, "Member 'SentryFeedback_SetName::Name_0' has a wrong offset!");

// Function Sentry.SentryFeedback.GetAssociatedEvent
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_GetAssociatedEvent final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_GetAssociatedEvent) == 0x000008, "Wrong alignment on SentryFeedback_GetAssociatedEvent");
static_assert(sizeof(SentryFeedback_GetAssociatedEvent) == 0x000010, "Wrong size on SentryFeedback_GetAssociatedEvent");
static_assert(offsetof(SentryFeedback_GetAssociatedEvent, ReturnValue) == 0x000000, "Member 'SentryFeedback_GetAssociatedEvent::ReturnValue' has a wrong offset!");

// Function Sentry.SentryFeedback.GetContactEmail
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_GetContactEmail final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_GetContactEmail) == 0x000008, "Wrong alignment on SentryFeedback_GetContactEmail");
static_assert(sizeof(SentryFeedback_GetContactEmail) == 0x000010, "Wrong size on SentryFeedback_GetContactEmail");
static_assert(offsetof(SentryFeedback_GetContactEmail, ReturnValue) == 0x000000, "Member 'SentryFeedback_GetContactEmail::ReturnValue' has a wrong offset!");

// Function Sentry.SentryFeedback.GetMessage
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_GetMessage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_GetMessage) == 0x000008, "Wrong alignment on SentryFeedback_GetMessage");
static_assert(sizeof(SentryFeedback_GetMessage) == 0x000010, "Wrong size on SentryFeedback_GetMessage");
static_assert(offsetof(SentryFeedback_GetMessage, ReturnValue) == 0x000000, "Member 'SentryFeedback_GetMessage::ReturnValue' has a wrong offset!");

// Function Sentry.SentryFeedback.GetName
// 0x0010 (0x0010 - 0x0000)
struct SentryFeedback_GetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryFeedback_GetName) == 0x000008, "Wrong alignment on SentryFeedback_GetName");
static_assert(sizeof(SentryFeedback_GetName) == 0x000010, "Wrong size on SentryFeedback_GetName");
static_assert(offsetof(SentryFeedback_GetName, ReturnValue) == 0x000000, "Member 'SentryFeedback_GetName::ReturnValue' has a wrong offset!");

// Function Sentry.SentryHint.AddAttachment
// 0x0008 (0x0008 - 0x0000)
struct SentryHint_AddAttachment final
{
public:
	class USentryAttachment*                      Attachment;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryHint_AddAttachment) == 0x000008, "Wrong alignment on SentryHint_AddAttachment");
static_assert(sizeof(SentryHint_AddAttachment) == 0x000008, "Wrong size on SentryHint_AddAttachment");
static_assert(offsetof(SentryHint_AddAttachment, Attachment) == 0x000000, "Member 'SentryHint_AddAttachment::Attachment' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryAttachmentWithData
// 0x0038 (0x0038 - 0x0000)
struct SentryLibrary_CreateSentryAttachmentWithData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryAttachment*                      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryAttachmentWithData) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryAttachmentWithData");
static_assert(sizeof(SentryLibrary_CreateSentryAttachmentWithData) == 0x000038, "Wrong size on SentryLibrary_CreateSentryAttachmentWithData");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithData, Data) == 0x000000, "Member 'SentryLibrary_CreateSentryAttachmentWithData::Data' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithData, Filename) == 0x000010, "Member 'SentryLibrary_CreateSentryAttachmentWithData::Filename' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithData, ContentType) == 0x000020, "Member 'SentryLibrary_CreateSentryAttachmentWithData::ContentType' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithData, ReturnValue) == 0x000030, "Member 'SentryLibrary_CreateSentryAttachmentWithData::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryAttachmentWithPath
// 0x0038 (0x0038 - 0x0000)
struct SentryLibrary_CreateSentryAttachmentWithPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentType;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryAttachment*                      ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryAttachmentWithPath) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryAttachmentWithPath");
static_assert(sizeof(SentryLibrary_CreateSentryAttachmentWithPath) == 0x000038, "Wrong size on SentryLibrary_CreateSentryAttachmentWithPath");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithPath, Path) == 0x000000, "Member 'SentryLibrary_CreateSentryAttachmentWithPath::Path' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithPath, Filename) == 0x000010, "Member 'SentryLibrary_CreateSentryAttachmentWithPath::Filename' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithPath, ContentType) == 0x000020, "Member 'SentryLibrary_CreateSentryAttachmentWithPath::ContentType' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryAttachmentWithPath, ReturnValue) == 0x000030, "Member 'SentryLibrary_CreateSentryAttachmentWithPath::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryBreadcrumb
// 0x0090 (0x0090 - 0x0000)
struct SentryLibrary_CreateSentryBreadcrumb final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Category;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSentryVariant>    Data;                                              // 0x0030(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USentryBreadcrumb*                      ReturnValue;                                       // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryBreadcrumb) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryBreadcrumb");
static_assert(sizeof(SentryLibrary_CreateSentryBreadcrumb) == 0x000090, "Wrong size on SentryLibrary_CreateSentryBreadcrumb");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, Message) == 0x000000, "Member 'SentryLibrary_CreateSentryBreadcrumb::Message' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, Type) == 0x000010, "Member 'SentryLibrary_CreateSentryBreadcrumb::Type' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, Category) == 0x000020, "Member 'SentryLibrary_CreateSentryBreadcrumb::Category' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, Data) == 0x000030, "Member 'SentryLibrary_CreateSentryBreadcrumb::Data' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, Level) == 0x000080, "Member 'SentryLibrary_CreateSentryBreadcrumb::Level' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryBreadcrumb, ReturnValue) == 0x000088, "Member 'SentryLibrary_CreateSentryBreadcrumb::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryEvent
// 0x0020 (0x0020 - 0x0000)
struct SentryLibrary_CreateSentryEvent final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryLevel                                  Level;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USentryEvent*                           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryEvent) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryEvent");
static_assert(sizeof(SentryLibrary_CreateSentryEvent) == 0x000020, "Wrong size on SentryLibrary_CreateSentryEvent");
static_assert(offsetof(SentryLibrary_CreateSentryEvent, Message) == 0x000000, "Member 'SentryLibrary_CreateSentryEvent::Message' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryEvent, Level) == 0x000010, "Member 'SentryLibrary_CreateSentryEvent::Level' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryEvent, ReturnValue) == 0x000018, "Member 'SentryLibrary_CreateSentryEvent::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryFeedback
// 0x0048 (0x0048 - 0x0000)
struct SentryLibrary_CreateSentryFeedback final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventId;                                           // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryFeedback*                        ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryFeedback) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryFeedback");
static_assert(sizeof(SentryLibrary_CreateSentryFeedback) == 0x000048, "Wrong size on SentryLibrary_CreateSentryFeedback");
static_assert(offsetof(SentryLibrary_CreateSentryFeedback, Message) == 0x000000, "Member 'SentryLibrary_CreateSentryFeedback::Message' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryFeedback, Name_0) == 0x000010, "Member 'SentryLibrary_CreateSentryFeedback::Name_0' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryFeedback, Email) == 0x000020, "Member 'SentryLibrary_CreateSentryFeedback::Email' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryFeedback, EventId) == 0x000030, "Member 'SentryLibrary_CreateSentryFeedback::EventId' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryFeedback, ReturnValue) == 0x000040, "Member 'SentryLibrary_CreateSentryFeedback::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryTransactionContext
// 0x0028 (0x0028 - 0x0000)
struct SentryLibrary_CreateSentryTransactionContext final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Operation;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USentryTransactionContext*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryTransactionContext) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryTransactionContext");
static_assert(sizeof(SentryLibrary_CreateSentryTransactionContext) == 0x000028, "Wrong size on SentryLibrary_CreateSentryTransactionContext");
static_assert(offsetof(SentryLibrary_CreateSentryTransactionContext, Name_0) == 0x000000, "Member 'SentryLibrary_CreateSentryTransactionContext::Name_0' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryTransactionContext, Operation) == 0x000010, "Member 'SentryLibrary_CreateSentryTransactionContext::Operation' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryTransactionContext, ReturnValue) == 0x000020, "Member 'SentryLibrary_CreateSentryTransactionContext::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLibrary.CreateSentryUser
// 0x0098 (0x0098 - 0x0000)
struct SentryLibrary_CreateSentryUser final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IPAddress;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Data;                                              // 0x0040(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USentryUser*                            ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLibrary_CreateSentryUser) == 0x000008, "Wrong alignment on SentryLibrary_CreateSentryUser");
static_assert(sizeof(SentryLibrary_CreateSentryUser) == 0x000098, "Wrong size on SentryLibrary_CreateSentryUser");
static_assert(offsetof(SentryLibrary_CreateSentryUser, Email) == 0x000000, "Member 'SentryLibrary_CreateSentryUser::Email' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryUser, ID) == 0x000010, "Member 'SentryLibrary_CreateSentryUser::ID' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryUser, UserName) == 0x000020, "Member 'SentryLibrary_CreateSentryUser::UserName' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryUser, IPAddress) == 0x000030, "Member 'SentryLibrary_CreateSentryUser::IPAddress' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryUser, Data) == 0x000040, "Member 'SentryLibrary_CreateSentryUser::Data' has a wrong offset!");
static_assert(offsetof(SentryLibrary_CreateSentryUser, ReturnValue) == 0x000090, "Member 'SentryLibrary_CreateSentryUser::ReturnValue' has a wrong offset!");

// Function Sentry.SentryLog.SetBody
// 0x0010 (0x0010 - 0x0000)
struct SentryLog_SetBody final
{
public:
	class FString                                 Body_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLog_SetBody) == 0x000008, "Wrong alignment on SentryLog_SetBody");
static_assert(sizeof(SentryLog_SetBody) == 0x000010, "Wrong size on SentryLog_SetBody");
static_assert(offsetof(SentryLog_SetBody, Body_0) == 0x000000, "Member 'SentryLog_SetBody::Body_0' has a wrong offset!");

// Function Sentry.SentryLog.SetLevel
// 0x0001 (0x0001 - 0x0000)
struct SentryLog_SetLevel final
{
public:
	ESentryLevel                                  Level_0;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SentryLog_SetLevel) == 0x000001, "Wrong alignment on SentryLog_SetLevel");
static_assert(sizeof(SentryLog_SetLevel) == 0x000001, "Wrong size on SentryLog_SetLevel");
