#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sentry

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Sentry_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Sentry.SentryAttachment
// 0x0018 (0x0040 - 0x0028)
class USentryAttachment final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitializeWithData(const TArray<uint8>& Data, const class FString& Filename, const class FString& ContentType)	 // 0x4ef0620;
	void InitializeWithPath(const class FString& Path, const class FString& Filename, const class FString& ContentType)	 // 0x4ef0b24;

	class FString GetContentType() const	 // 0x4ef0168;
	TArray<uint8> GetData() const	 // 0x4ef01c4;
	class FString GetFilename() const	 // 0x4ef037c;
	class FString GetPath() const	 // 0x4ef0510;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryAttachment">();
	}
	static class USentryAttachment* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryAttachment>();
	}
};
static_assert(alignof(USentryAttachment) == 0x000008, "Wrong alignment on USentryAttachment");
static_assert(sizeof(USentryAttachment) == 0x000040, "Wrong size on USentryAttachment");

// Class Sentry.SentryBeforeBreadcrumbHandler
// 0x0000 (0x0028 - 0x0028)
class USentryBeforeBreadcrumbHandler final : public UObject
{
public:
	class USentryBreadcrumb* HandleBeforeBreadcrumb(class USentryBreadcrumb* Breadcrumb, class USentryHint* Hint)	 // 0x2ff3a90;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryBeforeBreadcrumbHandler">();
	}
	static class USentryBeforeBreadcrumbHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryBeforeBreadcrumbHandler>();
	}
};
static_assert(alignof(USentryBeforeBreadcrumbHandler) == 0x000008, "Wrong alignment on USentryBeforeBreadcrumbHandler");
static_assert(sizeof(USentryBeforeBreadcrumbHandler) == 0x000028, "Wrong size on USentryBeforeBreadcrumbHandler");

// Class Sentry.SentryBeforeLogHandler
// 0x0000 (0x0028 - 0x0028)
class USentryBeforeLogHandler : public UObject
{
public:
	class USentryLog* HandleBeforeLog(class USentryLog* LogData)	 // 0x2ff3ed0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryBeforeLogHandler">();
	}
	static class USentryBeforeLogHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryBeforeLogHandler>();
	}
};
static_assert(alignof(USentryBeforeLogHandler) == 0x000008, "Wrong alignment on USentryBeforeLogHandler");
static_assert(sizeof(USentryBeforeLogHandler) == 0x000028, "Wrong size on USentryBeforeLogHandler");

// Class Sentry.SentryBeforeSendHandler
// 0x0000 (0x0028 - 0x0028)
class USentryBeforeSendHandler : public UObject
{
public:
	class USentryEvent* HandleBeforeSend(class USentryEvent* Event, class USentryHint* Hint)	 // 0x2ff3a90;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryBeforeSendHandler">();
	}
	static class USentryBeforeSendHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryBeforeSendHandler>();
	}
};
static_assert(alignof(USentryBeforeSendHandler) == 0x000008, "Wrong alignment on USentryBeforeSendHandler");
static_assert(sizeof(USentryBeforeSendHandler) == 0x000028, "Wrong size on USentryBeforeSendHandler");

// Class Sentry.SentryBreadcrumb
// 0x0018 (0x0040 - 0x0028)
class USentryBreadcrumb final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize()	 // 0x2ff4130;
	void SetCategory(const class FString& Category)	 // 0x4ef1220;
	void SetData(const TMap<class FString, struct FSentryVariant>& Data)	 // 0x4ef15dc;
	void SetLevel(ESentryLevel Level)	 // 0x4ef1860;
	void SetMessage(const class FString& Message)	 // 0x4ef1aa0;
	void SetType(const class FString& Type)	 // 0x4ef1d2c;

	class FString GetCategory() const	 // 0x4ef010c;
	TMap<class FString, struct FSentryVariant> GetData() const	 // 0x4ef0220;
	ESentryLevel GetLevel() const	 // 0x4ef0468;
	class FString GetMessage() const	 // 0x4ef0510;
	class FString GetType() const	 // 0x4ef0168;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryBreadcrumb">();
	}
	static class USentryBreadcrumb* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryBreadcrumb>();
	}
};
static_assert(alignof(USentryBreadcrumb) == 0x000008, "Wrong alignment on USentryBreadcrumb");
static_assert(sizeof(USentryBreadcrumb) == 0x000040, "Wrong size on USentryBreadcrumb");

// Class Sentry.SentryEvent
// 0x0018 (0x0040 - 0x0028)
class USentryEvent final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize()	 // 0x2ff4230;
	void RemoveContext(const class FString& Key)	 // 0x2ff4a40;
	void RemoveExtra(const class FString& Key)	 // 0x2ff4cc0;
	void RemoveTag(const class FString& Key)	 // 0x2ff4f40;
	void SetContext(const class FString& Key, const TMap<class FString, struct FSentryVariant>& Values)	 // 0x2ff5940;
	void SetExtra(const class FString& Key, const struct FSentryVariant& Value)	 // 0x2ff5cf0;
	void SetExtras(const TMap<class FString, struct FSentryVariant>& Extras)	 // 0x2ff6370;
	void SetFingerprint(const TArray<class FString>& Fingerprint)	 // 0x2ff64f0;
	void SetLevel(ESentryLevel Level)	 // 0x4ef1920;
	void SetMessage(const class FString& Message)	 // 0x4ef1b70;
	void SetTag(const class FString& Key, const class FString& Value)	 // 0x2ff6b10;
	void SetTags(const TMap<class FString, class FString>& Tags)	 // 0x2ff73f0;

	TMap<class FString, struct FSentryVariant> GetContext(const class FString& Key) const	 // 0x2ff1fd0;
	struct FSentryVariant GetExtra(const class FString& Key) const	 // 0x2ff2810;
	TMap<class FString, struct FSentryVariant> GetExtras() const	 // 0x2ff2e50;
	TArray<class FString> GetFingerprint() const	 // 0x2ff2f70;
	class FString GetId() const	 // 0x2ff3010;
	ESentryLevel GetLevel() const	 // 0x4ef04a0;
	class FString GetMessage() const	 // 0x4ef037c;
	class FString GetTag(const class FString& Key) const	 // 0x2ff32a0;
	TMap<class FString, class FString> GetTags() const	 // 0x2ff38a0;
	bool IsAnr() const	 // 0x2ff49a0;
	bool IsCrash() const	 // 0x2ff49f0;
	bool TryGetContext(const class FString& Key, TMap<class FString, struct FSentryVariant>* Value) const	 // 0x2ff7570;
	bool TryGetExtra(const class FString& Key, struct FSentryVariant* Value) const	 // 0x2ff7cf0;
	bool TryGetTag(const class FString& Key, class FString* Value) const	 // 0x2ff83b0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryEvent">();
	}
	static class USentryEvent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryEvent>();
	}
};
static_assert(alignof(USentryEvent) == 0x000008, "Wrong alignment on USentryEvent");
static_assert(sizeof(USentryEvent) == 0x000040, "Wrong size on USentryEvent");

// Class Sentry.SentryFeedback
// 0x0018 (0x0040 - 0x0028)
class USentryFeedback final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(const class FString& Message)	 // 0x2ff4330;
	void SetAssociatedEvent(const class FString& EventId)	 // 0x2ff51c0;
	void SetContactEmail(const class FString& Email)	 // 0x2ff56c0;
	void SetName(const class FString& Name_0)	 // 0x2ff6890;

	class FString GetAssociatedEvent() const	 // 0x2ff1df0;
	class FString GetContactEmail() const	 // 0x2ff1f30;
	class FString GetMessage() const	 // 0x2ff3160;
	class FString GetName() const	 // 0x2ff3200;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryFeedback">();
	}
	static class USentryFeedback* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryFeedback>();
	}
};
static_assert(alignof(USentryFeedback) == 0x000008, "Wrong alignment on USentryFeedback");
static_assert(sizeof(USentryFeedback) == 0x000040, "Wrong size on USentryFeedback");

// Class Sentry.SentryHint
// 0x0018 (0x0040 - 0x0028)
class USentryHint final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAttachment(class USentryAttachment* Attachment)	 // 0x2ff0d20;
	void Initialize()	 // 0x2ff4680;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryHint">();
	}
	static class USentryHint* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryHint>();
	}
};
static_assert(alignof(USentryHint) == 0x000008, "Wrong alignment on USentryHint");
static_assert(sizeof(USentryHint) == 0x000040, "Wrong size on USentryHint");

// Class Sentry.SentryLibrary
// 0x0000 (0x0028 - 0x0028)
class USentryLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class USentryAttachment* CreateSentryAttachmentWithData(const TArray<uint8>& Data, const class FString& Filename, const class FString& ContentType)	 // 0x4eeec9c;
	static class USentryAttachment* CreateSentryAttachmentWithPath(const class FString& Path, const class FString& Filename, const class FString& ContentType)	 // 0x4eef184;
	static class USentryBreadcrumb* CreateSentryBreadcrumb(const class FString& Message, const class FString& Type, const class FString& Category, const TMap<class FString, struct FSentryVariant>& Data, ESentryLevel Level)	 // 0x4eef5d4;
	static class USentryEvent* CreateSentryEvent(const class FString& Message, ESentryLevel Level)	 // 0x4eefaec;
	static class USentryFeedback* CreateSentryFeedback(const class FString& Message, const class FString& Name_0, const class FString& Email, const class FString& EventId)	 // 0x2ff0fb0;
	static class USentryTransactionContext* CreateSentryTransactionContext(const class FString& Name_0, const class FString& Operation)	 // 0x2ff1890;
	static class USentryUser* CreateSentryUser(const class FString& Email, const class FString& ID, const class FString& UserName, const class FString& IPAddress, const TMap<class FString, class FString>& Data)	 // 0x4eefde0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryLibrary">();
	}
	static class USentryLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryLibrary>();
	}
};
static_assert(alignof(USentryLibrary) == 0x000008, "Wrong alignment on USentryLibrary");
static_assert(sizeof(USentryLibrary) == 0x000028, "Wrong size on USentryLibrary");

// Class Sentry.SentryLog
// 0x0030 (0x0058 - 0x0028)
class USentryLog final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Body;                                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESentryLevel                                  Level;                                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize()	 // 0x2ff4780;
	void SetBody(const class FString& Body_0)	 // 0x2ff5440;
	void SetLevel(ESentryLevel Level_0)	 // 0x2ff6620;

	class FString GetBody() const	 // 0x2ff1e90;
	ESentryLevel GetLevel() const	 // 0x2ff3120;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryLog">();
	}
	static class USentryLog* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryLog>();
	}
};
static_assert(alignof(USentryLog) == 0x000008, "Wrong alignment on USentryLog");
static_assert(sizeof(USentryLog) == 0x000058, "Wrong size on USentryLog");
static_assert(offsetof(USentryLog, Body) == 0x000040, "Member 'USentryLog::Body' has a wrong offset!");
static_assert(offsetof(USentryLog, Level) == 0x000050, "Member 'USentryLog::Level' has a wrong offset!");

// Class Sentry.SentrySamplingContext
// 0x0018 (0x0040 - 0x0028)
class USentrySamplingContext final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TMap<class FString, struct FSentryVariant> GetCustomSamplingContext() const	 // 0x2ff26f0;
	class USentryTransactionContext* GetTransactionContext() const	 // 0x2ff39c0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentrySamplingContext">();
	}
	static class USentrySamplingContext* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentrySamplingContext>();
	}
};
static_assert(alignof(USentrySamplingContext) == 0x000008, "Wrong alignment on USentrySamplingContext");
static_assert(sizeof(USentrySamplingContext) == 0x000040, "Wrong size on USentrySamplingContext");

// Class Sentry.SentryScope
// 0x0018 (0x0040 - 0x0028)
class USentryScope final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAttachment(class USentryAttachment* Attachment)	 // 0x4eeea5c;
	void AddBreadcrumb(class USentryBreadcrumb* Breadcrumb)	 // 0x4eeeb40;
	void Clear()	 // 0x4eeec24;
	void ClearAttachments()	 // 0x4eeec4c;
	void ClearBreadcrumbs()	 // 0x4eeec74;
	void Initialize()	 // 0x2ff48a0;
	void RemoveContext(const class FString& Key)	 // 0x4ef0f90;
	void RemoveExtra(const class FString& Key)	 // 0x4ef106c;
	void RemoveTag(const class FString& Key)	 // 0x4ef1148;
	void SetContext(const class FString& Key, const TMap<class FString, struct FSentryVariant>& Values)	 // 0x4ef12f0;
	void SetExtra(const class FString& Key, const struct FSentryVariant& Value)	 // 0x2ff6030;
	void SetExtras(const TMap<class FString, struct FSentryVariant>& Extras)	 // 0x4ef16b8;
	void SetFingerprint(const TArray<class FString>& Fingerprint)	 // 0x4ef1794;
	void SetLevel(ESentryLevel Level)	 // 0x4ef19e0;
	void SetTag(const class FString& Key, const class FString& Value)	 // 0x2ff6f80;
	void SetTags(const TMap<class FString, class FString>& Tags)	 // 0x4ef1c40;

	TMap<class FString, struct FSentryVariant> GetContext(const class FString& Key) const	 // 0x2ff2360;
	struct FSentryVariant GetExtra(const class FString& Key) const	 // 0x2ff2b30;
	TMap<class FString, struct FSentryVariant> GetExtras() const	 // 0x4ef02cc;
	TArray<class FString> GetFingerprint() const	 // 0x4ef03d8;
	ESentryLevel GetLevel() const	 // 0x4ef04d8;
	class FString GetTag(const class FString& Key) const	 // 0x2ff35a0;
	TMap<class FString, class FString> GetTags() const	 // 0x4ef056c;
	bool TryGetContext(const class FString& Key, TMap<class FString, struct FSentryVariant>* Value) const	 // 0x2ff7930;
	bool TryGetExtra(const class FString& Key, struct FSentryVariant* Value) const	 // 0x2ff8050;
	bool TryGetTag(const class FString& Key, class FString* Value) const	 // 0x2ff8700;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryScope">();
	}
	static class USentryScope* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryScope>();
	}
};
static_assert(alignof(USentryScope) == 0x000008, "Wrong alignment on USentryScope");
static_assert(sizeof(USentryScope) == 0x000040, "Wrong size on USentryScope");

// Class Sentry.ScopeTestBeforeSendHandler
// 0x0000 (0x0028 - 0x0028)
class UScopeTestBeforeSendHandler final : public USentryBeforeSendHandler
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ScopeTestBeforeSendHandler">();
	}
	static class UScopeTestBeforeSendHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UScopeTestBeforeSendHandler>();
	}
};
static_assert(alignof(UScopeTestBeforeSendHandler) == 0x000008, "Wrong alignment on UScopeTestBeforeSendHandler");
static_assert(sizeof(UScopeTestBeforeSendHandler) == 0x000028, "Wrong size on UScopeTestBeforeSendHandler");

// Class Sentry.SentrySettings
// 0x0178 (0x01A0 - 0x0028)
class USentrySettings final : public UObject
{
public:
	bool                                          InitAutomatically;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Dsn;                                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Debug;                                             // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Environment;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Dist;                                              // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleRate;                                        // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableAutoLogAttachment;                           // 0x006C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachStacktrace;                                  // 0x006D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SendDefaultPii;                                    // 0x006E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachScreenshot;                                  // 0x006F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachGpuDump;                                     // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxAttachmentSize;                                 // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableStructuredLogging;                           // 0x0078(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StructuredLoggingCategories;                       // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FStructuredLoggingLevels               StructuredLoggingLevels;                           // 0x0090(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSendBreadcrumbsWithStructuredLogging;             // 0x0095(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxBreadcrumbs;                                    // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAutomaticBreadcrumbs                  AutomaticBreadcrumbs;                              // 0x009C(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FAutomaticBreadcrumbsForLogs           AutomaticBreadcrumbsForLogs;                       // 0x00A1(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          EnableAutoSessionTracking;                         // 0x00A6(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SessionTimeout;                                    // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideReleaseName;                               // 0x00AC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Release;                                           // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseProxy;                                          // 0x00C0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProxyUrl;                                          // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USentryBeforeSendHandler>   BeforeSendHandler;                                 // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USentryBeforeBreadcrumbHandler> BeforeBreadcrumbHandler;                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USentryBeforeLogHandler>    BeforeLogHandler;                                  // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableAutoCrashCapturing;                          // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryDatabaseLocation                       DatabaseLocation;                                  // 0x00F1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CrashpadWaitForUpload;                             // 0x00F2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InAppInclude;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         InAppExclude;                                      // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          EnableAppNotRespondingTracking;                    // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableTracing;                                     // 0x0119(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryTracesSamplingType                     SamplingType;                                      // 0x011A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TracesSampleRate;                                  // 0x011C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USentryTraceSampler>        TracesSampler;                                     // 0x0120(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EditorDsn;                                         // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTagsPromotion                         TagsPromotion;                                     // 0x0138(0x0006)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FEnableBuildConfigurations             EnableBuildConfigurations;                         // 0x013E(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FEnableBuildTargets                    EnableBuildTargets;                                // 0x0143(0x0005)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          EnableForPromotedBuildsOnly;                       // 0x0148(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UploadSymbolsAutomatically;                        // 0x0149(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProjectName;                                       // 0x0150(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OrgName;                                           // 0x0160(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthToken;                                         // 0x0170(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeSources;                                    // 0x0180(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESentryCliLogLevel                            DiagnosticLevel;                                   // 0x0181(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseLegacyGradlePlugin;                             // 0x0182(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CrashReporterUrl;                                  // 0x0188(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireUserConsent;                               // 0x0198(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefaultUserConsentGiven;                          // 0x0199(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentrySettings">();
	}
	static class USentrySettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentrySettings>();
	}
};
static_assert(alignof(USentrySettings) == 0x000008, "Wrong alignment on USentrySettings");
static_assert(sizeof(USentrySettings) == 0x0001A0, "Wrong size on USentrySettings");
static_assert(offsetof(USentrySettings, InitAutomatically) == 0x000028, "Member 'USentrySettings::InitAutomatically' has a wrong offset!");
static_assert(offsetof(USentrySettings, Dsn) == 0x000030, "Member 'USentrySettings::Dsn' has a wrong offset!");
static_assert(offsetof(USentrySettings, Debug) == 0x000040, "Member 'USentrySettings::Debug' has a wrong offset!");
static_assert(offsetof(USentrySettings, Environment) == 0x000048, "Member 'USentrySettings::Environment' has a wrong offset!");
static_assert(offsetof(USentrySettings, Dist) == 0x000058, "Member 'USentrySettings::Dist' has a wrong offset!");
static_assert(offsetof(USentrySettings, SampleRate) == 0x000068, "Member 'USentrySettings::SampleRate' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableAutoLogAttachment) == 0x00006C, "Member 'USentrySettings::EnableAutoLogAttachment' has a wrong offset!");
static_assert(offsetof(USentrySettings, AttachStacktrace) == 0x00006D, "Member 'USentrySettings::AttachStacktrace' has a wrong offset!");
static_assert(offsetof(USentrySettings, SendDefaultPii) == 0x00006E, "Member 'USentrySettings::SendDefaultPii' has a wrong offset!");
static_assert(offsetof(USentrySettings, AttachScreenshot) == 0x00006F, "Member 'USentrySettings::AttachScreenshot' has a wrong offset!");
static_assert(offsetof(USentrySettings, AttachGpuDump) == 0x000070, "Member 'USentrySettings::AttachGpuDump' has a wrong offset!");
static_assert(offsetof(USentrySettings, MaxAttachmentSize) == 0x000074, "Member 'USentrySettings::MaxAttachmentSize' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableStructuredLogging) == 0x000078, "Member 'USentrySettings::EnableStructuredLogging' has a wrong offset!");
static_assert(offsetof(USentrySettings, StructuredLoggingCategories) == 0x000080, "Member 'USentrySettings::StructuredLoggingCategories' has a wrong offset!");
static_assert(offsetof(USentrySettings, StructuredLoggingLevels) == 0x000090, "Member 'USentrySettings::StructuredLoggingLevels' has a wrong offset!");
static_assert(offsetof(USentrySettings, bSendBreadcrumbsWithStructuredLogging) == 0x000095, "Member 'USentrySettings::bSendBreadcrumbsWithStructuredLogging' has a wrong offset!");
static_assert(offsetof(USentrySettings, MaxBreadcrumbs) == 0x000098, "Member 'USentrySettings::MaxBreadcrumbs' has a wrong offset!");
static_assert(offsetof(USentrySettings, AutomaticBreadcrumbs) == 0x00009C, "Member 'USentrySettings::AutomaticBreadcrumbs' has a wrong offset!");
static_assert(offsetof(USentrySettings, AutomaticBreadcrumbsForLogs) == 0x0000A1, "Member 'USentrySettings::AutomaticBreadcrumbsForLogs' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableAutoSessionTracking) == 0x0000A6, "Member 'USentrySettings::EnableAutoSessionTracking' has a wrong offset!");
static_assert(offsetof(USentrySettings, SessionTimeout) == 0x0000A8, "Member 'USentrySettings::SessionTimeout' has a wrong offset!");
static_assert(offsetof(USentrySettings, OverrideReleaseName) == 0x0000AC, "Member 'USentrySettings::OverrideReleaseName' has a wrong offset!");
static_assert(offsetof(USentrySettings, Release) == 0x0000B0, "Member 'USentrySettings::Release' has a wrong offset!");
static_assert(offsetof(USentrySettings, UseProxy) == 0x0000C0, "Member 'USentrySettings::UseProxy' has a wrong offset!");
static_assert(offsetof(USentrySettings, ProxyUrl) == 0x0000C8, "Member 'USentrySettings::ProxyUrl' has a wrong offset!");
static_assert(offsetof(USentrySettings, BeforeSendHandler) == 0x0000D8, "Member 'USentrySettings::BeforeSendHandler' has a wrong offset!");
static_assert(offsetof(USentrySettings, BeforeBreadcrumbHandler) == 0x0000E0, "Member 'USentrySettings::BeforeBreadcrumbHandler' has a wrong offset!");
static_assert(offsetof(USentrySettings, BeforeLogHandler) == 0x0000E8, "Member 'USentrySettings::BeforeLogHandler' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableAutoCrashCapturing) == 0x0000F0, "Member 'USentrySettings::EnableAutoCrashCapturing' has a wrong offset!");
static_assert(offsetof(USentrySettings, DatabaseLocation) == 0x0000F1, "Member 'USentrySettings::DatabaseLocation' has a wrong offset!");
static_assert(offsetof(USentrySettings, CrashpadWaitForUpload) == 0x0000F2, "Member 'USentrySettings::CrashpadWaitForUpload' has a wrong offset!");
static_assert(offsetof(USentrySettings, InAppInclude) == 0x0000F8, "Member 'USentrySettings::InAppInclude' has a wrong offset!");
static_assert(offsetof(USentrySettings, InAppExclude) == 0x000108, "Member 'USentrySettings::InAppExclude' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableAppNotRespondingTracking) == 0x000118, "Member 'USentrySettings::EnableAppNotRespondingTracking' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableTracing) == 0x000119, "Member 'USentrySettings::EnableTracing' has a wrong offset!");
static_assert(offsetof(USentrySettings, SamplingType) == 0x00011A, "Member 'USentrySettings::SamplingType' has a wrong offset!");
static_assert(offsetof(USentrySettings, TracesSampleRate) == 0x00011C, "Member 'USentrySettings::TracesSampleRate' has a wrong offset!");
static_assert(offsetof(USentrySettings, TracesSampler) == 0x000120, "Member 'USentrySettings::TracesSampler' has a wrong offset!");
static_assert(offsetof(USentrySettings, EditorDsn) == 0x000128, "Member 'USentrySettings::EditorDsn' has a wrong offset!");
static_assert(offsetof(USentrySettings, TagsPromotion) == 0x000138, "Member 'USentrySettings::TagsPromotion' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableBuildConfigurations) == 0x00013E, "Member 'USentrySettings::EnableBuildConfigurations' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableBuildTargets) == 0x000143, "Member 'USentrySettings::EnableBuildTargets' has a wrong offset!");
static_assert(offsetof(USentrySettings, EnableForPromotedBuildsOnly) == 0x000148, "Member 'USentrySettings::EnableForPromotedBuildsOnly' has a wrong offset!");
static_assert(offsetof(USentrySettings, UploadSymbolsAutomatically) == 0x000149, "Member 'USentrySettings::UploadSymbolsAutomatically' has a wrong offset!");
static_assert(offsetof(USentrySettings, ProjectName) == 0x000150, "Member 'USentrySettings::ProjectName' has a wrong offset!");
static_assert(offsetof(USentrySettings, OrgName) == 0x000160, "Member 'USentrySettings::OrgName' has a wrong offset!");
static_assert(offsetof(USentrySettings, AuthToken) == 0x000170, "Member 'USentrySettings::AuthToken' has a wrong offset!");
static_assert(offsetof(USentrySettings, IncludeSources) == 0x000180, "Member 'USentrySettings::IncludeSources' has a wrong offset!");
static_assert(offsetof(USentrySettings, DiagnosticLevel) == 0x000181, "Member 'USentrySettings::DiagnosticLevel' has a wrong offset!");
static_assert(offsetof(USentrySettings, UseLegacyGradlePlugin) == 0x000182, "Member 'USentrySettings::UseLegacyGradlePlugin' has a wrong offset!");
static_assert(offsetof(USentrySettings, CrashReporterUrl) == 0x000188, "Member 'USentrySettings::CrashReporterUrl' has a wrong offset!");
static_assert(offsetof(USentrySettings, bRequireUserConsent) == 0x000198, "Member 'USentrySettings::bRequireUserConsent' has a wrong offset!");
static_assert(offsetof(USentrySettings, bDefaultUserConsentGiven) == 0x000199, "Member 'USentrySettings::bDefaultUserConsentGiven' has a wrong offset!");

// Class Sentry.SentrySpan
// 0x0018 (0x0040 - 0x0028)
class USentrySpan final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Finish()	 // 0x3007e00;
	void FinishWithTimestamp(int64 Timestamp)	 // 0x3007e30;
	void GetTrace(class FString* Name_0, class FString* Value)	 // 0x3008120;
	void RemoveData(const class FString& Key)	 // 0x3009b60;
	void RemoveTag(const class FString& Key)	 // 0x3009df0;
	void SetData(const class FString& Key, const TMap<class FString, struct FSentryVariant>& Values)	 // 0x300a0d0;
	void SetTag(const class FString& Key, const class FString& Value)	 // 0x300a490;
	class USentrySpan* StartChild(const class FString& Operation, const class FString& Description, bool BindToScope)	 // 0x300a910;
	class USentrySpan* StartChildWithTimestamp(const class FString& Operation, const class FString& Description, int64 Timestamp, bool BindToScope)	 // 0x300b000;

	bool IsFinished() const	 // 0x3008450;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentrySpan">();
	}
	static class USentrySpan* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentrySpan>();
	}
};
static_assert(alignof(USentrySpan) == 0x000008, "Wrong alignment on USentrySpan");
static_assert(sizeof(USentrySpan) == 0x000040, "Wrong size on USentrySpan");

// Class Sentry.SentrySubsystem
// 0x0088 (0x00B8 - 0x0030)
class USentrySubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USentryBeforeSendHandler*               BeforeSendHandler;                                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USentryBeforeBreadcrumbHandler*         BeforeBreadcrumbHandler;                           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USentryBeforeLogHandler*                BeforeLogHandler;                                  // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USentryTraceSampler*                    TraceSampler;                                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAttachment(class USentryAttachment* Attachment)	 // 0x3006ad0;
	void AddBreadcrumb(class USentryBreadcrumb* Breadcrumb)	 // 0x4ef2b00;
	void AddBreadcrumbWithParams(const class FString& Message, const class FString& Category, const class FString& Type, const TMap<class FString, struct FSentryVariant>& Data, ESentryLevel Level)	 // 0x4ef2bf8;
	class FString CaptureEvent(class USentryEvent* Event)	 // 0x4ef3114;
	class FString CaptureEventWithScope(class USentryEvent* Event, const TDelegate<void(class USentryScope* Scope)>& OnConfigureScope)	 // 0x4ef33d0;
	void CaptureFeedback(class USentryFeedback* Feedback)	 // 0x3006d70;
	void CaptureFeedbackWithParams(const class FString& Message, const class FString& Name_0, const class FString& Email, const class FString& EventId)	 // 0x3007010;
	class FString CaptureMessage(const class FString& Message, ESentryLevel Level)	 // 0x4ef3664;
	class FString CaptureMessageWithScope(const class FString& Message, const TDelegate<void(class USentryScope* Scope)>& OnConfigureScope, ESentryLevel Level)	 // 0x4ef3964;
	void ClearAttachments()	 // 0x3007940;
	void ClearBreadcrumbs()	 // 0x4ef3cc4;
	void Close()	 // 0x4ef3d00;
	class USentryTransactionContext* ContinueTrace(const class FString& SentryTrace, const TArray<class FString>& BaggageHeaders)	 // 0x3007990;
	void EndSession()	 // 0x3007db0;
	void GiveUserConsent()	 // 0x3008360;
	void Initialize()	 // 0x4ef3d14;
	void InitializeWithSettings(const TDelegate<void(class USentrySettings* Settings)>& OnConfigureSettings)	 // 0x4ef3d28;
	void LogDebug(const class FString& Message, const class FString& Category)	 // 0x30084e0;
	void LogError(const class FString& Message, const class FString& Category)	 // 0x3008960;
	void LogFatal(const class FString& Message, const class FString& Category)	 // 0x3008de0;
	void LogInfo(const class FString& Message, const class FString& Category)	 // 0x3009260;
	void LogWarning(const class FString& Message, const class FString& Category)	 // 0x30096e0;
	void RemoveTag(const class FString& Key)	 // 0x4ef3dc4;
	void RemoveUser()	 // 0x4ef4030;
	void RevokeUserConsent()	 // 0x300a080;
	void SetContext(const class FString& Key, const TMap<class FString, struct FSentryVariant>& Values)	 // 0x4ef406c;
	void SetLevel(ESentryLevel Level)	 // 0x4ef436c;
	void SetTag(const class FString& Key, const class FString& Value)	 // 0x4ef443c;
	void SetUser(class USentryUser* User)	 // 0x4ef45b8;
	void StartSession()	 // 0x300b950;
	class USentryTransaction* StartTransaction(const class FString& Name_0, const class FString& Operation, bool BindToScope)	 // 0x300b9a0;
	class USentryTransaction* StartTransactionWithContext(class USentryTransactionContext* Context, bool BindToScope)	 // 0x300c0a0;
	class USentryTransaction* StartTransactionWithContextAndOptions(class USentryTransactionContext* Context, const struct FSentryTransactionOptions& OPTIONS)	 // 0x300c5f0;
	class USentryTransaction* StartTransactionWithContextAndTimestamp(class USentryTransactionContext* Context, int64 Timestamp, bool BindToScope)	 // 0x300ca60;

	EUserConsent GetUserConsent() const	 // 0x3008300;
	ESentryCrashedLastRun IsCrashedLastRun() const	 // 0x30083b0;
	bool IsEnabled() const	 // 0x3008410;
	bool IsSupportedForCurrentSettings() const	 // 0x3008490;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentrySubsystem">();
	}
	static class USentrySubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentrySubsystem>();
	}
};
static_assert(alignof(USentrySubsystem) == 0x000008, "Wrong alignment on USentrySubsystem");
static_assert(sizeof(USentrySubsystem) == 0x0000B8, "Wrong size on USentrySubsystem");
static_assert(offsetof(USentrySubsystem, BeforeSendHandler) == 0x000060, "Member 'USentrySubsystem::BeforeSendHandler' has a wrong offset!");
static_assert(offsetof(USentrySubsystem, BeforeBreadcrumbHandler) == 0x000068, "Member 'USentrySubsystem::BeforeBreadcrumbHandler' has a wrong offset!");
static_assert(offsetof(USentrySubsystem, BeforeLogHandler) == 0x000070, "Member 'USentrySubsystem::BeforeLogHandler' has a wrong offset!");
static_assert(offsetof(USentrySubsystem, TraceSampler) == 0x000078, "Member 'USentrySubsystem::TraceSampler' has a wrong offset!");

// Class Sentry.TestBeforeLogHandler
// 0x0000 (0x0028 - 0x0028)
class UTestBeforeLogHandler final : public USentryBeforeLogHandler
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"TestBeforeLogHandler">();
	}
	static class UTestBeforeLogHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UTestBeforeLogHandler>();
	}
};
static_assert(alignof(UTestBeforeLogHandler) == 0x000008, "Wrong alignment on UTestBeforeLogHandler");
static_assert(sizeof(UTestBeforeLogHandler) == 0x000028, "Wrong size on UTestBeforeLogHandler");

// Class Sentry.SentryTraceSampler
// 0x0000 (0x0028 - 0x0028)
class USentryTraceSampler : public UObject
{
public:
	bool Sample(class USentrySamplingContext* samplingContext, float* samplingValue)	 // 0x30400a0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryTraceSampler">();
	}
	static class USentryTraceSampler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryTraceSampler>();
	}
};
static_assert(alignof(USentryTraceSampler) == 0x000008, "Wrong alignment on USentryTraceSampler");
static_assert(sizeof(USentryTraceSampler) == 0x000028, "Wrong size on USentryTraceSampler");

// Class Sentry.TraceSamplingTestHandler
// 0x0000 (0x0028 - 0x0028)
class UTraceSamplingTestHandler final : public USentryTraceSampler
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"TraceSamplingTestHandler">();
	}
	static class UTraceSamplingTestHandler* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UTraceSamplingTestHandler>();
	}
};
static_assert(alignof(UTraceSamplingTestHandler) == 0x000008, "Wrong alignment on UTraceSamplingTestHandler");
static_assert(sizeof(UTraceSamplingTestHandler) == 0x000028, "Wrong size on UTraceSamplingTestHandler");

// Class Sentry.SentryTransaction
// 0x0018 (0x0040 - 0x0028)
class USentryTransaction final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Finish()	 // 0x303e5a0;
	void FinishWithTimestamp(int64 Timestamp)	 // 0x303e5f0;
	void GetTrace(class FString* Name_0, class FString* Value)	 // 0x303f2d0;
	void RemoveData(const class FString& Key)	 // 0x303fb80;
	void RemoveTag(const class FString& Key)	 // 0x303fe10;
	void SetData(const class FString& Key, const TMap<class FString, struct FSentryVariant>& Values)	 // 0x30403b0;
	void SetName(const class FString& Name_0)	 // 0x3040770;
	void SetTag(const class FString& Key, const class FString& Value)	 // 0x3040a00;
	class USentrySpan* StartChildSpan(const class FString& Operation, const class FString& Description, bool BindToScope)	 // 0x300a910;
	class USentrySpan* StartChildSpanWithTimestamp(const class FString& Operation, const class FString& Description, int64 Timestamp, bool BindToScope)	 // 0x300b000;

	bool IsFinished() const	 // 0x3008450;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryTransaction">();
	}
	static class USentryTransaction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryTransaction>();
	}
};
static_assert(alignof(USentryTransaction) == 0x000008, "Wrong alignment on USentryTransaction");
static_assert(sizeof(USentryTransaction) == 0x000040, "Wrong size on USentryTransaction");

// Class Sentry.SentryTransactionContext
// 0x0018 (0x0040 - 0x0028)
class USentryTransactionContext final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(const class FString& Name_0, const class FString& Operation)	 // 0x303f5c0;

	class FString GetName() const	 // 0x2ff3160;
	class FString GetOperation() const	 // 0x2ff1e90;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryTransactionContext">();
	}
	static class USentryTransactionContext* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryTransactionContext>();
	}
};
static_assert(alignof(USentryTransactionContext) == 0x000008, "Wrong alignment on USentryTransactionContext");
static_assert(sizeof(USentryTransactionContext) == 0x000040, "Wrong size on USentryTransactionContext");

// Class Sentry.SentryUser
// 0x0018 (0x0040 - 0x0028)
class USentryUser final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetData(const TMap<class FString, class FString>& Data)	 // 0x4ef5c8c;
	void SetEmail(const class FString& Email)	 // 0x4ef1aa0;
	void SetId(const class FString& ID)	 // 0x4ef1d2c;
	void SetIpAddress(const class FString& IPAddress)	 // 0x4ef5d70;
	void SetUsername(const class FString& UserName)	 // 0x4ef1220;

	TMap<class FString, class FString> GetData() const	 // 0x4ef056c;
	class FString GetEmail() const	 // 0x4ef0510;
	class FString GetId() const	 // 0x4ef0168;
	class FString GetIpAddress() const	 // 0x4ef5c30;
	class FString GetUsername() const	 // 0x4ef010c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SentryUser">();
	}
	static class USentryUser* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USentryUser>();
	}
};
static_assert(alignof(USentryUser) == 0x000008, "Wrong alignment on USentryUser");
