#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sentry

#include "Basic.hpp"


namespace SDK
{

// Enum Sentry.ESentryLevel
// NumValues: 0x0006
enum class ESentryLevel : uint8
{
	Debug                                    = 0,
	Info                                     = 1,
	Warning                                  = 2,
	Error                                    = 3,
	Fatal                                    = 4,
	ESentryLevel_MAX                         = 5,
};

// Enum Sentry.ESentryCrashedLastRun
// NumValues: 0x0004
enum class ESentryCrashedLastRun : uint8
{
	NotEvaluated                             = 0,
	NotCrashed                               = 1,
	Crashed                                  = 2,
	ESentryCrashedLastRun_MAX                = 3,
};

// Enum Sentry.EUserConsent
// NumValues: 0x0004
enum class EUserConsent : uint8
{
	Revoked                                  = 0,
	Given                                    = 1,
	Unknown                                  = 2,
	EUserConsent_MAX                         = 3,
};

// Enum Sentry.ESentryTracesSamplingType
// NumValues: 0x0003
enum class ESentryTracesSamplingType : uint8
{
	UniformSampleRate                        = 0,
	TracesSampler                            = 1,
	ESentryTracesSamplingType_MAX            = 2,
};

// Enum Sentry.ESentryCliLogLevel
// NumValues: 0x0006
enum class ESentryCliLogLevel : uint8
{
	Trace                                    = 0,
	Debug                                    = 1,
	Info                                     = 2,
	Warn                                     = 3,
	Error                                    = 4,
	ESentryCliLogLevel_MAX                   = 5,
};

// Enum Sentry.ESentryDatabaseLocation
// NumValues: 0x0003
enum class ESentryDatabaseLocation : uint8
{
	ProjectDirectory                         = 0,
	ProjectUserDirectory                     = 1,
	ESentryDatabaseLocation_MAX              = 2,
};

// Enum Sentry.ESentryVariantType
// NumValues: 0x0008
enum class ESentryVariantType : uint8
{
	Empty                                    = 0,
	Integer                                  = 1,
	Float                                    = 2,
	Bool                                     = 3,
	String                                   = 4,
	Array                                    = 5,
	Map                                      = 6,
	ESentryVariantType_MAX                   = 7,
};

// ScriptStruct Sentry.AutomaticBreadcrumbs
// 0x0005 (0x0005 - 0x0000)
struct FAutomaticBreadcrumbs final
{
public:
	bool                                          bOnMapLoadingStarted;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnMapLoaded;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnGameStateClassChanged;                          // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnGameSessionIDChanged;                           // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnUserActivityStringChanged;                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAutomaticBreadcrumbs) == 0x000001, "Wrong alignment on FAutomaticBreadcrumbs");
static_assert(sizeof(FAutomaticBreadcrumbs) == 0x000005, "Wrong size on FAutomaticBreadcrumbs");
static_assert(offsetof(FAutomaticBreadcrumbs, bOnMapLoadingStarted) == 0x000000, "Member 'FAutomaticBreadcrumbs::bOnMapLoadingStarted' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbs, bOnMapLoaded) == 0x000001, "Member 'FAutomaticBreadcrumbs::bOnMapLoaded' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbs, bOnGameStateClassChanged) == 0x000002, "Member 'FAutomaticBreadcrumbs::bOnGameStateClassChanged' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbs, bOnGameSessionIDChanged) == 0x000003, "Member 'FAutomaticBreadcrumbs::bOnGameSessionIDChanged' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbs, bOnUserActivityStringChanged) == 0x000004, "Member 'FAutomaticBreadcrumbs::bOnUserActivityStringChanged' has a wrong offset!");

// ScriptStruct Sentry.AutomaticBreadcrumbsForLogs
// 0x0005 (0x0005 - 0x0000)
struct FAutomaticBreadcrumbsForLogs final
{
public:
	bool                                          bOnFatalLog;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnErrorLog;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnWarningLog;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnInfoLog;                                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnDebugLog;                                       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAutomaticBreadcrumbsForLogs) == 0x000001, "Wrong alignment on FAutomaticBreadcrumbsForLogs");
static_assert(sizeof(FAutomaticBreadcrumbsForLogs) == 0x000005, "Wrong size on FAutomaticBreadcrumbsForLogs");
static_assert(offsetof(FAutomaticBreadcrumbsForLogs, bOnFatalLog) == 0x000000, "Member 'FAutomaticBreadcrumbsForLogs::bOnFatalLog' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbsForLogs, bOnErrorLog) == 0x000001, "Member 'FAutomaticBreadcrumbsForLogs::bOnErrorLog' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbsForLogs, bOnWarningLog) == 0x000002, "Member 'FAutomaticBreadcrumbsForLogs::bOnWarningLog' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbsForLogs, bOnInfoLog) == 0x000003, "Member 'FAutomaticBreadcrumbsForLogs::bOnInfoLog' has a wrong offset!");
static_assert(offsetof(FAutomaticBreadcrumbsForLogs, bOnDebugLog) == 0x000004, "Member 'FAutomaticBreadcrumbsForLogs::bOnDebugLog' has a wrong offset!");

// ScriptStruct Sentry.StructuredLoggingLevels
// 0x0005 (0x0005 - 0x0000)
struct FStructuredLoggingLevels final
{
public:
	bool                                          bOnFatalLog;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnErrorLog;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnWarningLog;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnInfoLog;                                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnDebugLog;                                       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStructuredLoggingLevels) == 0x000001, "Wrong alignment on FStructuredLoggingLevels");
static_assert(sizeof(FStructuredLoggingLevels) == 0x000005, "Wrong size on FStructuredLoggingLevels");
static_assert(offsetof(FStructuredLoggingLevels, bOnFatalLog) == 0x000000, "Member 'FStructuredLoggingLevels::bOnFatalLog' has a wrong offset!");
static_assert(offsetof(FStructuredLoggingLevels, bOnErrorLog) == 0x000001, "Member 'FStructuredLoggingLevels::bOnErrorLog' has a wrong offset!");
static_assert(offsetof(FStructuredLoggingLevels, bOnWarningLog) == 0x000002, "Member 'FStructuredLoggingLevels::bOnWarningLog' has a wrong offset!");
static_assert(offsetof(FStructuredLoggingLevels, bOnInfoLog) == 0x000003, "Member 'FStructuredLoggingLevels::bOnInfoLog' has a wrong offset!");
static_assert(offsetof(FStructuredLoggingLevels, bOnDebugLog) == 0x000004, "Member 'FStructuredLoggingLevels::bOnDebugLog' has a wrong offset!");

// ScriptStruct Sentry.TagsPromotion
// 0x0006 (0x0006 - 0x0000)
struct FTagsPromotion final
{
public:
	bool                                          bPromoteBuildConfiguration;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteTargetType;                                // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteEngineMode;                                // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteIsGame;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteIsStandalone;                              // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPromoteIsUnattended;                              // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTagsPromotion) == 0x000001, "Wrong alignment on FTagsPromotion");
static_assert(sizeof(FTagsPromotion) == 0x000006, "Wrong size on FTagsPromotion");
static_assert(offsetof(FTagsPromotion, bPromoteBuildConfiguration) == 0x000000, "Member 'FTagsPromotion::bPromoteBuildConfiguration' has a wrong offset!");
static_assert(offsetof(FTagsPromotion, bPromoteTargetType) == 0x000001, "Member 'FTagsPromotion::bPromoteTargetType' has a wrong offset!");
static_assert(offsetof(FTagsPromotion, bPromoteEngineMode) == 0x000002, "Member 'FTagsPromotion::bPromoteEngineMode' has a wrong offset!");
static_assert(offsetof(FTagsPromotion, bPromoteIsGame) == 0x000003, "Member 'FTagsPromotion::bPromoteIsGame' has a wrong offset!");
static_assert(offsetof(FTagsPromotion, bPromoteIsStandalone) == 0x000004, "Member 'FTagsPromotion::bPromoteIsStandalone' has a wrong offset!");
static_assert(offsetof(FTagsPromotion, bPromoteIsUnattended) == 0x000005, "Member 'FTagsPromotion::bPromoteIsUnattended' has a wrong offset!");

// ScriptStruct Sentry.EnableBuildConfigurations
// 0x0005 (0x0005 - 0x0000)
struct FEnableBuildConfigurations final
{
public:
	bool                                          bEnableDebug;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebugGame;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDevelopment;                                // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTest;                                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableShipping;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEnableBuildConfigurations) == 0x000001, "Wrong alignment on FEnableBuildConfigurations");
static_assert(sizeof(FEnableBuildConfigurations) == 0x000005, "Wrong size on FEnableBuildConfigurations");
static_assert(offsetof(FEnableBuildConfigurations, bEnableDebug) == 0x000000, "Member 'FEnableBuildConfigurations::bEnableDebug' has a wrong offset!");
static_assert(offsetof(FEnableBuildConfigurations, bEnableDebugGame) == 0x000001, "Member 'FEnableBuildConfigurations::bEnableDebugGame' has a wrong offset!");
static_assert(offsetof(FEnableBuildConfigurations, bEnableDevelopment) == 0x000002, "Member 'FEnableBuildConfigurations::bEnableDevelopment' has a wrong offset!");
static_assert(offsetof(FEnableBuildConfigurations, bEnableTest) == 0x000003, "Member 'FEnableBuildConfigurations::bEnableTest' has a wrong offset!");
static_assert(offsetof(FEnableBuildConfigurations, bEnableShipping) == 0x000004, "Member 'FEnableBuildConfigurations::bEnableShipping' has a wrong offset!");

// ScriptStruct Sentry.EnableBuildTargets
// 0x0005 (0x0005 - 0x0000)
struct FEnableBuildTargets final
{
public:
	bool                                          bEnableClient;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableGame;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableEditor;                                     // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableServer;                                     // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProgram;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEnableBuildTargets) == 0x000001, "Wrong alignment on FEnableBuildTargets");
static_assert(sizeof(FEnableBuildTargets) == 0x000005, "Wrong size on FEnableBuildTargets");
static_assert(offsetof(FEnableBuildTargets, bEnableClient) == 0x000000, "Member 'FEnableBuildTargets::bEnableClient' has a wrong offset!");
static_assert(offsetof(FEnableBuildTargets, bEnableGame) == 0x000001, "Member 'FEnableBuildTargets::bEnableGame' has a wrong offset!");
static_assert(offsetof(FEnableBuildTargets, bEnableEditor) == 0x000002, "Member 'FEnableBuildTargets::bEnableEditor' has a wrong offset!");
static_assert(offsetof(FEnableBuildTargets, bEnableServer) == 0x000003, "Member 'FEnableBuildTargets::bEnableServer' has a wrong offset!");
static_assert(offsetof(FEnableBuildTargets, bEnableProgram) == 0x000004, "Member 'FEnableBuildTargets::bEnableProgram' has a wrong offset!");

// ScriptStruct Sentry.SentryVariant
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FSentryVariant final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSentryVariant) == 0x000008, "Wrong alignment on FSentryVariant");
static_assert(sizeof(FSentryVariant) == 0x000020, "Wrong size on FSentryVariant");

// ScriptStruct Sentry.SentryTransactionOptions
// 0x0058 (0x0058 - 0x0000)
struct FSentryTransactionOptions final
{
public:
	TMap<class FString, struct FSentryVariant>    CustomSamplingContext;                             // 0x0000(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          BindToScope;                                       // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSentryTransactionOptions) == 0x000008, "Wrong alignment on FSentryTransactionOptions");
static_assert(sizeof(FSentryTransactionOptions) == 0x000058, "Wrong size on FSentryTransactionOptions");
static_assert(offsetof(FSentryTransactionOptions, CustomSamplingContext) == 0x000000, "Member 'FSentryTransactionOptions::CustomSamplingContext' has a wrong offset!");
static_assert(offsetof(FSentryTransactionOptions, BindToScope) == 0x000050, "Member 'FSentryTransactionOptions::BindToScope' has a wrong offset!");

}

