#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequencerScripting

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SequencerScripting_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class SequencerScripting.MovieSceneScriptingKey
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneScriptingKey : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingKey">();
	}
	static class UMovieSceneScriptingKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingKey");
static_assert(sizeof(UMovieSceneScriptingKey) == 0x000040, "Wrong size on UMovieSceneScriptingKey");

// Class SequencerScripting.MovieSceneScriptingActorReferenceKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingActorReferenceKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(const struct FMovieSceneObjectBindingID& InNewValue)	 // 0x41474d4;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	struct FMovieSceneObjectBindingID GetValue() const	 // 0x41461bc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceKey">();
	}
	static class UMovieSceneScriptingActorReferenceKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingActorReferenceKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingActorReferenceKey");
static_assert(sizeof(UMovieSceneScriptingActorReferenceKey) == 0x000060, "Wrong size on UMovieSceneScriptingActorReferenceKey");

// Class SequencerScripting.MovieSceneScriptingChannel
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneScriptingChannel : public UObject
{
public:
	class FName                                   ChannelName;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingChannel">();
	}
	static class UMovieSceneScriptingChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingChannel");
static_assert(sizeof(UMovieSceneScriptingChannel) == 0x000030, "Wrong size on UMovieSceneScriptingChannel");
static_assert(offsetof(UMovieSceneScriptingChannel, ChannelName) == 0x000028, "Member 'UMovieSceneScriptingChannel::ChannelName' has a wrong offset!");

// Class SequencerScripting.MovieSceneScriptingActorReferenceChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingActorReferenceChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingActorReferenceKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneObjectBindingID& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x41447c4;
	void RemoveDefault()	 // 0x41464cc;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(const struct FMovieSceneObjectBindingID& InDefaultValue)	 // 0x4146800;

	struct FMovieSceneObjectBindingID GetDefault() const	 // 0x4145d80;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	bool HasDefault() const	 // 0x41463dc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceChannel">();
	}
	static class UMovieSceneScriptingActorReferenceChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingActorReferenceChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingActorReferenceChannel");
static_assert(sizeof(UMovieSceneScriptingActorReferenceChannel) == 0x000060, "Wrong size on UMovieSceneScriptingActorReferenceChannel");

// Class SequencerScripting.MovieSceneScriptingBoolKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingBoolKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(bool InNewValue)	 // 0x41475e0;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	bool GetValue() const	 // 0x4146200;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingBoolKey">();
	}
	static class UMovieSceneScriptingBoolKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingBoolKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingBoolKey");
static_assert(sizeof(UMovieSceneScriptingBoolKey) == 0x000060, "Wrong size on UMovieSceneScriptingBoolKey");

// Class SequencerScripting.MovieSceneScriptingBoolChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingBoolChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingBoolKey* AddKey(const struct FFrameNumber& InTime, bool NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x4144a18;
	void RemoveDefault()	 // 0x414650c;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(bool InDefaultValue)	 // 0x414694c;

	struct FSequencerScriptingRange ComputeEffectiveRange() const	 // 0x4145934;
	TArray<bool> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const	 // 0x41459cc;
	bool GetDefault() const	 // 0x4145db8;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	int32 GetNumKeys() const	 // 0x4145f0c;
	bool HasDefault() const	 // 0x4146430;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingBoolChannel">();
	}
	static class UMovieSceneScriptingBoolChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingBoolChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingBoolChannel");
static_assert(sizeof(UMovieSceneScriptingBoolChannel) == 0x000060, "Wrong size on UMovieSceneScriptingBoolChannel");

// Class SequencerScripting.MovieSceneScriptingByteKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingByteKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(uint8 InNewValue)	 // 0x41476d4;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	uint8 GetValue() const	 // 0x4146290;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingByteKey">();
	}
	static class UMovieSceneScriptingByteKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingByteKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingByteKey");
static_assert(sizeof(UMovieSceneScriptingByteKey) == 0x000060, "Wrong size on UMovieSceneScriptingByteKey");

// Class SequencerScripting.MovieSceneScriptingByteChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingByteChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingByteKey* AddKey(const struct FFrameNumber& InTime, uint8 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation)	 // 0x4144d54;
	void RemoveDefault()	 // 0x414650c;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(uint8 InDefaultValue)	 // 0x4146a48;

	uint8 GetDefault() const	 // 0x4145db8;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	bool HasDefault() const	 // 0x4146430;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingByteChannel">();
	}
	static class UMovieSceneScriptingByteChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingByteChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingByteChannel");
static_assert(sizeof(UMovieSceneScriptingByteChannel) == 0x000060, "Wrong size on UMovieSceneScriptingByteChannel");

// Class SequencerScripting.MovieSceneScriptingDoubleKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingDoubleKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetArriveTangent(float InNewValue)	 // 0x4146678;
	void SetArriveTangentWeight(float InNewValue)	 // 0x414673c;
	void SetInterpolationMode(ERichCurveInterpMode InNewValue)	 // 0x4146bfc;
	void SetLeaveTangent(float InNewValue)	 // 0x4146d14;
	void SetLeaveTangentWeight(float InNewValue)	 // 0x4146dd8;
	void SetTangentMode(ERichCurveTangentMode InNewValue)	 // 0x414703c;
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue)	 // 0x4147154;
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(double InNewValue)	 // 0x41477c4;

	float GetArriveTangent() const	 // 0x4145d30;
	float GetArriveTangentWeight() const	 // 0x4145d58;
	ERichCurveInterpMode GetInterpolationMode() const	 // 0x4145e28;
	float GetLeaveTangent() const	 // 0x4145ebc;
	float GetLeaveTangentWeight() const	 // 0x4145ee4;
	ERichCurveTangentMode GetTangentMode() const	 // 0x4146044;
	ERichCurveTangentWeightMode GetTangentWeightMode() const	 // 0x4146098;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	double GetValue() const	 // 0x4146338;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleKey">();
	}
	static class UMovieSceneScriptingDoubleKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleKey");
static_assert(sizeof(UMovieSceneScriptingDoubleKey) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleKey");

// Class SequencerScripting.MovieSceneScriptingDoubleChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingDoubleChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingDoubleKey* AddKey(const struct FFrameNumber& InTime, double NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation)	 // 0x414518c;
	void RemoveDefault()	 // 0x4146560;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(double InDefaultValue)	 // 0x4146b34;
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation)	 // 0x4146e9c;
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation)	 // 0x4146f6c;

	struct FSequencerScriptingRange ComputeEffectiveRange() const	 // 0x4145980;
	TArray<double> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const	 // 0x4145b7c;
	double GetDefault() const	 // 0x4145e00;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	int32 GetNumKeys() const	 // 0x4145f64;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const	 // 0x4145fbc;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const	 // 0x4146000;
	bool HasDefault() const	 // 0x4146470;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleChannel">();
	}
	static class UMovieSceneScriptingDoubleChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleChannel");
static_assert(sizeof(UMovieSceneScriptingDoubleChannel) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleChannel");

// Class SequencerScripting.MovieSceneScriptingEventKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingEventKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(const struct FMovieSceneEvent& InNewValue)	 // 0x414788c;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	struct FMovieSceneEvent GetValue() const	 // 0x414638c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingEventKey">();
	}
	static class UMovieSceneScriptingEventKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingEventKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingEventKey");
static_assert(sizeof(UMovieSceneScriptingEventKey) == 0x000060, "Wrong size on UMovieSceneScriptingEventKey");

// Class SequencerScripting.MovieSceneScriptingEventChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingEventChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingEventKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneEvent& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x41455b4;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;

	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingEventChannel">();
	}
	static class UMovieSceneScriptingEventChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingEventChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingEventChannel");
static_assert(sizeof(UMovieSceneScriptingEventChannel) == 0x000060, "Wrong size on UMovieSceneScriptingEventChannel");

// Class SequencerScripting.MovieSceneScriptingFloatKey
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneScriptingFloatKey : public UMovieSceneScriptingKey
{
public:
	void SetArriveTangent(float InNewValue)	 // 0x4155abc;
	void SetArriveTangentWeight(float InNewValue)	 // 0x4155b84;
	void SetInterpolationMode(ERichCurveInterpMode InNewValue)	 // 0x41569bc;
	void SetLeaveTangent(float InNewValue)	 // 0x4156a80;
	void SetLeaveTangentWeight(float InNewValue)	 // 0x4156b48;
	void SetTangentMode(ERichCurveTangentMode InNewValue)	 // 0x415828c;
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue)	 // 0x4158350;
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x4158414;
	void SetValue(float InNewValue)	 // 0x4158668;

	float GetArriveTangent() const	 // 0x4152170;
	float GetArriveTangentWeight() const	 // 0x415219c;
	ERichCurveInterpMode GetInterpolationMode() const	 // 0x4153a04;
	float GetLeaveTangent() const	 // 0x4153a2c;
	float GetLeaveTangentWeight() const	 // 0x4153a58;
	ERichCurveTangentMode GetTangentMode() const	 // 0x4154acc;
	ERichCurveTangentWeightMode GetTangentWeightMode() const	 // 0x4154af4;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	float GetValue() const	 // 0x4154c98;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingFloatKey">();
	}
	static class UMovieSceneScriptingFloatKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingFloatKey");
static_assert(sizeof(UMovieSceneScriptingFloatKey) == 0x000040, "Wrong size on UMovieSceneScriptingFloatKey");

// Class SequencerScripting.MovieSceneScriptingActualFloatKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingActualFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingActualFloatKey">();
	}
	static class UMovieSceneScriptingActualFloatKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActualFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingActualFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingActualFloatKey");
static_assert(sizeof(UMovieSceneScriptingActualFloatKey) == 0x000060, "Wrong size on UMovieSceneScriptingActualFloatKey");

// Class SequencerScripting.MovieSceneScriptingDoubleAsFloatKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingDoubleAsFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleAsFloatKey">();
	}
	static class UMovieSceneScriptingDoubleAsFloatKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleAsFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleAsFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleAsFloatKey");
static_assert(sizeof(UMovieSceneScriptingDoubleAsFloatKey) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleAsFloatKey");

// Class SequencerScripting.MovieSceneScriptingFloatChannel
// 0x0050 (0x0080 - 0x0030)
class UMovieSceneScriptingFloatChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingFloatKey* AddKey(const struct FFrameNumber& InTime, float NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation)	 // 0x4150744;
	void RemoveDefault()	 // 0x415582c;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(float InDefaultValue)	 // 0x4155d9c;
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation)	 // 0x41572ac;
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation)	 // 0x415738c;

	struct FSequencerScriptingRange ComputeEffectiveRange() const	 // 0x41515c4;
	TArray<float> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const	 // 0x4151650;
	float GetDefault() const	 // 0x4153304;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	int32 GetNumKeys() const	 // 0x4153cd8;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const	 // 0x41544d4;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const	 // 0x4154530;
	bool HasDefault() const	 // 0x4154e50;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingFloatChannel">();
	}
	static class UMovieSceneScriptingFloatChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingFloatChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingFloatChannel");
static_assert(sizeof(UMovieSceneScriptingFloatChannel) == 0x000080, "Wrong size on UMovieSceneScriptingFloatChannel");

// Class SequencerScripting.MovieSceneScriptingIntegerKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingIntegerKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(int32 InNewValue)	 // 0x4158730;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	int32 GetValue() const	 // 0x4154cc4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerKey">();
	}
	static class UMovieSceneScriptingIntegerKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingIntegerKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingIntegerKey");
static_assert(sizeof(UMovieSceneScriptingIntegerKey) == 0x000060, "Wrong size on UMovieSceneScriptingIntegerKey");

// Class SequencerScripting.MovieSceneScriptingIntegerChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingIntegerChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingIntegerKey* AddKey(const struct FFrameNumber& InTime, int32 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x4150b68;
	void RemoveDefault()	 // 0x41558bc;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(int32 InDefaultValue)	 // 0x4155e60;

	int32 GetDefault() const	 // 0x415332c;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	bool HasDefault() const	 // 0x4154edc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerChannel">();
	}
	static class UMovieSceneScriptingIntegerChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingIntegerChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingIntegerChannel");
static_assert(sizeof(UMovieSceneScriptingIntegerChannel) == 0x000060, "Wrong size on UMovieSceneScriptingIntegerChannel");

// Class SequencerScripting.MovieSceneScriptingObjectPathKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingObjectPathKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(class UObject* InNewValue)	 // 0x4158820;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	class UObject* GetValue() const	 // 0x4154d68;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathKey">();
	}
	static class UMovieSceneScriptingObjectPathKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingObjectPathKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingObjectPathKey");
static_assert(sizeof(UMovieSceneScriptingObjectPathKey) == 0x000060, "Wrong size on UMovieSceneScriptingObjectPathKey");

// Class SequencerScripting.MovieSceneScriptingObjectPathChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingObjectPathChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingObjectPathKey* AddKey(const struct FFrameNumber& InTime, class UObject* NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x4150ea8;
	void RemoveDefault()	 // 0x41464cc;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(class UObject* InDefaultValue)	 // 0x4155f4c;

	class UObject* GetDefault() const	 // 0x4153390;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	bool HasDefault() const	 // 0x4154f38;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathChannel">();
	}
	static class UMovieSceneScriptingObjectPathChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingObjectPathChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingObjectPathChannel");
static_assert(sizeof(UMovieSceneScriptingObjectPathChannel) == 0x000060, "Wrong size on UMovieSceneScriptingObjectPathChannel");

// Class SequencerScripting.MovieSceneScriptingStringKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingStringKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x414726c;
	void SetValue(const class FString& InNewValue)	 // 0x41588e0;

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const	 // 0x41460ec;
	class FString GetValue() const	 // 0x4154dc4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingStringKey">();
	}
	static class UMovieSceneScriptingStringKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingStringKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingStringKey");
static_assert(sizeof(UMovieSceneScriptingStringKey) == 0x000060, "Wrong size on UMovieSceneScriptingStringKey");

// Class SequencerScripting.MovieSceneScriptingStringChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingStringChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingStringKey* AddKey(const struct FFrameNumber& InTime, const class FString& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit)	 // 0x41510dc;
	void RemoveDefault()	 // 0x4146560;
	void RemoveKey(class UMovieSceneScriptingKey* Key)	 // 0x41465b4;
	void SetDefault(const class FString& InDefaultValue)	 // 0x4156028;

	class FString GetDefault() const	 // 0x41533b4;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const	 // 0x4145e7c;
	bool HasDefault() const	 // 0x4154f64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneScriptingStringChannel">();
	}
	static class UMovieSceneScriptingStringChannel* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingStringChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingStringChannel");
static_assert(sizeof(UMovieSceneScriptingStringChannel) == 0x000060, "Wrong size on UMovieSceneScriptingStringChannel");

// Class SequencerScripting.MovieSceneBindingExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneBindingExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneTrack* AddTrack(const struct FMovieSceneBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415143c;
	static TArray<class UMovieSceneTrack*> FindTracksByExactType(const struct FMovieSceneBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x4151934;
	static TArray<class UMovieSceneTrack*> FindTracksByType(const struct FMovieSceneBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x4151ad0;
	static TArray<struct FMovieSceneBindingProxy> GetChildPossessables(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4153184;
	static class FText GetDisplayName(const struct FMovieSceneBindingProxy& InBinding)	 // 0x41533f4;
	static struct FGuid GetId(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4153974;
	static class FString GetName(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4153c24;
	static class UObject* GetObjectTemplate(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4153e30;
	static struct FMovieSceneBindingProxy GetParent(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4153ef0;
	static class UClass* GetPossessedObjectClass(const struct FMovieSceneBindingProxy& InBinding)	 // 0x415443c;
	static int32 GetSortingOrder(const struct FMovieSceneBindingProxy& InBinding)	 // 0x415477c;
	static TArray<class UMovieSceneTrack*> GetTracks(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4154b1c;
	static bool IsValid(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4155194;
	static void MoveBindingContents(const struct FMovieSceneBindingProxy& SourceBindingId, const struct FMovieSceneBindingProxy& DestinationBindingId)	 // 0x4155224;
	static void Remove(const struct FMovieSceneBindingProxy& InBinding)	 // 0x4155310;
	static void RemoveTrack(const struct FMovieSceneBindingProxy& InBinding, class UMovieSceneTrack* TrackToRemove)	 // 0x4155910;
	static void SetDisplayName(const struct FMovieSceneBindingProxy& InBinding, const class FText& InDisplayName)	 // 0x415614c;
	static void SetName(const struct FMovieSceneBindingProxy& InBinding, const class FString& InName)	 // 0x4156ea8;
	static void SetParent(const struct FMovieSceneBindingProxy& InBinding, const struct FMovieSceneBindingProxy& InParentBinding)	 // 0x4157190;
	static void SetSortingOrder(const struct FMovieSceneBindingProxy& InBinding, int32 SortingOrder)	 // 0x4157b04;
	static void SetSpawnableBindingID(const struct FMovieSceneBindingProxy& InBinding, const struct FMovieSceneObjectBindingID& SpawnableBindingID)	 // 0x4157c70;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneBindingExtensions">();
	}
	static class UMovieSceneBindingExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneBindingExtensions>();
	}
};
static_assert(alignof(UMovieSceneBindingExtensions) == 0x000008, "Wrong alignment on UMovieSceneBindingExtensions");
static_assert(sizeof(UMovieSceneBindingExtensions) == 0x000028, "Wrong size on UMovieSceneBindingExtensions");

// Class SequencerScripting.MovieSceneEventTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneEventTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneEventRepeaterSection* AddEventRepeaterSection(class UMovieSceneEventTrack* InTrack)	 // 0x415054c;
	static class UMovieSceneEventTriggerSection* AddEventTriggerSection(class UMovieSceneEventTrack* InTrack)	 // 0x4150648;
	static class UClass* GetBoundObjectPropertyClass(const struct FMovieSceneEvent& EventKey)	 // 0x41526e8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneEventTrackExtensions">();
	}
	static class UMovieSceneEventTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneEventTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneEventTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneEventTrackExtensions");
static_assert(sizeof(UMovieSceneEventTrackExtensions) == 0x000028, "Wrong size on UMovieSceneEventTrackExtensions");

// Class SequencerScripting.MovieSceneFolderExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneFolderExtensions final : public UBlueprintFunctionLibrary
{
public:
	static bool AddChildFolder(class UMovieSceneFolder* TargetFolder, class UMovieSceneFolder* FolderToAdd)	 // 0x41500c0;
	static bool AddChildMasterTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InTrack)	 // 0x4150248;
	static bool AddChildObjectBinding(class UMovieSceneFolder* Folder, const struct FMovieSceneBindingProxy& InObjectBinding)	 // 0x4150388;
	static bool AddChildTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InTrack)	 // 0x4150248;
	static TArray<class UMovieSceneFolder*> GetChildFolders(class UMovieSceneFolder* Folder)	 // 0x4152d88;
	static TArray<class UMovieSceneTrack*> GetChildMasterTracks(class UMovieSceneFolder* Folder)	 // 0x4152ed0;
	static TArray<struct FMovieSceneBindingProxy> GetChildObjectBindings(class UMovieSceneFolder* Folder)	 // 0x4152fac;
	static TArray<class UMovieSceneTrack*> GetChildTracks(class UMovieSceneFolder* Folder)	 // 0x415322c;
	static struct FColor GetFolderColor(class UMovieSceneFolder* Folder)	 // 0x41537d0;
	static class FName GetFolderName(class UMovieSceneFolder* Folder)	 // 0x4153898;
	static bool RemoveChildFolder(class UMovieSceneFolder* TargetFolder, class UMovieSceneFolder* FolderToRemove)	 // 0x41553c4;
	static bool RemoveChildMasterTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InTrack)	 // 0x4155538;
	static bool RemoveChildObjectBinding(class UMovieSceneFolder* Folder, const struct FMovieSceneBindingProxy& InObjectBinding)	 // 0x4155678;
	static bool RemoveChildTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InTrack)	 // 0x4155538;
	static bool SetFolderColor(class UMovieSceneFolder* Folder, const struct FColor& InFolderColor)	 // 0x415671c;
	static bool SetFolderName(class UMovieSceneFolder* Folder, class FName InFolderName)	 // 0x4156864;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneFolderExtensions">();
	}
	static class UMovieSceneFolderExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneFolderExtensions>();
	}
};
static_assert(alignof(UMovieSceneFolderExtensions) == 0x000008, "Wrong alignment on UMovieSceneFolderExtensions");
static_assert(sizeof(UMovieSceneFolderExtensions) == 0x000028, "Wrong size on UMovieSceneFolderExtensions");

// Class SequencerScripting.MovieSceneMaterialTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneMaterialTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetMaterialIndex(class UMovieSceneComponentMaterialTrack* Track)	 // 0x4153a84;
	static void SetMaterialIndex(class UMovieSceneComponentMaterialTrack* Track, const int32 MaterialIndex)	 // 0x4156c10;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneMaterialTrackExtensions">();
	}
	static class UMovieSceneMaterialTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneMaterialTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneMaterialTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneMaterialTrackExtensions");
static_assert(sizeof(UMovieSceneMaterialTrackExtensions) == 0x000028, "Wrong size on UMovieSceneMaterialTrackExtensions");

// Class SequencerScripting.MovieScenePrimitiveMaterialTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieScenePrimitiveMaterialTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetMaterialIndex(class UMovieScenePrimitiveMaterialTrack* Track)	 // 0x4153b54;
	static void SetMaterialIndex(class UMovieScenePrimitiveMaterialTrack* Track, const int32 MaterialIndex)	 // 0x4156d5c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieScenePrimitiveMaterialTrackExtensions">();
	}
	static class UMovieScenePrimitiveMaterialTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieScenePrimitiveMaterialTrackExtensions>();
	}
};
static_assert(alignof(UMovieScenePrimitiveMaterialTrackExtensions) == 0x000008, "Wrong alignment on UMovieScenePrimitiveMaterialTrackExtensions");
static_assert(sizeof(UMovieScenePrimitiveMaterialTrackExtensions) == 0x000028, "Wrong size on UMovieScenePrimitiveMaterialTrackExtensions");

// Class SequencerScripting.MovieScenePropertyTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieScenePropertyTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UEnum* GetByteTrackEnum(class UMovieSceneByteTrack* Track)	 // 0x41527a8;
	static class UClass* GetObjectPropertyClass(class UMovieSceneObjectPropertyTrack* Track)	 // 0x4153d54;
	static class FName GetPropertyName(class UMovieScenePropertyTrack* Track)	 // 0x415458c;
	static class FString GetPropertyPath(class UMovieScenePropertyTrack* Track)	 // 0x415466c;
	static class FName GetUniqueTrackName(class UMovieScenePropertyTrack* Track)	 // 0x4154bc4;
	static void SetByteTrackEnum(class UMovieSceneByteTrack* Track, class UEnum* InEnum)	 // 0x4155c4c;
	static void SetObjectPropertyClass(class UMovieSceneObjectPropertyTrack* Track, class UClass* PropertyClass)	 // 0x4157040;
	static void SetPropertyNameAndPath(class UMovieScenePropertyTrack* Track, const class FName& InPropertyName, const class FString& InPropertyPath)	 // 0x415746c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieScenePropertyTrackExtensions">();
	}
	static class UMovieScenePropertyTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieScenePropertyTrackExtensions>();
	}
};
static_assert(alignof(UMovieScenePropertyTrackExtensions) == 0x000008, "Wrong alignment on UMovieScenePropertyTrackExtensions");
static_assert(sizeof(UMovieScenePropertyTrackExtensions) == 0x000028, "Wrong size on UMovieScenePropertyTrackExtensions");

// Class SequencerScripting.MovieSceneSectionExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneSectionExtensions final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UMovieSceneScriptingChannel*> FindChannelsByType(class UMovieSceneSection* Section, TSubclassOf<class UMovieSceneScriptingChannel> ChannelType)	 // 0x41517e0;
	static TArray<class UMovieSceneScriptingChannel*> GetAllChannels(class UMovieSceneSection* Section)	 // 0x4151c6c;
	static int32 GetAutoSizeEndFrame(class UMovieSceneSection* Section)	 // 0x41521c8;
	static float GetAutoSizeEndFrameSeconds(class UMovieSceneSection* Section)	 // 0x4152288;
	static bool GetAutoSizeHasEndFrame(class UMovieSceneSection* Section)	 // 0x415234c;
	static bool GetAutoSizeHasStartFrame(class UMovieSceneSection* Section)	 // 0x4152458;
	static int32 GetAutoSizeStartFrame(class UMovieSceneSection* Section)	 // 0x4152564;
	static float GetAutoSizeStartFrameSeconds(class UMovieSceneSection* Section)	 // 0x4152624;
	static TArray<class UMovieSceneScriptingChannel*> GetChannels(class UMovieSceneSection* Section)	 // 0x4152884;
	static TArray<class UMovieSceneScriptingChannel*> GetChannelsByType(class UMovieSceneSection* Section, TSubclassOf<class UMovieSceneScriptingChannel> ChannelType)	 // 0x41517e0;
	static int32 GetEndFrame(class UMovieSceneSection* Section)	 // 0x4153504;
	static float GetEndFrameSeconds(class UMovieSceneSection* Section)	 // 0x4153640;
	static int32 GetParentSequenceFrame(class UMovieSceneSubSection* Section, int32 InFrame, class UMovieSceneSequence* ParentSequence)	 // 0x4153fd8;
	static int32 GetStartFrame(class UMovieSceneSection* Section)	 // 0x415480c;
	static float GetStartFrameSeconds(class UMovieSceneSection* Section)	 // 0x4154944;
	static bool HasEndFrame(class UMovieSceneSection* Section)	 // 0x4154fd4;
	static bool HasStartFrame(class UMovieSceneSection* Section)	 // 0x41550b4;
	static void SetEndFrame(class UMovieSceneSection* Section, int32 EndFrame)	 // 0x4156240;
	static void SetEndFrameBounded(class UMovieSceneSection* Section, bool bIsBounded)	 // 0x41563e4;
	static void SetEndFrameSeconds(class UMovieSceneSection* Section, float EndTime)	 // 0x4156578;
	static void SetRange(class UMovieSceneSection* Section, int32 StartFrame, int32 EndFrame)	 // 0x415761c;
	static void SetRangeSeconds(class UMovieSceneSection* Section, float StartTime, float EndTime)	 // 0x415788c;
	static void SetStartFrame(class UMovieSceneSection* Section, int32 StartFrame)	 // 0x4157db0;
	static void SetStartFrameBounded(class UMovieSceneSection* Section, bool bIsBounded)	 // 0x4157f54;
	static void SetStartFrameSeconds(class UMovieSceneSection* Section, float StartTime)	 // 0x41580e8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneSectionExtensions">();
	}
	static class UMovieSceneSectionExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneSectionExtensions>();
	}
};
static_assert(alignof(UMovieSceneSectionExtensions) == 0x000008, "Wrong alignment on UMovieSceneSectionExtensions");
static_assert(sizeof(UMovieSceneSectionExtensions) == 0x000028, "Wrong size on UMovieSceneSectionExtensions");

// Class SequencerScripting.MovieSceneSequenceExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneSequenceExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 AddMarkedFrame(class UMovieSceneSequence* Sequence, const struct FMovieSceneMarkedFrame& InMarkedFrame)	 // 0x415af58;
	static class UMovieSceneTrack* AddMasterTrack(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415b0b8;
	static struct FMovieSceneBindingProxy AddPossessable(class UMovieSceneSequence* Sequence, class UObject* ObjectToPossess)	 // 0x415b2b0;
	static class UMovieSceneFolder* AddRootFolderToSequence(class UMovieSceneSequence* Sequence, const class FString& NewFolderName)	 // 0x415b444;
	static struct FMovieSceneBindingProxy AddSpawnableFromClass(class UMovieSceneSequence* Sequence, class UClass* ClassToSpawn)	 // 0x415b6d0;
	static struct FMovieSceneBindingProxy AddSpawnableFromInstance(class UMovieSceneSequence* Sequence, class UObject* ObjectToSpawn)	 // 0x415b888;
	static class UMovieSceneTrack* AddTrack(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415b0b8;
	static void DeleteMarkedFrame(class UMovieSceneSequence* Sequence, int32 DeleteIndex)	 // 0x415ba40;
	static void DeleteMarkedFrames(class UMovieSceneSequence* Sequence)	 // 0x415bba0;
	static struct FMovieSceneBindingProxy FindBindingById(class UMovieSceneSequence* Sequence, const struct FGuid& BindingId)	 // 0x415bc70;
	static struct FMovieSceneBindingProxy FindBindingByName(class UMovieSceneSequence* Sequence, const class FString& Name_0)	 // 0x415be64;
	static int32 FindMarkedFrameByFrameNumber(class UMovieSceneSequence* Sequence, const struct FFrameNumber& InFrameNumber)	 // 0x415c030;
	static int32 FindMarkedFrameByLabel(class UMovieSceneSequence* Sequence, const class FString& InLabel)	 // 0x415c1a0;
	static TArray<class UMovieSceneTrack*> FindMasterTracksByExactType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415c32c;
	static TArray<class UMovieSceneTrack*> FindMasterTracksByType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415c484;
	static int32 FindNextMarkedFrame(class UMovieSceneSequence* Sequence, const struct FFrameNumber& InFrameNumber, bool bForward)	 // 0x415c5dc;
	static TArray<class UMovieSceneTrack*> FindTracksByExactType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415c7c0;
	static TArray<class UMovieSceneTrack*> FindTracksByType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType)	 // 0x415c914;
	static struct FMovieSceneObjectBindingID GetBindingID(const struct FMovieSceneBindingProxy& InBinding)	 // 0x415ca68;
	static TArray<struct FMovieSceneBindingProxy> GetBindings(class UMovieSceneSequence* Sequence)	 // 0x415cb18;
	static EUpdateClockSource GetClockSource(class UMovieSceneSequence* InSequence)	 // 0x415cca8;
	static struct FFrameRate GetDisplayRate(class UMovieSceneSequence* Sequence)	 // 0x415cf60;
	static EMovieSceneEvaluationType GetEvaluationType(class UMovieSceneSequence* InSequence)	 // 0x415d17c;
	static TArray<struct FMovieSceneMarkedFrame> GetMarkedFrames(class UMovieSceneSequence* Sequence)	 // 0x415d258;
	static TArray<class UMovieSceneTrack*> GetMasterTracks(class UMovieSceneSequence* Sequence)	 // 0x415d41c;
	static class UMovieScene* GetMovieScene(class UMovieSceneSequence* Sequence)	 // 0x415d4f8;
	static int32 GetPlaybackEnd(class UMovieSceneSequence* Sequence)	 // 0x415d688;
	static float GetPlaybackEndSeconds(class UMovieSceneSequence* Sequence)	 // 0x415d7c8;
	static struct FSequencerScriptingRange GetPlaybackRange(class UMovieSceneSequence* Sequence)	 // 0x415d958;
	static int32 GetPlaybackStart(class UMovieSceneSequence* Sequence)	 // 0x415da88;
	static float GetPlaybackStartSeconds(class UMovieSceneSequence* Sequence)	 // 0x415dbc0;
	static struct FMovieSceneObjectBindingID GetPortableBindingID(class UMovieSceneSequence* RootSequence, class UMovieSceneSequence* DestinationSequence, const struct FMovieSceneBindingProxy& InBinding)	 // 0x415dd48;
	static TArray<struct FMovieSceneBindingProxy> GetPossessables(class UMovieSceneSequence* Sequence)	 // 0x415def0;
	static TArray<class UMovieSceneFolder*> GetRootFoldersInSequence(class UMovieSceneSequence* Sequence)	 // 0x415e0b4;
	static TArray<struct FMovieSceneBindingProxy> GetSpawnables(class UMovieSceneSequence* Sequence)	 // 0x415e4c4;
	static struct FFrameRate GetTickResolution(class UMovieSceneSequence* Sequence)	 // 0x415e7dc;
	static struct FTimecode GetTimecodeSource(class UMovieSceneSequence* Sequence)	 // 0x415e8a4;
	static TArray<class UMovieSceneTrack*> GetTracks(class UMovieSceneSequence* Sequence)	 // 0x415eb04;
	static float GetViewRangeEnd(class UMovieSceneSequence* InSequence)	 // 0x415ebdc;
	static float GetViewRangeStart(class UMovieSceneSequence* InSequence)	 // 0x415ecac;
	static float GetWorkRangeEnd(class UMovieSceneSequence* InSequence)	 // 0x415ed7c;
	static float GetWorkRangeStart(class UMovieSceneSequence* InSequence)	 // 0x415ee4c;
	static bool IsReadOnly(class UMovieSceneSequence* Sequence)	 // 0x415f04c;
	static TArray<class UObject*> LocateBoundObjects(class UMovieSceneSequence* Sequence, const struct FMovieSceneBindingProxy& InBinding, class UObject* Context)	 // 0x415f110;
	static struct FMovieSceneObjectBindingID MakeBindingID(class UMovieSceneSequence* Sequence, const struct FMovieSceneBindingProxy& InBinding, EMovieSceneObjectBindingSpace Space)	 // 0x415f3f4;
	static struct FSequencerScriptingRange MakeRange(class UMovieSceneSequence* Sequence, int32 StartFrame, int32 Duration)	 // 0x415f62c;
	static struct FSequencerScriptingRange MakeRangeSeconds(class UMovieSceneSequence* Sequence, float StartTime, float Duration)	 // 0x415f840;
	static bool RemoveMasterTrack(class UMovieSceneSequence* Sequence, class UMovieSceneTrack* Track)	 // 0x415fb40;
	static void RemoveRootFolderFromSequence(class UMovieSceneSequence* Sequence, class UMovieSceneFolder* Folder)	 // 0x415fc80;
	static bool RemoveTrack(class UMovieSceneSequence* Sequence, class UMovieSceneTrack* Track)	 // 0x415fb40;
	static struct FMovieSceneBindingProxy ResolveBindingID(class UMovieSceneSequence* RootSequence, const struct FMovieSceneObjectBindingID& InObjectBindingID)	 // 0x416014c;
	static void SetClockSource(class UMovieSceneSequence* InSequence, EUpdateClockSource InClockSource)	 // 0x4160338;
	static void SetDisplayRate(class UMovieSceneSequence* Sequence, const struct FFrameRate& DisplayRate)	 // 0x41606ac;
	static void SetEvaluationType(class UMovieSceneSequence* InSequence, EMovieSceneEvaluationType InEvaluationType)	 // 0x4160b34;
	static void SetMarkedFrame(class UMovieSceneSequence* Sequence, int32 InMarkIndex, const struct FFrameNumber& InFrameNumber)	 // 0x4160ca0;
	static void SetPlaybackEnd(class UMovieSceneSequence* Sequence, int32 EndFrame)	 // 0x4160fe0;
	static void SetPlaybackEndSeconds(class UMovieSceneSequence* Sequence, float EndTime)	 // 0x4161188;
	static void SetPlaybackStart(class UMovieSceneSequence* Sequence, int32 StartFrame)	 // 0x4161338;
	static void SetPlaybackStartSeconds(class UMovieSceneSequence* Sequence, float StartTime)	 // 0x41614e0;
	static void SetReadOnly(class UMovieSceneSequence* Sequence, bool bInReadOnly)	 // 0x4161690;
	static void SetTickResolution(class UMovieSceneSequence* Sequence, const struct FFrameRate& TickResolution)	 // 0x4161d70;
	static void SetTickResolutionDirectly(class UMovieSceneSequence* Sequence, const struct FFrameRate& TickResolution)	 // 0x4161ee0;
	static void SetViewRangeEnd(class UMovieSceneSequence* InSequence, float EndTimeInSeconds)	 // 0x41621d0;
	static void SetViewRangeStart(class UMovieSceneSequence* InSequence, float StartTimeInSeconds)	 // 0x4162318;
	static void SetWorkRangeEnd(class UMovieSceneSequence* InSequence, float EndTimeInSeconds)	 // 0x4162460;
	static void SetWorkRangeStart(class UMovieSceneSequence* InSequence, float StartTimeInSeconds)	 // 0x41625a8;
	static void SortMarkedFrames(class UMovieSceneSequence* Sequence)	 // 0x41626f0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneSequenceExtensions">();
	}
	static class UMovieSceneSequenceExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneSequenceExtensions>();
	}
};
static_assert(alignof(UMovieSceneSequenceExtensions) == 0x000008, "Wrong alignment on UMovieSceneSequenceExtensions");
static_assert(sizeof(UMovieSceneSequenceExtensions) == 0x000028, "Wrong size on UMovieSceneSequenceExtensions");

// Class SequencerScripting.MovieSceneTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneSection* AddSection(class UMovieSceneTrack* Track)	 // 0x415b5cc;
	static struct FColor GetColorTint(class UMovieSceneTrack* Track)	 // 0x415cd8c;
	static class FText GetDisplayName(class UMovieSceneTrack* Track)	 // 0x415ce54;
	static TArray<class UMovieSceneSection*> GetSections(class UMovieSceneTrack* Track)	 // 0x415e288;
	static class UMovieSceneSection* GetSectionToKey(class UMovieSceneTrack* Track)	 // 0x415e1a8;
	static int32 GetSortingOrder(class UMovieSceneTrack* Track)	 // 0x415e3f4;
	static class FText GetTrackRowDisplayName(class UMovieSceneTrack* Track, int32 rowIndex)	 // 0x415e980;
	static void RemoveSection(class UMovieSceneTrack* Track, class UMovieSceneSection* Section)	 // 0x415ff64;
	static void SetColorTint(class UMovieSceneTrack* Track, const struct FColor& ColorTint)	 // 0x41604a0;
	static void SetDisplayName(class UMovieSceneTrack* Track, const class FText& InName)	 // 0x416059c;
	static void SetSectionToKey(class UMovieSceneTrack* Track, class UMovieSceneSection* Section)	 // 0x41617d0;
	static void SetSortingOrder(class UMovieSceneTrack* Track, int32 SortingOrder)	 // 0x4161924;
	static void SetTrackRowDisplayName(class UMovieSceneTrack* Track, const class FText& InName, int32 rowIndex)	 // 0x4162044;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneTrackExtensions">();
	}
	static class UMovieSceneTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneTrackExtensions");
static_assert(sizeof(UMovieSceneTrackExtensions) == 0x000028, "Wrong size on UMovieSceneTrackExtensions");

// Class SequencerScripting.MovieSceneFloatVectorTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneFloatVectorTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetNumChannelsUsed(class UMovieSceneFloatVectorTrack* Track)	 // 0x415d5b8;
	static void SetNumChannelsUsed(class UMovieSceneFloatVectorTrack* Track, int32 InNumChannelsUsed)	 // 0x4160e94;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneFloatVectorTrackExtensions">();
	}
	static class UMovieSceneFloatVectorTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneFloatVectorTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneFloatVectorTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneFloatVectorTrackExtensions");
static_assert(sizeof(UMovieSceneFloatVectorTrackExtensions) == 0x000028, "Wrong size on UMovieSceneFloatVectorTrackExtensions");

// Class SequencerScripting.MovieSceneDoubleVectorTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneDoubleVectorTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetNumChannelsUsed(class UMovieSceneDoubleVectorTrack* Track)	 // 0x415d5b8;
	static void SetNumChannelsUsed(class UMovieSceneDoubleVectorTrack* Track, int32 InNumChannelsUsed)	 // 0x4160e94;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneDoubleVectorTrackExtensions">();
	}
	static class UMovieSceneDoubleVectorTrackExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneDoubleVectorTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneDoubleVectorTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneDoubleVectorTrackExtensions");
static_assert(sizeof(UMovieSceneDoubleVectorTrackExtensions) == 0x000028, "Wrong size on UMovieSceneDoubleVectorTrackExtensions");

// Class SequencerScripting.SequencerScriptingRangeExtensions
// 0x0000 (0x0028 - 0x0028)
class USequencerScriptingRangeExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetEndFrame(const struct FSequencerScriptingRange& Range)	 // 0x415d028;
	static float GetEndSeconds(const struct FSequencerScriptingRange& Range)	 // 0x415d0bc;
	static int32 GetStartFrame(const struct FSequencerScriptingRange& Range)	 // 0x415e688;
	static float GetStartSeconds(const struct FSequencerScriptingRange& Range)	 // 0x415e71c;
	static bool HasEnd(const struct FSequencerScriptingRange& Range)	 // 0x415ef1c;
	static bool HasStart(const struct FSequencerScriptingRange& Range)	 // 0x415efb4;
	static void RemoveEnd(struct FSequencerScriptingRange& Range)	 // 0x415fab0;
	static void RemoveStart(struct FSequencerScriptingRange& Range)	 // 0x41600bc;
	static void SetEndFrame(struct FSequencerScriptingRange& Range, int32 End)	 // 0x4160810;
	static void SetEndSeconds(struct FSequencerScriptingRange& Range, float End)	 // 0x4160994;
	static void SetStartFrame(struct FSequencerScriptingRange& Range, int32 Start)	 // 0x4161a64;
	static void SetStartSeconds(struct FSequencerScriptingRange& Range, float Start)	 // 0x4161be8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SequencerScriptingRangeExtensions">();
	}
	static class USequencerScriptingRangeExtensions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USequencerScriptingRangeExtensions>();
	}
};
static_assert(alignof(USequencerScriptingRangeExtensions) == 0x000008, "Wrong alignment on USequencerScriptingRangeExtensions");
static_assert(sizeof(USequencerScriptingRangeExtensions) == 0x000028, "Wrong size on USequencerScriptingRangeExtensions");

}

