#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint.SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x0147 (0x0148 - 0x0001)
struct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_101;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_102;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_103;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_104;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_105;                                 // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_106;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_107;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_108;                                // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_109;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_110;                                // 0x003C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_111;                               // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_112;                              // 0x0044(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_113;                               // 0x0070(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_114;                                // 0x0074(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_115;                                // 0x0075(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_116;                                // 0x0076(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_117;                                // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_118;                                // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_119;                                 // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_120;                              // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
};
static_assert(alignof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000148, "Wrong size on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_101) == 0x000004, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_101' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_102) == 0x00000C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_102' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_103) == 0x000014, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_103' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000018, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_105) == 0x000020, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_105' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_106) == 0x000024, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_106' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_107) == 0x00002C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_107' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_108) == 0x000030, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_108' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_109) == 0x000038, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_109' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_110) == 0x00003C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_110' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_111) == 0x000040, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_111' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_112) == 0x000044, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_112' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_113) == 0x000070, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_113' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_114) == 0x000074, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_114' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_115) == 0x000075, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_115' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_116) == 0x000076, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_116' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_117) == 0x000078, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_117' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_118) == 0x000080, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_118' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_119) == 0x000088, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_119' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_120) == 0x000090, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_120' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint.SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

