#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint.SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint.SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C.ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint
// 0x00A8 (0x00A8 - 0x0000)
struct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewState;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTime_ReturnValue_1;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_2;     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_3;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1;  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_2;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_3;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_ImplicitCast; // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet___FloatProperty_0_ImplicitCast; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint");
static_assert(sizeof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint) == 0x0000A8, "Wrong size on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, K2Node_CustomEvent_NewState) == 0x000004, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::K2Node_CustomEvent_NewState' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTime_ReturnValue) == 0x00000C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000010, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000011, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000015, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_1) == 0x000016, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000017, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000018, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTime_ReturnValue_1) == 0x00001C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000021, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_2) == 0x000022, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000023, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_3) == 0x000024, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Not_PreBool_ReturnValue_1) == 0x000025, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000028, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_4) == 0x00002C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x00002D, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00002E, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x00002F, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_5) == 0x000030, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000034, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_ReturnValue_2) == 0x000038, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue) == 0x00003C, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_BooleanAND_ReturnValue_6) == 0x000040, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_ReturnValue_3) == 0x000041, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000042, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_SelectFloat_ReturnValue) == 0x000048, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x000050, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000068, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000070, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1) == 0x000078, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000080, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1) == 0x000088, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_2) == 0x000090, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_3) == 0x000098, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, K2Node_StructMemberSet___FloatProperty_ImplicitCast) == 0x0000A0, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::K2Node_StructMemberSet___FloatProperty_ImplicitCast' has a wrong offset!");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint, K2Node_StructMemberSet___FloatProperty_0_ImplicitCast) == 0x0000A4, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint::K2Node_StructMemberSet___FloatProperty_0_ImplicitCast' has a wrong offset!");

// Function SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint.SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C.SetState
// 0x0004 (0x0004 - 0x0000)
struct SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState final
{
public:
	int32                                         NewState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState) == 0x000004, "Wrong alignment on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState");
static_assert(sizeof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState) == 0x000004, "Wrong size on SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState");
static_assert(offsetof(SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState, NewState) == 0x000000, "Member 'SK_Facilitiy_ChemLab_Base_01_A_Skeleton_AnimBlueprint_C_SetState::NewState' has a wrong offset!");

}

