#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpectreBossRuntime

#include "Basic.hpp"

#include "Mercuna_structs.hpp"
#include "Mercuna_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "SpectreBossRuntime_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AICommon_structs.hpp"
#include "AICommon_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"
#include "Water_classes.hpp"


namespace SDK
{

// Class SpectreBossRuntime.P2AbilityTask_Dash
// 0x0048 (0x00C8 - 0x0080)
class UP2AbilityTask_Dash final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bDashFinished)> OnDashFinished;                               // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_Dash">();
	}
	static class UP2AbilityTask_Dash* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_Dash>();
	}
};
static_assert(alignof(UP2AbilityTask_Dash) == 0x000008, "Wrong alignment on UP2AbilityTask_Dash");
static_assert(sizeof(UP2AbilityTask_Dash) == 0x0000C8, "Wrong size on UP2AbilityTask_Dash");
static_assert(offsetof(UP2AbilityTask_Dash, OnDashFinished) == 0x0000B8, "Member 'UP2AbilityTask_Dash::OnDashFinished' has a wrong offset!");

// Class SpectreBossRuntime.P2AbilityTask_PsiPulse
// 0x00B8 (0x0138 - 0x0080)
class UP2AbilityTask_PsiPulse final : public UAbilityTask
{
public:
	uint8                                         Pad_80[0x78];                                      // 0x0080(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AffectedActors;                                    // 0x00F8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0108(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* HitActor)> OnHitActor;                               // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UP2AbilityTask_PsiPulse* DoBoxPulse(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& Location, const struct FVector& Direction, float Distance, const struct FVector2D& Dimensions, float WaveDepth, float Speed, bool DrawDebug)	 // 0x4d6d4b4;
	static class UP2AbilityTask_PsiPulse* DoConePulse(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& Location, const struct FVector& Direction, float Distance, float StartRadius, float EndRadius, float WaveDepth, float Speed, bool DrawDebug)	 // 0x4d6d98c;
	static class UP2AbilityTask_PsiPulse* DoSpherePulse(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FVector& Location, float StartRadius, float EndRadius, float Speed, bool DrawDebug)	 // 0x4d6dfa4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_PsiPulse">();
	}
	static class UP2AbilityTask_PsiPulse* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_PsiPulse>();
	}
};
static_assert(alignof(UP2AbilityTask_PsiPulse) == 0x000008, "Wrong alignment on UP2AbilityTask_PsiPulse");
static_assert(sizeof(UP2AbilityTask_PsiPulse) == 0x000138, "Wrong size on UP2AbilityTask_PsiPulse");
static_assert(offsetof(UP2AbilityTask_PsiPulse, AffectedActors) == 0x0000F8, "Member 'UP2AbilityTask_PsiPulse::AffectedActors' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_PsiPulse, ActorsToIgnore) == 0x000108, "Member 'UP2AbilityTask_PsiPulse::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_PsiPulse, OnCompleted) == 0x000118, "Member 'UP2AbilityTask_PsiPulse::OnCompleted' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_PsiPulse, OnHitActor) == 0x000128, "Member 'UP2AbilityTask_PsiPulse::OnHitActor' has a wrong offset!");

// Class SpectreBossRuntime.P2AbilityTask_SetChrCollision
// 0x0060 (0x00E0 - 0x0080)
class UP2AbilityTask_SetChrCollision final : public UAbilityTask
{
public:
	struct FCollisionPayload                      Params_0;                                          // 0x0080(0x0020)(Net, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x40];                                      // 0x00A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2AbilityTask_SetChrCollision* SetCollision(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, const struct FCollisionPayload& Payload)	 // 0x4d6f144;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_SetChrCollision">();
	}
	static class UP2AbilityTask_SetChrCollision* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_SetChrCollision>();
	}
};
static_assert(alignof(UP2AbilityTask_SetChrCollision) == 0x000008, "Wrong alignment on UP2AbilityTask_SetChrCollision");
static_assert(sizeof(UP2AbilityTask_SetChrCollision) == 0x0000E0, "Wrong size on UP2AbilityTask_SetChrCollision");
static_assert(offsetof(UP2AbilityTask_SetChrCollision, Params_0) == 0x000080, "Member 'UP2AbilityTask_SetChrCollision::Params_0' has a wrong offset!");

// Class SpectreBossRuntime.P2AbilityTask_StunInArea
// 0x0068 (0x00E8 - 0x0080)
class UP2AbilityTask_StunInArea final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(class AActor* StunnedActor)> OnActorStunned;                       // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x48];                                      // 0x00A0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UP2AbilityTask_StunInArea* StunActorsInArea(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, bool bReversedDirection, const struct FGameplayTag& StunTagCloseRange, const struct FGameplayTag& StunTagMediumRange, const struct FGameplayTag& StunTagLongRange, float StartRadius, float EndRadius, float Duration, float CloseRangeThreshold, float MediumRangeThreshold, bool bDrawDebug)	 // 0x4d6f3d8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AbilityTask_StunInArea">();
	}
	static class UP2AbilityTask_StunInArea* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AbilityTask_StunInArea>();
	}
};
static_assert(alignof(UP2AbilityTask_StunInArea) == 0x000008, "Wrong alignment on UP2AbilityTask_StunInArea");
static_assert(sizeof(UP2AbilityTask_StunInArea) == 0x0000E8, "Wrong size on UP2AbilityTask_StunInArea");
static_assert(offsetof(UP2AbilityTask_StunInArea, OnActorStunned) == 0x000080, "Member 'UP2AbilityTask_StunInArea::OnActorStunned' has a wrong offset!");
static_assert(offsetof(UP2AbilityTask_StunInArea, OnCompleted) == 0x000090, "Member 'UP2AbilityTask_StunInArea::OnCompleted' has a wrong offset!");

// Class SpectreBossRuntime.P2Ability_Afraid
// 0x0018 (0x04A8 - 0x0490)
class UP2Ability_Afraid final : public UP2Ability
{
public:
	struct FGameplayTag                           StatusTag;                                         // 0x0490(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FearDuration;                                      // 0x0498(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49C[0xC];                                      // 0x049C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFearFinished()	 // 0x4d6e65c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_Afraid">();
	}
	static class UP2Ability_Afraid* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_Afraid>();
	}
};
static_assert(alignof(UP2Ability_Afraid) == 0x000008, "Wrong alignment on UP2Ability_Afraid");
static_assert(sizeof(UP2Ability_Afraid) == 0x0004A8, "Wrong size on UP2Ability_Afraid");
static_assert(offsetof(UP2Ability_Afraid, StatusTag) == 0x000490, "Member 'UP2Ability_Afraid::StatusTag' has a wrong offset!");
static_assert(offsetof(UP2Ability_Afraid, FearDuration) == 0x000498, "Member 'UP2Ability_Afraid::FearDuration' has a wrong offset!");

// Class SpectreBossRuntime.P2Ability_DimensionImprisonment
// 0x0028 (0x04B8 - 0x0490)
class UP2Ability_DimensionImprisonment final : public UP2Ability
{
public:
	TSubclassOf<class UGameplayEffect>            ImprisonmentGameplayEffect;                        // 0x0490(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_498[0x10];                                     // 0x0498(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AbilityDuration;                                   // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2AbilityTask_SetChrCollision*         CollisionSettingTask;                              // 0x04B0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnDurationEnded()	 // 0x4765098;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_DimensionImprisonment">();
	}
	static class UP2Ability_DimensionImprisonment* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_DimensionImprisonment>();
	}
};
static_assert(alignof(UP2Ability_DimensionImprisonment) == 0x000008, "Wrong alignment on UP2Ability_DimensionImprisonment");
static_assert(sizeof(UP2Ability_DimensionImprisonment) == 0x0004B8, "Wrong size on UP2Ability_DimensionImprisonment");
static_assert(offsetof(UP2Ability_DimensionImprisonment, ImprisonmentGameplayEffect) == 0x000490, "Member 'UP2Ability_DimensionImprisonment::ImprisonmentGameplayEffect' has a wrong offset!");
static_assert(offsetof(UP2Ability_DimensionImprisonment, AbilityDuration) == 0x0004A8, "Member 'UP2Ability_DimensionImprisonment::AbilityDuration' has a wrong offset!");
static_assert(offsetof(UP2Ability_DimensionImprisonment, CollisionSettingTask) == 0x0004B0, "Member 'UP2Ability_DimensionImprisonment::CollisionSettingTask' has a wrong offset!");

// Class SpectreBossRuntime.P2Ability_InputPenalty
// 0x0028 (0x04B8 - 0x0490)
class UP2Ability_InputPenalty final : public UP2Ability
{
public:
	float                                         Duration;                                          // 0x0490(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InputPenaltyStatusTag;                             // 0x0494(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            MovePenaltyGameplayEffect;                         // 0x04A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A8[0x10];                                     // 0x04A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTimerFinished()	 // 0x4d6e65c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_InputPenalty">();
	}
	static class UP2Ability_InputPenalty* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_InputPenalty>();
	}
};
static_assert(alignof(UP2Ability_InputPenalty) == 0x000008, "Wrong alignment on UP2Ability_InputPenalty");
static_assert(sizeof(UP2Ability_InputPenalty) == 0x0004B8, "Wrong size on UP2Ability_InputPenalty");
static_assert(offsetof(UP2Ability_InputPenalty, Duration) == 0x000490, "Member 'UP2Ability_InputPenalty::Duration' has a wrong offset!");
static_assert(offsetof(UP2Ability_InputPenalty, InputPenaltyStatusTag) == 0x000494, "Member 'UP2Ability_InputPenalty::InputPenaltyStatusTag' has a wrong offset!");
static_assert(offsetof(UP2Ability_InputPenalty, MovePenaltyGameplayEffect) == 0x0004A0, "Member 'UP2Ability_InputPenalty::MovePenaltyGameplayEffect' has a wrong offset!");

// Class SpectreBossRuntime.P2Ability_SpectreSplitTimeline
// 0x00C0 (0x0558 - 0x0498)
class UP2Ability_SpectreSplitTimeline final : public UP2NpcAbility
{
public:
	TSubclassOf<class UGameplayAbility>           CloneDeathAbility;                                 // 0x0498(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ProxyDamageThreshold;                              // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CloneDamageThreshold;                              // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A8[0xB0];                                     // 0x04A8(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReceivedDamage(class AActor* Actor, const struct FP2DamageData& AttributeChangeData)	 // 0x4d6eee4;
	void RegisterDamageComponents(const TArray<class AActor*>& Actors)	 // 0x4d6f054;
	void SetSpectreProxy(class AActor* InProxy)	 // 0x4d6f31c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_SpectreSplitTimeline">();
	}
	static class UP2Ability_SpectreSplitTimeline* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_SpectreSplitTimeline>();
	}
};
static_assert(alignof(UP2Ability_SpectreSplitTimeline) == 0x000008, "Wrong alignment on UP2Ability_SpectreSplitTimeline");
static_assert(sizeof(UP2Ability_SpectreSplitTimeline) == 0x000558, "Wrong size on UP2Ability_SpectreSplitTimeline");
static_assert(offsetof(UP2Ability_SpectreSplitTimeline, CloneDeathAbility) == 0x000498, "Member 'UP2Ability_SpectreSplitTimeline::CloneDeathAbility' has a wrong offset!");
static_assert(offsetof(UP2Ability_SpectreSplitTimeline, ProxyDamageThreshold) == 0x0004A0, "Member 'UP2Ability_SpectreSplitTimeline::ProxyDamageThreshold' has a wrong offset!");
static_assert(offsetof(UP2Ability_SpectreSplitTimeline, CloneDamageThreshold) == 0x0004A4, "Member 'UP2Ability_SpectreSplitTimeline::CloneDamageThreshold' has a wrong offset!");

// Class SpectreBossRuntime.P2Ability_WaterIllusionDrowning
// 0x0070 (0x0500 - 0x0490)
class UP2Ability_WaterIllusionDrowning final : public UP2Ability
{
public:
	struct FGameplayTag                           StatusTag;                                         // 0x0490(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           DrownMontageTag;                                   // 0x0498(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenDepletionFrequencySeconds;                   // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OxygenDepletionRate;                               // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            DrowningEffect;                                    // 0x04A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerspectiveMontageData                CurrentMontages;                                   // 0x04B0(0x0030)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E0[0x20];                                     // 0x04E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2Ability_WaterIllusionDrowning">();
	}
	static class UP2Ability_WaterIllusionDrowning* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2Ability_WaterIllusionDrowning>();
	}
};
static_assert(alignof(UP2Ability_WaterIllusionDrowning) == 0x000008, "Wrong alignment on UP2Ability_WaterIllusionDrowning");
static_assert(sizeof(UP2Ability_WaterIllusionDrowning) == 0x000500, "Wrong size on UP2Ability_WaterIllusionDrowning");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, StatusTag) == 0x000490, "Member 'UP2Ability_WaterIllusionDrowning::StatusTag' has a wrong offset!");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, DrownMontageTag) == 0x000498, "Member 'UP2Ability_WaterIllusionDrowning::DrownMontageTag' has a wrong offset!");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, OxygenDepletionFrequencySeconds) == 0x0004A0, "Member 'UP2Ability_WaterIllusionDrowning::OxygenDepletionFrequencySeconds' has a wrong offset!");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, OxygenDepletionRate) == 0x0004A4, "Member 'UP2Ability_WaterIllusionDrowning::OxygenDepletionRate' has a wrong offset!");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, DrowningEffect) == 0x0004A8, "Member 'UP2Ability_WaterIllusionDrowning::DrowningEffect' has a wrong offset!");
static_assert(offsetof(UP2Ability_WaterIllusionDrowning, CurrentMontages) == 0x0004B0, "Member 'UP2Ability_WaterIllusionDrowning::CurrentMontages' has a wrong offset!");

// Class SpectreBossRuntime.P2AnimSectionRetimingNotifyState
// 0x0060 (0x0090 - 0x0030)
class UP2AnimSectionRetimingNotifyState final : public UAnimNotifyState
{
public:
	TMap<class FName, float>                      MontageSectionPlaybackRateMap;                     // 0x0030(0x0050)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         DefaultPlaybackRate;                               // 0x0080(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2AnimSectionRetimingNotifyState">();
	}
	static class UP2AnimSectionRetimingNotifyState* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2AnimSectionRetimingNotifyState>();
	}
};
static_assert(alignof(UP2AnimSectionRetimingNotifyState) == 0x000008, "Wrong alignment on UP2AnimSectionRetimingNotifyState");
static_assert(sizeof(UP2AnimSectionRetimingNotifyState) == 0x000090, "Wrong size on UP2AnimSectionRetimingNotifyState");
static_assert(offsetof(UP2AnimSectionRetimingNotifyState, MontageSectionPlaybackRateMap) == 0x000030, "Member 'UP2AnimSectionRetimingNotifyState::MontageSectionPlaybackRateMap' has a wrong offset!");
static_assert(offsetof(UP2AnimSectionRetimingNotifyState, DefaultPlaybackRate) == 0x000080, "Member 'UP2AnimSectionRetimingNotifyState::DefaultPlaybackRate' has a wrong offset!");

// Class SpectreBossRuntime.P2BTDecorator_CheckPlayersInArena
// 0x0018 (0x0080 - 0x0068)
class UP2BTDecorator_CheckPlayersInArena final : public UBTDecorator
{
public:
	EP2DownedState                                MaxDbnoStageToConsider;                            // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerThreshold;                                   // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComparisonType                               ThresholdComparisonType;                           // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHeroCharacterEntered(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e670;
	void OnHeroCharacterExited(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e670;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_CheckPlayersInArena">();
	}
	static class UP2BTDecorator_CheckPlayersInArena* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_CheckPlayersInArena>();
	}
};
static_assert(alignof(UP2BTDecorator_CheckPlayersInArena) == 0x000008, "Wrong alignment on UP2BTDecorator_CheckPlayersInArena");
static_assert(sizeof(UP2BTDecorator_CheckPlayersInArena) == 0x000080, "Wrong size on UP2BTDecorator_CheckPlayersInArena");
static_assert(offsetof(UP2BTDecorator_CheckPlayersInArena, MaxDbnoStageToConsider) == 0x000068, "Member 'UP2BTDecorator_CheckPlayersInArena::MaxDbnoStageToConsider' has a wrong offset!");
static_assert(offsetof(UP2BTDecorator_CheckPlayersInArena, PlayerThreshold) == 0x00006C, "Member 'UP2BTDecorator_CheckPlayersInArena::PlayerThreshold' has a wrong offset!");
static_assert(offsetof(UP2BTDecorator_CheckPlayersInArena, ThresholdComparisonType) == 0x000070, "Member 'UP2BTDecorator_CheckPlayersInArena::ThresholdComparisonType' has a wrong offset!");

// Class SpectreBossRuntime.P2BTDecorator_IsArenaSealed
// 0x0008 (0x0070 - 0x0068)
class UP2BTDecorator_IsArenaSealed final : public UBTDecorator
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHeroCharacterEntered(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e730;
	void OnHeroCharacterExited(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e730;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_IsArenaSealed">();
	}
	static class UP2BTDecorator_IsArenaSealed* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_IsArenaSealed>();
	}
};
static_assert(alignof(UP2BTDecorator_IsArenaSealed) == 0x000008, "Wrong alignment on UP2BTDecorator_IsArenaSealed");
static_assert(sizeof(UP2BTDecorator_IsArenaSealed) == 0x000070, "Wrong size on UP2BTDecorator_IsArenaSealed");

// Class SpectreBossRuntime.P2BTDecorator_NumOfPlayersInArena
// 0x0010 (0x00B0 - 0x00A0)
class UP2BTDecorator_NumOfPlayersInArena final : public UP2BTDecorator_UtilityCurve
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EP2DownedState                                MaxDbnoStageToConsider;                            // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHeroCharacterEntered(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e7f0;
	void OnHeroCharacterExited(class AP2HeroCharacter* HeroCharacter)	 // 0x4d6e7f0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTDecorator_NumOfPlayersInArena">();
	}
	static class UP2BTDecorator_NumOfPlayersInArena* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTDecorator_NumOfPlayersInArena>();
	}
};
static_assert(alignof(UP2BTDecorator_NumOfPlayersInArena) == 0x000008, "Wrong alignment on UP2BTDecorator_NumOfPlayersInArena");
static_assert(sizeof(UP2BTDecorator_NumOfPlayersInArena) == 0x0000B0, "Wrong size on UP2BTDecorator_NumOfPlayersInArena");
static_assert(offsetof(UP2BTDecorator_NumOfPlayersInArena, MaxDbnoStageToConsider) == 0x0000A8, "Member 'UP2BTDecorator_NumOfPlayersInArena::MaxDbnoStageToConsider' has a wrong offset!");

// Class SpectreBossRuntime.P2BTService_UpdatePerceptionTarget
// 0x0000 (0x0098 - 0x0098)
class UP2BTService_UpdatePerceptionTarget final : public UBTService_BlackboardBase
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTService_UpdatePerceptionTarget">();
	}
	static class UP2BTService_UpdatePerceptionTarget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTService_UpdatePerceptionTarget>();
	}
};
static_assert(alignof(UP2BTService_UpdatePerceptionTarget) == 0x000008, "Wrong alignment on UP2BTService_UpdatePerceptionTarget");
static_assert(sizeof(UP2BTService_UpdatePerceptionTarget) == 0x000098, "Wrong size on UP2BTService_UpdatePerceptionTarget");

// Class SpectreBossRuntime.P2BTTask_ZigzagTo
// 0x00E0 (0x0178 - 0x0098)
class UP2BTTask_ZigzagTo final : public UBTTask_BlackboardBase
{
public:
	struct FBlackboardKeySelector                 IsLookedAt;                                        // 0x0098(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSubclassOf<class UP2NpcAbility_Spectre_Dash> DashAbilityClass;                                  // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           DashRightAnim;                                     // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimMontage*                           DashLeftAnim;                                      // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x3C];                                      // 0x00E8(0x003C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PendingPathsNum;                                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMercunaPath*                           Path;                                              // 0x0128(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AMercunaNavGroundGrid*                  NavGrid;                                           // 0x0130(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAIRequestID                           MoveRequestId;                                     // 0x0138(0x0004)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTreeComponent*                 Owner;                                             // 0x0140(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DashCooldown;                                      // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DashSpeed;                                         // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DashHeightLimit;                                   // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EndDistance;                                       // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DashLimit;                                         // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MovementSpeed;                                     // 0x015C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RandomMovementSpeedDeviation;                      // 0x0160(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Amplitude;                                         // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RandomAmplitudeDeviation;                          // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_16C[0xC];                                      // 0x016C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMoveCompleted(const struct FAIRequestID& RequestID, const EMercunaMoveResult Result)	 // 0x4d6e8b0;
	void OnPathUpdated(EMercunaPathEvent PathEvent)	 // 0x4d6e9f0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2BTTask_ZigzagTo">();
	}
	static class UP2BTTask_ZigzagTo* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2BTTask_ZigzagTo>();
	}
};
static_assert(alignof(UP2BTTask_ZigzagTo) == 0x000008, "Wrong alignment on UP2BTTask_ZigzagTo");
static_assert(sizeof(UP2BTTask_ZigzagTo) == 0x000178, "Wrong size on UP2BTTask_ZigzagTo");
static_assert(offsetof(UP2BTTask_ZigzagTo, IsLookedAt) == 0x000098, "Member 'UP2BTTask_ZigzagTo::IsLookedAt' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashAbilityClass) == 0x0000C0, "Member 'UP2BTTask_ZigzagTo::DashAbilityClass' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashRightAnim) == 0x0000D8, "Member 'UP2BTTask_ZigzagTo::DashRightAnim' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashLeftAnim) == 0x0000E0, "Member 'UP2BTTask_ZigzagTo::DashLeftAnim' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, PendingPathsNum) == 0x000124, "Member 'UP2BTTask_ZigzagTo::PendingPathsNum' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, Path) == 0x000128, "Member 'UP2BTTask_ZigzagTo::Path' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, NavGrid) == 0x000130, "Member 'UP2BTTask_ZigzagTo::NavGrid' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, MoveRequestId) == 0x000138, "Member 'UP2BTTask_ZigzagTo::MoveRequestId' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, Owner) == 0x000140, "Member 'UP2BTTask_ZigzagTo::Owner' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashCooldown) == 0x000148, "Member 'UP2BTTask_ZigzagTo::DashCooldown' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashSpeed) == 0x00014C, "Member 'UP2BTTask_ZigzagTo::DashSpeed' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashHeightLimit) == 0x000150, "Member 'UP2BTTask_ZigzagTo::DashHeightLimit' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, EndDistance) == 0x000154, "Member 'UP2BTTask_ZigzagTo::EndDistance' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, DashLimit) == 0x000158, "Member 'UP2BTTask_ZigzagTo::DashLimit' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, MovementSpeed) == 0x00015C, "Member 'UP2BTTask_ZigzagTo::MovementSpeed' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, RandomMovementSpeedDeviation) == 0x000160, "Member 'UP2BTTask_ZigzagTo::RandomMovementSpeedDeviation' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, Amplitude) == 0x000164, "Member 'UP2BTTask_ZigzagTo::Amplitude' has a wrong offset!");
static_assert(offsetof(UP2BTTask_ZigzagTo, RandomAmplitudeDeviation) == 0x000168, "Member 'UP2BTTask_ZigzagTo::RandomAmplitudeDeviation' has a wrong offset!");

// Class SpectreBossRuntime.P2ReplicatedLevelSequenceActor
// 0x0000 (0x0328 - 0x0328)
class AP2ReplicatedLevelSequenceActor : public AReplicatedLevelSequenceActor
{
public:
	void SetTransform(const struct FVector& NewLocation, const struct FRotator& NewRotation)	 // 0x4d745e8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2ReplicatedLevelSequenceActor">();
	}
	static class AP2ReplicatedLevelSequenceActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2ReplicatedLevelSequenceActor>();
	}
};
static_assert(alignof(AP2ReplicatedLevelSequenceActor) == 0x000008, "Wrong alignment on AP2ReplicatedLevelSequenceActor");
static_assert(sizeof(AP2ReplicatedLevelSequenceActor) == 0x000328, "Wrong size on AP2ReplicatedLevelSequenceActor");

// Class SpectreBossRuntime.P2DeathLevelSequenceActor
// 0x0000 (0x0328 - 0x0328)
class AP2DeathLevelSequenceActor final : public AP2ReplicatedLevelSequenceActor
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2DeathLevelSequenceActor">();
	}
	static class AP2DeathLevelSequenceActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2DeathLevelSequenceActor>();
	}
};
static_assert(alignof(AP2DeathLevelSequenceActor) == 0x000008, "Wrong alignment on AP2DeathLevelSequenceActor");
static_assert(sizeof(AP2DeathLevelSequenceActor) == 0x000328, "Wrong size on AP2DeathLevelSequenceActor");

// Class SpectreBossRuntime.P2EnvQueryContext_SpectreArenaCentre
// 0x0000 (0x0028 - 0x0028)
class UP2EnvQueryContext_SpectreArenaCentre final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2EnvQueryContext_SpectreArenaCentre">();
	}
	static class UP2EnvQueryContext_SpectreArenaCentre* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2EnvQueryContext_SpectreArenaCentre>();
	}
};
static_assert(alignof(UP2EnvQueryContext_SpectreArenaCentre) == 0x000008, "Wrong alignment on UP2EnvQueryContext_SpectreArenaCentre");
static_assert(sizeof(UP2EnvQueryContext_SpectreArenaCentre) == 0x000028, "Wrong size on UP2EnvQueryContext_SpectreArenaCentre");

// Class SpectreBossRuntime.P2EnvQueryTest_Grouped
// 0x0008 (0x0210 - 0x0208)
class UP2EnvQueryTest_Grouped final : public UEnvQueryTest
{
public:
	float                                         DistanceMetric;                                    // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2EnvQueryTest_Grouped">();
	}
	static class UP2EnvQueryTest_Grouped* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2EnvQueryTest_Grouped>();
	}
};
static_assert(alignof(UP2EnvQueryTest_Grouped) == 0x000008, "Wrong alignment on UP2EnvQueryTest_Grouped");
static_assert(sizeof(UP2EnvQueryTest_Grouped) == 0x000210, "Wrong size on UP2EnvQueryTest_Grouped");
static_assert(offsetof(UP2EnvQueryTest_Grouped, DistanceMetric) == 0x000208, "Member 'UP2EnvQueryTest_Grouped::DistanceMetric' has a wrong offset!");

// Class SpectreBossRuntime.P2EnvQueryTest_InBossRoom
// 0x0000 (0x0208 - 0x0208)
class UP2EnvQueryTest_InBossRoom final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2EnvQueryTest_InBossRoom">();
	}
	static class UP2EnvQueryTest_InBossRoom* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2EnvQueryTest_InBossRoom>();
	}
};
static_assert(alignof(UP2EnvQueryTest_InBossRoom) == 0x000008, "Wrong alignment on UP2EnvQueryTest_InBossRoom");
static_assert(sizeof(UP2EnvQueryTest_InBossRoom) == 0x000208, "Wrong size on UP2EnvQueryTest_InBossRoom");

// Class SpectreBossRuntime.P2EnvQueryTest_SeparationDist
// 0x0000 (0x0208 - 0x0208)
class UP2EnvQueryTest_SeparationDist final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2EnvQueryTest_SeparationDist">();
	}
	static class UP2EnvQueryTest_SeparationDist* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2EnvQueryTest_SeparationDist>();
	}
};
static_assert(alignof(UP2EnvQueryTest_SeparationDist) == 0x000008, "Wrong alignment on UP2EnvQueryTest_SeparationDist");
static_assert(sizeof(UP2EnvQueryTest_SeparationDist) == 0x000208, "Wrong size on UP2EnvQueryTest_SeparationDist");

// Class SpectreBossRuntime.P2FearLevelSequenceActor
// 0x0000 (0x0328 - 0x0328)
class AP2FearLevelSequenceActor final : public AP2ReplicatedLevelSequenceActor
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2FearLevelSequenceActor">();
	}
	static class AP2FearLevelSequenceActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2FearLevelSequenceActor>();
	}
};
static_assert(alignof(AP2FearLevelSequenceActor) == 0x000008, "Wrong alignment on AP2FearLevelSequenceActor");
static_assert(sizeof(AP2FearLevelSequenceActor) == 0x000328, "Wrong size on AP2FearLevelSequenceActor");

// Class SpectreBossRuntime.GrenadeDetectionConfig
// 0x0018 (0x0048 - 0x0030)
class UGrenadeDetectionConfig final : public UDataAsset
{
public:
	TSubclassOf<class ATriggerBase>               DetectionActor;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGrenadeDetectionEventConfig>   EventConfigs;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GrenadeDetectionConfig">();
	}
	static class UGrenadeDetectionConfig* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGrenadeDetectionConfig>();
	}
};
static_assert(alignof(UGrenadeDetectionConfig) == 0x000008, "Wrong alignment on UGrenadeDetectionConfig");
static_assert(sizeof(UGrenadeDetectionConfig) == 0x000048, "Wrong size on UGrenadeDetectionConfig");
static_assert(offsetof(UGrenadeDetectionConfig, DetectionActor) == 0x000030, "Member 'UGrenadeDetectionConfig::DetectionActor' has a wrong offset!");
static_assert(offsetof(UGrenadeDetectionConfig, EventConfigs) == 0x000038, "Member 'UGrenadeDetectionConfig::EventConfigs' has a wrong offset!");

// Class SpectreBossRuntime.P2GrenadeDetectionComponent
// 0x0060 (0x0128 - 0x00C8)
class UP2GrenadeDetectionComponent final : public UP2PawnComponent
{
public:
	class UGrenadeDetectionConfig*                Config;                                            // 0x00C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATriggerBase*                           DetectorInstance;                                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x50];                                      // 0x00D8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor)	 // 0x4d6e36c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GrenadeDetectionComponent">();
	}
	static class UP2GrenadeDetectionComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2GrenadeDetectionComponent>();
	}
};
static_assert(alignof(UP2GrenadeDetectionComponent) == 0x000008, "Wrong alignment on UP2GrenadeDetectionComponent");
static_assert(sizeof(UP2GrenadeDetectionComponent) == 0x000128, "Wrong size on UP2GrenadeDetectionComponent");
static_assert(offsetof(UP2GrenadeDetectionComponent, Config) == 0x0000C8, "Member 'UP2GrenadeDetectionComponent::Config' has a wrong offset!");
static_assert(offsetof(UP2GrenadeDetectionComponent, DetectorInstance) == 0x0000D0, "Member 'UP2GrenadeDetectionComponent::DetectorInstance' has a wrong offset!");

// Class SpectreBossRuntime.P2LightsOutManager
// 0x0008 (0x02B8 - 0x02B0)
class AP2LightsOutManager final : public AActor
{
public:
	float                                         Duration;                                          // 0x02B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RemainingTime;                                     // 0x02B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void DoLightsOut(float LightsOutDuration)	 // 0x4d6dee0;
	void OnSetLightsOut(bool LightsOutActive)	 // 0xae1e64;
	void TriggerLightsOut(float LightsOutDuration)	 // 0x4d6fa00;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2LightsOutManager">();
	}
	static class AP2LightsOutManager* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2LightsOutManager>();
	}
};
static_assert(alignof(AP2LightsOutManager) == 0x000008, "Wrong alignment on AP2LightsOutManager");
static_assert(sizeof(AP2LightsOutManager) == 0x0002B8, "Wrong size on AP2LightsOutManager");
static_assert(offsetof(AP2LightsOutManager, Duration) == 0x0002B0, "Member 'AP2LightsOutManager::Duration' has a wrong offset!");
static_assert(offsetof(AP2LightsOutManager, RemainingTime) == 0x0002B4, "Member 'AP2LightsOutManager::RemainingTime' has a wrong offset!");

// Class SpectreBossRuntime.P2NavLink
// 0x0010 (0x04F0 - 0x04E0)
class AP2NavLink final : public AMercunaNavLink
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SplineMidpointOffset;                              // 0x04E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E4[0xC];                                      // 0x04E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReceiveNavLinkStart(class APawn* Pawn, EMercunaNavigationLinkDirection Direction, const struct FVector& Destination)	 // 0x4d6eaac;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NavLink">();
	}
	static class AP2NavLink* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2NavLink>();
	}
};
static_assert(alignof(AP2NavLink) == 0x000010, "Wrong alignment on AP2NavLink");
static_assert(sizeof(AP2NavLink) == 0x0004F0, "Wrong size on AP2NavLink");
static_assert(offsetof(AP2NavLink, SplineComponent) == 0x0004D8, "Member 'AP2NavLink::SplineComponent' has a wrong offset!");
static_assert(offsetof(AP2NavLink, SplineMidpointOffset) == 0x0004E0, "Member 'AP2NavLink::SplineMidpointOffset' has a wrong offset!");

// Class SpectreBossRuntime.P2NavLink_SpectreCatwalkJump
// 0x0060 (0x0540 - 0x04E0)
class AP2NavLink_SpectreCatwalkJump final : public AMercunaNavLink
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x04D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumArcPoints;                                      // 0x04E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOverrideHeight;                                   // 0x04E4(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E5[0x3];                                      // 0x04E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverridenHeight;                                   // 0x04E8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         JumpSpeed;                                         // 0x04EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>           JumpAbility;                                       // 0x04F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class AP2BaseCharacter>        CharacterUsingLink;                                // 0x04F8(0x0030)(Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APawn* Pawn)> OnCatwalkJumpEnd;                              // 0x0530(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnReceiveNavLinkStart(class APawn* Pawn, EMercunaNavigationLinkDirection Direction, const struct FVector& Destination)	 // 0x4d6ec48;
	void Phase(bool bPhaseIn, class AActor* Actor)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NavLink_SpectreCatwalkJump">();
	}
	static class AP2NavLink_SpectreCatwalkJump* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2NavLink_SpectreCatwalkJump>();
	}
};
static_assert(alignof(AP2NavLink_SpectreCatwalkJump) == 0x000010, "Wrong alignment on AP2NavLink_SpectreCatwalkJump");
static_assert(sizeof(AP2NavLink_SpectreCatwalkJump) == 0x000540, "Wrong size on AP2NavLink_SpectreCatwalkJump");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, SplineComponent) == 0x0004D8, "Member 'AP2NavLink_SpectreCatwalkJump::SplineComponent' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, NumArcPoints) == 0x0004E0, "Member 'AP2NavLink_SpectreCatwalkJump::NumArcPoints' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, bOverrideHeight) == 0x0004E4, "Member 'AP2NavLink_SpectreCatwalkJump::bOverrideHeight' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, OverridenHeight) == 0x0004E8, "Member 'AP2NavLink_SpectreCatwalkJump::OverridenHeight' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, JumpSpeed) == 0x0004EC, "Member 'AP2NavLink_SpectreCatwalkJump::JumpSpeed' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, JumpAbility) == 0x0004F0, "Member 'AP2NavLink_SpectreCatwalkJump::JumpAbility' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, CharacterUsingLink) == 0x0004F8, "Member 'AP2NavLink_SpectreCatwalkJump::CharacterUsingLink' has a wrong offset!");
static_assert(offsetof(AP2NavLink_SpectreCatwalkJump, OnCatwalkJumpEnd) == 0x000530, "Member 'AP2NavLink_SpectreCatwalkJump::OnCatwalkJumpEnd' has a wrong offset!");

// Class SpectreBossRuntime.P2NpcAbility_DimensionalPrison
// 0x0010 (0x04D0 - 0x04C0)
class UP2NpcAbility_DimensionalPrison final : public UP2NpcAbility_MontageBasedAttack
{
public:
	TSubclassOf<class UGameplayEffect>            ImprisonmentGrantingGameplayEffect;                // 0x04C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BlackboardKeyName;                                 // 0x04C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcAbility_DimensionalPrison">();
	}
	static class UP2NpcAbility_DimensionalPrison* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcAbility_DimensionalPrison>();
	}
};
static_assert(alignof(UP2NpcAbility_DimensionalPrison) == 0x000008, "Wrong alignment on UP2NpcAbility_DimensionalPrison");
static_assert(sizeof(UP2NpcAbility_DimensionalPrison) == 0x0004D0, "Wrong size on UP2NpcAbility_DimensionalPrison");
static_assert(offsetof(UP2NpcAbility_DimensionalPrison, ImprisonmentGrantingGameplayEffect) == 0x0004C0, "Member 'UP2NpcAbility_DimensionalPrison::ImprisonmentGrantingGameplayEffect' has a wrong offset!");
static_assert(offsetof(UP2NpcAbility_DimensionalPrison, BlackboardKeyName) == 0x0004C8, "Member 'UP2NpcAbility_DimensionalPrison::BlackboardKeyName' has a wrong offset!");

// Class SpectreBossRuntime.P2NpcAbility_SpectreFear
// 0x0000 (0x0498 - 0x0498)
class UP2NpcAbility_SpectreFear final : public UP2NpcAbility_Attack
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcAbility_SpectreFear">();
	}
	static class UP2NpcAbility_SpectreFear* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcAbility_SpectreFear>();
	}
};
static_assert(alignof(UP2NpcAbility_SpectreFear) == 0x000008, "Wrong alignment on UP2NpcAbility_SpectreFear");
static_assert(sizeof(UP2NpcAbility_SpectreFear) == 0x000498, "Wrong size on UP2NpcAbility_SpectreFear");

// Class SpectreBossRuntime.P2NpcAbility_SpectrePsiShove
// 0x0000 (0x0498 - 0x0498)
class UP2NpcAbility_SpectrePsiShove final : public UP2NpcAbility_Attack
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcAbility_SpectrePsiShove">();
	}
	static class UP2NpcAbility_SpectrePsiShove* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcAbility_SpectrePsiShove>();
	}
};
static_assert(alignof(UP2NpcAbility_SpectrePsiShove) == 0x000008, "Wrong alignment on UP2NpcAbility_SpectrePsiShove");
static_assert(sizeof(UP2NpcAbility_SpectrePsiShove) == 0x000498, "Wrong size on UP2NpcAbility_SpectrePsiShove");

// Class SpectreBossRuntime.P2NpcAbility_SpectreRemoveHelmet
// 0x0000 (0x0498 - 0x0498)
class UP2NpcAbility_SpectreRemoveHelmet final : public UP2NpcAbility
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcAbility_SpectreRemoveHelmet">();
	}
	static class UP2NpcAbility_SpectreRemoveHelmet* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcAbility_SpectreRemoveHelmet>();
	}
};
static_assert(alignof(UP2NpcAbility_SpectreRemoveHelmet) == 0x000008, "Wrong alignment on UP2NpcAbility_SpectreRemoveHelmet");
static_assert(sizeof(UP2NpcAbility_SpectreRemoveHelmet) == 0x000498, "Wrong size on UP2NpcAbility_SpectreRemoveHelmet");

// Class SpectreBossRuntime.P2NpcAbility_Spectre_Dash
// 0x0008 (0x04A0 - 0x0498)
class UP2NpcAbility_Spectre_Dash final : public UP2NpcAbility
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDashAbilityFinished(bool hasFinished)	 // 0x4d73a08;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcAbility_Spectre_Dash">();
	}
	static class UP2NpcAbility_Spectre_Dash* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcAbility_Spectre_Dash>();
	}
};
static_assert(alignof(UP2NpcAbility_Spectre_Dash) == 0x000008, "Wrong alignment on UP2NpcAbility_Spectre_Dash");
static_assert(sizeof(UP2NpcAbility_Spectre_Dash) == 0x0004A0, "Wrong size on UP2NpcAbility_Spectre_Dash");

// Class SpectreBossRuntime.P2NpcBossAnimInstance
// 0x0010 (0x0570 - 0x0560)
class UP2NpcBossAnimInstance : public UP2NpcAnimInstance
{
public:
	int32                                         ActiveBossStage;                                   // 0x0560(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_564[0xC];                                      // 0x0564(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcBossAnimInstance">();
	}
	static class UP2NpcBossAnimInstance* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2NpcBossAnimInstance>();
	}
};
static_assert(alignof(UP2NpcBossAnimInstance) == 0x000010, "Wrong alignment on UP2NpcBossAnimInstance");
static_assert(sizeof(UP2NpcBossAnimInstance) == 0x000570, "Wrong size on UP2NpcBossAnimInstance");
static_assert(offsetof(UP2NpcBossAnimInstance, ActiveBossStage) == 0x000560, "Member 'UP2NpcBossAnimInstance::ActiveBossStage' has a wrong offset!");

// Class SpectreBossRuntime.P2NpcBossCharacter
// 0x0030 (0x0B60 - 0x0B30)
class AP2NpcBossCharacter : public AP2NPCharacter
{
public:
	TArray<struct FGameplayTag>                   BossStageTags;                                     // 0x0B30(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_B40[0x20];                                     // 0x0B40(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetActiveBossStage() const	 // 0x4d73304;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2NpcBossCharacter">();
	}
	static class AP2NpcBossCharacter* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2NpcBossCharacter>();
	}
};
static_assert(alignof(AP2NpcBossCharacter) == 0x000010, "Wrong alignment on AP2NpcBossCharacter");
static_assert(sizeof(AP2NpcBossCharacter) == 0x000B60, "Wrong size on AP2NpcBossCharacter");
static_assert(offsetof(AP2NpcBossCharacter, BossStageTags) == 0x000B30, "Member 'AP2NpcBossCharacter::BossStageTags' has a wrong offset!");

// Class SpectreBossRuntime.P2RaidEventListenerInterface
// 0x0000 (0x0000 - 0x0000)
class IP2RaidEventListenerInterface final
{
public:
	void ReceiveEvent(const struct FGameplayTag& EventTag, const struct FP2RaidEventParameters& EventParams)	 // 0x4d73e78;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2RaidEventListenerInterface">();
	}
	static class IP2RaidEventListenerInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IP2RaidEventListenerInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IP2RaidEventListenerInterface) == 0x000001, "Wrong alignment on IP2RaidEventListenerInterface");
static_assert(sizeof(IP2RaidEventListenerInterface) == 0x000001, "Wrong size on IP2RaidEventListenerInterface");

// Class SpectreBossRuntime.P2RaidEventMessenger
// 0x0050 (0x0078 - 0x0028)
class UP2RaidEventMessenger final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RegisterListener(class AActor* ListenerToRegister)	 // 0x1667790;
	void SendEvent(const struct FGameplayTag& EventTag, const struct FP2RaidEventParameters& EventParams)	 // 0x4d73fd4;
	void SendEventWithIntensityCurve(const struct FGameplayTag& EventTag, const struct FVector& EventOrigin, const class UCurveFloat* IntensityCurve, float MaxDistance)	 // 0x4d74130;
	void UnRegisterListener(class AActor* ListenerToUnregister)	 // 0x1667600;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2RaidEventMessenger">();
	}
	static class UP2RaidEventMessenger* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2RaidEventMessenger>();
	}
};
static_assert(alignof(UP2RaidEventMessenger) == 0x000008, "Wrong alignment on UP2RaidEventMessenger");
static_assert(sizeof(UP2RaidEventMessenger) == 0x000078, "Wrong size on UP2RaidEventMessenger");

// Class SpectreBossRuntime.P2SpectreAirlockDevice
// 0x0000 (0x02C0 - 0x02C0)
class AP2SpectreAirlockDevice final : public AP2AIAirlockDevice
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2SpectreAirlockDevice">();
	}
	static class AP2SpectreAirlockDevice* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2SpectreAirlockDevice>();
	}
};
static_assert(alignof(AP2SpectreAirlockDevice) == 0x000008, "Wrong alignment on AP2SpectreAirlockDevice");
static_assert(sizeof(AP2SpectreAirlockDevice) == 0x0002C0, "Wrong size on AP2SpectreAirlockDevice");

// Class SpectreBossRuntime.P2SpectreArenaBoundsVolume
// 0x0000 (0x02E8 - 0x02E8)
class AP2SpectreArenaBoundsVolume final : public AP2Volume
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2SpectreArenaBoundsVolume">();
	}
	static class AP2SpectreArenaBoundsVolume* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2SpectreArenaBoundsVolume>();
	}
};
static_assert(alignof(AP2SpectreArenaBoundsVolume) == 0x000008, "Wrong alignment on AP2SpectreArenaBoundsVolume");
