#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateTreeModule

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "StateTreeModule_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class StateTreeModule.StateTreeSchema
// 0x0000 (0x0028 - 0x0028)
class UStateTreeSchema : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTreeSchema">();
	}
	static class UStateTreeSchema* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTreeSchema>();
	}
};
static_assert(alignof(UStateTreeSchema) == 0x000008, "Wrong alignment on UStateTreeSchema");
static_assert(sizeof(UStateTreeSchema) == 0x000028, "Wrong size on UStateTreeSchema");

// Class StateTreeModule.StateTreeNodeBlueprintBase
// 0x0018 (0x0040 - 0x0028)
class UStateTreeNodeBlueprintBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CachedOwner;                                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RequestTransition(const struct FStateTreeStateLink& TargetState, const EStateTreeTransitionPriority Priority)	 // 0x4a4e9a8;
	void SendEvent(const struct FStateTreeEvent& Event)	 // 0x4a4eb70;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTreeNodeBlueprintBase">();
	}
	static class UStateTreeNodeBlueprintBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTreeNodeBlueprintBase>();
	}
};
static_assert(alignof(UStateTreeNodeBlueprintBase) == 0x000008, "Wrong alignment on UStateTreeNodeBlueprintBase");
static_assert(sizeof(UStateTreeNodeBlueprintBase) == 0x000040, "Wrong size on UStateTreeNodeBlueprintBase");
static_assert(offsetof(UStateTreeNodeBlueprintBase, CachedOwner) == 0x000038, "Member 'UStateTreeNodeBlueprintBase::CachedOwner' has a wrong offset!");

// Class StateTreeModule.StateTreeConditionBlueprintBase
// 0x0008 (0x0048 - 0x0040)
class UStateTreeConditionBlueprintBase final : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ReceiveTestCondition() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTreeConditionBlueprintBase">();
	}
	static class UStateTreeConditionBlueprintBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTreeConditionBlueprintBase>();
	}
};
static_assert(alignof(UStateTreeConditionBlueprintBase) == 0x000008, "Wrong alignment on UStateTreeConditionBlueprintBase");
static_assert(sizeof(UStateTreeConditionBlueprintBase) == 0x000048, "Wrong size on UStateTreeConditionBlueprintBase");

// Class StateTreeModule.StateTreeEvaluatorBlueprintBase
// 0x0008 (0x0048 - 0x0040)
class UStateTreeEvaluatorBlueprintBase final : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveTick(const float DeltaTime)	 // 0xae1e64;
	void ReceiveTreeStart()	 // 0xae1e64;
	void ReceiveTreeStop()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTreeEvaluatorBlueprintBase">();
	}
	static class UStateTreeEvaluatorBlueprintBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTreeEvaluatorBlueprintBase>();
	}
};
static_assert(alignof(UStateTreeEvaluatorBlueprintBase) == 0x000008, "Wrong alignment on UStateTreeEvaluatorBlueprintBase");
static_assert(sizeof(UStateTreeEvaluatorBlueprintBase) == 0x000048, "Wrong size on UStateTreeEvaluatorBlueprintBase");

// Class StateTreeModule.StateTreeTaskBlueprintBase
// 0x0008 (0x0048 - 0x0040)
class UStateTreeTaskBlueprintBase : public UStateTreeNodeBlueprintBase
{
public:
	uint8                                         bShouldStateChangeOnReselect : 1;                  // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_40_1 : 1;                                   // 0x0040(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bShouldCallTickOnlyOnEvents : 1;                   // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldCopyBoundPropertiesOnTick : 1;              // 0x0040(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldCopyBoundPropertiesOnExitState : 1;         // 0x0040(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EStateTreeRunStatus ReceiveEnterState(const struct FStateTreeTransitionResult& Transition)	 // 0xae1e64;
	void ReceiveExitState(const struct FStateTreeTransitionResult& Transition)	 // 0xae1e64;
	void ReceiveStateCompleted(const EStateTreeRunStatus CompletionStatus, const struct FStateTreeActiveStates& CompletedActiveStates)	 // 0xae1e64;
	EStateTreeRunStatus ReceiveTick(const float DeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTreeTaskBlueprintBase">();
	}
	static class UStateTreeTaskBlueprintBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTreeTaskBlueprintBase>();
	}
};
static_assert(alignof(UStateTreeTaskBlueprintBase) == 0x000008, "Wrong alignment on UStateTreeTaskBlueprintBase");
static_assert(sizeof(UStateTreeTaskBlueprintBase) == 0x000048, "Wrong size on UStateTreeTaskBlueprintBase");

// Class StateTreeModule.StateTree
// 0x0128 (0x0158 - 0x0030)
class UStateTree final : public UDataAsset
{
public:
	class UStateTreeSchema*                       Schema;                                            // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FCompactStateTreeState>         States;                                            // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FCompactStateTransition>        Transitions;                                       // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FInstancedStructContainer              Nodes;                                             // 0x0058(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreeInstanceData                 DefaultInstanceData;                               // 0x0068(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreeInstanceData                 SharedInstanceData;                                // 0x0078(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeExternalDataDesc>     ContextDataDescs;                                  // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FStateTreePropertyBindings             PropertyBindings;                                  // 0x00B0(0x0068)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  Parameters;                                        // 0x0118(0x0010)(NativeAccessSpecifierPrivate)
	struct FStateTreeIndex8                       ParametersDataViewIndex;                           // 0x0128(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_129[0x1];                                      // 0x0129(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        EvaluatorsBegin;                                   // 0x012A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        EvaluatorsNum;                                     // 0x012C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        GlobalTasksBegin;                                  // 0x012E(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        GlobalTasksNum;                                    // 0x0130(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasGlobalTransitionTasks;                         // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStateTreeExternalDataDesc>     ExternalDataDescs;                                 // 0x0138(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	int32                                         ExternalDataBaseIndex;                             // 0x0148(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumDataViews;                                      // 0x014C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"StateTree">();
	}
	static class UStateTree* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UStateTree>();
	}
};
static_assert(alignof(UStateTree) == 0x000008, "Wrong alignment on UStateTree");
static_assert(sizeof(UStateTree) == 0x000158, "Wrong size on UStateTree");
static_assert(offsetof(UStateTree, Schema) == 0x000030, "Member 'UStateTree::Schema' has a wrong offset!");
static_assert(offsetof(UStateTree, States) == 0x000038, "Member 'UStateTree::States' has a wrong offset!");
static_assert(offsetof(UStateTree, Transitions) == 0x000048, "Member 'UStateTree::Transitions' has a wrong offset!");
static_assert(offsetof(UStateTree, Nodes) == 0x000058, "Member 'UStateTree::Nodes' has a wrong offset!");
static_assert(offsetof(UStateTree, DefaultInstanceData) == 0x000068, "Member 'UStateTree::DefaultInstanceData' has a wrong offset!");
static_assert(offsetof(UStateTree, SharedInstanceData) == 0x000078, "Member 'UStateTree::SharedInstanceData' has a wrong offset!");
static_assert(offsetof(UStateTree, ContextDataDescs) == 0x0000A0, "Member 'UStateTree::ContextDataDescs' has a wrong offset!");
static_assert(offsetof(UStateTree, PropertyBindings) == 0x0000B0, "Member 'UStateTree::PropertyBindings' has a wrong offset!");
static_assert(offsetof(UStateTree, Parameters) == 0x000118, "Member 'UStateTree::Parameters' has a wrong offset!");
static_assert(offsetof(UStateTree, ParametersDataViewIndex) == 0x000128, "Member 'UStateTree::ParametersDataViewIndex' has a wrong offset!");
static_assert(offsetof(UStateTree, EvaluatorsBegin) == 0x00012A, "Member 'UStateTree::EvaluatorsBegin' has a wrong offset!");
static_assert(offsetof(UStateTree, EvaluatorsNum) == 0x00012C, "Member 'UStateTree::EvaluatorsNum' has a wrong offset!");
static_assert(offsetof(UStateTree, GlobalTasksBegin) == 0x00012E, "Member 'UStateTree::GlobalTasksBegin' has a wrong offset!");
static_assert(offsetof(UStateTree, GlobalTasksNum) == 0x000130, "Member 'UStateTree::GlobalTasksNum' has a wrong offset!");
static_assert(offsetof(UStateTree, bHasGlobalTransitionTasks) == 0x000132, "Member 'UStateTree::bHasGlobalTransitionTasks' has a wrong offset!");
static_assert(offsetof(UStateTree, ExternalDataDescs) == 0x000138, "Member 'UStateTree::ExternalDataDescs' has a wrong offset!");
static_assert(offsetof(UStateTree, ExternalDataBaseIndex) == 0x000148, "Member 'UStateTree::ExternalDataBaseIndex' has a wrong offset!");
static_assert(offsetof(UStateTree, NumDataViews) == 0x00014C, "Member 'UStateTree::NumDataViews' has a wrong offset!");

}

