#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STTask_RunBT

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"


namespace SDK::Params
{

// Function STTask_RunBT.STTask_RunBT_C.ExecuteUbergraph_STTask_RunBT
// 0x0034 (0x0034 - 0x0000)
struct STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStateTreeTransitionResult             K2Node_Event_Transition;                           // 0x0004(0x002E)(ConstParm, NoDestructor)
};
static_assert(alignof(STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT) == 0x000004, "Wrong alignment on STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT");
static_assert(sizeof(STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT) == 0x000034, "Wrong size on STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT");
static_assert(offsetof(STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT, EntryPoint) == 0x000000, "Member 'STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT::EntryPoint' has a wrong offset!");
static_assert(offsetof(STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT, K2Node_Event_Transition) == 0x000004, "Member 'STTask_RunBT_C_ExecuteUbergraph_STTask_RunBT::K2Node_Event_Transition' has a wrong offset!");

// Function STTask_RunBT.STTask_RunBT_C.ReceiveEnterState
// 0x0030 (0x0030 - 0x0000)
struct STTask_RunBT_C_ReceiveEnterState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x002E(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STTask_RunBT_C_ReceiveEnterState) == 0x000002, "Wrong alignment on STTask_RunBT_C_ReceiveEnterState");
static_assert(sizeof(STTask_RunBT_C_ReceiveEnterState) == 0x000030, "Wrong size on STTask_RunBT_C_ReceiveEnterState");
static_assert(offsetof(STTask_RunBT_C_ReceiveEnterState, Transition) == 0x000000, "Member 'STTask_RunBT_C_ReceiveEnterState::Transition' has a wrong offset!");
static_assert(offsetof(STTask_RunBT_C_ReceiveEnterState, ReturnValue) == 0x00002E, "Member 'STTask_RunBT_C_ReceiveEnterState::ReturnValue' has a wrong offset!");
static_assert(offsetof(STTask_RunBT_C_ReceiveEnterState, CallFunc_RunBehaviorTree_ReturnValue) == 0x00002F, "Member 'STTask_RunBT_C_ReceiveEnterState::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");

// Function STTask_RunBT.STTask_RunBT_C.ReceiveExitState
// 0x002E (0x002E - 0x0000)
struct STTask_RunBT_C_ReceiveExitState final
{
public:
	struct FStateTreeTransitionResult             Transition;                                        // 0x0000(0x002E)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(STTask_RunBT_C_ReceiveExitState) == 0x000002, "Wrong alignment on STTask_RunBT_C_ReceiveExitState");
static_assert(sizeof(STTask_RunBT_C_ReceiveExitState) == 0x00002E, "Wrong size on STTask_RunBT_C_ReceiveExitState");
static_assert(offsetof(STTask_RunBT_C_ReceiveExitState, Transition) == 0x000000, "Member 'STTask_RunBT_C_ReceiveExitState::Transition' has a wrong offset!");

// Function STTask_RunBT.STTask_RunBT_C.ReceiveTick
// 0x0008 (0x0008 - 0x0000)
struct STTask_RunBT_C_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunning_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(STTask_RunBT_C_ReceiveTick) == 0x000004, "Wrong alignment on STTask_RunBT_C_ReceiveTick");
static_assert(sizeof(STTask_RunBT_C_ReceiveTick) == 0x000008, "Wrong size on STTask_RunBT_C_ReceiveTick");
static_assert(offsetof(STTask_RunBT_C_ReceiveTick, DeltaTime) == 0x000000, "Member 'STTask_RunBT_C_ReceiveTick::DeltaTime' has a wrong offset!");
static_assert(offsetof(STTask_RunBT_C_ReceiveTick, ReturnValue) == 0x000004, "Member 'STTask_RunBT_C_ReceiveTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(STTask_RunBT_C_ReceiveTick, CallFunc_IsRunning_ReturnValue) == 0x000005, "Member 'STTask_RunBT_C_ReceiveTick::CallFunc_IsRunning_ReturnValue' has a wrong offset!");

}

