#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Synthesis

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Synthesis_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AudioMixer_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class Synthesis.SourceEffectDynamicsProcessorPreset
// 0x0078 (0x00E0 - 0x0068)
class USourceEffectDynamicsProcessorPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectDynamicsProcessorSettings Settings;                                          // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectDynamicsProcessorSettings& InSettings)	 // 0x55fbaf8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectDynamicsProcessorPreset">();
	}
	static class USourceEffectDynamicsProcessorPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectDynamicsProcessorPreset>();
	}
};
static_assert(alignof(USourceEffectDynamicsProcessorPreset) == 0x000008, "Wrong alignment on USourceEffectDynamicsProcessorPreset");
static_assert(sizeof(USourceEffectDynamicsProcessorPreset) == 0x0000E0, "Wrong size on USourceEffectDynamicsProcessorPreset");
static_assert(offsetof(USourceEffectDynamicsProcessorPreset, Settings) == 0x0000B8, "Member 'USourceEffectDynamicsProcessorPreset::Settings' has a wrong offset!");

// Class Synthesis.AudioImpulseResponse
// 0x0030 (0x0058 - 0x0028)
class UAudioImpulseResponse final : public UObject
{
public:
	TArray<float>                                 ImpulseResponse;                                   // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalizationVolumeDb;                             // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrueStereo;                                       // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 IRData;                                            // 0x0048(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AudioImpulseResponse">();
	}
	static class UAudioImpulseResponse* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAudioImpulseResponse>();
	}
};
static_assert(alignof(UAudioImpulseResponse) == 0x000008, "Wrong alignment on UAudioImpulseResponse");
static_assert(sizeof(UAudioImpulseResponse) == 0x000058, "Wrong size on UAudioImpulseResponse");
static_assert(offsetof(UAudioImpulseResponse, ImpulseResponse) == 0x000028, "Member 'UAudioImpulseResponse::ImpulseResponse' has a wrong offset!");
static_assert(offsetof(UAudioImpulseResponse, NumChannels) == 0x000038, "Member 'UAudioImpulseResponse::NumChannels' has a wrong offset!");
static_assert(offsetof(UAudioImpulseResponse, SampleRate) == 0x00003C, "Member 'UAudioImpulseResponse::SampleRate' has a wrong offset!");
static_assert(offsetof(UAudioImpulseResponse, NormalizationVolumeDb) == 0x000040, "Member 'UAudioImpulseResponse::NormalizationVolumeDb' has a wrong offset!");
static_assert(offsetof(UAudioImpulseResponse, bTrueStereo) == 0x000044, "Member 'UAudioImpulseResponse::bTrueStereo' has a wrong offset!");
static_assert(offsetof(UAudioImpulseResponse, IRData) == 0x000048, "Member 'UAudioImpulseResponse::IRData' has a wrong offset!");

// Class Synthesis.ModularSynthPresetBank
// 0x0010 (0x0038 - 0x0028)
class UModularSynthPresetBank final : public UObject
{
public:
	TArray<struct FModularSynthPresetBankEntry>   Presets;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ModularSynthPresetBank">();
	}
	static class UModularSynthPresetBank* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UModularSynthPresetBank>();
	}
};
static_assert(alignof(UModularSynthPresetBank) == 0x000008, "Wrong alignment on UModularSynthPresetBank");
static_assert(sizeof(UModularSynthPresetBank) == 0x000038, "Wrong size on UModularSynthPresetBank");
static_assert(offsetof(UModularSynthPresetBank, Presets) == 0x000028, "Member 'UModularSynthPresetBank::Presets' has a wrong offset!");

// Class Synthesis.ModularSynthLibrary
// 0x0000 (0x0028 - 0x0028)
class UModularSynthLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddModularSynthPresetToBankAsset(class UModularSynthPresetBank* InBank, const struct FModularSynthPreset& Preset, const class FString& PresetName)	 // 0x55f1ff4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ModularSynthLibrary">();
	}
	static class UModularSynthLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UModularSynthLibrary>();
	}
};
static_assert(alignof(UModularSynthLibrary) == 0x000008, "Wrong alignment on UModularSynthLibrary");
static_assert(sizeof(UModularSynthLibrary) == 0x000028, "Wrong size on UModularSynthLibrary");

// Class Synthesis.ModularSynthComponent
// 0x06D0 (0x0EA0 - 0x07D0)
class UModularSynthComponent final : public USynthComponent
{
public:
	int32                                         VoiceCount;                                        // 0x07D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D4[0x6CC];                                    // 0x07D4(0x06CC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FPatchId CreatePatch(const ESynth1PatchSource PatchSource, const TArray<struct FSynth1PatchCable>& PatchCables, const bool bEnableByDefault)	 // 0x55f2280;
	void NoteOff(const float Note, const bool bAllNotesOff, const bool bKillAllNotes)	 // 0x55f3004;
	void NoteOn(const float Note, const int32 Velocity, const float Duration)	 // 0x55f3454;
	void SetAttackTime(float AttackTimeMsec)	 // 0x55f42e0;
	void SetChorusDepth(float Depth)	 // 0x55f474c;
	void SetChorusEnabled(bool EnableChorus)	 // 0x55f4810;
	void SetChorusFeedback(float Feedback)	 // 0x55f48d4;
	void SetChorusFrequency(float Frequency)	 // 0x55f4998;
	void SetDecayTime(float DecayTimeMsec)	 // 0x55f4eb8;
	void SetEnableLegato(bool LegatoEnabled)	 // 0x55f57a0;
	bool SetEnablePatch(const struct FPatchId& PatchId, const bool bIsEnabled)	 // 0x55f5864;
	void SetEnablePolyphony(bool bEnablePolyphony)	 // 0x55f59b8;
	void SetEnableRetrigger(bool RetriggerEnabled)	 // 0x55f5a7c;
	void SetEnableUnison(bool EnableUnison)	 // 0x55f5b40;
	void SetFilterAlgorithm(ESynthFilterAlgorithm FilterAlgorithm)	 // 0x55f5fa4;
	void SetFilterFrequency(float FilterFrequencyHz)	 // 0x55f6964;
	void SetFilterFrequencyMod(float FilterFrequencyHz)	 // 0x55f6a28;
	void SetFilterQ(float FilterQ)	 // 0x55f6aec;
	void SetFilterQMod(float FilterQ)	 // 0x55f6c74;
	void SetFilterType(ESynthFilterType FilterType)	 // 0x55f6dfc;
	void SetGainDb(float GainDb)	 // 0x55f7578;
	void SetLFOFrequency(int32 LFOIndex, float FrequencyHz)	 // 0x55f82cc;
	void SetLFOFrequencyMod(int32 LFOIndex, float FrequencyModHz)	 // 0x55f8408;
	void SetLFOGain(int32 LFOIndex, float Gain)	 // 0x55f8544;
	void SetLFOGainMod(int32 LFOIndex, float GainMod)	 // 0x55f8680;
	void SetLFOMode(int32 LFOIndex, ESynthLFOMode LFOMode)	 // 0x55f87bc;
	void SetLFOPatch(int32 LFOIndex, ESynthLFOPatchType LFOPatchType)	 // 0x55f892c;
	void SetLFOType(int32 LFOIndex, ESynthLFOType LFOType)	 // 0x55f8a9c;
	void SetModEnvAttackTime(const float AttackTimeMsec)	 // 0x55f8e84;
	void SetModEnvBiasInvert(const bool bInvert)	 // 0x55f8f48;
	void SetModEnvBiasPatch(const ESynthModEnvBiasPatch InPatchType)	 // 0x55f9048;
	void SetModEnvDecayTime(const float DecayTimeMsec)	 // 0x55f9144;
	void SetModEnvDepth(const float Depth)	 // 0x55f9208;
	void SetModEnvInvert(const bool bInvert)	 // 0x55f92cc;
	void SetModEnvPatch(const ESynthModEnvPatch InPatchType)	 // 0x55f93cc;
	void SetModEnvReleaseTime(const float Release)	 // 0x55f94c8;
	void SetModEnvSustainGain(const float SustainGain)	 // 0x55f958c;
	void SetOscCents(int32 OscIndex, float Cents)	 // 0x55f9838;
	void SetOscFrequencyMod(int32 OscIndex, float OscFreqMod)	 // 0x55f9974;
	void SetOscGain(int32 OscIndex, float OscGain)	 // 0x55f9ab0;
	void SetOscGainMod(int32 OscIndex, float OscGainMod)	 // 0x55f9bec;
	void SetOscOctave(int32 OscIndex, float Octave)	 // 0x55f9d28;
	void SetOscPulsewidth(int32 OscIndex, float Pulsewidth)	 // 0x55f9e64;
	void SetOscSemitones(int32 OscIndex, float Semitones)	 // 0x55f9fa0;
	void SetOscSync(const bool bIsSynced)	 // 0x55fa0dc;
	void SetOscType(int32 OscIndex, ESynth1OscType OscType)	 // 0x55fa1dc;
	void SetPan(float Pan)	 // 0x55fa318;
	void SetPitchBend(float PitchBend)	 // 0x55fa51c;
	void SetPortamento(float Portamento)	 // 0x55fa860;
	void SetReleaseTime(float ReleaseTimeMsec)	 // 0x55fb240;
	void SetSpread(float Spread)	 // 0x55fc9e4;
	void SetStereoDelayFeedback(float DelayFeedback)	 // 0x55fcd30;
	void SetStereoDelayIsEnabled(bool StereoDelayEnabled)	 // 0x55fcdf4;
	void SetStereoDelayMode(ESynthStereoDelayMode StereoDelayMode)	 // 0x55fceb8;
	void SetStereoDelayRatio(float DelayRatio)	 // 0x55fcf78;
	void SetStereoDelayTime(float DelayTimeMsec)	 // 0x55fd03c;
	void SetStereoDelayWetlevel(float DelayWetlevel)	 // 0x55fd100;
	void SetSustainGain(float SustainGain)	 // 0x55fd288;
	void SetSynthPreset(const struct FModularSynthPreset& SynthPreset)	 // 0x55fd44c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ModularSynthComponent">();
	}
	static class UModularSynthComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UModularSynthComponent>();
	}
};
static_assert(alignof(UModularSynthComponent) == 0x000010, "Wrong alignment on UModularSynthComponent");
static_assert(sizeof(UModularSynthComponent) == 0x000EA0, "Wrong size on UModularSynthComponent");
static_assert(offsetof(UModularSynthComponent, VoiceCount) == 0x0007D0, "Member 'UModularSynthComponent::VoiceCount' has a wrong offset!");

// Class Synthesis.SourceEffectBitCrusherPreset
// 0x01C8 (0x0230 - 0x0068)
class USourceEffectBitCrusherPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0xF8];                                      // 0x0068(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectBitCrusherSettings        Settings;                                          // 0x0160(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetBitModulator(const class USoundModulatorBase* Modulator)	 // 0x55f44c4;
	void SetBitModulators(const TSet<class USoundModulatorBase*>& InModulators)	 // 0x55f45a4;
	void SetBits(float Bits)	 // 0x55f4688;
	void SetModulationSettings(const struct FSourceEffectBitCrusherSettings& ModulationSettings)	 // 0x55f9650;
	void SetSampleRate(float SampleRate)	 // 0x55fb3c8;
	void SetSampleRateModulator(const class USoundModulatorBase* Modulator)	 // 0x55fb48c;
	void SetSampleRateModulators(const TSet<class USoundModulatorBase*>& InModulators)	 // 0x55fb56c;
	void SetSettings(const struct FSourceEffectBitCrusherBaseSettings& Settings_0)	 // 0x55fb914;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectBitCrusherPreset">();
	}
	static class USourceEffectBitCrusherPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectBitCrusherPreset>();
	}
};
static_assert(alignof(USourceEffectBitCrusherPreset) == 0x000008, "Wrong alignment on USourceEffectBitCrusherPreset");
static_assert(sizeof(USourceEffectBitCrusherPreset) == 0x000230, "Wrong size on USourceEffectBitCrusherPreset");
static_assert(offsetof(USourceEffectBitCrusherPreset, Settings) == 0x000160, "Member 'USourceEffectBitCrusherPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectChorusPreset
// 0x04D8 (0x0540 - 0x0068)
class USourceEffectChorusPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x280];                                     // 0x0068(0x0280)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectChorusSettings            Settings;                                          // 0x02E8(0x0258)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetDepth(float Depth)	 // 0x55f5290;
	void SetDepthModulator(const class USoundModulatorBase* Modulator)	 // 0x55f5354;
	void SetDepthModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55f5434;
	void SetDry(float DryAmount)	 // 0x55f5518;
	void SetDryModulator(const class USoundModulatorBase* Modulator)	 // 0x55f55dc;
	void SetDryModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55f56bc;
	void SetFeedback(float Feedback)	 // 0x55f5d1c;
	void SetFeedbackModulator(const class USoundModulatorBase* Modulator)	 // 0x55f5de0;
	void SetFeedbackModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55f5ec0;
	void SetFrequency(float Frequency)	 // 0x55f6fd8;
	void SetFrequencyModulator(const class USoundModulatorBase* Modulator)	 // 0x55f722c;
	void SetFrequencyModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55f730c;
	void SetModulationSettings(const struct FSourceEffectChorusSettings& ModulationSettings)	 // 0x55f9744;
	void SetSettings(const struct FSourceEffectChorusBaseSettings& Settings_0)	 // 0x55fb9a8;
	void SetSpread(float Spread)	 // 0x55fcaa8;
	void SetSpreadModulator(const class USoundModulatorBase* Modulator)	 // 0x55fcb6c;
	void SetSpreadModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55fcc4c;
	void SetWet(float WetAmount)	 // 0x55fd7ec;
	void SetWetModulator(const class USoundModulatorBase* Modulator)	 // 0x55fd8b0;
	void SetWetModulators(const TSet<class USoundModulatorBase*>& Modulators)	 // 0x55fd990;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectChorusPreset">();
	}
	static class USourceEffectChorusPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectChorusPreset>();
	}
};
static_assert(alignof(USourceEffectChorusPreset) == 0x000008, "Wrong alignment on USourceEffectChorusPreset");
static_assert(sizeof(USourceEffectChorusPreset) == 0x000540, "Wrong size on USourceEffectChorusPreset");
static_assert(offsetof(USourceEffectChorusPreset, Settings) == 0x0002E8, "Member 'USourceEffectChorusPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectConvolutionReverbPreset
// 0x0058 (0x00C0 - 0x0068)
class USourceEffectConvolutionReverbPreset final : public USoundEffectSourcePreset
{
public:
	class UAudioImpulseResponse*                  ImpulseResponse;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSourceEffectConvolutionReverbSettings Settings;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ESubmixEffectConvolutionReverbBlockSize       BlockSize;                                         // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHardwareAcceleration;                       // 0x0081(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x3E];                                      // 0x0082(0x003E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetImpulseResponse(class UAudioImpulseResponse* InImpulseResponse)	 // 0x55f7e10;
	void SetSettings(const struct FSourceEffectConvolutionReverbSettings& InSettings)	 // 0x55fba48;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectConvolutionReverbPreset">();
	}
	static class USourceEffectConvolutionReverbPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectConvolutionReverbPreset>();
	}
};
static_assert(alignof(USourceEffectConvolutionReverbPreset) == 0x000008, "Wrong alignment on USourceEffectConvolutionReverbPreset");
static_assert(sizeof(USourceEffectConvolutionReverbPreset) == 0x0000C0, "Wrong size on USourceEffectConvolutionReverbPreset");
static_assert(offsetof(USourceEffectConvolutionReverbPreset, ImpulseResponse) == 0x000068, "Member 'USourceEffectConvolutionReverbPreset::ImpulseResponse' has a wrong offset!");
static_assert(offsetof(USourceEffectConvolutionReverbPreset, Settings) == 0x000070, "Member 'USourceEffectConvolutionReverbPreset::Settings' has a wrong offset!");
static_assert(offsetof(USourceEffectConvolutionReverbPreset, BlockSize) == 0x000080, "Member 'USourceEffectConvolutionReverbPreset::BlockSize' has a wrong offset!");
static_assert(offsetof(USourceEffectConvolutionReverbPreset, bEnableHardwareAcceleration) == 0x000081, "Member 'USourceEffectConvolutionReverbPreset::bEnableHardwareAcceleration' has a wrong offset!");

// Class Synthesis.EnvelopeFollowerListener
// 0x0020 (0x00E0 - 0x00C0)
class UEnvelopeFollowerListener final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(float EnvelopeValue)> OnEnvelopeFollowerUpdate;                    // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"EnvelopeFollowerListener">();
	}
	static class UEnvelopeFollowerListener* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UEnvelopeFollowerListener>();
	}
};
static_assert(alignof(UEnvelopeFollowerListener) == 0x000008, "Wrong alignment on UEnvelopeFollowerListener");
static_assert(sizeof(UEnvelopeFollowerListener) == 0x0000E0, "Wrong size on UEnvelopeFollowerListener");
static_assert(offsetof(UEnvelopeFollowerListener, OnEnvelopeFollowerUpdate) == 0x0000C0, "Member 'UEnvelopeFollowerListener::OnEnvelopeFollowerUpdate' has a wrong offset!");

// Class Synthesis.SourceEffectEnvelopeFollowerPreset
// 0x0040 (0x00A8 - 0x0068)
class USourceEffectEnvelopeFollowerPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x34];                                      // 0x0068(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectEnvelopeFollowerSettings  Settings;                                          // 0x009C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void RegisterEnvelopeFollowerListener(class UEnvelopeFollowerListener* EnvelopeFollowerListener)	 // 0x55f3824;
	void SetSettings(const struct FSourceEffectEnvelopeFollowerSettings& InSettings)	 // 0x55fbc98;
	void UnregisterEnvelopeFollowerListener(class UEnvelopeFollowerListener* EnvelopeFollowerListener)	 // 0x55fda74;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectEnvelopeFollowerPreset">();
	}
	static class USourceEffectEnvelopeFollowerPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectEnvelopeFollowerPreset>();
	}
};
static_assert(alignof(USourceEffectEnvelopeFollowerPreset) == 0x000008, "Wrong alignment on USourceEffectEnvelopeFollowerPreset");
static_assert(sizeof(USourceEffectEnvelopeFollowerPreset) == 0x0000A8, "Wrong size on USourceEffectEnvelopeFollowerPreset");
static_assert(offsetof(USourceEffectEnvelopeFollowerPreset, Settings) == 0x00009C, "Member 'USourceEffectEnvelopeFollowerPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectEQPreset
// 0x0048 (0x00B0 - 0x0068)
class USourceEffectEQPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectEQSettings                Settings;                                          // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectEQSettings& InSettings)	 // 0x55fbbcc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectEQPreset">();
	}
	static class USourceEffectEQPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectEQPreset>();
	}
};
static_assert(alignof(USourceEffectEQPreset) == 0x000008, "Wrong alignment on USourceEffectEQPreset");
static_assert(sizeof(USourceEffectEQPreset) == 0x0000B0, "Wrong size on USourceEffectEQPreset");
static_assert(offsetof(USourceEffectEQPreset, Settings) == 0x0000A0, "Member 'USourceEffectEQPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectFilterPreset
// 0x0068 (0x00D0 - 0x0068)
class USourceEffectFilterPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x48];                                      // 0x0068(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectFilterSettings            Settings;                                          // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectFilterSettings& InSettings)	 // 0x55fbd34;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectFilterPreset">();
	}
	static class USourceEffectFilterPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectFilterPreset>();
	}
};
static_assert(alignof(USourceEffectFilterPreset) == 0x000008, "Wrong alignment on USourceEffectFilterPreset");
static_assert(sizeof(USourceEffectFilterPreset) == 0x0000D0, "Wrong size on USourceEffectFilterPreset");
static_assert(offsetof(USourceEffectFilterPreset, Settings) == 0x0000B0, "Member 'USourceEffectFilterPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectFoldbackDistortionPreset
// 0x0040 (0x00A8 - 0x0068)
class USourceEffectFoldbackDistortionPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x34];                                      // 0x0068(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectFoldbackDistortionSettings Settings;                                         // 0x009C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectFoldbackDistortionSettings& InSettings)	 // 0x55fbde4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectFoldbackDistortionPreset">();
	}
	static class USourceEffectFoldbackDistortionPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectFoldbackDistortionPreset>();
	}
};
static_assert(alignof(USourceEffectFoldbackDistortionPreset) == 0x000008, "Wrong alignment on USourceEffectFoldbackDistortionPreset");
static_assert(sizeof(USourceEffectFoldbackDistortionPreset) == 0x0000A8, "Wrong size on USourceEffectFoldbackDistortionPreset");
static_assert(offsetof(USourceEffectFoldbackDistortionPreset, Settings) == 0x00009C, "Member 'USourceEffectFoldbackDistortionPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectMidSideSpreaderPreset
// 0x0038 (0x00A0 - 0x0068)
class USourceEffectMidSideSpreaderPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectMidSideSpreaderSettings   Settings;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectMidSideSpreaderSettings& InSettings)	 // 0x55fbe7c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectMidSideSpreaderPreset">();
	}
	static class USourceEffectMidSideSpreaderPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectMidSideSpreaderPreset>();
	}
};
static_assert(alignof(USourceEffectMidSideSpreaderPreset) == 0x000008, "Wrong alignment on USourceEffectMidSideSpreaderPreset");
static_assert(sizeof(USourceEffectMidSideSpreaderPreset) == 0x0000A0, "Wrong size on USourceEffectMidSideSpreaderPreset");
static_assert(offsetof(USourceEffectMidSideSpreaderPreset, Settings) == 0x000098, "Member 'USourceEffectMidSideSpreaderPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectMotionFilterPreset
// 0x0118 (0x0180 - 0x0068)
class USourceEffectMotionFilterPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0xA0];                                      // 0x0068(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectMotionFilterSettings      Settings;                                          // 0x0108(0x0078)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectMotionFilterSettings& InSettings)	 // 0x55fbf14;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectMotionFilterPreset">();
	}
	static class USourceEffectMotionFilterPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectMotionFilterPreset>();
	}
};
static_assert(alignof(USourceEffectMotionFilterPreset) == 0x000008, "Wrong alignment on USourceEffectMotionFilterPreset");
static_assert(sizeof(USourceEffectMotionFilterPreset) == 0x000180, "Wrong size on USourceEffectMotionFilterPreset");
static_assert(offsetof(USourceEffectMotionFilterPreset, Settings) == 0x000108, "Member 'USourceEffectMotionFilterPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectPannerPreset
// 0x0038 (0x00A0 - 0x0068)
class USourceEffectPannerPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectPannerSettings            Settings;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectPannerSettings& InSettings)	 // 0x55fbffc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectPannerPreset">();
	}
	static class USourceEffectPannerPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectPannerPreset>();
	}
};
static_assert(alignof(USourceEffectPannerPreset) == 0x000008, "Wrong alignment on USourceEffectPannerPreset");
static_assert(sizeof(USourceEffectPannerPreset) == 0x0000A0, "Wrong size on USourceEffectPannerPreset");
static_assert(offsetof(USourceEffectPannerPreset, Settings) == 0x000098, "Member 'USourceEffectPannerPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectPhaserPreset
// 0x0048 (0x00B0 - 0x0068)
class USourceEffectPhaserPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectPhaserSettings            Settings;                                          // 0x00A0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectPhaserSettings& InSettings)	 // 0x55fc090;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectPhaserPreset">();
	}
	static class USourceEffectPhaserPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectPhaserPreset>();
	}
};
static_assert(alignof(USourceEffectPhaserPreset) == 0x000008, "Wrong alignment on USourceEffectPhaserPreset");
static_assert(sizeof(USourceEffectPhaserPreset) == 0x0000B0, "Wrong size on USourceEffectPhaserPreset");
static_assert(offsetof(USourceEffectPhaserPreset, Settings) == 0x0000A0, "Member 'USourceEffectPhaserPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectRingModulationPreset
// 0x0068 (0x00D0 - 0x0068)
class USourceEffectRingModulationPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x48];                                      // 0x0068(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectRingModulationSettings    Settings;                                          // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectRingModulationSettings& InSettings)	 // 0x55fc130;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectRingModulationPreset">();
	}
	static class USourceEffectRingModulationPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectRingModulationPreset>();
	}
};
static_assert(alignof(USourceEffectRingModulationPreset) == 0x000008, "Wrong alignment on USourceEffectRingModulationPreset");
static_assert(sizeof(USourceEffectRingModulationPreset) == 0x0000D0, "Wrong size on USourceEffectRingModulationPreset");
static_assert(offsetof(USourceEffectRingModulationPreset, Settings) == 0x0000B0, "Member 'USourceEffectRingModulationPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectSimpleDelayPreset
// 0x0058 (0x00C0 - 0x0068)
class USourceEffectSimpleDelayPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x40];                                      // 0x0068(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectSimpleDelaySettings       Settings;                                          // 0x00A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectSimpleDelaySettings& InSettings)	 // 0x55fc1cc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectSimpleDelayPreset">();
	}
	static class USourceEffectSimpleDelayPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectSimpleDelayPreset>();
	}
};
static_assert(alignof(USourceEffectSimpleDelayPreset) == 0x000008, "Wrong alignment on USourceEffectSimpleDelayPreset");
static_assert(sizeof(USourceEffectSimpleDelayPreset) == 0x0000C0, "Wrong size on USourceEffectSimpleDelayPreset");
static_assert(offsetof(USourceEffectSimpleDelayPreset, Settings) == 0x0000A8, "Member 'USourceEffectSimpleDelayPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectStereoDelayPreset
// 0x0070 (0x00D8 - 0x0068)
class USourceEffectStereoDelayPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x4C];                                      // 0x0068(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectStereoDelaySettings       Settings;                                          // 0x00B4(0x0024)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectStereoDelaySettings& InSettings)	 // 0x55fc294;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectStereoDelayPreset">();
	}
	static class USourceEffectStereoDelayPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectStereoDelayPreset>();
	}
};
static_assert(alignof(USourceEffectStereoDelayPreset) == 0x000008, "Wrong alignment on USourceEffectStereoDelayPreset");
static_assert(sizeof(USourceEffectStereoDelayPreset) == 0x0000D8, "Wrong size on USourceEffectStereoDelayPreset");
static_assert(offsetof(USourceEffectStereoDelayPreset, Settings) == 0x0000B4, "Member 'USourceEffectStereoDelayPreset::Settings' has a wrong offset!");

// Class Synthesis.SourceEffectWaveShaperPreset
// 0x0038 (0x00A0 - 0x0068)
class USourceEffectWaveShaperPreset final : public USoundEffectSourcePreset
{
public:
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceEffectWaveShaperSettings        Settings;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSourceEffectWaveShaperSettings& InSettings)	 // 0x55fbffc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SourceEffectWaveShaperPreset">();
	}
	static class USourceEffectWaveShaperPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USourceEffectWaveShaperPreset>();
	}
};
static_assert(alignof(USourceEffectWaveShaperPreset) == 0x000008, "Wrong alignment on USourceEffectWaveShaperPreset");
static_assert(sizeof(USourceEffectWaveShaperPreset) == 0x0000A0, "Wrong size on USourceEffectWaveShaperPreset");
static_assert(offsetof(USourceEffectWaveShaperPreset, Settings) == 0x000098, "Member 'USourceEffectWaveShaperPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectConvolutionReverbPreset
// 0x0098 (0x0100 - 0x0068)
class USubmixEffectConvolutionReverbPreset final : public USoundEffectSubmixPreset
{
public:
	class UAudioImpulseResponse*                  ImpulseResponse;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubmixEffectConvolutionReverbSettings Settings;                                          // 0x0070(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ESubmixEffectConvolutionReverbBlockSize       BlockSize;                                         // 0x00A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHardwareAcceleration;                       // 0x00A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x5E];                                      // 0x00A2(0x005E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetImpulseResponse(class UAudioImpulseResponse* InImpulseResponse)	 // 0x55f7ed8;
	void SetSettings(const struct FSubmixEffectConvolutionReverbSettings& InSettings)	 // 0x55fc364;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectConvolutionReverbPreset">();
	}
	static class USubmixEffectConvolutionReverbPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectConvolutionReverbPreset>();
	}
};
static_assert(alignof(USubmixEffectConvolutionReverbPreset) == 0x000008, "Wrong alignment on USubmixEffectConvolutionReverbPreset");
static_assert(sizeof(USubmixEffectConvolutionReverbPreset) == 0x000100, "Wrong size on USubmixEffectConvolutionReverbPreset");
static_assert(offsetof(USubmixEffectConvolutionReverbPreset, ImpulseResponse) == 0x000068, "Member 'USubmixEffectConvolutionReverbPreset::ImpulseResponse' has a wrong offset!");
static_assert(offsetof(USubmixEffectConvolutionReverbPreset, Settings) == 0x000070, "Member 'USubmixEffectConvolutionReverbPreset::Settings' has a wrong offset!");
static_assert(offsetof(USubmixEffectConvolutionReverbPreset, BlockSize) == 0x0000A0, "Member 'USubmixEffectConvolutionReverbPreset::BlockSize' has a wrong offset!");
static_assert(offsetof(USubmixEffectConvolutionReverbPreset, bEnableHardwareAcceleration) == 0x0000A1, "Member 'USubmixEffectConvolutionReverbPreset::bEnableHardwareAcceleration' has a wrong offset!");

// Class Synthesis.SubmixEffectDelayStatics
// 0x0000 (0x0028 - 0x0028)
class USubmixEffectDelayStatics final : public UBlueprintFunctionLibrary
{
public:
	static struct FSubmixEffectDelaySettings SetDelayLength(struct FSubmixEffectDelaySettings& DelaySettings, float DelayLength)	 // 0x55f50dc;
	static struct FSubmixEffectDelaySettings SetInterpolationTime(struct FSubmixEffectDelaySettings& DelaySettings, float InterpolationTime)	 // 0x55f8064;
	static struct FSubmixEffectDelaySettings SetMaximumDelayLength(struct FSubmixEffectDelaySettings& DelaySettings, float MaximumDelayLength)	 // 0x55f8cd0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectDelayStatics">();
	}
	static class USubmixEffectDelayStatics* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectDelayStatics>();
	}
};
static_assert(alignof(USubmixEffectDelayStatics) == 0x000008, "Wrong alignment on USubmixEffectDelayStatics");
static_assert(sizeof(USubmixEffectDelayStatics) == 0x000028, "Wrong size on USubmixEffectDelayStatics");

// Class Synthesis.SubmixEffectDelayPreset
// 0x0050 (0x00B8 - 0x0068)
class USubmixEffectDelayPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x34];                                      // 0x0068(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectDelaySettings             Settings;                                          // 0x009C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSubmixEffectDelaySettings             DynamicSettings;                                   // 0x00A8(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDefaultSettings(const struct FSubmixEffectDelaySettings& InSettings)	 // 0x55f4f7c;
	void SetDelay(float Length)	 // 0x55f5018;
	void SetInterpolationTime(float Time)	 // 0x55f7fa0;
	void SetSettings(const struct FSubmixEffectDelaySettings& InSettings)	 // 0x55fc45c;

	float GetMaxDelayInMilliseconds() const	 // 0x55f2bfc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectDelayPreset">();
	}
	static class USubmixEffectDelayPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectDelayPreset>();
	}
};
static_assert(alignof(USubmixEffectDelayPreset) == 0x000008, "Wrong alignment on USubmixEffectDelayPreset");
static_assert(sizeof(USubmixEffectDelayPreset) == 0x0000B8, "Wrong size on USubmixEffectDelayPreset");
static_assert(offsetof(USubmixEffectDelayPreset, Settings) == 0x00009C, "Member 'USubmixEffectDelayPreset::Settings' has a wrong offset!");
static_assert(offsetof(USubmixEffectDelayPreset, DynamicSettings) == 0x0000A8, "Member 'USubmixEffectDelayPreset::DynamicSettings' has a wrong offset!");

// Class Synthesis.SubmixEffectFilterPreset
// 0x0040 (0x00A8 - 0x0068)
class USubmixEffectFilterPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x34];                                      // 0x0068(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectFilterSettings            Settings;                                          // 0x009C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetFilterAlgorithm(ESubmixFilterAlgorithm InAlgorithm)	 // 0x55f6064;
	void SetFilterCutoffFrequency(float InFrequency)	 // 0x55f6144;
	void SetFilterCutoffFrequencyMod(float InFrequency)	 // 0x55f6208;
	void SetFilterQ(float InQ)	 // 0x55f6bb0;
	void SetFilterQMod(float InQ)	 // 0x55f6d38;
	void SetFilterType(ESubmixFilterType InType)	 // 0x55f6ef8;
	void SetSettings(const struct FSubmixEffectFilterSettings& InSettings)	 // 0x55fc50c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectFilterPreset">();
	}
	static class USubmixEffectFilterPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectFilterPreset>();
	}
};
static_assert(alignof(USubmixEffectFilterPreset) == 0x000008, "Wrong alignment on USubmixEffectFilterPreset");
static_assert(sizeof(USubmixEffectFilterPreset) == 0x0000A8, "Wrong size on USubmixEffectFilterPreset");
static_assert(offsetof(USubmixEffectFilterPreset, Settings) == 0x00009C, "Member 'USubmixEffectFilterPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectFlexiverbPreset
// 0x0048 (0x00B0 - 0x0068)
class USubmixEffectFlexiverbPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectFlexiverbSettings         Settings;                                          // 0x00A0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSubmixEffectFlexiverbSettings& InSettings)	 // 0x55fc5a4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectFlexiverbPreset">();
	}
	static class USubmixEffectFlexiverbPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectFlexiverbPreset>();
	}
};
static_assert(alignof(USubmixEffectFlexiverbPreset) == 0x000008, "Wrong alignment on USubmixEffectFlexiverbPreset");
static_assert(sizeof(USubmixEffectFlexiverbPreset) == 0x0000B0, "Wrong size on USubmixEffectFlexiverbPreset");
static_assert(offsetof(USubmixEffectFlexiverbPreset, Settings) == 0x0000A0, "Member 'USubmixEffectFlexiverbPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectMultibandCompressorPreset
// 0x0098 (0x0100 - 0x0068)
class USubmixEffectMultibandCompressorPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x60];                                      // 0x0068(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectMultibandCompressorSettings Settings;                                        // 0x00C8(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void ResetKey()	 // 0x55f39b4;
	void SetAudioBus(class UAudioBus* AudioBus)	 // 0x55f43a4;
	void SetExternalSubmix(class USoundSubmix* Submix)	 // 0x55f5c04;
	void SetSettings(const struct FSubmixEffectMultibandCompressorSettings& InSettings)	 // 0x55fc648;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectMultibandCompressorPreset">();
	}
	static class USubmixEffectMultibandCompressorPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectMultibandCompressorPreset>();
	}
};
static_assert(alignof(USubmixEffectMultibandCompressorPreset) == 0x000008, "Wrong alignment on USubmixEffectMultibandCompressorPreset");
static_assert(sizeof(USubmixEffectMultibandCompressorPreset) == 0x000100, "Wrong size on USubmixEffectMultibandCompressorPreset");
static_assert(offsetof(USubmixEffectMultibandCompressorPreset, Settings) == 0x0000C8, "Member 'USubmixEffectMultibandCompressorPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectStereoDelayPreset
// 0x0070 (0x00D8 - 0x0068)
class USubmixEffectStereoDelayPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x4C];                                      // 0x0068(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectStereoDelaySettings       Settings;                                          // 0x00B4(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSubmixEffectStereoDelaySettings& InSettings)	 // 0x55fc294;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectStereoDelayPreset">();
	}
	static class USubmixEffectStereoDelayPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectStereoDelayPreset>();
	}
};
static_assert(alignof(USubmixEffectStereoDelayPreset) == 0x000008, "Wrong alignment on USubmixEffectStereoDelayPreset");
static_assert(sizeof(USubmixEffectStereoDelayPreset) == 0x0000D8, "Wrong size on USubmixEffectStereoDelayPreset");
static_assert(offsetof(USubmixEffectStereoDelayPreset, Settings) == 0x0000B4, "Member 'USubmixEffectStereoDelayPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectStereoToQuadPreset
// 0x0038 (0x00A0 - 0x0068)
class USubmixEffectStereoToQuadPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x30];                                      // 0x0068(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectStereoToQuadSettings      Settings;                                          // 0x0098(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetSettings(const struct FSubmixEffectStereoToQuadSettings& InSettings)	 // 0x55fc718;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectStereoToQuadPreset">();
	}
	static class USubmixEffectStereoToQuadPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectStereoToQuadPreset>();
	}
};
static_assert(alignof(USubmixEffectStereoToQuadPreset) == 0x000008, "Wrong alignment on USubmixEffectStereoToQuadPreset");
static_assert(sizeof(USubmixEffectStereoToQuadPreset) == 0x0000A0, "Wrong size on USubmixEffectStereoToQuadPreset");
static_assert(offsetof(USubmixEffectStereoToQuadPreset, Settings) == 0x000098, "Member 'USubmixEffectStereoToQuadPreset::Settings' has a wrong offset!");

// Class Synthesis.SubmixEffectTapDelayPreset
// 0x0070 (0x00D8 - 0x0068)
class USubmixEffectTapDelayPreset final : public USoundEffectSubmixPreset
{
public:
	uint8                                         Pad_68[0x40];                                      // 0x0068(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubmixEffectTapDelaySettings          Settings;                                          // 0x00A8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTap(int32* TapId)	 // 0x55f21f4;
	float GetMaxDelayInMilliseconds()	 // 0x46a6aec;
	void GetTap(int32 TapId, struct FTapDelayInfo* TapInfo)	 // 0x55f2c74;
	void GetTapIds(TArray<int32>* TapIds)	 // 0x55f2da8;
	void RemoveTap(int32 TapId)	 // 0x55f38f4;
	void SetInterpolationTime(float Time)	 // 0x55f8208;
	void SetSettings(const struct FSubmixEffectTapDelaySettings& InSettings)	 // 0x55fc7a8;
	void SetTap(int32 TapId, const struct FTapDelayInfo& TapInfo)	 // 0x55fd528;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SubmixEffectTapDelayPreset">();
	}
	static class USubmixEffectTapDelayPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USubmixEffectTapDelayPreset>();
	}
};
static_assert(alignof(USubmixEffectTapDelayPreset) == 0x000008, "Wrong alignment on USubmixEffectTapDelayPreset");
static_assert(sizeof(USubmixEffectTapDelayPreset) == 0x0000D8, "Wrong size on USubmixEffectTapDelayPreset");
static_assert(offsetof(USubmixEffectTapDelayPreset, Settings) == 0x0000A8, "Member 'USubmixEffectTapDelayPreset::Settings' has a wrong offset!");

// Class Synthesis.GranularSynth
// 0x03E0 (0x0BB0 - 0x07D0)
class UGranularSynth final : public USynthComponent
{
public:
	class USoundWave*                             GranulatedSoundWave;                               // 0x07D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7D8[0x3D8];                                    // 0x07D8(0x03D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NoteOff(const float Note, const bool bKill)	 // 0x55f2ec4;
	void NoteOn(const float Note, const int32 Velocity, const float Duration)	 // 0x55f3298;
	void SetAttackTime(const float AttackTimeMsec)	 // 0x55f421c;
	void SetDecayTime(const float DecayTimeMsec)	 // 0x55f421c;
	void SetGrainDuration(const float BaseDurationMsec, const struct FVector2D& DurationRange)	 // 0x55f763c;
	void SetGrainEnvelopeType(const EGranularSynthEnvelopeType EnvelopeType)	 // 0x55f7790;
	void SetGrainPan(const float BasePan, const struct FVector2D& PanRange)	 // 0x55f788c;
	void SetGrainPitch(const float BasePitch, const struct FVector2D& PitchRange)	 // 0x55f79e0;
	void SetGrainProbability(const float InGrainProbability)	 // 0x55f7b34;
	void SetGrainsPerSecond(const float InGrainsPerSecond)	 // 0x55f7d4c;
	void SetGrainVolume(const float BaseVolume, const struct FVector2D& VolumeRange)	 // 0x55f7bf8;
	void SetPlaybackSpeed(const float InPlayheadRate)	 // 0x55fa5e0;
	void SetPlayheadTime(const float InPositionSec, const float LerpTimeSec, EGranularSynthSeekType SeekType)	 // 0x55fa6a4;
	void SetReleaseTimeMsec(const float ReleaseTimeMsec)	 // 0x55fb304;
	void SetScrubMode(const bool bScrubMode)	 // 0x55fb650;
	void SetSoundWave(class USoundWave* InSoundWave)	 // 0x55fc854;
	void SetSustainGain(const float SustainGain)	 // 0x55fd1c4;

	float GetCurrentPlayheadTime() const	 // 0x55f24c8;
	float GetSampleDuration() const	 // 0x55f2c5c;
	bool IsLoaded() const	 // 0x55f2e94;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GranularSynth">();
	}
	static class UGranularSynth* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGranularSynth>();
	}
};
static_assert(alignof(UGranularSynth) == 0x000010, "Wrong alignment on UGranularSynth");
static_assert(sizeof(UGranularSynth) == 0x000BB0, "Wrong size on UGranularSynth");
static_assert(offsetof(UGranularSynth, GranulatedSoundWave) == 0x0007D0, "Member 'UGranularSynth::GranulatedSoundWave' has a wrong offset!");

// Class Synthesis.MonoWaveTableSynthPreset
// 0x0148 (0x0170 - 0x0028)
class UMonoWaveTableSynthPreset final : public UObject
{
public:
	class FString                                 PresetName;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLockKeyframesToGridBool : 1;                      // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LockKeyframesToGrid;                               // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaveTableResolution;                               // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRuntimeFloatCurve>             WaveTable;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NonTransactional, NativeAccessSpecifierPublic)
	uint8                                         bNormalizeWaveTables : 1;                          // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x117];                                     // 0x0059(0x0117)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MonoWaveTableSynthPreset">();
	}
	static class UMonoWaveTableSynthPreset* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMonoWaveTableSynthPreset>();
	}
};
static_assert(alignof(UMonoWaveTableSynthPreset) == 0x000008, "Wrong alignment on UMonoWaveTableSynthPreset");
static_assert(sizeof(UMonoWaveTableSynthPreset) == 0x000170, "Wrong size on UMonoWaveTableSynthPreset");
static_assert(offsetof(UMonoWaveTableSynthPreset, PresetName) == 0x000028, "Member 'UMonoWaveTableSynthPreset::PresetName' has a wrong offset!");
static_assert(offsetof(UMonoWaveTableSynthPreset, LockKeyframesToGrid) == 0x00003C, "Member 'UMonoWaveTableSynthPreset::LockKeyframesToGrid' has a wrong offset!");
static_assert(offsetof(UMonoWaveTableSynthPreset, WaveTableResolution) == 0x000040, "Member 'UMonoWaveTableSynthPreset::WaveTableResolution' has a wrong offset!");
static_assert(offsetof(UMonoWaveTableSynthPreset, WaveTable) == 0x000048, "Member 'UMonoWaveTableSynthPreset::WaveTable' has a wrong offset!");

// Class Synthesis.SynthComponentMonoWaveTable
// 0x0750 (0x0F20 - 0x07D0)
class USynthComponentMonoWaveTable final : public USynthComponent
{
public:
	TMulticastInlineDelegate<void(int32 TableIndex)> OnTableAltered;                                 // 0x07D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnNumTablesChanged;                                // 0x07E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMonoWaveTableSynthPreset*              CurrentPreset;                                     // 0x07F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7F8[0x728];                                    // 0x07F8(0x0728)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetCurveTangent(int32 TableIndex)	 // 0x55f24e0;
	int32 GetNumTableEntries()	 // 0x55f2c3c;
	void NoteOff(const float InMidiNote)	 // 0x55f31d4;
	void NoteOn(const float InMidiNote, const float InVelocity)	 // 0x55f3610;
	void RefreshAllWaveTables()	 // 0x55f3750;
	void RefreshWaveTable(int32 Index_0)	 // 0x55f3764;
	void SetAmpEnvelopeAttackTime(const float InAttackTimeMsec)	 // 0x55f3b84;
	void SetAmpEnvelopeBiasDepth(const float InDepth)	 // 0x55f3c48;
	void SetAmpEnvelopeBiasInvert(const bool bInBiasInvert)	 // 0x55f3d0c;
	void SetAmpEnvelopeDecayTime(const float InDecayTimeMsec)	 // 0x55f3e0c;
	void SetAmpEnvelopeDepth(const float InDepth)	 // 0x55f3ed0;
	void SetAmpEnvelopeInvert(const bool bInInvert)	 // 0x55f3f94;
	void SetAmpEnvelopeReleaseTime(const float InReleaseTimeMsec)	 // 0x55f4094;
	void SetAmpEnvelopeSustainGain(const float InSustainGain)	 // 0x55f4158;
	bool SetCurveInterpolationType(ECurveInterpolationType InterpolationType, int32 TableIndex)	 // 0x55f4a5c;
	bool SetCurveTangent(int32 TableIndex, float InNewTangent)	 // 0x55f4bac;
	bool SetCurveValue(int32 TableIndex, int32 KeyframeIndex, const float NewValue)	 // 0x55f4cfc;
	void SetFilterEnvelopeAttackTime(const float InAttackTimeMsec)	 // 0x55f62cc;
	void SetFilterEnvelopeBiasDepth(const float InDepth)	 // 0x55f6390;
	void SetFilterEnvelopeBiasInvert(const bool bInBiasInvert)	 // 0x55f6454;
	void SetFilterEnvelopeDepth(const float InDepth)	 // 0x55f6554;
	void SetFilterEnvelopeInvert(const bool bInInvert)	 // 0x55f6618;
	void SetFilterEnvelopenDecayTime(const float InDecayTimeMsec)	 // 0x55f68a0;
	void SetFilterEnvelopeReleaseTime(const float InReleaseTimeMsec)	 // 0x55f6718;
	void SetFilterEnvelopeSustainGain(const float InSustainGain)	 // 0x55f67dc;
	void SetFrequency(const float FrequencyHz)	 // 0x55f709c;
	void SetFrequencyPitchBend(const float FrequencyOffsetCents)	 // 0x55f73f0;
	void SetFrequencyWithMidiNote(const float InMidiNote)	 // 0x55f74b4;
	void SetLowPassFilterResonance(float InNewQ)	 // 0x55f8c0c;
	void SetPositionEnvelopeAttackTime(const float InAttackTimeMsec)	 // 0x55faba8;
	void SetPositionEnvelopeBiasDepth(const float InDepth)	 // 0x55fac6c;
	void SetPositionEnvelopeBiasInvert(const bool bInBiasInvert)	 // 0x55fad30;
	void SetPositionEnvelopeDecayTime(const float InDecayTimeMsec)	 // 0x55fae30;
	void SetPositionEnvelopeDepth(const float InDepth)	 // 0x55faef4;
	void SetPositionEnvelopeInvert(const bool bInInvert)	 // 0x55fafb8;
	void SetPositionEnvelopeReleaseTime(const float InReleaseTimeMsec)	 // 0x55fb0b8;
	void SetPositionEnvelopeSustainGain(const float InSustainGain)	 // 0x55fb17c;
	void SetPosLfoDepth(const float InLfoDepth)	 // 0x55fa924;
	void SetPosLfoFrequency(const float InLfoFrequency)	 // 0x55fa9e8;
	void SetPosLfoType(const ESynthLFOType InLfoType)	 // 0x55faaac;
	void SetSustainPedalState(bool InSustainPedalState)	 // 0x55fd34c;
	void SetWaveTablePosition(float InPosition)	 // 0x55fd728;

	TArray<float> GetKeyFrameValuesForTable(float TableIndex) const	 // 0x55f25b0;
	int32 GetMaxTableIndex() const	 // 0x55f2c14;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SynthComponentMonoWaveTable">();
	}
	static class USynthComponentMonoWaveTable* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USynthComponentMonoWaveTable>();
	}
};
static_assert(alignof(USynthComponentMonoWaveTable) == 0x000010, "Wrong alignment on USynthComponentMonoWaveTable");
static_assert(sizeof(USynthComponentMonoWaveTable) == 0x000F20, "Wrong size on USynthComponentMonoWaveTable");
static_assert(offsetof(USynthComponentMonoWaveTable, OnTableAltered) == 0x0007D0, "Member 'USynthComponentMonoWaveTable::OnTableAltered' has a wrong offset!");
