#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function TutorialRuntime.P2GameMode_Tutorial.OnPlayerDeathMessage
// 0x00A0 (0x00A0 - 0x0000)
struct P2GameMode_Tutorial_OnPlayerDeathMessage final
{
public:
	struct FGameplayTag                           InGameplayTag;                                     // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FP2VerbMessage                         VerbMessage;                                       // 0x0008(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GameMode_Tutorial_OnPlayerDeathMessage) == 0x000008, "Wrong alignment on P2GameMode_Tutorial_OnPlayerDeathMessage");
static_assert(sizeof(P2GameMode_Tutorial_OnPlayerDeathMessage) == 0x0000A0, "Wrong size on P2GameMode_Tutorial_OnPlayerDeathMessage");
static_assert(offsetof(P2GameMode_Tutorial_OnPlayerDeathMessage, InGameplayTag) == 0x000000, "Member 'P2GameMode_Tutorial_OnPlayerDeathMessage::InGameplayTag' has a wrong offset!");
static_assert(offsetof(P2GameMode_Tutorial_OnPlayerDeathMessage, VerbMessage) == 0x000008, "Member 'P2GameMode_Tutorial_OnPlayerDeathMessage::VerbMessage' has a wrong offset!");

// Function TutorialRuntime.P2GameMode_Tutorial.SetRaidTimerRemainingTimeAnomaly
// 0x0004 (0x0004 - 0x0000)
struct P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly final
{
public:
	float                                         InRemainingTimeSec;                                // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly) == 0x000004, "Wrong alignment on P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly");
static_assert(sizeof(P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly) == 0x000004, "Wrong size on P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly");
static_assert(offsetof(P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly, InRemainingTimeSec) == 0x000000, "Member 'P2GameMode_Tutorial_SetRaidTimerRemainingTimeAnomaly::InRemainingTimeSec' has a wrong offset!");

// Function TutorialRuntime.P2GameMode_Tutorial.StartRaidTimerAnomaly
// 0x0004 (0x0004 - 0x0000)
struct P2GameMode_Tutorial_StartRaidTimerAnomaly final
{
public:
	int32                                         RaidDuration;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GameMode_Tutorial_StartRaidTimerAnomaly) == 0x000004, "Wrong alignment on P2GameMode_Tutorial_StartRaidTimerAnomaly");
static_assert(sizeof(P2GameMode_Tutorial_StartRaidTimerAnomaly) == 0x000004, "Wrong size on P2GameMode_Tutorial_StartRaidTimerAnomaly");
static_assert(offsetof(P2GameMode_Tutorial_StartRaidTimerAnomaly, RaidDuration) == 0x000000, "Member 'P2GameMode_Tutorial_StartRaidTimerAnomaly::RaidDuration' has a wrong offset!");

// Function TutorialRuntime.P2GameMode_Tutorial.GetRaidElapsedTimeAnomaly
// 0x0004 (0x0004 - 0x0000)
struct P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly) == 0x000004, "Wrong alignment on P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly");
static_assert(sizeof(P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly) == 0x000004, "Wrong size on P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly");
static_assert(offsetof(P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly, ReturnValue) == 0x000000, "Member 'P2GameMode_Tutorial_GetRaidElapsedTimeAnomaly::ReturnValue' has a wrong offset!");

// Function TutorialRuntime.P2GameMode_Tutorial.GetRaidRemainingTimeAnomaly
// 0x0004 (0x0004 - 0x0000)
struct P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly) == 0x000004, "Wrong alignment on P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly");
static_assert(sizeof(P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly) == 0x000004, "Wrong size on P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly");
static_assert(offsetof(P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly, ReturnValue) == 0x000000, "Member 'P2GameMode_Tutorial_GetRaidRemainingTimeAnomaly::ReturnValue' has a wrong offset!");

// Function TutorialRuntime.P2TutorialCheckpoint.OnBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct P2TutorialCheckpoint_OnBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(P2TutorialCheckpoint_OnBeginOverlap) == 0x000008, "Wrong alignment on P2TutorialCheckpoint_OnBeginOverlap");
static_assert(sizeof(P2TutorialCheckpoint_OnBeginOverlap) == 0x000010, "Wrong size on P2TutorialCheckpoint_OnBeginOverlap");
static_assert(offsetof(P2TutorialCheckpoint_OnBeginOverlap, OverlappedActor) == 0x000000, "Member 'P2TutorialCheckpoint_OnBeginOverlap::OverlappedActor' has a wrong offset!");
static_assert(offsetof(P2TutorialCheckpoint_OnBeginOverlap, OtherActor) == 0x000008, "Member 'P2TutorialCheckpoint_OnBeginOverlap::OtherActor' has a wrong offset!");

// Function TutorialRuntime.TutorialFunctionLibrary.GivePlayerFallDamage
// 0x0010 (0x0010 - 0x0000)
struct TutorialFunctionLibrary_GivePlayerFallDamage final
{
public:
	class AP2HeroCharacter*                       InHero;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDamage;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TutorialFunctionLibrary_GivePlayerFallDamage) == 0x000008, "Wrong alignment on TutorialFunctionLibrary_GivePlayerFallDamage");
static_assert(sizeof(TutorialFunctionLibrary_GivePlayerFallDamage) == 0x000010, "Wrong size on TutorialFunctionLibrary_GivePlayerFallDamage");
static_assert(offsetof(TutorialFunctionLibrary_GivePlayerFallDamage, InHero) == 0x000000, "Member 'TutorialFunctionLibrary_GivePlayerFallDamage::InHero' has a wrong offset!");
static_assert(offsetof(TutorialFunctionLibrary_GivePlayerFallDamage, InDamage) == 0x000008, "Member 'TutorialFunctionLibrary_GivePlayerFallDamage::InDamage' has a wrong offset!");

}

