#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialRuntime

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class TutorialRuntime.P2GameMode_Tutorial
// 0x0080 (0x05B8 - 0x0538)
class AP2GameMode_Tutorial final : public AP2GameMode
{
public:
	class UP2LoadoutPresetData*                   StartingItems;                                     // 0x0538(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UP2ContextHelperData*                   InitialContextHelper;                              // 0x0540(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_548[0x70];                                     // 0x0548(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerDeathMessage(const struct FGameplayTag& InGameplayTag, const struct FP2VerbMessage& VerbMessage)	 // 0x4ea930c;
	void PauseRaidTimerAnomaly()	 // 0x4ea9444;
	void ResumeRaidTimerAnomaly()	 // 0x4ea9458;
	void SetRaidTimerRemainingTimeAnomaly(const float InRemainingTimeSec)	 // 0x4ea9480;
	void StartRaidTimerAnomaly(int32 RaidDuration)	 // 0x4ea9554;

	float GetRaidElapsedTimeAnomaly() const	 // 0x4ea8f58;
	float GetRaidRemainingTimeAnomaly() const	 // 0x4ea8f90;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GameMode_Tutorial">();
	}
	static class AP2GameMode_Tutorial* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2GameMode_Tutorial>();
	}
};
static_assert(alignof(AP2GameMode_Tutorial) == 0x000008, "Wrong alignment on AP2GameMode_Tutorial");
static_assert(sizeof(AP2GameMode_Tutorial) == 0x0005B8, "Wrong size on AP2GameMode_Tutorial");
static_assert(offsetof(AP2GameMode_Tutorial, StartingItems) == 0x000538, "Member 'AP2GameMode_Tutorial::StartingItems' has a wrong offset!");
static_assert(offsetof(AP2GameMode_Tutorial, InitialContextHelper) == 0x000540, "Member 'AP2GameMode_Tutorial::InitialContextHelper' has a wrong offset!");

// Class TutorialRuntime.P2GameState_Tutorial
// 0x0018 (0x0400 - 0x03E8)
class AP2GameState_Tutorial final : public AP2GameState
{
public:
	TMulticastInlineDelegate<void()>              OnTutorialRestartDelegate;                         // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Client_OnTutorialRestart()	 // 0x485c824;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2GameState_Tutorial">();
	}
	static class AP2GameState_Tutorial* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2GameState_Tutorial>();
	}
};
static_assert(alignof(AP2GameState_Tutorial) == 0x000008, "Wrong alignment on AP2GameState_Tutorial");
static_assert(sizeof(AP2GameState_Tutorial) == 0x000400, "Wrong size on AP2GameState_Tutorial");
static_assert(offsetof(AP2GameState_Tutorial, OnTutorialRestartDelegate) == 0x0003E8, "Member 'AP2GameState_Tutorial::OnTutorialRestartDelegate' has a wrong offset!");

// Class TutorialRuntime.P2TutorialCheatExtension
// 0x0000 (0x0078 - 0x0078)
class UP2TutorialCheatExtension final : public UP2CheatManagerExtension
{
public:
	void EndTutorial() const	 // 0x4ea8f44;
	void StartTutorial() const	 // 0x4ea9614;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TutorialCheatExtension">();
	}
	static class UP2TutorialCheatExtension* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UP2TutorialCheatExtension>();
	}
};
static_assert(alignof(UP2TutorialCheatExtension) == 0x000008, "Wrong alignment on UP2TutorialCheatExtension");
static_assert(sizeof(UP2TutorialCheatExtension) == 0x000078, "Wrong size on UP2TutorialCheatExtension");

// Class TutorialRuntime.P2TutorialCheckpoint
// 0x00A0 (0x0350 - 0x02B0)
class alignas(0x10) AP2TutorialCheckpoint final : public AActor
{
public:
	class UP2LoadoutPresetData*                   Items;                                             // 0x02B0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnomalyEnabled;                                   // 0x02B8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRaidStarted;                                      // 0x02B9(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RaidDuration;                                      // 0x02BC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UShapeComponent*                        Shape;                                             // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x88];                                     // 0x02C8(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor)	 // 0x4ea91cc;
	void ResetAnomalyTriggers()	 // 0x12e6ef8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"P2TutorialCheckpoint">();
	}
	static class AP2TutorialCheckpoint* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AP2TutorialCheckpoint>();
	}
};
static_assert(alignof(AP2TutorialCheckpoint) == 0x000010, "Wrong alignment on AP2TutorialCheckpoint");
static_assert(sizeof(AP2TutorialCheckpoint) == 0x000350, "Wrong size on AP2TutorialCheckpoint");
static_assert(offsetof(AP2TutorialCheckpoint, Items) == 0x0002B0, "Member 'AP2TutorialCheckpoint::Items' has a wrong offset!");
static_assert(offsetof(AP2TutorialCheckpoint, bAnomalyEnabled) == 0x0002B8, "Member 'AP2TutorialCheckpoint::bAnomalyEnabled' has a wrong offset!");
static_assert(offsetof(AP2TutorialCheckpoint, bRaidStarted) == 0x0002B9, "Member 'AP2TutorialCheckpoint::bRaidStarted' has a wrong offset!");
static_assert(offsetof(AP2TutorialCheckpoint, RaidDuration) == 0x0002BC, "Member 'AP2TutorialCheckpoint::RaidDuration' has a wrong offset!");
static_assert(offsetof(AP2TutorialCheckpoint, Shape) == 0x0002C0, "Member 'AP2TutorialCheckpoint::Shape' has a wrong offset!");

// Class TutorialRuntime.TutorialFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTutorialFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GivePlayerFallDamage(class AP2HeroCharacter* InHero, float InDamage)	 // 0x4ea8fb8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"TutorialFunctionLibrary">();
	}
	static class UTutorialFunctionLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UTutorialFunctionLibrary>();
	}
};
static_assert(alignof(UTutorialFunctionLibrary) == 0x000008, "Wrong alignment on UTutorialFunctionLibrary");
static_assert(sizeof(UTutorialFunctionLibrary) == 0x000028, "Wrong size on UTutorialFunctionLibrary");

}

