#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class UMG.MovieScene2DTransformTrack
// 0x0000 (0x00C8 - 0x00C8)
class UMovieScene2DTransformTrack final : public UMovieScenePropertyTrack
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieScene2DTransformTrack">();
	}
	static class UMovieScene2DTransformTrack* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieScene2DTransformTrack>();
	}
};
static_assert(alignof(UMovieScene2DTransformTrack) == 0x000008, "Wrong alignment on UMovieScene2DTransformTrack");
static_assert(sizeof(UMovieScene2DTransformTrack) == 0x0000C8, "Wrong size on UMovieScene2DTransformTrack");

// Class UMG.Visual
// 0x0000 (0x0028 - 0x0028)
class UVisual : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Visual">();
	}
	static class UVisual* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVisual>();
	}
};
static_assert(alignof(UVisual) == 0x000008, "Wrong alignment on UVisual");
static_assert(sizeof(UVisual) == 0x000028, "Wrong size on UVisual");

// Class UMG.MovieScene2DTransformSection
// 0x0780 (0x0870 - 0x00F0)
class UMovieScene2DTransformSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieScene2DTransformMask             TransformMask;                                     // 0x00F8(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneFloatChannel                Translation[0x2];                                  // 0x0100(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Rotation;                                          // 0x0320(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Scale[0x2];                                        // 0x0430(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                Shear[0x2];                                        // 0x0650(0x0110)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieScene2DTransformSection">();
	}
	static class UMovieScene2DTransformSection* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieScene2DTransformSection>();
	}
};
static_assert(alignof(UMovieScene2DTransformSection) == 0x000008, "Wrong alignment on UMovieScene2DTransformSection");
static_assert(sizeof(UMovieScene2DTransformSection) == 0x000870, "Wrong size on UMovieScene2DTransformSection");
static_assert(offsetof(UMovieScene2DTransformSection, TransformMask) == 0x0000F8, "Member 'UMovieScene2DTransformSection::TransformMask' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Translation) == 0x000100, "Member 'UMovieScene2DTransformSection::Translation' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Rotation) == 0x000320, "Member 'UMovieScene2DTransformSection::Rotation' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Scale) == 0x000430, "Member 'UMovieScene2DTransformSection::Scale' has a wrong offset!");
static_assert(offsetof(UMovieScene2DTransformSection, Shear) == 0x000650, "Member 'UMovieScene2DTransformSection::Shear' has a wrong offset!");

// Class UMG.Widget
// 0x0128 (0x0150 - 0x0028)
class UWidget : public UVisual
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             Slot;                                              // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             bIsEnabledDelegate;                                // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ToolTipText;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipTextDelegate;                               // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ToolTipWidget;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipWidgetDelegate;                             // 0x0078(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             VisibilityDelegate;                                // 0x0088(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       RenderTransform;                                   // 0x0098(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              RenderTransformPivot;                              // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFlowDirectionPreference                      FlowDirectionPreference;                           // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsVariable : 1;                                   // 0x00E1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCreatedByConstructionScript : 1;                  // 0x00E1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEnabled : 1;                                    // 0x00E1(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Cursor : 1;                              // 0x00E1(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsVolatile : 1;                                   // 0x00E1(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	EMouseCursor                                  Cursor;                                            // 0x00E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetClipping                               Clipping;                                          // 0x00E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              Visibility;                                        // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RenderOpacity;                                     // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateAccessibleWidgetData*             AccessibleWidgetData;                              // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetNavigation*                      Navigation;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyBinding*>               NativeBindings;                                    // 0x0120(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ForceLayoutPrepass()	 // 0x66f36e8;
	void ForceVolatile(bool bForce)	 // 0x66f372c;
	void InvalidateLayoutAndVolatility()	 // 0x66f4e68;
	void K2_AddFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate)	 // 0x66f4fb0;
	void K2_BroadcastFieldValueChanged(const struct FFieldNotificationId& FieldId)	 // 0x66f5104;
	void K2_RemoveFieldValueChangedDelegate(const struct FFieldNotificationId& FieldId, TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate)	 // 0x66f5208;
	void RemoveFromParent()	 // 0x115cedc;
	void ResetCursor()	 // 0x66f5d30;
	void SetAllNavigationRules(EUINavigationRule Rule, class FName WidgetToFocus)	 // 0x66f6128;
	void SetClipping(EWidgetClipping InClipping)	 // 0x66f71f0;
	void SetCursor(EMouseCursor InCursor)	 // 0x66f76ec;
	void SetFocus()	 // 0x66f8848;
	void SetIsEnabled(bool bInIsEnabled)	 // 0xb47de8;
	void SetKeyboardFocus()	 // 0x66fa360;
	void SetNavigationRule(EUINavigation Direction, EUINavigationRule Rule, class FName WidgetToFocus)	 // 0x66fb374;
	void SetNavigationRuleBase(EUINavigation Direction, EUINavigationRule Rule)	 // 0x66fb55c;
	void SetNavigationRuleCustom(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate)	 // 0x66fb6e0;
	void SetNavigationRuleCustomBoundary(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate)	 // 0x66fb854;
	void SetNavigationRuleExplicit(EUINavigation Direction, class UWidget* InWidget)	 // 0x66fb9c8;
	void SetRenderOpacity(float InOpacity)	 // 0x174380c;
	void SetRenderScale(const struct FVector2D& Scale)	 // 0xb14ed4;
	void SetRenderShear(const struct FVector2D& Shear)	 // 0x66fc528;
	void SetRenderTransform(const struct FWidgetTransform& InTransform)	 // 0xf806f0;
	void SetRenderTransformAngle(float Angle)	 // 0xf61968;
	void SetRenderTransformPivot(const struct FVector2D& Pivot)	 // 0x66fc5ec;
	void SetRenderTranslation(const struct FVector2D& Translation)	 // 0xd9902c;
	void SetToolTip(class UWidget* Widget)	 // 0x66fe848;
	void SetToolTipText(const class FText& InToolTipText)	 // 0x66fe908;
	void SetUserFocus(class APlayerController* PlayerController)	 // 0x66fea7c;
	void SetVisibility(ESlateVisibility InVisibility)	 // 0xe83788;

	class FText GetAccessibleSummaryText() const	 // 0x66f3840;
	class FText GetAccessibleText() const	 // 0x66f38d0;
	const struct FGeometry GetCachedGeometry() const	 // 0x66f3988;
	EWidgetClipping GetClipping() const	 // 0x66f3aa4;
	struct FVector2D GetDesiredSize() const	 // 0x66f3c68;
	class UGameInstance* GetGameInstance() const	 // 0x66f3e08;
	bool GetIsEnabled() const	 // 0x66f3fe8;
	class ULocalPlayer* GetOwningLocalPlayer() const	 // 0x66f42ac;
	class APlayerController* GetOwningPlayer() const	 // 0x1639874;
	const struct FGeometry GetPaintSpaceGeometry() const	 // 0x66f42d4;
	class UPanelWidget* GetParent() const	 // 0x66f4300;
	float GetRenderOpacity() const	 // 0x66f4354;
	float GetRenderTransformAngle() const	 // 0x66f4394;
	const struct FGeometry GetTickSpaceGeometry() const	 // 0x66f3988;
	ESlateVisibility GetVisibility() const	 // 0x1680964;
	bool HasAnyUserFocus() const	 // 0x66f47b8;
	bool HasFocusedDescendants() const	 // 0x66f4960;
	bool HasKeyboardFocus() const	 // 0x66f49b0;
	bool HasMouseCapture() const	 // 0x66f49d4;
	bool HasMouseCaptureByUser(int32 UserIndex, int32 PointerIndex) const	 // 0x66f4a24;
	bool HasUserFocus(class APlayerController* PlayerController) const	 // 0x66f4bd4;
	bool HasUserFocusedDescendants(class APlayerController* PlayerController) const	 // 0x66f4d34;
	bool IsHovered() const	 // 0x4f1e4c0;
	bool IsInViewport() const	 // 0x66f4e7c;
	bool IsRendered() const	 // 0x66f4f08;
	bool IsVisible() const	 // 0x66f4f68;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Widget">();
	}
	static class UWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWidget>();
	}
};
static_assert(alignof(UWidget) == 0x000008, "Wrong alignment on UWidget");
static_assert(sizeof(UWidget) == 0x000150, "Wrong size on UWidget");
static_assert(offsetof(UWidget, Slot) == 0x000030, "Member 'UWidget::Slot' has a wrong offset!");
static_assert(offsetof(UWidget, bIsEnabledDelegate) == 0x000038, "Member 'UWidget::bIsEnabledDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipText) == 0x000048, "Member 'UWidget::ToolTipText' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipTextDelegate) == 0x000060, "Member 'UWidget::ToolTipTextDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipWidget) == 0x000070, "Member 'UWidget::ToolTipWidget' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipWidgetDelegate) == 0x000078, "Member 'UWidget::ToolTipWidgetDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, VisibilityDelegate) == 0x000088, "Member 'UWidget::VisibilityDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, RenderTransform) == 0x000098, "Member 'UWidget::RenderTransform' has a wrong offset!");
static_assert(offsetof(UWidget, RenderTransformPivot) == 0x0000D0, "Member 'UWidget::RenderTransformPivot' has a wrong offset!");
static_assert(offsetof(UWidget, FlowDirectionPreference) == 0x0000E0, "Member 'UWidget::FlowDirectionPreference' has a wrong offset!");
static_assert(offsetof(UWidget, Cursor) == 0x0000E2, "Member 'UWidget::Cursor' has a wrong offset!");
static_assert(offsetof(UWidget, Clipping) == 0x0000E3, "Member 'UWidget::Clipping' has a wrong offset!");
static_assert(offsetof(UWidget, Visibility) == 0x0000E4, "Member 'UWidget::Visibility' has a wrong offset!");
static_assert(offsetof(UWidget, RenderOpacity) == 0x0000E8, "Member 'UWidget::RenderOpacity' has a wrong offset!");
static_assert(offsetof(UWidget, AccessibleWidgetData) == 0x0000F0, "Member 'UWidget::AccessibleWidgetData' has a wrong offset!");
static_assert(offsetof(UWidget, Navigation) == 0x0000F8, "Member 'UWidget::Navigation' has a wrong offset!");
static_assert(offsetof(UWidget, NativeBindings) == 0x000120, "Member 'UWidget::NativeBindings' has a wrong offset!");

// Class UMG.Throbber
// 0x00F0 (0x0240 - 0x0150)
class UThrobber final : public UWidget
{
public:
	int32                                         NumberOfPieces;                                    // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateHorizontally;                              // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateVertically;                                // 0x0155(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateOpacity;                                   // 0x0156(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_157[0x9];                                      // 0x0157(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Image;                                             // 0x0160(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x10];                                     // 0x0230(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAnimateHorizontally(bool bInAnimateHorizontally)	 // 0x66f6638;
	void SetAnimateOpacity(bool bInAnimateOpacity)	 // 0x66f66fc;
	void SetAnimateVertically(bool bInAnimateVertically)	 // 0x66f67c0;
	void SetNumberOfPieces(int32 InNumberOfPieces)	 // 0x66fbce8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Throbber">();
	}
	static class UThrobber* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UThrobber>();
	}
};
static_assert(alignof(UThrobber) == 0x000010, "Wrong alignment on UThrobber");
static_assert(sizeof(UThrobber) == 0x000240, "Wrong size on UThrobber");
static_assert(offsetof(UThrobber, NumberOfPieces) == 0x000150, "Member 'UThrobber::NumberOfPieces' has a wrong offset!");
static_assert(offsetof(UThrobber, bAnimateHorizontally) == 0x000154, "Member 'UThrobber::bAnimateHorizontally' has a wrong offset!");
static_assert(offsetof(UThrobber, bAnimateVertically) == 0x000155, "Member 'UThrobber::bAnimateVertically' has a wrong offset!");
static_assert(offsetof(UThrobber, bAnimateOpacity) == 0x000156, "Member 'UThrobber::bAnimateOpacity' has a wrong offset!");
static_assert(offsetof(UThrobber, Image) == 0x000160, "Member 'UThrobber::Image' has a wrong offset!");

// Class UMG.PanelWidget
// 0x0018 (0x0168 - 0x0150)
class UPanelWidget : public UWidget
{
public:
	TArray<class UPanelSlot*>                     Slots;                                             // 0x0150(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPanelSlot* AddChild(class UWidget* Content)	 // 0x66f2228;
	void ClearChildren()	 // 0x17abc48;
	bool RemoveChild(class UWidget* Content)	 // 0x66f57c4;
	bool RemoveChildAt(int32 Index_0)	 // 0x66f5894;

	TArray<class UWidget*> GetAllChildren() const	 // 0x1226d34;
	class UWidget* GetChildAt(int32 Index_0) const	 // 0x16d5888;
	int32 GetChildIndex(const class UWidget* Content) const	 // 0x66f39d4;
	int32 GetChildrenCount() const	 // 0x62ccac4;
	bool HasAnyChildren() const	 // 0x4a8bc64;
	bool HasChild(class UWidget* Content) const	 // 0x66f4834;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"PanelWidget">();
	}
	static class UPanelWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UPanelWidget>();
	}
};
static_assert(alignof(UPanelWidget) == 0x000008, "Wrong alignment on UPanelWidget");
static_assert(sizeof(UPanelWidget) == 0x000168, "Wrong size on UPanelWidget");
static_assert(offsetof(UPanelWidget, Slots) == 0x000150, "Member 'UPanelWidget::Slots' has a wrong offset!");

// Class UMG.ContentWidget
// 0x0000 (0x0168 - 0x0168)
class UContentWidget : public UPanelWidget
{
public:
	class UPanelSlot* SetContent(class UWidget* Content)	 // 0x66cdb94;

	class UWidget* GetContent() const	 // 0x66cbca0;
	class UPanelSlot* GetContentSlot() const	 // 0x66cbccc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ContentWidget">();
	}
	static class UContentWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UContentWidget>();
	}
};
static_assert(alignof(UContentWidget) == 0x000008, "Wrong alignment on UContentWidget");
static_assert(sizeof(UContentWidget) == 0x000168, "Wrong size on UContentWidget");

// Class UMG.Border
// 0x01A8 (0x0310 - 0x0168)
#pragma pack(push, 0x1)
class alignas(0x10) UBorder : public UContentWidget
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShowEffectWhenDisabled : 1;                       // 0x016A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ContentColorAndOpacity;                            // 0x016C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ContentColorAndOpacityDelegate;                    // 0x017C(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x018C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Background;                                        // 0x01A0(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             BackgroundDelegate;                                // 0x0270(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BrushColor;                                        // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             BrushColorDelegate;                                // 0x0290(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DesiredSizeScale;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipForRightToLeftFlowDirection;                  // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)> OnMouseButtonDownEvent; // 0x02B4(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)> OnMouseButtonUpEvent; // 0x02C4(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)> OnMouseMoveEvent; // 0x02D4(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)> OnMouseDoubleClickEvent; // 0x02E4(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x14];                                     // 0x02F4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMaterialInstanceDynamic* GetDynamicMaterial()	 // 0x66cbcec;
	void SetBrush(const struct FSlateBrush& InBrush)	 // 0xb13818;
	void SetBrushColor(const struct FLinearColor& InBrushColor)	 // 0xb15cc0;
	void SetBrushFromAsset(class USlateBrushAsset* Asset)	 // 0x66cd894;
	void SetBrushFromMaterial(class UMaterialInterface* Material)	 // 0x173c49c;
	void SetBrushFromTexture(class UTexture2D* Texture)	 // 0x17a5460;
	void SetContentColorAndOpacity(const struct FLinearColor& InContentColorAndOpacity)	 // 0xc871d4;
	void SetDesiredSizeScale(const struct FVector2D& InScale)	 // 0x66cddf0;
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment)	 // 0x66ce4a4;
	void SetPadding(const struct FMargin& InPadding)	 // 0x66cf110;
	void SetShowEffectWhenDisabled(bool bInShowEffectWhenDisabled)	 // 0x66cf914;
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment)	 // 0x66cff38;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Border">();
	}
	static class UBorder* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UBorder>();
	}
};
#pragma pack(pop)
static_assert(alignof(UBorder) == 0x000010, "Wrong alignment on UBorder");
static_assert(sizeof(UBorder) == 0x000310, "Wrong size on UBorder");
static_assert(offsetof(UBorder, HorizontalAlignment) == 0x000168, "Member 'UBorder::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UBorder, VerticalAlignment) == 0x000169, "Member 'UBorder::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UBorder, ContentColorAndOpacity) == 0x00016C, "Member 'UBorder::ContentColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UBorder, ContentColorAndOpacityDelegate) == 0x00017C, "Member 'UBorder::ContentColorAndOpacityDelegate' has a wrong offset!");
static_assert(offsetof(UBorder, Padding) == 0x00018C, "Member 'UBorder::Padding' has a wrong offset!");
static_assert(offsetof(UBorder, Background) == 0x0001A0, "Member 'UBorder::Background' has a wrong offset!");
static_assert(offsetof(UBorder, BackgroundDelegate) == 0x000270, "Member 'UBorder::BackgroundDelegate' has a wrong offset!");
static_assert(offsetof(UBorder, BrushColor) == 0x000280, "Member 'UBorder::BrushColor' has a wrong offset!");
static_assert(offsetof(UBorder, BrushColorDelegate) == 0x000290, "Member 'UBorder::BrushColorDelegate' has a wrong offset!");
static_assert(offsetof(UBorder, DesiredSizeScale) == 0x0002A0, "Member 'UBorder::DesiredSizeScale' has a wrong offset!");
static_assert(offsetof(UBorder, bFlipForRightToLeftFlowDirection) == 0x0002B0, "Member 'UBorder::bFlipForRightToLeftFlowDirection' has a wrong offset!");
static_assert(offsetof(UBorder, OnMouseButtonDownEvent) == 0x0002B4, "Member 'UBorder::OnMouseButtonDownEvent' has a wrong offset!");
static_assert(offsetof(UBorder, OnMouseButtonUpEvent) == 0x0002C4, "Member 'UBorder::OnMouseButtonUpEvent' has a wrong offset!");
static_assert(offsetof(UBorder, OnMouseMoveEvent) == 0x0002D4, "Member 'UBorder::OnMouseMoveEvent' has a wrong offset!");
static_assert(offsetof(UBorder, OnMouseDoubleClickEvent) == 0x0002E4, "Member 'UBorder::OnMouseDoubleClickEvent' has a wrong offset!");

// Class UMG.ScrollBar
// 0x07B0 (0x0900 - 0x0150)
class UScrollBar final : public UWidget
{
public:
	struct FScrollBarStyle                        WidgetStyle;                                       // 0x0150(0x0770)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowScrollbar;                              // 0x08C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysShowScrollbarTrack;                         // 0x08C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x08C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C3[0x5];                                      // 0x08C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Thickness;                                         // 0x08C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x08D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E8[0x18];                                     // 0x08E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetState(float InOffsetFraction, float InThumbSizeFraction)	 // 0x66fdb18;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"ScrollBar">();
	}
	static class UScrollBar* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UScrollBar>();
	}
};
static_assert(alignof(UScrollBar) == 0x000010, "Wrong alignment on UScrollBar");
static_assert(sizeof(UScrollBar) == 0x000900, "Wrong size on UScrollBar");
static_assert(offsetof(UScrollBar, WidgetStyle) == 0x000150, "Member 'UScrollBar::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UScrollBar, bAlwaysShowScrollbar) == 0x0008C0, "Member 'UScrollBar::bAlwaysShowScrollbar' has a wrong offset!");
static_assert(offsetof(UScrollBar, bAlwaysShowScrollbarTrack) == 0x0008C1, "Member 'UScrollBar::bAlwaysShowScrollbarTrack' has a wrong offset!");
static_assert(offsetof(UScrollBar, Orientation) == 0x0008C2, "Member 'UScrollBar::Orientation' has a wrong offset!");
static_assert(offsetof(UScrollBar, Thickness) == 0x0008C8, "Member 'UScrollBar::Thickness' has a wrong offset!");
static_assert(offsetof(UScrollBar, Padding) == 0x0008D8, "Member 'UScrollBar::Padding' has a wrong offset!");

// Class UMG.CheckBox
// 0x0B18 (0x0C80 - 0x0168)
#pragma pack(push, 0x1)
class alignas(0x10) UCheckBox : public UContentWidget
{
public:
	ECheckBoxState                                CheckedState;                                      // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             CheckedStateDelegate;                              // 0x016C(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         WidgetStyle;                                       // 0x0180(0x0AD0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0C50(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonClickMethod                            ClickMethod;                                       // 0x0C51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonTouchMethod                            TouchMethod;                                       // 0x0C52(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonPressMethod                            PressMethod;                                       // 0x0C53(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x0C54(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C55[0x3];                                      // 0x0C55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsChecked)> OnCheckStateChanged;                             // 0x0C58(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C68[0x10];                                     // 0x0C68(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCheckedState(ECheckBoxState InCheckedState)	 // 0x66cd954;
	void SetClickMethod(EButtonClickMethod InClickMethod)	 // 0x66cdad4;
	void SetIsChecked(bool InIsChecked)	 // 0x66ce6e8;
	void SetPressMethod(EButtonPressMethod InPressMethod)	 // 0x66cf434;
	void SetTouchMethod(EButtonTouchMethod InTouchMethod)	 // 0x66cfc34;

	ECheckBoxState GetCheckedState() const	 // 0x66cbc7c;
	bool IsChecked() const	 // 0x66cc664;
	bool IsPressed() const	 // 0x66cc94c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"CheckBox">();
	}
	static class UCheckBox* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UCheckBox>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCheckBox) == 0x000010, "Wrong alignment on UCheckBox");
static_assert(sizeof(UCheckBox) == 0x000C80, "Wrong size on UCheckBox");
static_assert(offsetof(UCheckBox, CheckedState) == 0x000168, "Member 'UCheckBox::CheckedState' has a wrong offset!");
static_assert(offsetof(UCheckBox, CheckedStateDelegate) == 0x00016C, "Member 'UCheckBox::CheckedStateDelegate' has a wrong offset!");
static_assert(offsetof(UCheckBox, WidgetStyle) == 0x000180, "Member 'UCheckBox::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UCheckBox, HorizontalAlignment) == 0x000C50, "Member 'UCheckBox::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UCheckBox, ClickMethod) == 0x000C51, "Member 'UCheckBox::ClickMethod' has a wrong offset!");
static_assert(offsetof(UCheckBox, TouchMethod) == 0x000C52, "Member 'UCheckBox::TouchMethod' has a wrong offset!");
static_assert(offsetof(UCheckBox, PressMethod) == 0x000C53, "Member 'UCheckBox::PressMethod' has a wrong offset!");
static_assert(offsetof(UCheckBox, IsFocusable) == 0x000C54, "Member 'UCheckBox::IsFocusable' has a wrong offset!");
static_assert(offsetof(UCheckBox, OnCheckStateChanged) == 0x000C58, "Member 'UCheckBox::OnCheckStateChanged' has a wrong offset!");

// Class UMG.Slider
// 0x05B0 (0x0700 - 0x0150)
class USlider : public UWidget
{
public:
	float                                         Value;                                             // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ValueDelegate;                                     // 0x0154(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinValue;                                          // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxValue;                                          // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSliderStyle                           WidgetStyle;                                       // 0x0170(0x0500)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SliderBarColor;                                    // 0x0674(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SliderHandleColor;                                 // 0x0684(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IndentHandle;                                      // 0x0694(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Locked;                                            // 0x0695(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MouseUsesStep;                                     // 0x0696(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequiresControllerLock;                            // 0x0697(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepSize;                                          // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x069C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69D[0x3];                                      // 0x069D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMouseCaptureBegin;                               // 0x06A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMouseCaptureEnd;                                 // 0x06B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnControllerCaptureBegin;                          // 0x06C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnControllerCaptureEnd;                            // 0x06D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Value)>   OnValueChanged;                                    // 0x06E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F0[0x10];                                     // 0x06F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIndentHandle(bool InValue)	 // 0x66f9940;
	void SetLocked(bool InValue)	 // 0x66fa434;
	void SetMaxValue(float InValue)	 // 0x66fa988;
	void SetMinValue(float InValue)	 // 0x66fb12c;
	void SetSliderBarColor(const struct FLinearColor& InValue)	 // 0x66fd8b8;
	void SetSliderHandleColor(const struct FLinearColor& InValue)	 // 0x66fd980;
	void SetStepSize(float InValue)	 // 0x66fdc6c;
	void SetValue(float InValue)	 // 0x66fec04;

	float GetNormalizedValue() const	 // 0x66f4250;
	float GetValue() const	 // 0x12bd7c8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"Slider">();
	}
	static class USlider* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<USlider>();
	}
};
static_assert(alignof(USlider) == 0x000010, "Wrong alignment on USlider");
static_assert(sizeof(USlider) == 0x000700, "Wrong size on USlider");
static_assert(offsetof(USlider, Value) == 0x000150, "Member 'USlider::Value' has a wrong offset!");
static_assert(offsetof(USlider, ValueDelegate) == 0x000154, "Member 'USlider::ValueDelegate' has a wrong offset!");
static_assert(offsetof(USlider, MinValue) == 0x000164, "Member 'USlider::MinValue' has a wrong offset!");
static_assert(offsetof(USlider, MaxValue) == 0x000168, "Member 'USlider::MaxValue' has a wrong offset!");
static_assert(offsetof(USlider, WidgetStyle) == 0x000170, "Member 'USlider::WidgetStyle' has a wrong offset!");
static_assert(offsetof(USlider, Orientation) == 0x000670, "Member 'USlider::Orientation' has a wrong offset!");
static_assert(offsetof(USlider, SliderBarColor) == 0x000674, "Member 'USlider::SliderBarColor' has a wrong offset!");
static_assert(offsetof(USlider, SliderHandleColor) == 0x000684, "Member 'USlider::SliderHandleColor' has a wrong offset!");
static_assert(offsetof(USlider, IndentHandle) == 0x000694, "Member 'USlider::IndentHandle' has a wrong offset!");
static_assert(offsetof(USlider, Locked) == 0x000695, "Member 'USlider::Locked' has a wrong offset!");
static_assert(offsetof(USlider, MouseUsesStep) == 0x000696, "Member 'USlider::MouseUsesStep' has a wrong offset!");
static_assert(offsetof(USlider, RequiresControllerLock) == 0x000697, "Member 'USlider::RequiresControllerLock' has a wrong offset!");
static_assert(offsetof(USlider, StepSize) == 0x000698, "Member 'USlider::StepSize' has a wrong offset!");
static_assert(offsetof(USlider, IsFocusable) == 0x00069C, "Member 'USlider::IsFocusable' has a wrong offset!");
static_assert(offsetof(USlider, OnMouseCaptureBegin) == 0x0006A0, "Member 'USlider::OnMouseCaptureBegin' has a wrong offset!");
static_assert(offsetof(USlider, OnMouseCaptureEnd) == 0x0006B0, "Member 'USlider::OnMouseCaptureEnd' has a wrong offset!");
static_assert(offsetof(USlider, OnControllerCaptureBegin) == 0x0006C0, "Member 'USlider::OnControllerCaptureBegin' has a wrong offset!");
static_assert(offsetof(USlider, OnControllerCaptureEnd) == 0x0006D0, "Member 'USlider::OnControllerCaptureEnd' has a wrong offset!");
static_assert(offsetof(USlider, OnValueChanged) == 0x0006E0, "Member 'USlider::OnValueChanged' has a wrong offset!");

// Class UMG.UMGSequencePlayer
// 0x0310 (0x0338 - 0x0028)
class UUMGSequencePlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x1F8];                                     // 0x0028(0x01F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Animation;                                         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                           // 0x0230(0x0088)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x80];                                     // 0x02B8(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetUserTag(class FName InUserTag)	 // 0x66cfcf4;

	class FName GetUserTag() const	 // 0x66cc328;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"UMGSequencePlayer">();
	}
	static class UUMGSequencePlayer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UUMGSequencePlayer>();
	}
};
static_assert(alignof(UUMGSequencePlayer) == 0x000008, "Wrong alignment on UUMGSequencePlayer");
static_assert(sizeof(UUMGSequencePlayer) == 0x000338, "Wrong size on UUMGSequencePlayer");
static_assert(offsetof(UUMGSequencePlayer, Animation) == 0x000220, "Member 'UUMGSequencePlayer::Animation' has a wrong offset!");
static_assert(offsetof(UUMGSequencePlayer, RootTemplateInstance) == 0x000230, "Member 'UUMGSequencePlayer::RootTemplateInstance' has a wrong offset!");

// Class UMG.NativeWidgetHost
// 0x0010 (0x0160 - 0x0150)
class UNativeWidgetHost final : public UWidget
{
public:
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"NativeWidgetHost">();
	}
	static class UNativeWidgetHost* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UNativeWidgetHost>();
	}
};
static_assert(alignof(UNativeWidgetHost) == 0x000008, "Wrong alignment on UNativeWidgetHost");
static_assert(sizeof(UNativeWidgetHost) == 0x000160, "Wrong size on UNativeWidgetHost");

// Class UMG.AsyncTaskDownloadImage
// 0x0020 (0x0050 - 0x0030)
class UAsyncTaskDownloadImage final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(class UTexture2DDynamic* Texture)> OnSuccess;                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTexture2DDynamic* Texture)> OnFail;                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UAsyncTaskDownloadImage* DownloadImage(const class FString& URL)	 // 0x66cb9e8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"AsyncTaskDownloadImage">();
	}
	static class UAsyncTaskDownloadImage* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UAsyncTaskDownloadImage>();
	}
};
static_assert(alignof(UAsyncTaskDownloadImage) == 0x000008, "Wrong alignment on UAsyncTaskDownloadImage");
static_assert(sizeof(UAsyncTaskDownloadImage) == 0x000050, "Wrong size on UAsyncTaskDownloadImage");
static_assert(offsetof(UAsyncTaskDownloadImage, OnSuccess) == 0x000030, "Member 'UAsyncTaskDownloadImage::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAsyncTaskDownloadImage, OnFail) == 0x000040, "Member 'UAsyncTaskDownloadImage::OnFail' has a wrong offset!");

// Class UMG.WidgetTree
// 0x0060 (0x0088 - 0x0028)
class UWidgetTree final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                RootWidget;                                        // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UWidget*>             NamedSlotBindings;                                 // 0x0038(0x0050)(ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WidgetTree">();
	}
	static class UWidgetTree* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWidgetTree>();
	}
};
static_assert(alignof(UWidgetTree) == 0x000008, "Wrong alignment on UWidgetTree");
static_assert(sizeof(UWidgetTree) == 0x000088, "Wrong size on UWidgetTree");
static_assert(offsetof(UWidgetTree, RootWidget) == 0x000030, "Member 'UWidgetTree::RootWidget' has a wrong offset!");
static_assert(offsetof(UWidgetTree, NamedSlotBindings) == 0x000038, "Member 'UWidgetTree::NamedSlotBindings' has a wrong offset!");

// Class UMG.MovieSceneWidgetMaterialTrack
// 0x0028 (0x00D0 - 0x00A8)
class UMovieSceneWidgetMaterialTrack final : public UMovieSceneMaterialTrack
{
public:
	uint8                                         Pad_A8[0x10];                                      // 0x00A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           BrushPropertyNamePath;                             // 0x00B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class FName                                   TrackName;                                         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneWidgetMaterialTrack">();
	}
	static class UMovieSceneWidgetMaterialTrack* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneWidgetMaterialTrack>();
	}
};
static_assert(alignof(UMovieSceneWidgetMaterialTrack) == 0x000008, "Wrong alignment on UMovieSceneWidgetMaterialTrack");
static_assert(sizeof(UMovieSceneWidgetMaterialTrack) == 0x0000D0, "Wrong size on UMovieSceneWidgetMaterialTrack");
static_assert(offsetof(UMovieSceneWidgetMaterialTrack, BrushPropertyNamePath) == 0x0000B8, "Member 'UMovieSceneWidgetMaterialTrack::BrushPropertyNamePath' has a wrong offset!");
static_assert(offsetof(UMovieSceneWidgetMaterialTrack, TrackName) == 0x0000C8, "Member 'UMovieSceneWidgetMaterialTrack::TrackName' has a wrong offset!");

// Class UMG.DynamicEntryBoxBase
// 0x00E0 (0x0230 - 0x0150)
class UDynamicEntryBoxBase : public UWidget
{
public:
	struct FVector2D                              EntrySpacing;                                      // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVector2D>                      SpacingPattern;                                    // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EDynamicBoxType                               EntryBoxType;                                      // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        EntrySizeRule;                                     // 0x0174(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EHorizontalAlignment                          EntryHorizontalAlignment;                          // 0x017C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVerticalAlignment                            EntryVerticalAlignment;                            // 0x017D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxElementSize;                                    // 0x0180(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRadialBoxSettings                     RadialBoxSettings;                                 // 0x0184(0x0010)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x14];                                     // 0x0194(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUserWidgetPool                        EntryWidgetPool;                                   // 0x01A8(0x0088)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void SetEntrySpacing(const struct FVector2D& InEntrySpacing)	 // 0x66cdeb8;
	void SetRadialSettings(const struct FRadialBoxSettings& InSettings)	 // 0x66cf4f4;

	const TArray<class UUserWidget*> GetAllEntries() const	 // 0x66cbbec;
	int32 GetNumEntries() const	 // 0x66cbeec;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"DynamicEntryBoxBase">();
	}
	static class UDynamicEntryBoxBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UDynamicEntryBoxBase>();
	}
};
static_assert(alignof(UDynamicEntryBoxBase) == 0x000008, "Wrong alignment on UDynamicEntryBoxBase");
static_assert(sizeof(UDynamicEntryBoxBase) == 0x000230, "Wrong size on UDynamicEntryBoxBase");
static_assert(offsetof(UDynamicEntryBoxBase, EntrySpacing) == 0x000150, "Member 'UDynamicEntryBoxBase::EntrySpacing' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, SpacingPattern) == 0x000160, "Member 'UDynamicEntryBoxBase::SpacingPattern' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, EntryBoxType) == 0x000170, "Member 'UDynamicEntryBoxBase::EntryBoxType' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, EntrySizeRule) == 0x000174, "Member 'UDynamicEntryBoxBase::EntrySizeRule' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, EntryHorizontalAlignment) == 0x00017C, "Member 'UDynamicEntryBoxBase::EntryHorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, EntryVerticalAlignment) == 0x00017D, "Member 'UDynamicEntryBoxBase::EntryVerticalAlignment' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, MaxElementSize) == 0x000180, "Member 'UDynamicEntryBoxBase::MaxElementSize' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, RadialBoxSettings) == 0x000184, "Member 'UDynamicEntryBoxBase::RadialBoxSettings' has a wrong offset!");
static_assert(offsetof(UDynamicEntryBoxBase, EntryWidgetPool) == 0x0001A8, "Member 'UDynamicEntryBoxBase::EntryWidgetPool' has a wrong offset!");

// Class UMG.MovieSceneMarginSection
// 0x0448 (0x0538 - 0x00F0)
class UMovieSceneMarginSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneFloatChannel                TopCurve;                                          // 0x00F8(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                LeftCurve;                                         // 0x0208(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                RightCurve;                                        // 0x0318(0x0110)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                BottomCurve;                                       // 0x0428(0x0110)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"MovieSceneMarginSection">();
	}
	static class UMovieSceneMarginSection* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UMovieSceneMarginSection>();
	}
};
static_assert(alignof(UMovieSceneMarginSection) == 0x000008, "Wrong alignment on UMovieSceneMarginSection");
static_assert(sizeof(UMovieSceneMarginSection) == 0x000538, "Wrong size on UMovieSceneMarginSection");
static_assert(offsetof(UMovieSceneMarginSection, TopCurve) == 0x0000F8, "Member 'UMovieSceneMarginSection::TopCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, LeftCurve) == 0x000208, "Member 'UMovieSceneMarginSection::LeftCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, RightCurve) == 0x000318, "Member 'UMovieSceneMarginSection::RightCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, BottomCurve) == 0x000428, "Member 'UMovieSceneMarginSection::BottomCurve' has a wrong offset!");

// Class UMG.WidgetSwitcher
// 0x0018 (0x0180 - 0x0168)
class UWidgetSwitcher : public UPanelWidget
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x14];                                     // 0x016C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetActiveWidget(class UWidget* Widget)	 // 0x472b054;
	void SetActiveWidgetIndex(int32 Index_0)	 // 0xe12688;

	class UWidget* GetActiveWidget() const	 // 0x6711ec0;
	int32 GetActiveWidgetIndex() const	 // 0x6711ee4;
	int32 GetNumWidgets() const	 // 0x6713698;
	class UWidget* GetWidgetAtIndex(int32 Index_0) const	 // 0x6713b74;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"WidgetSwitcher">();
	}
	static class UWidgetSwitcher* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UWidgetSwitcher>();
	}
};
static_assert(alignof(UWidgetSwitcher) == 0x000008, "Wrong alignment on UWidgetSwitcher");
static_assert(sizeof(UWidgetSwitcher) == 0x000180, "Wrong size on UWidgetSwitcher");
static_assert(offsetof(UWidgetSwitcher, ActiveWidgetIndex) == 0x000168, "Member 'UWidgetSwitcher::ActiveWidgetIndex' has a wrong offset!");

// Class UMG.UserListEntryLibrary
// 0x0000 (0x0028 - 0x0028)
class UUserListEntryLibrary final : public UBlueprintFunctionLibrary
{
public:
