#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Effect

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_Effect.UMG_Effect_C.ExecuteUbergraph_UMG_Effect
// 0x0010 (0x0010 - 0x0000)
struct UMG_Effect_C_ExecuteUbergraph_UMG_Effect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Event_InMaterial;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Effect_C_ExecuteUbergraph_UMG_Effect) == 0x000008, "Wrong alignment on UMG_Effect_C_ExecuteUbergraph_UMG_Effect");
static_assert(sizeof(UMG_Effect_C_ExecuteUbergraph_UMG_Effect) == 0x000010, "Wrong size on UMG_Effect_C_ExecuteUbergraph_UMG_Effect");
static_assert(offsetof(UMG_Effect_C_ExecuteUbergraph_UMG_Effect, EntryPoint) == 0x000000, "Member 'UMG_Effect_C_ExecuteUbergraph_UMG_Effect::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_Effect_C_ExecuteUbergraph_UMG_Effect, K2Node_Event_InMaterial) == 0x000008, "Member 'UMG_Effect_C_ExecuteUbergraph_UMG_Effect::K2Node_Event_InMaterial' has a wrong offset!");

// Function UMG_Effect.UMG_Effect_C.SetEffect
// 0x0008 (0x0008 - 0x0000)
struct UMG_Effect_C_SetEffect final
{
public:
	class UMaterialInstance*                      InMaterial;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_Effect_C_SetEffect) == 0x000008, "Wrong alignment on UMG_Effect_C_SetEffect");
static_assert(sizeof(UMG_Effect_C_SetEffect) == 0x000008, "Wrong size on UMG_Effect_C_SetEffect");
static_assert(offsetof(UMG_Effect_C_SetEffect, InMaterial) == 0x000000, "Member 'UMG_Effect_C_SetEffect::InMaterial' has a wrong offset!");

}

