#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VCamInput

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "VCamInput_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class VCamInput.VCamPressAnyKey
// 0x0038 (0x0418 - 0x03E0)
class UVCamPressAnyKey final : public UCommonActivatableWidget
{
public:
	TMulticastInlineDelegate<void(const struct FKey& Key)> OnKeySelected;                            // 0x03E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnKeySelectionCanceled;                            // 0x03F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_400[0x18];                                     // 0x0400(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamPressAnyKey">();
	}
	static class UVCamPressAnyKey* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamPressAnyKey>();
	}
};
static_assert(alignof(UVCamPressAnyKey) == 0x000008, "Wrong alignment on UVCamPressAnyKey");
static_assert(sizeof(UVCamPressAnyKey) == 0x000418, "Wrong size on UVCamPressAnyKey");
static_assert(offsetof(UVCamPressAnyKey, OnKeySelected) == 0x0003E0, "Member 'UVCamPressAnyKey::OnKeySelected' has a wrong offset!");
static_assert(offsetof(UVCamPressAnyKey, OnKeySelectionCanceled) == 0x0003F0, "Member 'UVCamPressAnyKey::OnKeySelectionCanceled' has a wrong offset!");

// Class VCamInput.VCamInputSettings
// 0x0058 (0x0090 - 0x0038)
class UVCamInputSettings final : public UDeveloperSettings
{
public:
	class FName                                   DefaultInputProfile;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVCamInputProfile>   InputProfiles;                                     // 0x0040(0x0050)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)

public:
	static class UVCamInputSettings* GetVCamInputSettings()	 // 0x4f8f750;

	void SetDefaultInputProfile(const class FName NewDefaultInputProfile)	 // 0x4f8f774;
	void SetInputProfiles(const TMap<class FName, struct FVCamInputProfile>& NewInputProfiles)	 // 0x4f8f88c;

	TArray<class FName> GetInputProfileNames() const	 // 0x4f8f6f8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamInputSettings">();
	}
	static class UVCamInputSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamInputSettings>();
	}
};
static_assert(alignof(UVCamInputSettings) == 0x000008, "Wrong alignment on UVCamInputSettings");
static_assert(sizeof(UVCamInputSettings) == 0x000090, "Wrong size on UVCamInputSettings");
static_assert(offsetof(UVCamInputSettings, DefaultInputProfile) == 0x000038, "Member 'UVCamInputSettings::DefaultInputProfile' has a wrong offset!");
static_assert(offsetof(UVCamInputSettings, InputProfiles) == 0x000040, "Member 'UVCamInputSettings::InputProfiles' has a wrong offset!");

// Class VCamInput.VCamInputSubsystem
// 0x0000 (0x0030 - 0x0030)
class UVCamInputSubsystem final : public UEngineSubsystem
{
public:
	void BindAnalogEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FAnalogInputEvent& AnalogEvent)> Delegate)	 // 0x4f8f464;
	void BindKeyDownEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FKeyEvent& KeyEvent)> Delegate)	 // 0x4f8f464;
	void BindKeyUpEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FKeyEvent& KeyEvent)> Delegate)	 // 0x4f8f464;
	void BindMouseButtonDownEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate)	 // 0x4f8f464;
	void BindMouseButtonUpEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate)	 // 0x4f8f464;
	void BindMouseDoubleClickEvent(const struct FKey& Key, TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate)	 // 0x4f8f464;
	void BindMouseMoveEvent(TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate)	 // 0x4f8f64c;
	void BindMouseWheelEvent(TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate)	 // 0x4f8f64c;
	void SetShouldConsumeGamepadInput(const bool bInShouldConsumeGamepadInput)	 // 0x4bc8ec0;

	bool GetShouldConsumeGamepadInput() const	 // 0x1645584;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamInputSubsystem">();
	}
	static class UVCamInputSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamInputSubsystem>();
	}
};
static_assert(alignof(UVCamInputSubsystem) == 0x000008, "Wrong alignment on UVCamInputSubsystem");
static_assert(sizeof(UVCamInputSubsystem) == 0x000030, "Wrong size on UVCamInputSubsystem");

}

