#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VCamInput

#include "Basic.hpp"

#include "VCamInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function VCamInput.VCamInputSettings.GetVCamInputSettings
// 0x0008 (0x0008 - 0x0000)
struct VCamInputSettings_GetVCamInputSettings final
{
public:
	class UVCamInputSettings*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSettings_GetVCamInputSettings) == 0x000008, "Wrong alignment on VCamInputSettings_GetVCamInputSettings");
static_assert(sizeof(VCamInputSettings_GetVCamInputSettings) == 0x000008, "Wrong size on VCamInputSettings_GetVCamInputSettings");
static_assert(offsetof(VCamInputSettings_GetVCamInputSettings, ReturnValue) == 0x000000, "Member 'VCamInputSettings_GetVCamInputSettings::ReturnValue' has a wrong offset!");

// Function VCamInput.VCamInputSettings.SetDefaultInputProfile
// 0x0008 (0x0008 - 0x0000)
struct VCamInputSettings_SetDefaultInputProfile final
{
public:
	class FName                                   NewDefaultInputProfile;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSettings_SetDefaultInputProfile) == 0x000004, "Wrong alignment on VCamInputSettings_SetDefaultInputProfile");
static_assert(sizeof(VCamInputSettings_SetDefaultInputProfile) == 0x000008, "Wrong size on VCamInputSettings_SetDefaultInputProfile");
static_assert(offsetof(VCamInputSettings_SetDefaultInputProfile, NewDefaultInputProfile) == 0x000000, "Member 'VCamInputSettings_SetDefaultInputProfile::NewDefaultInputProfile' has a wrong offset!");

// Function VCamInput.VCamInputSettings.SetInputProfiles
// 0x0050 (0x0050 - 0x0000)
struct VCamInputSettings_SetInputProfiles final
{
public:
	TMap<class FName, struct FVCamInputProfile>   NewInputProfiles;                                  // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSettings_SetInputProfiles) == 0x000008, "Wrong alignment on VCamInputSettings_SetInputProfiles");
static_assert(sizeof(VCamInputSettings_SetInputProfiles) == 0x000050, "Wrong size on VCamInputSettings_SetInputProfiles");
static_assert(offsetof(VCamInputSettings_SetInputProfiles, NewInputProfiles) == 0x000000, "Member 'VCamInputSettings_SetInputProfiles::NewInputProfiles' has a wrong offset!");

// Function VCamInput.VCamInputSettings.GetInputProfileNames
// 0x0010 (0x0010 - 0x0000)
struct VCamInputSettings_GetInputProfileNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSettings_GetInputProfileNames) == 0x000008, "Wrong alignment on VCamInputSettings_GetInputProfileNames");
static_assert(sizeof(VCamInputSettings_GetInputProfileNames) == 0x000010, "Wrong size on VCamInputSettings_GetInputProfileNames");
static_assert(offsetof(VCamInputSettings_GetInputProfileNames, ReturnValue) == 0x000000, "Member 'VCamInputSettings_GetInputProfileNames::ReturnValue' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindAnalogEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindAnalogEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FAnalogInputEvent& AnalogEvent)> Delegate;          // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindAnalogEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindAnalogEvent");
static_assert(sizeof(VCamInputSubsystem_BindAnalogEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindAnalogEvent");
static_assert(offsetof(VCamInputSubsystem_BindAnalogEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindAnalogEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindAnalogEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindAnalogEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindKeyDownEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindKeyDownEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FKeyEvent& KeyEvent)> Delegate;                     // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindKeyDownEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindKeyDownEvent");
static_assert(sizeof(VCamInputSubsystem_BindKeyDownEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindKeyDownEvent");
static_assert(offsetof(VCamInputSubsystem_BindKeyDownEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindKeyDownEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindKeyDownEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindKeyDownEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindKeyUpEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindKeyUpEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FKeyEvent& KeyEvent)> Delegate;                     // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindKeyUpEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindKeyUpEvent");
static_assert(sizeof(VCamInputSubsystem_BindKeyUpEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindKeyUpEvent");
static_assert(offsetof(VCamInputSubsystem_BindKeyUpEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindKeyUpEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindKeyUpEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindKeyUpEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindMouseButtonDownEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindMouseButtonDownEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate;               // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindMouseButtonDownEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindMouseButtonDownEvent");
static_assert(sizeof(VCamInputSubsystem_BindMouseButtonDownEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindMouseButtonDownEvent");
static_assert(offsetof(VCamInputSubsystem_BindMouseButtonDownEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindMouseButtonDownEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindMouseButtonDownEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindMouseButtonDownEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindMouseButtonUpEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindMouseButtonUpEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate;               // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindMouseButtonUpEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindMouseButtonUpEvent");
static_assert(sizeof(VCamInputSubsystem_BindMouseButtonUpEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindMouseButtonUpEvent");
static_assert(offsetof(VCamInputSubsystem_BindMouseButtonUpEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindMouseButtonUpEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindMouseButtonUpEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindMouseButtonUpEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindMouseDoubleClickEvent
// 0x0028 (0x0028 - 0x0000)
struct VCamInputSubsystem_BindMouseDoubleClickEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate;               // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindMouseDoubleClickEvent) == 0x000008, "Wrong alignment on VCamInputSubsystem_BindMouseDoubleClickEvent");
static_assert(sizeof(VCamInputSubsystem_BindMouseDoubleClickEvent) == 0x000028, "Wrong size on VCamInputSubsystem_BindMouseDoubleClickEvent");
static_assert(offsetof(VCamInputSubsystem_BindMouseDoubleClickEvent, Key) == 0x000000, "Member 'VCamInputSubsystem_BindMouseDoubleClickEvent::Key' has a wrong offset!");
static_assert(offsetof(VCamInputSubsystem_BindMouseDoubleClickEvent, Delegate) == 0x000018, "Member 'VCamInputSubsystem_BindMouseDoubleClickEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindMouseMoveEvent
// 0x0010 (0x0010 - 0x0000)
struct VCamInputSubsystem_BindMouseMoveEvent final
{
public:
	TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindMouseMoveEvent) == 0x000004, "Wrong alignment on VCamInputSubsystem_BindMouseMoveEvent");
static_assert(sizeof(VCamInputSubsystem_BindMouseMoveEvent) == 0x000010, "Wrong size on VCamInputSubsystem_BindMouseMoveEvent");
static_assert(offsetof(VCamInputSubsystem_BindMouseMoveEvent, Delegate) == 0x000000, "Member 'VCamInputSubsystem_BindMouseMoveEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.BindMouseWheelEvent
// 0x0010 (0x0010 - 0x0000)
struct VCamInputSubsystem_BindMouseWheelEvent final
{
public:
	TDelegate<void(float DeltaTime, const struct FPointerEvent& MouseEvent)> Delegate;               // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_BindMouseWheelEvent) == 0x000004, "Wrong alignment on VCamInputSubsystem_BindMouseWheelEvent");
static_assert(sizeof(VCamInputSubsystem_BindMouseWheelEvent) == 0x000010, "Wrong size on VCamInputSubsystem_BindMouseWheelEvent");
static_assert(offsetof(VCamInputSubsystem_BindMouseWheelEvent, Delegate) == 0x000000, "Member 'VCamInputSubsystem_BindMouseWheelEvent::Delegate' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.SetShouldConsumeGamepadInput
// 0x0001 (0x0001 - 0x0000)
struct VCamInputSubsystem_SetShouldConsumeGamepadInput final
{
public:
	bool                                          bInShouldConsumeGamepadInput;                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_SetShouldConsumeGamepadInput) == 0x000001, "Wrong alignment on VCamInputSubsystem_SetShouldConsumeGamepadInput");
static_assert(sizeof(VCamInputSubsystem_SetShouldConsumeGamepadInput) == 0x000001, "Wrong size on VCamInputSubsystem_SetShouldConsumeGamepadInput");
static_assert(offsetof(VCamInputSubsystem_SetShouldConsumeGamepadInput, bInShouldConsumeGamepadInput) == 0x000000, "Member 'VCamInputSubsystem_SetShouldConsumeGamepadInput::bInShouldConsumeGamepadInput' has a wrong offset!");

// Function VCamInput.VCamInputSubsystem.GetShouldConsumeGamepadInput
// 0x0001 (0x0001 - 0x0000)
struct VCamInputSubsystem_GetShouldConsumeGamepadInput final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VCamInputSubsystem_GetShouldConsumeGamepadInput) == 0x000001, "Wrong alignment on VCamInputSubsystem_GetShouldConsumeGamepadInput");
static_assert(sizeof(VCamInputSubsystem_GetShouldConsumeGamepadInput) == 0x000001, "Wrong size on VCamInputSubsystem_GetShouldConsumeGamepadInput");
static_assert(offsetof(VCamInputSubsystem_GetShouldConsumeGamepadInput, ReturnValue) == 0x000000, "Member 'VCamInputSubsystem_GetShouldConsumeGamepadInput::ReturnValue' has a wrong offset!");

}

