#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VCamCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VCamCore_structs.hpp"
#include "VPUtilities_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "VCamInput_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class VCamCore.SimpleVirtualCamera
// 0x0010 (0x0AB0 - 0x0AA0)
class ASimpleVirtualCamera final : public ACineCameraActor
{
public:
	class UVCamComponent*                         VCamComponent;                                     // 0x0AA0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA8[0x8];                                      // 0x0AA8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"SimpleVirtualCamera">();
	}
	static class ASimpleVirtualCamera* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ASimpleVirtualCamera>();
	}
};
static_assert(alignof(ASimpleVirtualCamera) == 0x000010, "Wrong alignment on ASimpleVirtualCamera");
static_assert(sizeof(ASimpleVirtualCamera) == 0x000AB0, "Wrong size on ASimpleVirtualCamera");
static_assert(offsetof(ASimpleVirtualCamera, VCamComponent) == 0x000AA0, "Member 'ASimpleVirtualCamera::VCamComponent' has a wrong offset!");

// Class VCamCore.GameplayViewTargetPolicy
// 0x0000 (0x0028 - 0x0028)
class UGameplayViewTargetPolicy : public UObject
{
public:
	TArray<class APlayerController*> DeterminePlayerControllers(const struct FDeterminePlayerControllersTargetPolicyParams& Params_0)	 // 0x4f77cc0;
	void UpdateViewTarget(const struct FUpdateViewTargetPolicyParams& Params_0)	 // 0x4f7a5dc;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"GameplayViewTargetPolicy">();
	}
	static class UGameplayViewTargetPolicy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UGameplayViewTargetPolicy>();
	}
};
static_assert(alignof(UGameplayViewTargetPolicy) == 0x000008, "Wrong alignment on UGameplayViewTargetPolicy");
static_assert(sizeof(UGameplayViewTargetPolicy) == 0x000028, "Wrong size on UGameplayViewTargetPolicy");

// Class VCamCore.VCamBaseActor
// 0x0010 (0x0AB0 - 0x0AA0)
class AVCamBaseActor final : public ACineCameraActor
{
public:
	class UVCamComponent*                         VCamComponent;                                     // 0x0AA0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AA8[0x8];                                      // 0x0AA8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UVCamComponent* GetVCamComponent() const	 // 0x4f78a40;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamBaseActor">();
	}
	static class AVCamBaseActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVCamBaseActor>();
	}
};
static_assert(alignof(AVCamBaseActor) == 0x000010, "Wrong alignment on AVCamBaseActor");
static_assert(sizeof(AVCamBaseActor) == 0x000AB0, "Wrong size on AVCamBaseActor");
static_assert(offsetof(AVCamBaseActor, VCamComponent) == 0x000AA0, "Member 'AVCamBaseActor::VCamComponent' has a wrong offset!");

// Class VCamCore.FocusFirstPlayerViewTargetPolicy
// 0x0000 (0x0028 - 0x0028)
class UFocusFirstPlayerViewTargetPolicy final : public UGameplayViewTargetPolicy
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"FocusFirstPlayerViewTargetPolicy">();
	}
	static class UFocusFirstPlayerViewTargetPolicy* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UFocusFirstPlayerViewTargetPolicy>();
	}
};
static_assert(alignof(UFocusFirstPlayerViewTargetPolicy) == 0x000008, "Wrong alignment on UFocusFirstPlayerViewTargetPolicy");
static_assert(sizeof(UFocusFirstPlayerViewTargetPolicy) == 0x000028, "Wrong size on UFocusFirstPlayerViewTargetPolicy");

// Class VCamCore.VCamModifier
// 0x0068 (0x0090 - 0x0028)
class UVCamModifier : public UObject
{
public:
	class UInputMappingContext*                   InputMappingContext;                               // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputContextPriority;                              // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FVCamModifierConnectionPoint> ConnectionPoints;                         // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIsInitialized;                                    // 0x0088(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetCurrentLiveLinkDataFromOwningComponent(struct FLiveLinkCameraBlueprintData* LiveLinkData)	 // 0x4f7e840;
	void SetEnabled(bool bNewEnabled)	 // 0x4f7f2cc;
	bool SetStackEntryName(class FName NewName)	 // 0x4f7f3ac;

	class UVCamComponent* GetOwningVCamComponent() const	 // 0x4f7e918;
	class FName GetStackEntryName() const	 // 0x4f7e93c;
	bool IsEnabled() const	 // 0x4f7ed74;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamModifier">();
	}
	static class UVCamModifier* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamModifier>();
	}
};
static_assert(alignof(UVCamModifier) == 0x000008, "Wrong alignment on UVCamModifier");
static_assert(sizeof(UVCamModifier) == 0x000090, "Wrong size on UVCamModifier");
static_assert(offsetof(UVCamModifier, InputMappingContext) == 0x000028, "Member 'UVCamModifier::InputMappingContext' has a wrong offset!");
static_assert(offsetof(UVCamModifier, InputContextPriority) == 0x000030, "Member 'UVCamModifier::InputContextPriority' has a wrong offset!");
static_assert(offsetof(UVCamModifier, ConnectionPoints) == 0x000038, "Member 'UVCamModifier::ConnectionPoints' has a wrong offset!");
static_assert(offsetof(UVCamModifier, bIsInitialized) == 0x000088, "Member 'UVCamModifier::bIsInitialized' has a wrong offset!");

// Class VCamCore.VCamComponent
// 0x0230 (0x0510 - 0x02E0)
class UVCamComponent final : public USceneComponent
{
public:
	TMulticastInlineDelegate<void(class UVCamComponent* NewComponent)> OnComponentReplaced;          // 0x02E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Role;                                              // 0x02F4(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLiveLinkSubjectName                   LiveLinkSubject;                                   // 0x02FC(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLockViewportToCamera;                             // 0x0304(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVCamViewportLocker                    ViewportLocker;                                    // 0x0308(0x0050)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bDisableComponentWhenSpawnedBySequencer;           // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisableOutputOnMultiUserReceiver;                 // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_35A[0x2];                                      // 0x035A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdateFrequencyMs;                                 // 0x035C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVCamTargetViewportID                         TargetViewport;                                    // 0x0360(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVCamInputProfile                      InputProfile;                                      // 0x0368(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	struct FVCamInputDeviceConfig                 InputDeviceSettings;                               // 0x03B8(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	TArray<class UVCamOutputProviderBase*>        OutputProviders;                                   // 0x03D8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UVCamModifierContext*                   ModifierContext;                                   // 0x03E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FModifierStackEntry>            ModifierStack;                                     // 0x03F0(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UInputComponent*                        InputComponent;                                    // 0x0400(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UInputMappingContext*>           AppliedInputContexts;                              // 0x0408(0x0010)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_418[0xF8];                                     // 0x0418(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddInputProfileWithCurrentlyActiveMappings(const class FName ProfileName, bool bUpdateIfProfileAlreadyExists)	 // 0x4f77848;
	bool AddModifier(const class FName Name_0, TSubclassOf<class UVCamModifier> ModifierClass, class UVCamModifier** CreatedModifier)	 // 0x4f7799c;
	bool AddOutputProvider(TSubclassOf<class UVCamOutputProviderBase> ProviderClass, class UVCamOutputProviderBase** CreatedProvider)	 // 0x4f77b28;
	void GetLiveLinkDataForCurrentFrame(struct FLiveLinkCameraBlueprintData* LiveLinkData)	 // 0x4f7805c;
	void HandleObjectReplaced(const TMap<class UObject*, class UObject*>& ReplacementMap)	 // 0x4f78a58;
	void InjectInputForAction(const class UInputAction* Action, const struct FInputActionValue& RawValue, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers)	 // 0x4f78b3c;
	void InjectInputVectorForAction(const class UInputAction* Action, const struct FVector& Value, const TArray<class UInputModifier*>& Modifiers, const TArray<class UInputTrigger*>& Triggers)	 // 0x4f78d78;
	bool InsertModifier(const class FName Name_0, int32 Index_0, TSubclassOf<class UVCamModifier> ModifierClass, class UVCamModifier** CreatedModifier)	 // 0x4f78f9c;
	bool InsertOutputProvider(int32 Index_0, TSubclassOf<class UVCamOutputProviderBase> ProviderClass, class UVCamOutputProviderBase** CreatedProvider)	 // 0x4f791a0;
	void RegisterObjectForInput(class UObject* Object)	 // 0x4f79328;
	void RemoveAllModifiers()	 // 0x4f793e8;
	void RemoveAllOutputProviders()	 // 0x4f79418;
	bool RemoveModifier(const class UVCamModifier* Modifier)	 // 0x4f79448;
	bool RemoveModifierByIndex(const int32 ModifierIndex)	 // 0x4f79524;
	bool RemoveModifierByName(const class FName Name_0)	 // 0x4f7963c;
	bool RemoveOutputProvider(const class UVCamOutputProviderBase* Provider)	 // 0x4f7971c;
	bool RemoveOutputProviderByIndex(const int32 ProviderIndex)	 // 0x4f797f8;
	void SetDisableComponentWhenSpawnedBySequencer(bool bValue)	 // 0x4f799d8;
	void SetDisableOutputOnMultiUserReceiver(bool bValue)	 // 0x4f79a98;
	void SetEnabled(bool bNewEnabled)	 // 0x4f79b58;
	void SetInputDeviceSettings(const struct FVCamInputDeviceConfig& NewInputProfile)	 // 0x4f79c1c;
	void SetInputProfile(const struct FVCamInputProfile& NewInputProfile)	 // 0x4f79cec;
	bool SetInputProfileFromName(const class FName ProfileName)	 // 0x4f79dc8;
	void SetLiveLinkSubobject(const struct FLiveLinkSubjectName& Value)	 // 0x4f79e98;
	void SetModifierContextClass(TSubclassOf<class UVCamModifierContext> ContextClass, class UVCamModifierContext** CreatedContext)	 // 0x4f79f58;
	bool SetModifierIndex(int32 OriginalIndex, int32 NewIndex)	 // 0x4f7a0d8;
	bool SetOutputProviderIndex(int32 OriginalIndex, int32 NewIndex)	 // 0x4f7a224;
	void SetRole(const struct FGameplayTag& Value)	 // 0x4f7a370;

	TArray<class FName> GetAllModifierNames() const	 // 0x4f77da0;
	void GetAllModifiers(TArray<class UVCamModifier*>* Modifiers) const	 // 0x4f77de0;
	void GetAllOutputProviders(TArray<class UVCamOutputProviderBase*>* Providers) const	 // 0x4f77e7c;
	TArray<struct FEnhancedActionKeyMapping> GetAllPlayerMappableActionKeyMappings() const	 // 0x4f77f1c;
	bool GetDisableComponentWhenSpawnedBySequencer() const	 // 0x4f77f80;
	bool GetDisableOutputOnMultiUserReceiver() const	 // 0x4f77f98;
	const struct FVCamInputDeviceConfig GetInputDeviceSettings() const	 // 0x4f77fb0;
	const struct FVCamInputProfile GetInputProfile() const	 // 0x4f7801c;
	class UInputVCamSubsystem* GetInputVCamSubsystem() const	 // 0x4f78038;
	struct FLiveLinkSubjectName GetLiveLinkSubobject() const	 // 0x4f78120;
	class UVCamModifier* GetModifierByIndex(const int32 Index_0) const	 // 0x4f78138;
	class UVCamModifier* GetModifierByName(const class FName Name_0) const	 // 0x4f78220;
	class UVCamModifierContext* GetModifierContext() const	 // 0x4f782f0;
	void GetModifiersByClass(TSubclassOf<class UVCamModifier> ModifierClass, TArray<class UVCamModifier*>* FoundModifiers) const	 // 0x4f78308;
	void GetModifiersByInterface(TSubclassOf<class IInterface> InterfaceClass, TArray<class UVCamModifier*>* FoundModifiers) const	 // 0x4f78438;
	int32 GetNumberOfModifiers() const	 // 0x4f78568;
	int32 GetNumberOfOutputProviders() const	 // 0x4f78580;
	class UVCamOutputProviderBase* GetOutputProviderByIndex(const int32 ProviderIndex) const	 // 0x4f78598;
	void GetOutputProvidersByClass(TSubclassOf<class UVCamOutputProviderBase> ProviderClass, TArray<class UVCamOutputProviderBase*>* FoundProviders) const	 // 0x4f78668;
	TArray<struct FEnhancedActionKeyMapping> GetPlayerMappableKeys() const	 // 0x4f77f1c;
	struct FKey GetPlayerMappedKey(const class FName MappingName) const	 // 0x4f787d0;
	struct FGameplayTag GetRole() const	 // 0x4f788f0;
	TArray<class UVCamSubsystem*> GetSubsystemArray(const TSubclassOf<class UVCamSubsystem>& Class_0) const	 // 0x4f78908;
	class UCineCameraComponent* GetTargetCamera() const	 // 0x4f78a1c;
	bool IsEnabled() const	 // 0x16cbe54;
	bool SaveCurrentInputProfileToSettings(const class FName ProfileName) const	 // 0x4f79908;
	void UnregisterObjectForInput(class UObject* Object) const	 // 0x4f7a51c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamComponent">();
	}
	static class UVCamComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamComponent>();
	}
};
static_assert(alignof(UVCamComponent) == 0x000010, "Wrong alignment on UVCamComponent");
static_assert(sizeof(UVCamComponent) == 0x000510, "Wrong size on UVCamComponent");
static_assert(offsetof(UVCamComponent, OnComponentReplaced) == 0x0002E0, "Member 'UVCamComponent::OnComponentReplaced' has a wrong offset!");
static_assert(offsetof(UVCamComponent, bEnabled) == 0x0002F0, "Member 'UVCamComponent::bEnabled' has a wrong offset!");
static_assert(offsetof(UVCamComponent, Role) == 0x0002F4, "Member 'UVCamComponent::Role' has a wrong offset!");
static_assert(offsetof(UVCamComponent, LiveLinkSubject) == 0x0002FC, "Member 'UVCamComponent::LiveLinkSubject' has a wrong offset!");
static_assert(offsetof(UVCamComponent, bLockViewportToCamera) == 0x000304, "Member 'UVCamComponent::bLockViewportToCamera' has a wrong offset!");
static_assert(offsetof(UVCamComponent, ViewportLocker) == 0x000308, "Member 'UVCamComponent::ViewportLocker' has a wrong offset!");
static_assert(offsetof(UVCamComponent, bDisableComponentWhenSpawnedBySequencer) == 0x000358, "Member 'UVCamComponent::bDisableComponentWhenSpawnedBySequencer' has a wrong offset!");
static_assert(offsetof(UVCamComponent, bDisableOutputOnMultiUserReceiver) == 0x000359, "Member 'UVCamComponent::bDisableOutputOnMultiUserReceiver' has a wrong offset!");
static_assert(offsetof(UVCamComponent, UpdateFrequencyMs) == 0x00035C, "Member 'UVCamComponent::UpdateFrequencyMs' has a wrong offset!");
static_assert(offsetof(UVCamComponent, TargetViewport) == 0x000360, "Member 'UVCamComponent::TargetViewport' has a wrong offset!");
static_assert(offsetof(UVCamComponent, InputProfile) == 0x000368, "Member 'UVCamComponent::InputProfile' has a wrong offset!");
static_assert(offsetof(UVCamComponent, InputDeviceSettings) == 0x0003B8, "Member 'UVCamComponent::InputDeviceSettings' has a wrong offset!");
static_assert(offsetof(UVCamComponent, OutputProviders) == 0x0003D8, "Member 'UVCamComponent::OutputProviders' has a wrong offset!");
static_assert(offsetof(UVCamComponent, ModifierContext) == 0x0003E8, "Member 'UVCamComponent::ModifierContext' has a wrong offset!");
static_assert(offsetof(UVCamComponent, ModifierStack) == 0x0003F0, "Member 'UVCamComponent::ModifierStack' has a wrong offset!");
static_assert(offsetof(UVCamComponent, InputComponent) == 0x000400, "Member 'UVCamComponent::InputComponent' has a wrong offset!");
static_assert(offsetof(UVCamComponent, AppliedInputContexts) == 0x000408, "Member 'UVCamComponent::AppliedInputContexts' has a wrong offset!");

// Class VCamCore.VCamSubsystem
// 0x0000 (0x0030 - 0x0030)
class UVCamSubsystem : public USubsystem
{
public:
	class UVCamComponent* GetVCamComponent() const	 // 0x4f7e918;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamSubsystem">();
	}
	static class UVCamSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamSubsystem>();
	}
};
static_assert(alignof(UVCamSubsystem) == 0x000008, "Wrong alignment on UVCamSubsystem");
static_assert(sizeof(UVCamSubsystem) == 0x000030, "Wrong size on UVCamSubsystem");

// Class VCamCore.InputVCamSubsystem
// 0x01C8 (0x01F8 - 0x0030)
class UInputVCamSubsystem final : public UVCamSubsystem
{
public:
	uint8                                         Pad_30[0x1A0];                                     // 0x0030(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UVCamPlayerInput*                       PlayerInput;                                       // 0x01D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D8[0x10];                                     // 0x01D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UInputComponent>> CurrentInputStack;                                 // 0x01E8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void SetShouldConsumeGamepadInput(EVCamGamepadInputMode GamepadInputMode)	 // 0x4f7a430;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"InputVCamSubsystem">();
	}
	static class UInputVCamSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UInputVCamSubsystem>();
	}
};
static_assert(alignof(UInputVCamSubsystem) == 0x000008, "Wrong alignment on UInputVCamSubsystem");
static_assert(sizeof(UInputVCamSubsystem) == 0x0001F8, "Wrong size on UInputVCamSubsystem");
static_assert(offsetof(UInputVCamSubsystem, PlayerInput) == 0x0001D0, "Member 'UInputVCamSubsystem::PlayerInput' has a wrong offset!");
static_assert(offsetof(UInputVCamSubsystem, CurrentInputStack) == 0x0001E8, "Member 'UInputVCamSubsystem::CurrentInputStack' has a wrong offset!");

// Class VCamCore.VCamBlueprintModifier
// 0x0000 (0x0090 - 0x0090)
class UVCamBlueprintModifier final : public UVCamModifier
{
public:
	void OnApply(class UVCamModifierContext* Context, class UCineCameraComponent* CameraComponent, const float DeltaTime)	 // 0xae1e64;
	void OnDeinitialize()	 // 0xae1e64;
	void OnInitialize(class UVCamModifierContext* Context)	 // 0xae1e64;

	void GetInputMappingContextAndPriority() const	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamBlueprintModifier">();
	}
	static class UVCamBlueprintModifier* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamBlueprintModifier>();
	}
};
static_assert(alignof(UVCamBlueprintModifier) == 0x000008, "Wrong alignment on UVCamBlueprintModifier");
static_assert(sizeof(UVCamBlueprintModifier) == 0x000090, "Wrong size on UVCamBlueprintModifier");

// Class VCamCore.VCamModifierContext
// 0x0000 (0x0028 - 0x0028)
class UVCamModifierContext final : public UObject
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamModifierContext">();
	}
	static class UVCamModifierContext* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamModifierContext>();
	}
};
static_assert(alignof(UVCamModifierContext) == 0x000008, "Wrong alignment on UVCamModifierContext");
static_assert(sizeof(UVCamModifierContext) == 0x000028, "Wrong size on UVCamModifierContext");

// Class VCamCore.VCamModifierInterface
// 0x0000 (0x0000 - 0x0000)
class IVCamModifierInterface final
{
public:
	void OnVCamComponentChanged(class UVCamComponent* VCam)	 // 0x4f7ef38;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamModifierInterface">();
	}
	static class IVCamModifierInterface* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVCamModifierInterface>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVCamModifierInterface) == 0x000001, "Wrong alignment on IVCamModifierInterface");
static_assert(sizeof(IVCamModifierInterface) == 0x000001, "Wrong size on IVCamModifierInterface");

// Class VCamCore.VCamOutputProviderBase
// 0x0140 (0x0168 - 0x0028)
class UVCamOutputProviderBase : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bNewIsActive)> OnActivatedDelegate_Blueprint;                 // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bUseOverrideResolution;                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              OverrideResolution;                                // 0x0054(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVPWidgetDisplayType                          DisplayType;                                       // 0x005C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayViewTargetPolicy*              GameplayViewTargetPolicy;                          // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActive;                                         // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVCamTargetViewportID                         TargetViewport;                                    // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                UMGClass;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FWidgetTreeSnapshot                    WidgetSnapshot;                                    // 0x0078(0x0058)(NativeAccessSpecifierPrivate)
	bool                                          bInitialized;                                      // 0x00D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVPFullScreenUserWidget*                UMGWidget;                                         // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UCineCameraComponent>    TargetCamera;                                      // 0x00E0(0x0030)(ExportObject, Transient, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWasOutputSuspendedWhileActive;                    // 0x0110(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TWeakObjectPtr<class APlayerController>> PlayersWhoseViewTargetsWereSet;                    // 0x0118(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void SetActive(const bool bInActive)	 // 0x4f7f020;
	void SetTargetCamera(const class UCineCameraComponent* InTargetCamera)	 // 0x4f7f4c8;
	void SetTargetViewport(EVCamTargetViewportID Value)	 // 0x4f7f588;
	void SetUMGClass(const TSubclassOf<class UUserWidget> InUMGClass)	 // 0x4f7f644;

	EVCamTargetViewportID GetTargetViewport() const	 // 0x4f7eaf4;
	TSubclassOf<class UUserWidget> GetUMGClass() const	 // 0x4f7eb08;
	bool IsActive() const	 // 0x4f7eb20;
	bool IsInitialized() const	 // 0x4766ea8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamOutputProviderBase">();
	}
	static class UVCamOutputProviderBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamOutputProviderBase>();
	}
};
static_assert(alignof(UVCamOutputProviderBase) == 0x000008, "Wrong alignment on UVCamOutputProviderBase");
static_assert(sizeof(UVCamOutputProviderBase) == 0x000168, "Wrong size on UVCamOutputProviderBase");
static_assert(offsetof(UVCamOutputProviderBase, OnActivatedDelegate_Blueprint) == 0x000040, "Member 'UVCamOutputProviderBase::OnActivatedDelegate_Blueprint' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, bUseOverrideResolution) == 0x000050, "Member 'UVCamOutputProviderBase::bUseOverrideResolution' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, OverrideResolution) == 0x000054, "Member 'UVCamOutputProviderBase::OverrideResolution' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, DisplayType) == 0x00005C, "Member 'UVCamOutputProviderBase::DisplayType' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, GameplayViewTargetPolicy) == 0x000060, "Member 'UVCamOutputProviderBase::GameplayViewTargetPolicy' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, bIsActive) == 0x000068, "Member 'UVCamOutputProviderBase::bIsActive' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, TargetViewport) == 0x000069, "Member 'UVCamOutputProviderBase::TargetViewport' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, UMGClass) == 0x000070, "Member 'UVCamOutputProviderBase::UMGClass' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, WidgetSnapshot) == 0x000078, "Member 'UVCamOutputProviderBase::WidgetSnapshot' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, bInitialized) == 0x0000D0, "Member 'UVCamOutputProviderBase::bInitialized' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, UMGWidget) == 0x0000D8, "Member 'UVCamOutputProviderBase::UMGWidget' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, TargetCamera) == 0x0000E0, "Member 'UVCamOutputProviderBase::TargetCamera' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, bWasOutputSuspendedWhileActive) == 0x000110, "Member 'UVCamOutputProviderBase::bWasOutputSuspendedWhileActive' has a wrong offset!");
static_assert(offsetof(UVCamOutputProviderBase, PlayersWhoseViewTargetsWereSet) == 0x000118, "Member 'UVCamOutputProviderBase::PlayersWhoseViewTargetsWereSet' has a wrong offset!");

// Class VCamCore.VCamOutputComposure
// 0x0018 (0x0180 - 0x0168)
class UVCamOutputComposure final : public UVCamOutputProviderBase
{
public:
	TArray<TSoftObjectPtr<class ACompositingElement>> LayerTargets;                                  // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 FinalOutputRenderTarget;                           // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamOutputComposure">();
	}
	static class UVCamOutputComposure* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamOutputComposure>();
	}
};
static_assert(alignof(UVCamOutputComposure) == 0x000008, "Wrong alignment on UVCamOutputComposure");
static_assert(sizeof(UVCamOutputComposure) == 0x000180, "Wrong size on UVCamOutputComposure");
static_assert(offsetof(UVCamOutputComposure, LayerTargets) == 0x000168, "Member 'UVCamOutputComposure::LayerTargets' has a wrong offset!");
static_assert(offsetof(UVCamOutputComposure, FinalOutputRenderTarget) == 0x000178, "Member 'UVCamOutputComposure::FinalOutputRenderTarget' has a wrong offset!");

// Class VCamCore.VCamOutputMediaOutput
// 0x0018 (0x0180 - 0x0168)
class UVCamOutputMediaOutput final : public UVCamOutputProviderBase
{
public:
	class UMediaOutput*                           OutputConfig;                                      // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromComposureOutputProviderIndex;                  // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaCapture*                          MediaCapture;                                      // 0x0178(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamOutputMediaOutput">();
	}
	static class UVCamOutputMediaOutput* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamOutputMediaOutput>();
	}
};
static_assert(alignof(UVCamOutputMediaOutput) == 0x000008, "Wrong alignment on UVCamOutputMediaOutput");
static_assert(sizeof(UVCamOutputMediaOutput) == 0x000180, "Wrong size on UVCamOutputMediaOutput");
static_assert(offsetof(UVCamOutputMediaOutput, OutputConfig) == 0x000168, "Member 'UVCamOutputMediaOutput::OutputConfig' has a wrong offset!");
static_assert(offsetof(UVCamOutputMediaOutput, FromComposureOutputProviderIndex) == 0x000170, "Member 'UVCamOutputMediaOutput::FromComposureOutputProviderIndex' has a wrong offset!");
static_assert(offsetof(UVCamOutputMediaOutput, MediaCapture) == 0x000178, "Member 'UVCamOutputMediaOutput::MediaCapture' has a wrong offset!");

// Class VCamCore.VCamOutputRemoteSession
// 0x0118 (0x0280 - 0x0168)
class UVCamOutputRemoteSession final : public UVCamOutputProviderBase
{
public:
	int32                                         PortNumber;                                        // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromComposureOutputProviderIndex;                  // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URemoteSessionMediaOutput*              MediaOutput;                                       // 0x0170(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URemoteSessionMediaCapture*             MediaCapture;                                      // 0x0178(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x100];                                    // 0x0180(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamOutputRemoteSession">();
	}
	static class UVCamOutputRemoteSession* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamOutputRemoteSession>();
	}
};
static_assert(alignof(UVCamOutputRemoteSession) == 0x000008, "Wrong alignment on UVCamOutputRemoteSession");
static_assert(sizeof(UVCamOutputRemoteSession) == 0x000280, "Wrong size on UVCamOutputRemoteSession");
static_assert(offsetof(UVCamOutputRemoteSession, PortNumber) == 0x000168, "Member 'UVCamOutputRemoteSession::PortNumber' has a wrong offset!");
static_assert(offsetof(UVCamOutputRemoteSession, FromComposureOutputProviderIndex) == 0x00016C, "Member 'UVCamOutputRemoteSession::FromComposureOutputProviderIndex' has a wrong offset!");
static_assert(offsetof(UVCamOutputRemoteSession, MediaOutput) == 0x000170, "Member 'UVCamOutputRemoteSession::MediaOutput' has a wrong offset!");
static_assert(offsetof(UVCamOutputRemoteSession, MediaCapture) == 0x000178, "Member 'UVCamOutputRemoteSession::MediaCapture' has a wrong offset!");

// Class VCamCore.VCamOutputViewport
// 0x0000 (0x0168 - 0x0168)
class UVCamOutputViewport final : public UVCamOutputProviderBase
{
public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamOutputViewport">();
	}
	static class UVCamOutputViewport* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamOutputViewport>();
	}
};
static_assert(alignof(UVCamOutputViewport) == 0x000008, "Wrong alignment on UVCamOutputViewport");
static_assert(sizeof(UVCamOutputViewport) == 0x000168, "Wrong size on UVCamOutputViewport");

// Class VCamCore.VCamPlayerInput
// 0x0020 (0x0760 - 0x0740)
class UVCamPlayerInput final : public UEnhancedPlayerInput
{
public:
	struct FVCamInputDeviceConfig                 InputDeviceSettings;                               // 0x0740(0x0020)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamPlayerInput">();
	}
	static class UVCamPlayerInput* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamPlayerInput>();
	}
};
static_assert(alignof(UVCamPlayerInput) == 0x000008, "Wrong alignment on UVCamPlayerInput");
static_assert(sizeof(UVCamPlayerInput) == 0x000760, "Wrong size on UVCamPlayerInput");
static_assert(offsetof(UVCamPlayerInput, InputDeviceSettings) == 0x000740, "Member 'UVCamPlayerInput::InputDeviceSettings' has a wrong offset!");

// Class VCamCore.VCamWidget
// 0x0098 (0x0318 - 0x0280)
class UVCamWidget : public UUserWidget
{
public:
	TMap<class FName, struct FVCamConnection>     Connections;                                       // 0x0280(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bRegisterForInput;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputMappingContext*                   InputMappingContext;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputContextPriority;                              // 0x02E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x1C];                                     // 0x02E4(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPostConnectionsReinitializedDelegate_Blueprint;  // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UVCamComponent*                         VCamComponent;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnConnectionUpdated(class FName ConnectionName, bool bDidConnectSuccessfully, class FName ModifierConnectionPointName, class UVCamModifier* ConnectedModifier, class UInputAction* ConnectedAction)	 // 0xae1e64;
	void OnInitializeConnections(class UVCamComponent* VCam)	 // 0x4f7ee74;
	void PostConnectionsInitialized()	 // 0xae1e64;
	bool ReinitializeConnections()	 // 0x4f7effc;
	void UpdateConnectionTargets(const TMap<class FName, struct FVCamConnectionTargetSettings>& NewConnectionTargets, const bool bReinitializeOnSuccessfulUpdate, EConnectionUpdateResult* Result)	 // 0x4f7f704;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamWidget">();
	}
	static class UVCamWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamWidget>();
	}
};
static_assert(alignof(UVCamWidget) == 0x000008, "Wrong alignment on UVCamWidget");
static_assert(sizeof(UVCamWidget) == 0x000318, "Wrong size on UVCamWidget");
static_assert(offsetof(UVCamWidget, Connections) == 0x000280, "Member 'UVCamWidget::Connections' has a wrong offset!");
static_assert(offsetof(UVCamWidget, bRegisterForInput) == 0x0002D0, "Member 'UVCamWidget::bRegisterForInput' has a wrong offset!");
static_assert(offsetof(UVCamWidget, InputMappingContext) == 0x0002D8, "Member 'UVCamWidget::InputMappingContext' has a wrong offset!");
static_assert(offsetof(UVCamWidget, InputContextPriority) == 0x0002E0, "Member 'UVCamWidget::InputContextPriority' has a wrong offset!");
static_assert(offsetof(UVCamWidget, OnPostConnectionsReinitializedDelegate_Blueprint) == 0x000300, "Member 'UVCamWidget::OnPostConnectionsReinitializedDelegate_Blueprint' has a wrong offset!");
static_assert(offsetof(UVCamWidget, VCamComponent) == 0x000310, "Member 'UVCamWidget::VCamComponent' has a wrong offset!");

// Class VCamCore.VCamStateSwitcherWidget
// 0x0078 (0x0390 - 0x0318)
class UVCamStateSwitcherWidget final : public UVCamWidget
{
public:
	TMulticastInlineDelegate<void(class UVCamStateSwitcherWidget* Widget, class FName OldState, class FName NewState)> OnPreStateChanged; // 0x0318(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UVCamStateSwitcherWidget* Widget, class FName OldState, class FName NewState)> OnPostStateChanged; // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FVCamWidgetConnectionState> States;                                     // 0x0338(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class FName                                   CurrentState;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void K2_SetCurrentState(class FName NewState)	 // 0x4f7edac;
	bool SetCurrentState(class FName NewState, bool bForceUpdate, bool bReinitializeConnections)	 // 0x4f7f0fc;

	class FName GetCurrentState() const	 // 0x4a89860;
	bool GetStateInfo(class FName State, struct FVCamWidgetConnectionState* OutStateInfo) const	 // 0x4f7e968;
	TArray<class FName> GetStates() const	 // 0x4f7ea98;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamStateSwitcherWidget">();
	}
	static class UVCamStateSwitcherWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamStateSwitcherWidget>();
	}
};
static_assert(alignof(UVCamStateSwitcherWidget) == 0x000008, "Wrong alignment on UVCamStateSwitcherWidget");
static_assert(sizeof(UVCamStateSwitcherWidget) == 0x000390, "Wrong size on UVCamStateSwitcherWidget");
