#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CinematicCamera_structs.hpp"


namespace SDK
{

// Enum VirtualCamera.EVirtualCameraFocusMethod
// NumValues: 0x0005
enum class EVirtualCameraFocusMethod : uint8
{
	None                                     = 0,
	Manual                                   = 1,
	Tracking                                 = 2,
	Auto                                     = 3,
	EVirtualCameraFocusMethod_MAX            = 4,
};

// Enum VirtualCamera.ETrackerInputSource
// NumValues: 0x0004
enum class ETrackerInputSource : uint8
{
	ARKit                                    = 0,
	Custom                                   = 1,
	LiveLink                                 = 2,
	ETrackerInputSource_MAX                  = 3,
};

// Enum VirtualCamera.ETouchInputState
// NumValues: 0x0007
enum class ETouchInputState : uint8
{
	ActorFocusTargeting                      = 0,
	AutoFocusTargeting                       = 1,
	BlueprintDefined                         = 2,
	ManualTouchFocus                         = 3,
	Scrubbing                                = 4,
	TouchAndHold                             = 5,
	ETouchInputState_MAX                     = 6,
};

// Enum VirtualCamera.EVirtualCameraAxis
// NumValues: 0x0007
enum class EVirtualCameraAxis : uint8
{
	LocationX                                = 0,
	LocationY                                = 1,
	LocationZ                                = 2,
	RotationX                                = 3,
	RotationY                                = 4,
	RotationZ                                = 5,
	EVirtualCameraAxis_MAX                   = 6,
};

// ScriptStruct VirtualCamera.TrackingOffset
// 0x0030 (0x0030 - 0x0000)
struct FTrackingOffset final
{
public:
	struct FVector                                Translation;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrackingOffset) == 0x000008, "Wrong alignment on FTrackingOffset");
static_assert(sizeof(FTrackingOffset) == 0x000030, "Wrong size on FTrackingOffset");
static_assert(offsetof(FTrackingOffset, Translation) == 0x000000, "Member 'FTrackingOffset::Translation' has a wrong offset!");
static_assert(offsetof(FTrackingOffset, Rotation) == 0x000018, "Member 'FTrackingOffset::Rotation' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraTransform
// 0x0060 (0x0060 - 0x0000)
struct FVirtualCameraTransform final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVirtualCameraTransform) == 0x000010, "Wrong alignment on FVirtualCameraTransform");
static_assert(sizeof(FVirtualCameraTransform) == 0x000060, "Wrong size on FVirtualCameraTransform");
static_assert(offsetof(FVirtualCameraTransform, Transform) == 0x000000, "Member 'FVirtualCameraTransform::Transform' has a wrong offset!");

// ScriptStruct VirtualCamera.ConcertVirtualCameraCameraFocusData
// 0x000C (0x000C - 0x0000)
struct FConcertVirtualCameraCameraFocusData final
{
public:
	float                                         ManualFocusDistance;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocusSmoothingInterpSpeed;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSmoothFocusChanges : 1;                           // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertVirtualCameraCameraFocusData) == 0x000004, "Wrong alignment on FConcertVirtualCameraCameraFocusData");
static_assert(sizeof(FConcertVirtualCameraCameraFocusData) == 0x00000C, "Wrong size on FConcertVirtualCameraCameraFocusData");
static_assert(offsetof(FConcertVirtualCameraCameraFocusData, ManualFocusDistance) == 0x000000, "Member 'FConcertVirtualCameraCameraFocusData::ManualFocusDistance' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraFocusData, FocusSmoothingInterpSpeed) == 0x000004, "Member 'FConcertVirtualCameraCameraFocusData::FocusSmoothingInterpSpeed' has a wrong offset!");

// ScriptStruct VirtualCamera.ConcertVirtualCameraCameraData
// 0x00A0 (0x00A0 - 0x0000)
struct FConcertVirtualCameraCameraData final
{
public:
	struct FVector                                CameraActorLocation;                               // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraActorRotation;                               // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                CameraComponentLocation;                           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraComponentRotation;                           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CurrentAperture;                                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentFocalLength;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertVirtualCameraCameraFocusData   FocusSettings;                                     // 0x0068(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraLensSettings                    LensSettings;                                      // 0x0074(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FCameraFilmbackSettings                FilmbackSettings;                                  // 0x0090(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConcertVirtualCameraCameraData) == 0x000008, "Wrong alignment on FConcertVirtualCameraCameraData");
static_assert(sizeof(FConcertVirtualCameraCameraData) == 0x0000A0, "Wrong size on FConcertVirtualCameraCameraData");
static_assert(offsetof(FConcertVirtualCameraCameraData, CameraActorLocation) == 0x000000, "Member 'FConcertVirtualCameraCameraData::CameraActorLocation' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, CameraActorRotation) == 0x000018, "Member 'FConcertVirtualCameraCameraData::CameraActorRotation' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, CameraComponentLocation) == 0x000030, "Member 'FConcertVirtualCameraCameraData::CameraComponentLocation' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, CameraComponentRotation) == 0x000048, "Member 'FConcertVirtualCameraCameraData::CameraComponentRotation' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, CurrentAperture) == 0x000060, "Member 'FConcertVirtualCameraCameraData::CurrentAperture' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, CurrentFocalLength) == 0x000064, "Member 'FConcertVirtualCameraCameraData::CurrentFocalLength' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, FocusSettings) == 0x000068, "Member 'FConcertVirtualCameraCameraData::FocusSettings' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, LensSettings) == 0x000074, "Member 'FConcertVirtualCameraCameraData::LensSettings' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraData, FilmbackSettings) == 0x000090, "Member 'FConcertVirtualCameraCameraData::FilmbackSettings' has a wrong offset!");

// ScriptStruct VirtualCamera.ConcertVirtualCameraCameraComponentEvent
// 0x00A8 (0x00A8 - 0x0000)
struct FConcertVirtualCameraCameraComponentEvent final
{
public:
	class FName                                   TrackingName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConcertVirtualCameraCameraData        CameraData;                                        // 0x0008(0x00A0)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertVirtualCameraCameraComponentEvent) == 0x000008, "Wrong alignment on FConcertVirtualCameraCameraComponentEvent");
static_assert(sizeof(FConcertVirtualCameraCameraComponentEvent) == 0x0000A8, "Wrong size on FConcertVirtualCameraCameraComponentEvent");
static_assert(offsetof(FConcertVirtualCameraCameraComponentEvent, TrackingName) == 0x000000, "Member 'FConcertVirtualCameraCameraComponentEvent::TrackingName' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraCameraComponentEvent, CameraData) == 0x000008, "Member 'FConcertVirtualCameraCameraComponentEvent::CameraData' has a wrong offset!");

// ScriptStruct VirtualCamera.ConcertVirtualCameraControllerEvent
// 0x00A8 (0x00A8 - 0x0000)
struct FConcertVirtualCameraControllerEvent final
{
public:
	ETrackerInputSource                           InputSource;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConcertVirtualCameraCameraData        CameraData;                                        // 0x0008(0x00A0)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FConcertVirtualCameraControllerEvent) == 0x000008, "Wrong alignment on FConcertVirtualCameraControllerEvent");
static_assert(sizeof(FConcertVirtualCameraControllerEvent) == 0x0000A8, "Wrong size on FConcertVirtualCameraControllerEvent");
static_assert(offsetof(FConcertVirtualCameraControllerEvent, InputSource) == 0x000000, "Member 'FConcertVirtualCameraControllerEvent::InputSource' has a wrong offset!");
static_assert(offsetof(FConcertVirtualCameraControllerEvent, CameraData) == 0x000008, "Member 'FConcertVirtualCameraControllerEvent::CameraData' has a wrong offset!");

// ScriptStruct VirtualCamera.LevelSequenceData
// 0x0028 (0x0028 - 0x0000)
struct FLevelSequenceData final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              LastEdited;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLevelSequenceData) == 0x000008, "Wrong alignment on FLevelSequenceData");
static_assert(sizeof(FLevelSequenceData) == 0x000028, "Wrong size on FLevelSequenceData");
static_assert(offsetof(FLevelSequenceData, AssetPath) == 0x000000, "Member 'FLevelSequenceData::AssetPath' has a wrong offset!");
static_assert(offsetof(FLevelSequenceData, DisplayName) == 0x000010, "Member 'FLevelSequenceData::DisplayName' has a wrong offset!");
static_assert(offsetof(FLevelSequenceData, LastEdited) == 0x000020, "Member 'FLevelSequenceData::LastEdited' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraAxisSettings
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FVirtualCameraAxisSettings final
{
public:
	bool                                          bIsLocked;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFrozen;                                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StabilizationScale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementScale;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x3C];                                       // 0x000C(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCameraAxisSettings) == 0x000008, "Wrong alignment on FVirtualCameraAxisSettings");
static_assert(sizeof(FVirtualCameraAxisSettings) == 0x000048, "Wrong size on FVirtualCameraAxisSettings");
static_assert(offsetof(FVirtualCameraAxisSettings, bIsLocked) == 0x000000, "Member 'FVirtualCameraAxisSettings::bIsLocked' has a wrong offset!");
static_assert(offsetof(FVirtualCameraAxisSettings, bIsFrozen) == 0x000001, "Member 'FVirtualCameraAxisSettings::bIsFrozen' has a wrong offset!");
static_assert(offsetof(FVirtualCameraAxisSettings, StabilizationScale) == 0x000004, "Member 'FVirtualCameraAxisSettings::StabilizationScale' has a wrong offset!");
static_assert(offsetof(FVirtualCameraAxisSettings, MovementScale) == 0x000008, "Member 'FVirtualCameraAxisSettings::MovementScale' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraSettings
// 0x0088 (0x0088 - 0x0000)
struct FVirtualCameraSettings final
{
public:
	float                                         FocalLength;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Aperture;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilmbackName;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilmbackWidth;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilmbackHeight;                                    // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MatteOpacity;                                      // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EVirtualCameraAxis, struct FVirtualCameraAxisSettings> AxisSettings;                        // 0x0028(0x0050)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAllowFocusVisualization;                          // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 DebugFocusPlaneColor;                              // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUnit                                         DesiredDistanceUnits;                              // 0x0080(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCameraSettings) == 0x000008, "Wrong alignment on FVirtualCameraSettings");
static_assert(sizeof(FVirtualCameraSettings) == 0x000088, "Wrong size on FVirtualCameraSettings");
static_assert(offsetof(FVirtualCameraSettings, FocalLength) == 0x000000, "Member 'FVirtualCameraSettings::FocalLength' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, Aperture) == 0x000004, "Member 'FVirtualCameraSettings::Aperture' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, FilmbackName) == 0x000008, "Member 'FVirtualCameraSettings::FilmbackName' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, FilmbackWidth) == 0x000018, "Member 'FVirtualCameraSettings::FilmbackWidth' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, FilmbackHeight) == 0x00001C, "Member 'FVirtualCameraSettings::FilmbackHeight' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, MatteOpacity) == 0x000020, "Member 'FVirtualCameraSettings::MatteOpacity' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, AxisSettings) == 0x000028, "Member 'FVirtualCameraSettings::AxisSettings' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, bAllowFocusVisualization) == 0x000078, "Member 'FVirtualCameraSettings::bAllowFocusVisualization' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, DebugFocusPlaneColor) == 0x00007C, "Member 'FVirtualCameraSettings::DebugFocusPlaneColor' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettings, DesiredDistanceUnits) == 0x000080, "Member 'FVirtualCameraSettings::DesiredDistanceUnits' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraWaypoint
// 0x0080 (0x0080 - 0x0000)
struct FVirtualCameraWaypoint final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             WaypointTransform;                                 // 0x0010(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              DateCreated;                                       // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHomeWaypoint;                                   // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFavorited;                                      // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCameraWaypoint) == 0x000010, "Wrong alignment on FVirtualCameraWaypoint");
static_assert(sizeof(FVirtualCameraWaypoint) == 0x000080, "Wrong size on FVirtualCameraWaypoint");
static_assert(offsetof(FVirtualCameraWaypoint, Name) == 0x000000, "Member 'FVirtualCameraWaypoint::Name' has a wrong offset!");
static_assert(offsetof(FVirtualCameraWaypoint, WaypointTransform) == 0x000010, "Member 'FVirtualCameraWaypoint::WaypointTransform' has a wrong offset!");
static_assert(offsetof(FVirtualCameraWaypoint, DateCreated) == 0x000070, "Member 'FVirtualCameraWaypoint::DateCreated' has a wrong offset!");
static_assert(offsetof(FVirtualCameraWaypoint, bIsHomeWaypoint) == 0x000078, "Member 'FVirtualCameraWaypoint::bIsHomeWaypoint' has a wrong offset!");
static_assert(offsetof(FVirtualCameraWaypoint, bIsFavorited) == 0x000079, "Member 'FVirtualCameraWaypoint::bIsFavorited' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraScreenshot
// 0x0110 (0x0110 - 0x0000)
struct FVirtualCameraScreenshot final
{
public:
	struct FVirtualCameraWaypoint                 Waypoint;                                          // 0x0000(0x0080)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVirtualCameraSettings                 CameraSettings;                                    // 0x0080(0x0088)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCameraScreenshot) == 0x000010, "Wrong alignment on FVirtualCameraScreenshot");
static_assert(sizeof(FVirtualCameraScreenshot) == 0x000110, "Wrong size on FVirtualCameraScreenshot");
static_assert(offsetof(FVirtualCameraScreenshot, Waypoint) == 0x000000, "Member 'FVirtualCameraScreenshot::Waypoint' has a wrong offset!");
static_assert(offsetof(FVirtualCameraScreenshot, CameraSettings) == 0x000080, "Member 'FVirtualCameraScreenshot::CameraSettings' has a wrong offset!");

// ScriptStruct VirtualCamera.VirtualCameraSettingsPreset
// 0x0098 (0x0098 - 0x0000)
struct FVirtualCameraSettingsPreset final
{
public:
	bool                                          bIsCameraSettingsSaved;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStabilizationSettingsSaved;                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAxisLockingSettingsSaved;                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMotionScaleSettingsSaved;                       // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFavorited;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVirtualCameraSettings                 CameraSettings;                                    // 0x0008(0x0088)(Edit, NativeAccessSpecifierPublic)
	struct FDateTime                              DateCreated;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVirtualCameraSettingsPreset) == 0x000008, "Wrong alignment on FVirtualCameraSettingsPreset");
static_assert(sizeof(FVirtualCameraSettingsPreset) == 0x000098, "Wrong size on FVirtualCameraSettingsPreset");
static_assert(offsetof(FVirtualCameraSettingsPreset, bIsCameraSettingsSaved) == 0x000000, "Member 'FVirtualCameraSettingsPreset::bIsCameraSettingsSaved' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, bIsStabilizationSettingsSaved) == 0x000001, "Member 'FVirtualCameraSettingsPreset::bIsStabilizationSettingsSaved' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, bIsAxisLockingSettingsSaved) == 0x000002, "Member 'FVirtualCameraSettingsPreset::bIsAxisLockingSettingsSaved' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, bIsMotionScaleSettingsSaved) == 0x000003, "Member 'FVirtualCameraSettingsPreset::bIsMotionScaleSettingsSaved' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, bIsFavorited) == 0x000004, "Member 'FVirtualCameraSettingsPreset::bIsFavorited' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, CameraSettings) == 0x000008, "Member 'FVirtualCameraSettingsPreset::CameraSettings' has a wrong offset!");
static_assert(offsetof(FVirtualCameraSettingsPreset, DateCreated) == 0x000090, "Member 'FVirtualCameraSettingsPreset::DateCreated' has a wrong offset!");

}

