#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "VirtualCamera_structs.hpp"


namespace SDK::Params
{

// Function VirtualCamera.VirtualCameraController.AddBlendableToCamera
// 0x0018 (0x0018 - 0x0000)
struct VirtualCameraController_AddBlendableToCamera final
{
public:
	TScriptInterface<class IBlendableInterface>   InBlendableToAdd;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWeight;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VirtualCameraController_AddBlendableToCamera) == 0x000008, "Wrong alignment on VirtualCameraController_AddBlendableToCamera");
static_assert(sizeof(VirtualCameraController_AddBlendableToCamera) == 0x000018, "Wrong size on VirtualCameraController_AddBlendableToCamera");
static_assert(offsetof(VirtualCameraController_AddBlendableToCamera, InBlendableToAdd) == 0x000000, "Member 'VirtualCameraController_AddBlendableToCamera::InBlendableToAdd' has a wrong offset!");
static_assert(offsetof(VirtualCameraController_AddBlendableToCamera, InWeight) == 0x000010, "Member 'VirtualCameraController_AddBlendableToCamera::InWeight' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.AddOnVirtualCameraUpdatedDelegate
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_AddOnVirtualCameraUpdatedDelegate final
{
public:
	TDelegate<void(float DeltaTime)>              InDelegate;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_AddOnVirtualCameraUpdatedDelegate) == 0x000004, "Wrong alignment on VirtualCameraController_AddOnVirtualCameraUpdatedDelegate");
static_assert(sizeof(VirtualCameraController_AddOnVirtualCameraUpdatedDelegate) == 0x000010, "Wrong size on VirtualCameraController_AddOnVirtualCameraUpdatedDelegate");
static_assert(offsetof(VirtualCameraController_AddOnVirtualCameraUpdatedDelegate, InDelegate) == 0x000000, "Member 'VirtualCameraController_AddOnVirtualCameraUpdatedDelegate::InDelegate' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetOptions
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_GetOptions final
{
public:
	TScriptInterface<class IVirtualCameraOptions> ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetOptions) == 0x000008, "Wrong alignment on VirtualCameraController_GetOptions");
static_assert(sizeof(VirtualCameraController_GetOptions) == 0x000010, "Wrong size on VirtualCameraController_GetOptions");
static_assert(offsetof(VirtualCameraController_GetOptions, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetOptions::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetPresetContainer
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_GetPresetContainer final
{
public:
	TScriptInterface<class IVirtualCameraPresetContainer> ReturnValue;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetPresetContainer) == 0x000008, "Wrong alignment on VirtualCameraController_GetPresetContainer");
static_assert(sizeof(VirtualCameraController_GetPresetContainer) == 0x000010, "Wrong size on VirtualCameraController_GetPresetContainer");
static_assert(offsetof(VirtualCameraController_GetPresetContainer, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetPresetContainer::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.RemoveOnVirtualCameraUpdatedDelegate
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate final
{
public:
	TDelegate<void(float DeltaTime)>              InDelegate;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate) == 0x000004, "Wrong alignment on VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate");
static_assert(sizeof(VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate) == 0x000010, "Wrong size on VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate");
static_assert(offsetof(VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate, InDelegate) == 0x000000, "Member 'VirtualCameraController_RemoveOnVirtualCameraUpdatedDelegate::InDelegate' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetBeforeSetVirtualCameraTransformDelegate
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate final
{
public:
	TDelegate<void(const struct FVirtualCameraTransform& CameraTransform)> InDelegate;               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate) == 0x000004, "Wrong alignment on VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate");
static_assert(sizeof(VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate) == 0x000010, "Wrong size on VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate");
static_assert(offsetof(VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate, InDelegate) == 0x000000, "Member 'VirtualCameraController_SetBeforeSetVirtualCameraTransformDelegate::InDelegate' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetFocusVisualization
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraController_SetFocusVisualization final
{
public:
	bool                                          bInShowFocusVisualization;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetFocusVisualization) == 0x000001, "Wrong alignment on VirtualCameraController_SetFocusVisualization");
static_assert(sizeof(VirtualCameraController_SetFocusVisualization) == 0x000001, "Wrong size on VirtualCameraController_SetFocusVisualization");
static_assert(offsetof(VirtualCameraController_SetFocusVisualization, bInShowFocusVisualization) == 0x000000, "Member 'VirtualCameraController_SetFocusVisualization::bInShowFocusVisualization' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetLiveLinkRepresentation
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_SetLiveLinkRepresentation final
{
public:
	struct FLiveLinkSubjectRepresentation         InLiveLinkRepresenation;                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetLiveLinkRepresentation) == 0x000008, "Wrong alignment on VirtualCameraController_SetLiveLinkRepresentation");
static_assert(sizeof(VirtualCameraController_SetLiveLinkRepresentation) == 0x000010, "Wrong size on VirtualCameraController_SetLiveLinkRepresentation");
static_assert(offsetof(VirtualCameraController_SetLiveLinkRepresentation, InLiveLinkRepresenation) == 0x000000, "Member 'VirtualCameraController_SetLiveLinkRepresentation::InLiveLinkRepresenation' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetOnActorClickedDelegate
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_SetOnActorClickedDelegate final
{
public:
	TDelegate<void(const struct FHitResult& HitResult)> InDelegate;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetOnActorClickedDelegate) == 0x000004, "Wrong alignment on VirtualCameraController_SetOnActorClickedDelegate");
static_assert(sizeof(VirtualCameraController_SetOnActorClickedDelegate) == 0x000010, "Wrong size on VirtualCameraController_SetOnActorClickedDelegate");
static_assert(offsetof(VirtualCameraController_SetOnActorClickedDelegate, InDelegate) == 0x000000, "Member 'VirtualCameraController_SetOnActorClickedDelegate::InDelegate' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetSaveSettingsOnStopStreaming
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraController_SetSaveSettingsOnStopStreaming final
{
public:
	bool                                          bShouldSettingsSave;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetSaveSettingsOnStopStreaming) == 0x000001, "Wrong alignment on VirtualCameraController_SetSaveSettingsOnStopStreaming");
static_assert(sizeof(VirtualCameraController_SetSaveSettingsOnStopStreaming) == 0x000001, "Wrong size on VirtualCameraController_SetSaveSettingsOnStopStreaming");
static_assert(offsetof(VirtualCameraController_SetSaveSettingsOnStopStreaming, bShouldSettingsSave) == 0x000000, "Member 'VirtualCameraController_SetSaveSettingsOnStopStreaming::bShouldSettingsSave' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.SetTrackedActorForFocus
// 0x0020 (0x0020 - 0x0000)
struct VirtualCameraController_SetTrackedActorForFocus final
{
public:
	class AActor*                                 InActorToTrack;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TrackingPointOffset;                               // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_SetTrackedActorForFocus) == 0x000008, "Wrong alignment on VirtualCameraController_SetTrackedActorForFocus");
static_assert(sizeof(VirtualCameraController_SetTrackedActorForFocus) == 0x000020, "Wrong size on VirtualCameraController_SetTrackedActorForFocus");
static_assert(offsetof(VirtualCameraController_SetTrackedActorForFocus, InActorToTrack) == 0x000000, "Member 'VirtualCameraController_SetTrackedActorForFocus::InActorToTrack' has a wrong offset!");
static_assert(offsetof(VirtualCameraController_SetTrackedActorForFocus, TrackingPointOffset) == 0x000008, "Member 'VirtualCameraController_SetTrackedActorForFocus::TrackingPointOffset' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetLiveLinkRepresentation
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraController_GetLiveLinkRepresentation final
{
public:
	struct FLiveLinkSubjectRepresentation         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetLiveLinkRepresentation) == 0x000008, "Wrong alignment on VirtualCameraController_GetLiveLinkRepresentation");
static_assert(sizeof(VirtualCameraController_GetLiveLinkRepresentation) == 0x000010, "Wrong size on VirtualCameraController_GetLiveLinkRepresentation");
static_assert(offsetof(VirtualCameraController_GetLiveLinkRepresentation, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetLiveLinkRepresentation::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetRelativeTransform
// 0x0060 (0x0060 - 0x0000)
struct VirtualCameraController_GetRelativeTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetRelativeTransform) == 0x000010, "Wrong alignment on VirtualCameraController_GetRelativeTransform");
static_assert(sizeof(VirtualCameraController_GetRelativeTransform) == 0x000060, "Wrong size on VirtualCameraController_GetRelativeTransform");
static_assert(offsetof(VirtualCameraController_GetRelativeTransform, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetRelativeTransform::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetSceneCaptureComponent
// 0x0008 (0x0008 - 0x0000)
struct VirtualCameraController_GetSceneCaptureComponent final
{
public:
	class USceneCaptureComponent2D*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetSceneCaptureComponent) == 0x000008, "Wrong alignment on VirtualCameraController_GetSceneCaptureComponent");
static_assert(sizeof(VirtualCameraController_GetSceneCaptureComponent) == 0x000008, "Wrong size on VirtualCameraController_GetSceneCaptureComponent");
static_assert(offsetof(VirtualCameraController_GetSceneCaptureComponent, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetSceneCaptureComponent::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetSequenceController
// 0x0008 (0x0008 - 0x0000)
struct VirtualCameraController_GetSequenceController final
{
public:
	class ULevelSequencePlaybackController*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetSequenceController) == 0x000008, "Wrong alignment on VirtualCameraController_GetSequenceController");
static_assert(sizeof(VirtualCameraController_GetSequenceController) == 0x000008, "Wrong size on VirtualCameraController_GetSequenceController");
static_assert(offsetof(VirtualCameraController_GetSequenceController, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetSequenceController::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.GetStreamedCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct VirtualCameraController_GetStreamedCameraComponent final
{
public:
	class UCineCameraComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_GetStreamedCameraComponent) == 0x000008, "Wrong alignment on VirtualCameraController_GetStreamedCameraComponent");
static_assert(sizeof(VirtualCameraController_GetStreamedCameraComponent) == 0x000008, "Wrong size on VirtualCameraController_GetStreamedCameraComponent");
static_assert(offsetof(VirtualCameraController_GetStreamedCameraComponent, ReturnValue) == 0x000000, "Member 'VirtualCameraController_GetStreamedCameraComponent::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.IsStreaming
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraController_IsStreaming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_IsStreaming) == 0x000001, "Wrong alignment on VirtualCameraController_IsStreaming");
static_assert(sizeof(VirtualCameraController_IsStreaming) == 0x000001, "Wrong size on VirtualCameraController_IsStreaming");
static_assert(offsetof(VirtualCameraController_IsStreaming, ReturnValue) == 0x000000, "Member 'VirtualCameraController_IsStreaming::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraController.ShouldSaveSettingsOnStopStreaming
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraController_ShouldSaveSettingsOnStopStreaming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraController_ShouldSaveSettingsOnStopStreaming) == 0x000001, "Wrong alignment on VirtualCameraController_ShouldSaveSettingsOnStopStreaming");
static_assert(sizeof(VirtualCameraController_ShouldSaveSettingsOnStopStreaming) == 0x000001, "Wrong size on VirtualCameraController_ShouldSaveSettingsOnStopStreaming");
static_assert(offsetof(VirtualCameraController_ShouldSaveSettingsOnStopStreaming, ReturnValue) == 0x000000, "Member 'VirtualCameraController_ShouldSaveSettingsOnStopStreaming::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetDisplayRate
// 0x0008 (0x0008 - 0x0000)
struct VirtualCameraClipsMetaData_GetDisplayRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetDisplayRate) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_GetDisplayRate");
static_assert(sizeof(VirtualCameraClipsMetaData_GetDisplayRate) == 0x000008, "Wrong size on VirtualCameraClipsMetaData_GetDisplayRate");
static_assert(offsetof(VirtualCameraClipsMetaData_GetDisplayRate, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetDisplayRate::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetLengthInFrames
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_GetLengthInFrames final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetLengthInFrames) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_GetLengthInFrames");
static_assert(sizeof(VirtualCameraClipsMetaData_GetLengthInFrames) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_GetLengthInFrames");
static_assert(offsetof(VirtualCameraClipsMetaData_GetLengthInFrames, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetLengthInFrames::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetDisplayRate
// 0x0008 (0x0008 - 0x0000)
struct VirtualCameraClipsMetaData_SetDisplayRate final
{
public:
	struct FFrameRate                             InDisplayRate;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetDisplayRate) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_SetDisplayRate");
static_assert(sizeof(VirtualCameraClipsMetaData_SetDisplayRate) == 0x000008, "Wrong size on VirtualCameraClipsMetaData_SetDisplayRate");
static_assert(offsetof(VirtualCameraClipsMetaData_SetDisplayRate, InDisplayRate) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetDisplayRate::InDisplayRate' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetFocalLength
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_SetFocalLength final
{
public:
	float                                         InFocalLength;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetFocalLength) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_SetFocalLength");
static_assert(sizeof(VirtualCameraClipsMetaData_SetFocalLength) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_SetFocalLength");
static_assert(offsetof(VirtualCameraClipsMetaData_SetFocalLength, InFocalLength) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetFocalLength::InFocalLength' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetFrameCountEnd
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_SetFrameCountEnd final
{
public:
	int32                                         InFrame;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetFrameCountEnd) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_SetFrameCountEnd");
static_assert(sizeof(VirtualCameraClipsMetaData_SetFrameCountEnd) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_SetFrameCountEnd");
static_assert(offsetof(VirtualCameraClipsMetaData_SetFrameCountEnd, InFrame) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetFrameCountEnd::InFrame' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetFrameCountStart
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_SetFrameCountStart final
{
public:
	int32                                         InFrame;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetFrameCountStart) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_SetFrameCountStart");
static_assert(sizeof(VirtualCameraClipsMetaData_SetFrameCountStart) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_SetFrameCountStart");
static_assert(offsetof(VirtualCameraClipsMetaData_SetFrameCountStart, InFrame) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetFrameCountStart::InFrame' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetIsACineCameraRecording
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraClipsMetaData_SetIsACineCameraRecording final
{
public:
	bool                                          bInIsACineCameraRecording;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetIsACineCameraRecording) == 0x000001, "Wrong alignment on VirtualCameraClipsMetaData_SetIsACineCameraRecording");
static_assert(sizeof(VirtualCameraClipsMetaData_SetIsACineCameraRecording) == 0x000001, "Wrong size on VirtualCameraClipsMetaData_SetIsACineCameraRecording");
static_assert(offsetof(VirtualCameraClipsMetaData_SetIsACineCameraRecording, bInIsACineCameraRecording) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetIsACineCameraRecording::bInIsACineCameraRecording' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetLengthInFrames
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_SetLengthInFrames final
{
public:
	int32                                         InLength;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetLengthInFrames) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_SetLengthInFrames");
static_assert(sizeof(VirtualCameraClipsMetaData_SetLengthInFrames) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_SetLengthInFrames");
static_assert(offsetof(VirtualCameraClipsMetaData_SetLengthInFrames, InLength) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetLengthInFrames::InLength' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetRecordedLevelName
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraClipsMetaData_SetRecordedLevelName final
{
public:
	class FString                                 InLevelName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetRecordedLevelName) == 0x000008, "Wrong alignment on VirtualCameraClipsMetaData_SetRecordedLevelName");
static_assert(sizeof(VirtualCameraClipsMetaData_SetRecordedLevelName) == 0x000010, "Wrong size on VirtualCameraClipsMetaData_SetRecordedLevelName");
static_assert(offsetof(VirtualCameraClipsMetaData_SetRecordedLevelName, InLevelName) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetRecordedLevelName::InLevelName' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraClipsMetaData_SetSelected final
{
public:
	bool                                          bInSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_SetSelected) == 0x000001, "Wrong alignment on VirtualCameraClipsMetaData_SetSelected");
static_assert(sizeof(VirtualCameraClipsMetaData_SetSelected) == 0x000001, "Wrong size on VirtualCameraClipsMetaData_SetSelected");
static_assert(offsetof(VirtualCameraClipsMetaData_SetSelected, bInSelected) == 0x000000, "Member 'VirtualCameraClipsMetaData_SetSelected::bInSelected' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetFocalLength
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_GetFocalLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetFocalLength) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_GetFocalLength");
static_assert(sizeof(VirtualCameraClipsMetaData_GetFocalLength) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_GetFocalLength");
static_assert(offsetof(VirtualCameraClipsMetaData_GetFocalLength, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetFocalLength::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetFrameCountEnd
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_GetFrameCountEnd final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetFrameCountEnd) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_GetFrameCountEnd");
static_assert(sizeof(VirtualCameraClipsMetaData_GetFrameCountEnd) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_GetFrameCountEnd");
static_assert(offsetof(VirtualCameraClipsMetaData_GetFrameCountEnd, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetFrameCountEnd::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetFrameCountStart
// 0x0004 (0x0004 - 0x0000)
struct VirtualCameraClipsMetaData_GetFrameCountStart final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetFrameCountStart) == 0x000004, "Wrong alignment on VirtualCameraClipsMetaData_GetFrameCountStart");
static_assert(sizeof(VirtualCameraClipsMetaData_GetFrameCountStart) == 0x000004, "Wrong size on VirtualCameraClipsMetaData_GetFrameCountStart");
static_assert(offsetof(VirtualCameraClipsMetaData_GetFrameCountStart, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetFrameCountStart::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetIsACineCameraRecording
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraClipsMetaData_GetIsACineCameraRecording final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetIsACineCameraRecording) == 0x000001, "Wrong alignment on VirtualCameraClipsMetaData_GetIsACineCameraRecording");
static_assert(sizeof(VirtualCameraClipsMetaData_GetIsACineCameraRecording) == 0x000001, "Wrong size on VirtualCameraClipsMetaData_GetIsACineCameraRecording");
static_assert(offsetof(VirtualCameraClipsMetaData_GetIsACineCameraRecording, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetIsACineCameraRecording::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetRecordedLevelName
// 0x0010 (0x0010 - 0x0000)
struct VirtualCameraClipsMetaData_GetRecordedLevelName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetRecordedLevelName) == 0x000008, "Wrong alignment on VirtualCameraClipsMetaData_GetRecordedLevelName");
static_assert(sizeof(VirtualCameraClipsMetaData_GetRecordedLevelName) == 0x000010, "Wrong size on VirtualCameraClipsMetaData_GetRecordedLevelName");
static_assert(offsetof(VirtualCameraClipsMetaData_GetRecordedLevelName, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetRecordedLevelName::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraClipsMetaData.GetSelected
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraClipsMetaData_GetSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraClipsMetaData_GetSelected) == 0x000001, "Wrong alignment on VirtualCameraClipsMetaData_GetSelected");
static_assert(sizeof(VirtualCameraClipsMetaData_GetSelected) == 0x000001, "Wrong size on VirtualCameraClipsMetaData_GetSelected");
static_assert(offsetof(VirtualCameraClipsMetaData_GetSelected, ReturnValue) == 0x000000, "Member 'VirtualCameraClipsMetaData_GetSelected::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraOptions.GetDesiredDistanceUnits
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraOptions_GetDesiredDistanceUnits final
{
public:
	EUnit                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraOptions_GetDesiredDistanceUnits) == 0x000001, "Wrong alignment on VirtualCameraOptions_GetDesiredDistanceUnits");
static_assert(sizeof(VirtualCameraOptions_GetDesiredDistanceUnits) == 0x000001, "Wrong size on VirtualCameraOptions_GetDesiredDistanceUnits");
static_assert(offsetof(VirtualCameraOptions_GetDesiredDistanceUnits, ReturnValue) == 0x000000, "Member 'VirtualCameraOptions_GetDesiredDistanceUnits::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraOptions.IsFocusVisualizationAllowed
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraOptions_IsFocusVisualizationAllowed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraOptions_IsFocusVisualizationAllowed) == 0x000001, "Wrong alignment on VirtualCameraOptions_IsFocusVisualizationAllowed");
static_assert(sizeof(VirtualCameraOptions_IsFocusVisualizationAllowed) == 0x000001, "Wrong size on VirtualCameraOptions_IsFocusVisualizationAllowed");
static_assert(offsetof(VirtualCameraOptions_IsFocusVisualizationAllowed, ReturnValue) == 0x000000, "Member 'VirtualCameraOptions_IsFocusVisualizationAllowed::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraOptions.SetDesiredDistanceUnits
// 0x0001 (0x0001 - 0x0000)
struct VirtualCameraOptions_SetDesiredDistanceUnits final
{
public:
	EUnit                                         DesiredUnits;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraOptions_SetDesiredDistanceUnits) == 0x000001, "Wrong alignment on VirtualCameraOptions_SetDesiredDistanceUnits");
static_assert(sizeof(VirtualCameraOptions_SetDesiredDistanceUnits) == 0x000001, "Wrong size on VirtualCameraOptions_SetDesiredDistanceUnits");
static_assert(offsetof(VirtualCameraOptions_SetDesiredDistanceUnits, DesiredUnits) == 0x000000, "Member 'VirtualCameraOptions_SetDesiredDistanceUnits::DesiredUnits' has a wrong offset!");

// Function VirtualCamera.VirtualCameraPresetContainer.DeletePreset
// 0x0018 (0x0018 - 0x0000)
struct VirtualCameraPresetContainer_DeletePreset final
{
public:
	class FString                                 PresetName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VirtualCameraPresetContainer_DeletePreset) == 0x000008, "Wrong alignment on VirtualCameraPresetContainer_DeletePreset");
static_assert(sizeof(VirtualCameraPresetContainer_DeletePreset) == 0x000018, "Wrong size on VirtualCameraPresetContainer_DeletePreset");
static_assert(offsetof(VirtualCameraPresetContainer_DeletePreset, PresetName) == 0x000000, "Member 'VirtualCameraPresetContainer_DeletePreset::PresetName' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_DeletePreset, ReturnValue) == 0x000010, "Member 'VirtualCameraPresetContainer_DeletePreset::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraPresetContainer.GetSettingsPresets
// 0x0050 (0x0050 - 0x0000)
struct VirtualCameraPresetContainer_GetSettingsPresets final
{
public:
	TMap<class FString, struct FVirtualCameraSettingsPreset> ReturnValue;                            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraPresetContainer_GetSettingsPresets) == 0x000008, "Wrong alignment on VirtualCameraPresetContainer_GetSettingsPresets");
static_assert(sizeof(VirtualCameraPresetContainer_GetSettingsPresets) == 0x000050, "Wrong size on VirtualCameraPresetContainer_GetSettingsPresets");
static_assert(offsetof(VirtualCameraPresetContainer_GetSettingsPresets, ReturnValue) == 0x000000, "Member 'VirtualCameraPresetContainer_GetSettingsPresets::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraPresetContainer.LoadPreset
// 0x0018 (0x0018 - 0x0000)
struct VirtualCameraPresetContainer_LoadPreset final
{
public:
	class FString                                 PresetName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VirtualCameraPresetContainer_LoadPreset) == 0x000008, "Wrong alignment on VirtualCameraPresetContainer_LoadPreset");
static_assert(sizeof(VirtualCameraPresetContainer_LoadPreset) == 0x000018, "Wrong size on VirtualCameraPresetContainer_LoadPreset");
static_assert(offsetof(VirtualCameraPresetContainer_LoadPreset, PresetName) == 0x000000, "Member 'VirtualCameraPresetContainer_LoadPreset::PresetName' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_LoadPreset, ReturnValue) == 0x000010, "Member 'VirtualCameraPresetContainer_LoadPreset::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VirtualCameraPresetContainer.SavePreset
// 0x0018 (0x0018 - 0x0000)
struct VirtualCameraPresetContainer_SavePreset final
{
public:
	bool                                          bSaveCameraSettings;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveStabilization;                                // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveAxisLocking;                                  // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveMotionScale;                                  // 0x0003(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VirtualCameraPresetContainer_SavePreset) == 0x000008, "Wrong alignment on VirtualCameraPresetContainer_SavePreset");
static_assert(sizeof(VirtualCameraPresetContainer_SavePreset) == 0x000018, "Wrong size on VirtualCameraPresetContainer_SavePreset");
static_assert(offsetof(VirtualCameraPresetContainer_SavePreset, bSaveCameraSettings) == 0x000000, "Member 'VirtualCameraPresetContainer_SavePreset::bSaveCameraSettings' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_SavePreset, bSaveStabilization) == 0x000001, "Member 'VirtualCameraPresetContainer_SavePreset::bSaveStabilization' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_SavePreset, bSaveAxisLocking) == 0x000002, "Member 'VirtualCameraPresetContainer_SavePreset::bSaveAxisLocking' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_SavePreset, bSaveMotionScale) == 0x000003, "Member 'VirtualCameraPresetContainer_SavePreset::bSaveMotionScale' has a wrong offset!");
static_assert(offsetof(VirtualCameraPresetContainer_SavePreset, ReturnValue) == 0x000008, "Member 'VirtualCameraPresetContainer_SavePreset::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetActiveLevelSequence
// 0x0008 (0x0008 - 0x0000)
struct LevelSequencePlaybackController_GetActiveLevelSequence final
{
public:
	class ULevelSequence*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetActiveLevelSequence) == 0x000008, "Wrong alignment on LevelSequencePlaybackController_GetActiveLevelSequence");
static_assert(sizeof(LevelSequencePlaybackController_GetActiveLevelSequence) == 0x000008, "Wrong size on LevelSequencePlaybackController_GetActiveLevelSequence");
static_assert(offsetof(LevelSequencePlaybackController_GetActiveLevelSequence, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetActiveLevelSequence::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetLevelSequences
// 0x0010 (0x0010 - 0x0000)
struct LevelSequencePlaybackController_GetLevelSequences final
{
public:
	TArray<struct FLevelSequenceData>             OutLevelSequenceNames;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetLevelSequences) == 0x000008, "Wrong alignment on LevelSequencePlaybackController_GetLevelSequences");
static_assert(sizeof(LevelSequencePlaybackController_GetLevelSequences) == 0x000010, "Wrong size on LevelSequencePlaybackController_GetLevelSequences");
static_assert(offsetof(LevelSequencePlaybackController_GetLevelSequences, OutLevelSequenceNames) == 0x000000, "Member 'LevelSequencePlaybackController_GetLevelSequences::OutLevelSequenceNames' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.JumpToPlaybackPosition
// 0x0004 (0x0004 - 0x0000)
struct LevelSequencePlaybackController_JumpToPlaybackPosition final
{
public:
	struct FFrameNumber                           InFrameNumber;                                     // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_JumpToPlaybackPosition) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_JumpToPlaybackPosition");
static_assert(sizeof(LevelSequencePlaybackController_JumpToPlaybackPosition) == 0x000004, "Wrong size on LevelSequencePlaybackController_JumpToPlaybackPosition");
static_assert(offsetof(LevelSequencePlaybackController_JumpToPlaybackPosition, InFrameNumber) == 0x000000, "Member 'LevelSequencePlaybackController_JumpToPlaybackPosition::InFrameNumber' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.SetActiveLevelSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequencePlaybackController_SetActiveLevelSequence final
{
public:
	class ULevelSequence*                         InNewLevelSequence;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequencePlaybackController_SetActiveLevelSequence) == 0x000008, "Wrong alignment on LevelSequencePlaybackController_SetActiveLevelSequence");
static_assert(sizeof(LevelSequencePlaybackController_SetActiveLevelSequence) == 0x000010, "Wrong size on LevelSequencePlaybackController_SetActiveLevelSequence");
static_assert(offsetof(LevelSequencePlaybackController_SetActiveLevelSequence, InNewLevelSequence) == 0x000000, "Member 'LevelSequencePlaybackController_SetActiveLevelSequence::InNewLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequencePlaybackController_SetActiveLevelSequence, ReturnValue) == 0x000008, "Member 'LevelSequencePlaybackController_SetActiveLevelSequence::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.SetSequencerLockedToCameraCut
// 0x0001 (0x0001 - 0x0000)
struct LevelSequencePlaybackController_SetSequencerLockedToCameraCut final
{
public:
	bool                                          bLockView;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_SetSequencerLockedToCameraCut) == 0x000001, "Wrong alignment on LevelSequencePlaybackController_SetSequencerLockedToCameraCut");
static_assert(sizeof(LevelSequencePlaybackController_SetSequencerLockedToCameraCut) == 0x000001, "Wrong size on LevelSequencePlaybackController_SetSequencerLockedToCameraCut");
static_assert(offsetof(LevelSequencePlaybackController_SetSequencerLockedToCameraCut, bLockView) == 0x000000, "Member 'LevelSequencePlaybackController_SetSequencerLockedToCameraCut::bLockView' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetActiveLevelSequenceName
// 0x0010 (0x0010 - 0x0000)
struct LevelSequencePlaybackController_GetActiveLevelSequenceName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetActiveLevelSequenceName) == 0x000008, "Wrong alignment on LevelSequencePlaybackController_GetActiveLevelSequenceName");
static_assert(sizeof(LevelSequencePlaybackController_GetActiveLevelSequenceName) == 0x000010, "Wrong size on LevelSequencePlaybackController_GetActiveLevelSequenceName");
static_assert(offsetof(LevelSequencePlaybackController_GetActiveLevelSequenceName, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetActiveLevelSequenceName::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequenceDuration
// 0x0004 (0x0004 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequenceDuration final
{
public:
	struct FFrameNumber                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequenceDuration) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequenceDuration");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequenceDuration) == 0x000004, "Wrong size on LevelSequencePlaybackController_GetCurrentSequenceDuration");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequenceDuration, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequenceDuration::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequenceFrameRate
// 0x0008 (0x0008 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequenceFrameRate final
{
public:
	struct FFrameRate                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequenceFrameRate) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequenceFrameRate");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequenceFrameRate) == 0x000008, "Wrong size on LevelSequencePlaybackController_GetCurrentSequenceFrameRate");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequenceFrameRate, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequenceFrameRate::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequencePlaybackEnd
// 0x0004 (0x0004 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd final
{
public:
	struct FFrameNumber                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd) == 0x000004, "Wrong size on LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequencePlaybackEnd::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequencePlaybackPosition
// 0x0008 (0x0008 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition final
{
public:
	struct FFrameTime                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition) == 0x000008, "Wrong size on LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequencePlaybackPosition::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequencePlaybackStart
// 0x0004 (0x0004 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequencePlaybackStart final
{
public:
	struct FFrameNumber                           ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequencePlaybackStart) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequencePlaybackStart");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequencePlaybackStart) == 0x000004, "Wrong size on LevelSequencePlaybackController_GetCurrentSequencePlaybackStart");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequencePlaybackStart, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequencePlaybackStart::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.GetCurrentSequencePlaybackTimecode
// 0x0014 (0x0014 - 0x0000)
struct LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode final
{
public:
	struct FTimecode                              ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode) == 0x000004, "Wrong alignment on LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode");
static_assert(sizeof(LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode) == 0x000014, "Wrong size on LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode");
static_assert(offsetof(LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_GetCurrentSequencePlaybackTimecode::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.IsSequencePlaybackActive
// 0x0001 (0x0001 - 0x0000)
struct LevelSequencePlaybackController_IsSequencePlaybackActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_IsSequencePlaybackActive) == 0x000001, "Wrong alignment on LevelSequencePlaybackController_IsSequencePlaybackActive");
static_assert(sizeof(LevelSequencePlaybackController_IsSequencePlaybackActive) == 0x000001, "Wrong size on LevelSequencePlaybackController_IsSequencePlaybackActive");
static_assert(offsetof(LevelSequencePlaybackController_IsSequencePlaybackActive, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_IsSequencePlaybackActive::ReturnValue' has a wrong offset!");

// Function VirtualCamera.LevelSequencePlaybackController.IsSequencerLockedToCameraCut
// 0x0001 (0x0001 - 0x0000)
struct LevelSequencePlaybackController_IsSequencerLockedToCameraCut final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequencePlaybackController_IsSequencerLockedToCameraCut) == 0x000001, "Wrong alignment on LevelSequencePlaybackController_IsSequencerLockedToCameraCut");
static_assert(sizeof(LevelSequencePlaybackController_IsSequencerLockedToCameraCut) == 0x000001, "Wrong size on LevelSequencePlaybackController_IsSequencerLockedToCameraCut");
static_assert(offsetof(LevelSequencePlaybackController_IsSequencerLockedToCameraCut, ReturnValue) == 0x000000, "Member 'LevelSequencePlaybackController_IsSequencerLockedToCameraCut::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.CalculateAutoFocusDistance
// 0x0020 (0x0020 - 0x0000)
struct VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance final
{
public:
	struct FVector2D                              ReticlePosition;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance");
static_assert(sizeof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance) == 0x000020, "Wrong size on VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, ReticlePosition) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::ReticlePosition' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, CineCamera) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::CineCamera' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance, ReturnValue) == 0x000018, "Member 'VCamBlueprintFunctionLibrary_CalculateAutoFocusDistance::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.CallFunctionByName
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_CallFunctionByName final
{
public:
	class UObject*                                ObjPtr;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(VCamBlueprintFunctionLibrary_CallFunctionByName) == 0x000008, "Wrong alignment on VCamBlueprintFunctionLibrary_CallFunctionByName");
static_assert(sizeof(VCamBlueprintFunctionLibrary_CallFunctionByName) == 0x000018, "Wrong size on VCamBlueprintFunctionLibrary_CallFunctionByName");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, ObjPtr) == 0x000000, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::ObjPtr' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, FunctionName) == 0x000008, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::FunctionName' has a wrong offset!");
static_assert(offsetof(VCamBlueprintFunctionLibrary_CallFunctionByName, ReturnValue) == 0x000010, "Member 'VCamBlueprintFunctionLibrary_CallFunctionByName::ReturnValue' has a wrong offset!");

// Function VirtualCamera.VCamBlueprintFunctionLibrary.ConvertStringToFrameRate
// 0x0018 (0x0018 - 0x0000)
struct VCamBlueprintFunctionLibrary_ConvertStringToFrameRate final
{
public:
	class FString                                 InFrameRateString;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
