#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualCamera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "VirtualCamera_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "CinematicCamera_classes.hpp"


namespace SDK
{

// Class VirtualCamera.VirtualCameraCineCameraComponent
// 0x00D0 (0x0CC0 - 0x0BF0)
class UVirtualCameraCineCameraComponent final : public UCineCameraComponent
{
public:
	TArray<float>                                 ApertureOptions;                                   // 0x0BE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 FocalLengthOptions;                                // 0x0BF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 MatteOptions;                                      // 0x0C08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FCameraFilmbackSettings> FilmbackOptions;                             // 0x0C18(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FCameraFilmbackSettings                DesiredFilmbackSettings;                           // 0x0C68(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MatteAspectRatio;                                  // 0x0C74(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MatteOpacity;                                      // 0x0C78(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C7C[0x4];                                      // 0x0C7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ViewSizeRatio;                                     // 0x0C80(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C90[0x30];                                     // 0x0C90(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraCineCameraComponent">();
	}
	static class UVirtualCameraCineCameraComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraCineCameraComponent>();
	}
};
static_assert(alignof(UVirtualCameraCineCameraComponent) == 0x000010, "Wrong alignment on UVirtualCameraCineCameraComponent");
static_assert(sizeof(UVirtualCameraCineCameraComponent) == 0x000CC0, "Wrong size on UVirtualCameraCineCameraComponent");
static_assert(offsetof(UVirtualCameraCineCameraComponent, ApertureOptions) == 0x000BE8, "Member 'UVirtualCameraCineCameraComponent::ApertureOptions' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, FocalLengthOptions) == 0x000BF8, "Member 'UVirtualCameraCineCameraComponent::FocalLengthOptions' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, MatteOptions) == 0x000C08, "Member 'UVirtualCameraCineCameraComponent::MatteOptions' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, FilmbackOptions) == 0x000C18, "Member 'UVirtualCameraCineCameraComponent::FilmbackOptions' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, DesiredFilmbackSettings) == 0x000C68, "Member 'UVirtualCameraCineCameraComponent::DesiredFilmbackSettings' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, MatteAspectRatio) == 0x000C74, "Member 'UVirtualCameraCineCameraComponent::MatteAspectRatio' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, MatteOpacity) == 0x000C78, "Member 'UVirtualCameraCineCameraComponent::MatteOpacity' has a wrong offset!");
static_assert(offsetof(UVirtualCameraCineCameraComponent, ViewSizeRatio) == 0x000C80, "Member 'UVirtualCameraCineCameraComponent::ViewSizeRatio' has a wrong offset!");

// Class VirtualCamera.VirtualCameraController
// 0x0000 (0x0000 - 0x0000)
class IVirtualCameraController final
{
public:
	void AddBlendableToCamera(const TScriptInterface<class IBlendableInterface>& InBlendableToAdd, float InWeight)	 // 0x4f922c0;
	void AddOnVirtualCameraUpdatedDelegate(const TDelegate<void(float DeltaTime)>& InDelegate)	 // 0x4f9244c;
	TScriptInterface<class IVirtualCameraOptions> GetOptions()	 // 0x4f93968;
	TScriptInterface<class IVirtualCameraPresetContainer> GetPresetContainer()	 // 0x4f93998;
	void RemoveOnVirtualCameraUpdatedDelegate(const TDelegate<void(float DeltaTime)>& InDelegate)	 // 0x4f942e8;
	void SetBeforeSetVirtualCameraTransformDelegate(const TDelegate<void(const struct FVirtualCameraTransform& CameraTransform)>& InDelegate)	 // 0x4f94738;
	void SetFocusVisualization(bool bInShowFocusVisualization)	 // 0x4f94898;
	void SetLiveLinkRepresentation(const struct FLiveLinkSubjectRepresentation& InLiveLinkRepresenation)	 // 0x4f9495c;
	void SetOnActorClickedDelegate(const TDelegate<void(const struct FHitResult& HitResult)>& InDelegate)	 // 0x4f949ec;
	void SetSaveSettingsOnStopStreaming(bool bShouldSettingsSave)	 // 0x4f94a8c;
	void SetTrackedActorForFocus(class AActor* InActorToTrack, const struct FVector& TrackingPointOffset)	 // 0x4f94b50;

	struct FLiveLinkSubjectRepresentation GetLiveLinkRepresentation() const	 // 0x4f937d0;
	struct FTransform GetRelativeTransform() const	 // 0x4f939c8;
	class USceneCaptureComponent2D* GetSceneCaptureComponent() const	 // 0x4f93a48;
	class ULevelSequencePlaybackController* GetSequenceController() const	 // 0x4f93a70;
	class UCineCameraComponent* GetStreamedCameraComponent() const	 // 0x4f93af8;
	bool IsStreaming() const	 // 0x4f93dc0;
	bool ShouldSaveSettingsOnStopStreaming() const	 // 0x4f94c68;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraController">();
	}
	static class IVirtualCameraController* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVirtualCameraController>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVirtualCameraController) == 0x000001, "Wrong alignment on IVirtualCameraController");
static_assert(sizeof(IVirtualCameraController) == 0x000001, "Wrong size on IVirtualCameraController");

// Class VirtualCamera.VirtualCameraClipsMetaData
// 0x0038 (0x0060 - 0x0028)
class UVirtualCameraClipsMetaData final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FocalLength;                                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsSelected;                                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RecordedLevelName;                                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         FrameCountStart;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         FrameCountEnd;                                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LengthInFrames;                                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameRate                             DisplayRate;                                       // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsACineCameraRecording;                           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FFrameRate GetDisplayRate()	 // 0x4f9908c;
	int32 GetLengthInFrames()	 // 0x46a6b04;
	void SetDisplayRate(const struct FFrameRate& InDisplayRate)	 // 0x4f9ae7c;
	void SetFocalLength(float InFocalLength)	 // 0x4f9b030;
	void SetFrameCountEnd(int32 InFrame)	 // 0x4f9b354;
	void SetFrameCountStart(int32 InFrame)	 // 0x4f9b410;
	void SetIsACineCameraRecording(bool bInIsACineCameraRecording)	 // 0x4f9b58c;
	void SetLengthInFrames(int32 InLength)	 // 0x4f9b648;
	void SetRecordedLevelName(const class FString& InLevelName)	 // 0x4f9beb0;
	void SetSelected(bool bInSelected)	 // 0x4f9c2a8;

	float GetFocalLength() const	 // 0x4f992f4;
	int32 GetFrameCountEnd() const	 // 0x4f99320;
	int32 GetFrameCountStart() const	 // 0x4eea7a4;
	bool GetIsACineCameraRecording() const	 // 0x4f99334;
	class FString GetRecordedLevelName() const	 // 0x4f995cc;
	bool GetSelected() const	 // 0x4f99a8c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraClipsMetaData">();
	}
	static class UVirtualCameraClipsMetaData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraClipsMetaData>();
	}
};
static_assert(alignof(UVirtualCameraClipsMetaData) == 0x000008, "Wrong alignment on UVirtualCameraClipsMetaData");
static_assert(sizeof(UVirtualCameraClipsMetaData) == 0x000060, "Wrong size on UVirtualCameraClipsMetaData");
static_assert(offsetof(UVirtualCameraClipsMetaData, FocalLength) == 0x000030, "Member 'UVirtualCameraClipsMetaData::FocalLength' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, bIsSelected) == 0x000034, "Member 'UVirtualCameraClipsMetaData::bIsSelected' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, RecordedLevelName) == 0x000038, "Member 'UVirtualCameraClipsMetaData::RecordedLevelName' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, FrameCountStart) == 0x000048, "Member 'UVirtualCameraClipsMetaData::FrameCountStart' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, FrameCountEnd) == 0x00004C, "Member 'UVirtualCameraClipsMetaData::FrameCountEnd' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, LengthInFrames) == 0x000050, "Member 'UVirtualCameraClipsMetaData::LengthInFrames' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, DisplayRate) == 0x000054, "Member 'UVirtualCameraClipsMetaData::DisplayRate' has a wrong offset!");
static_assert(offsetof(UVirtualCameraClipsMetaData, bIsACineCameraRecording) == 0x00005C, "Member 'UVirtualCameraClipsMetaData::bIsACineCameraRecording' has a wrong offset!");

// Class VirtualCamera.VirtualCameraOptions
// 0x0000 (0x0000 - 0x0000)
class IVirtualCameraOptions final
{
public:
	EUnit GetDesiredDistanceUnits()	 // 0x4f9321c;
	bool IsFocusVisualizationAllowed()	 // 0x4f93d9c;
	void SetDesiredDistanceUnits(const EUnit DesiredUnits)	 // 0x4f947d8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraOptions">();
	}
	static class IVirtualCameraOptions* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVirtualCameraOptions>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVirtualCameraOptions) == 0x000001, "Wrong alignment on IVirtualCameraOptions");
static_assert(sizeof(IVirtualCameraOptions) == 0x000001, "Wrong size on IVirtualCameraOptions");

// Class VirtualCamera.VirtualCameraPresetContainer
// 0x0000 (0x0000 - 0x0000)
class IVirtualCameraPresetContainer final
{
public:
	int32 DeletePreset(const class FString& PresetName)	 // 0x4f92c00;
	TMap<class FString, struct FVirtualCameraSettingsPreset> GetSettingsPresets()	 // 0x4f93a98;
	bool LoadPreset(const class FString& PresetName)	 // 0x4f93e4c;
	class FString SavePreset(const bool bSaveCameraSettings, const bool bSaveStabilization, const bool bSaveAxisLocking, const bool bSaveMotionScale)	 // 0x4f94384;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraPresetContainer">();
	}
	static class IVirtualCameraPresetContainer* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVirtualCameraPresetContainer>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVirtualCameraPresetContainer) == 0x000001, "Wrong alignment on IVirtualCameraPresetContainer");
static_assert(sizeof(IVirtualCameraPresetContainer) == 0x000001, "Wrong size on IVirtualCameraPresetContainer");

// Class VirtualCamera.LevelSequencePlaybackController
// 0x0018 (0x0040 - 0x0028)
class ULevelSequencePlaybackController final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         ActiveLevelSequence;                               // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClearActiveLevelSequence()	 // 0x4f9294c;
	class ULevelSequence* GetActiveLevelSequence()	 // 0x3c8e6d4;
	void GetLevelSequences(TArray<struct FLevelSequenceData>* OutLevelSequenceNames)	 // 0x4f93744;
	void JumpToPlaybackPosition(const struct FFrameNumber& InFrameNumber)	 // 0x4f93de4;
	void PauseLevelSequence()	 // 0x17c7f2c;
	void PlayLevelSequence()	 // 0x17c7f2c;
	void PlayLevelSequenceReverse()	 // 0x17c7f2c;
	bool SetActiveLevelSequence(class ULevelSequence* InNewLevelSequence)	 // 0x4f93f2c;
	void SetSequencerLockedToCameraCut(bool bLockView)	 // 0x4bc8ec0;
	void StopLevelSequencePlay()	 // 0x17c7f2c;

	class FString GetActiveLevelSequenceName() const	 // 0x4f92fd8;
	struct FFrameNumber GetCurrentSequenceDuration() const	 // 0x4f93120;
	struct FFrameRate GetCurrentSequenceFrameRate() const	 // 0x4f9314c;
	struct FFrameNumber GetCurrentSequencePlaybackEnd() const	 // 0x4f93178;
	struct FFrameTime GetCurrentSequencePlaybackPosition() const	 // 0x4f931a4;
	struct FFrameNumber GetCurrentSequencePlaybackStart() const	 // 0x4f931c4;
	struct FTimecode GetCurrentSequencePlaybackTimecode() const	 // 0x4f931f0;
	bool IsSequencePlaybackActive() const	 // 0x1645584;
	bool IsSequencerLockedToCameraCut() const	 // 0x1645584;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"LevelSequencePlaybackController">();
	}
	static class ULevelSequencePlaybackController* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<ULevelSequencePlaybackController>();
	}
};
static_assert(alignof(ULevelSequencePlaybackController) == 0x000008, "Wrong alignment on ULevelSequencePlaybackController");
static_assert(sizeof(ULevelSequencePlaybackController) == 0x000040, "Wrong size on ULevelSequencePlaybackController");
static_assert(offsetof(ULevelSequencePlaybackController, ActiveLevelSequence) == 0x000038, "Member 'ULevelSequencePlaybackController::ActiveLevelSequence' has a wrong offset!");

// Class VirtualCamera.VCamBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UVCamBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float CalculateAutoFocusDistance(const struct FVector2D& ReticlePosition, class UCineCameraComponent* CineCamera)	 // 0x4f924ec;
	static bool CallFunctionByName(class UObject* ObjPtr, class FName FunctionName)	 // 0x4f927e4;
	static struct FFrameRate ConvertStringToFrameRate(const class FString& InFrameRateString)	 // 0x4f92960;
	static bool CopyToCineCameraActor(class UCineCameraComponent* SourceCameraComponent, class ACineCameraActor* TargetCameraActor)	 // 0x4f92a48;
	static class UObject* EditorLoadAsset(const class FString& AssetPath)	 // 0x4f92ce0;
	static bool EditorSaveAsset(const class FString& AssetPath)	 // 0x4f92dc4;
	static void EditorSetGameView(bool bIsToggled)	 // 0x4bc8ec0;
	static void EnableDebugFocusPlane(class UCineCameraComponent* CineCamera, bool bEnabled)	 // 0x4f92ea8;
	static TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& CameraBindingID)	 // 0x4f93018;
	static class ULevelSequence* GetCurrentLevelSequence()	 // 0x3fa3450;
	static int32 GetCurrentLevelSequenceCurrentFrame()	 // 0x4f9310c;
	static struct FFrameRate GetDisplayRate(class ULevelSequence* LevelSequence)	 // 0x4f93240;
	static struct FTimecode GetLevelSequenceFrameAsTimecode(const class ULevelSequence* LevelSequence, int32 InFrame)	 // 0x4f93320;
	static struct FTimecode GetLevelSequenceFrameAsTimecodeWithoutObject(const struct FFrameRate& DisplayRate, int32 InFrame)	 // 0x4f93498;
	static int32 GetLevelSequenceLengthInFrames(const class ULevelSequence* LevelSequence)	 // 0x4f935f4;
	static class FString GetNextUndoDescription()	 // 0x4f93800;
	static TMap<class FName, class FString> GetObjectMetadataTags(class UObject* InObject)	 // 0x4f9384c;
	static class ULevelSequence* GetPendingTakeLevelSequence()	 // 0x3fa3450;
	static class UVirtualCameraUserSettings* GetUserSettings()	 // 0x4f93b20;
	static class UTexture* ImportSnapshotTexture(const class FString& Filename, const class FString& SubFolderName, const class FString& AbsolutePathPackage)	 // 0x4f93b50;
	static bool IsCurrentLevelSequencePlaying()	 // 0x1645584;
	static bool IsGameRunning()	 // 0x16463d4;
	static bool IsRecording()	 // 0x1645584;
	static bool IsTakeRecorderPanelOpen()	 // 0x1645584;
	static bool ModifyLevelSequenceMetadata(class UVirtualCameraClipsMetaData* LevelSequenceMetaData)	 // 0x4f93f2c;
	static bool ModifyLevelSequenceMetadataForSelects(class UVirtualCameraClipsMetaData* LevelSequenceMetaData, bool bIsSelected)	 // 0x4f93fdc;
	static void ModifyObjectMetadataTags(class UObject* InObject, class FName InTag, const class FString& InValue)	 // 0x4f94114;
	static void PauseCurrentLevelSequence()	 // 0x17c7f2c;
	static void PilotActor(class AActor* SelectedActor)	 // 0x43f717c;
	static void PlayCurrentLevelSequence()	 // 0x17c7f2c;
	static void SetActorLabel(class AActor* Actor, const class FString& NewActorLabel)	 // 0x4f945f4;
	static void SetCurrentLevelSequenceCurrentFrame(int32 NewFrame)	 // 0x46ee728;
	static void SetOnTakeRecorderSlateChanged(TDelegate<void(const class FString& Slate)> OnTakeRecorderSlateChanged)	 // 0x4f8f64c;
	static TArray<struct FAssetData> SortAssetsByTimecodeAssetData(const TArray<struct FAssetData>& LevelSequenceAssets)	 // 0x4f94c8c;
	static int32 TimecodeToFrameAmount(const struct FTimecode& Timecode, const struct FFrameRate& InFrameRate)	 // 0x4f94f8c;
	static bool TryOpenTakeRecorderPanel()	 // 0x1645584;
	static bool UpdatePostProcessSettingsForCapture(class USceneCaptureComponent2D* CaptureComponent, float DepthOfField, float FStopValue)	 // 0x4f950c4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VCamBlueprintFunctionLibrary">();
	}
	static class UVCamBlueprintFunctionLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVCamBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UVCamBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UVCamBlueprintFunctionLibrary");
static_assert(sizeof(UVCamBlueprintFunctionLibrary) == 0x000028, "Wrong size on UVCamBlueprintFunctionLibrary");

// Class VirtualCamera.VirtualCameraActor
// 0x0210 (0x0CB0 - 0x0AA0)
class AVirtualCameraActor final : public ACineCameraActor
{
public:
	uint8                                         Pad_AA0[0x18];                                     // 0x0AA0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               SceneCaptureComponent;                             // 0x0AB8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectRepresentation         LiveLinkSubject;                                   // 0x0AC0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UVirtualCameraMovement*                 MovementComponent;                                 // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URemoteSessionMediaOutput*              MediaOutput;                                       // 0x0AD8(0x0008)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                CameraUMGClass;                                    // 0x0AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetDeviceResolution;                            // 0x0AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemoteSessionPort;                                 // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVPFullScreenUserWidget*                CameraScreenWidget;                                // 0x0B00(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URemoteSessionMediaCapture*             MediaCapture;                                      // 0x0B08(0x0008)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWorld*                                 ActorWorld;                                        // 0x0B10(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 PreviousViewTarget;                                // 0x0B18(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowFocusVisualization;                          // 0x0B20(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B21[0x3];                                      // 0x0B21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FVirtualCameraTransform& CameraTransform)> OnPreSetVirtualCameraTransform; // 0x0B24(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(const struct FHitResult& HitResult)> OnActorClickedDelegate;                      // 0x0B34(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float DeltaTime)> OnVirtualCameraUpdatedDelegates;                 // 0x0B48(0x0010)(Edit, ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<class FString, struct FVirtualCameraSettingsPreset> SettingsPresets;                        // 0x0B58(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA8[0x8];                                      // 0x0BA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   StreamedCamera;                                    // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB8[0xF8];                                     // 0x0BB8(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraActor">();
	}
	static class AVirtualCameraActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVirtualCameraActor>();
	}
};
static_assert(alignof(AVirtualCameraActor) == 0x000010, "Wrong alignment on AVirtualCameraActor");
static_assert(sizeof(AVirtualCameraActor) == 0x000CB0, "Wrong size on AVirtualCameraActor");
static_assert(offsetof(AVirtualCameraActor, SceneCaptureComponent) == 0x000AB8, "Member 'AVirtualCameraActor::SceneCaptureComponent' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, LiveLinkSubject) == 0x000AC0, "Member 'AVirtualCameraActor::LiveLinkSubject' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, MovementComponent) == 0x000AD0, "Member 'AVirtualCameraActor::MovementComponent' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, MediaOutput) == 0x000AD8, "Member 'AVirtualCameraActor::MediaOutput' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, CameraUMGClass) == 0x000AE0, "Member 'AVirtualCameraActor::CameraUMGClass' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, TargetDeviceResolution) == 0x000AE8, "Member 'AVirtualCameraActor::TargetDeviceResolution' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, RemoteSessionPort) == 0x000AF8, "Member 'AVirtualCameraActor::RemoteSessionPort' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, CameraScreenWidget) == 0x000B00, "Member 'AVirtualCameraActor::CameraScreenWidget' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, MediaCapture) == 0x000B08, "Member 'AVirtualCameraActor::MediaCapture' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, ActorWorld) == 0x000B10, "Member 'AVirtualCameraActor::ActorWorld' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, PreviousViewTarget) == 0x000B18, "Member 'AVirtualCameraActor::PreviousViewTarget' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, bAllowFocusVisualization) == 0x000B20, "Member 'AVirtualCameraActor::bAllowFocusVisualization' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, OnPreSetVirtualCameraTransform) == 0x000B24, "Member 'AVirtualCameraActor::OnPreSetVirtualCameraTransform' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, OnActorClickedDelegate) == 0x000B34, "Member 'AVirtualCameraActor::OnActorClickedDelegate' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, OnVirtualCameraUpdatedDelegates) == 0x000B48, "Member 'AVirtualCameraActor::OnVirtualCameraUpdatedDelegates' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, SettingsPresets) == 0x000B58, "Member 'AVirtualCameraActor::SettingsPresets' has a wrong offset!");
static_assert(offsetof(AVirtualCameraActor, StreamedCamera) == 0x000BB0, "Member 'AVirtualCameraActor::StreamedCamera' has a wrong offset!");

// Class VirtualCamera.VirtualCameraConcertCameraComponent
// 0x0018 (0x00D8 - 0x00C0)
class UVirtualCameraConcertCameraComponent final : public UActorComponent
{
public:
	class FName                                   TrackingName;                                      // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasAuthority;                                     // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSendUpdateInEditor;                               // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateCameraComponentTransform;                   // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   ComponentToTrack;                                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraConcertCameraComponent">();
	}
	static class UVirtualCameraConcertCameraComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraConcertCameraComponent>();
	}
};
static_assert(alignof(UVirtualCameraConcertCameraComponent) == 0x000008, "Wrong alignment on UVirtualCameraConcertCameraComponent");
static_assert(sizeof(UVirtualCameraConcertCameraComponent) == 0x0000D8, "Wrong size on UVirtualCameraConcertCameraComponent");
static_assert(offsetof(UVirtualCameraConcertCameraComponent, TrackingName) == 0x0000C0, "Member 'UVirtualCameraConcertCameraComponent::TrackingName' has a wrong offset!");
static_assert(offsetof(UVirtualCameraConcertCameraComponent, bHasAuthority) == 0x0000C8, "Member 'UVirtualCameraConcertCameraComponent::bHasAuthority' has a wrong offset!");
static_assert(offsetof(UVirtualCameraConcertCameraComponent, bSendUpdateInEditor) == 0x0000C9, "Member 'UVirtualCameraConcertCameraComponent::bSendUpdateInEditor' has a wrong offset!");
static_assert(offsetof(UVirtualCameraConcertCameraComponent, bUpdateCameraComponentTransform) == 0x0000CA, "Member 'UVirtualCameraConcertCameraComponent::bUpdateCameraComponentTransform' has a wrong offset!");
static_assert(offsetof(UVirtualCameraConcertCameraComponent, ComponentToTrack) == 0x0000D0, "Member 'UVirtualCameraConcertCameraComponent::ComponentToTrack' has a wrong offset!");

// Class VirtualCamera.VirtualCameraMovement
// 0x0168 (0x0190 - 0x0028)
class UVirtualCameraMovement final : public UObject
{
public:
	uint8                                         Pad_28[0x168];                                     // 0x0028(0x0168)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetLocalAxis()	 // 0x4f9a4d8;
	void SetLocalAxis(const struct FTransform& InTransform)	 // 0x4f9b704;
	void SetLocalTransform(const struct FTransform& Transform)	 // 0x4f9b860;
	void SetLocationScale(const struct FVector& LocationScale)	 // 0x4f9b990;
	void SetRotationScale(const struct FRotator& RotationScale)	 // 0x4f9bf90;

	struct FTransform GetLocalTransform() const	 // 0x4f99428;
	struct FTransform GetTransform() const	 // 0x4f99b88;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraMovement">();
	}
	static class UVirtualCameraMovement* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraMovement>();
	}
};
static_assert(alignof(UVirtualCameraMovement) == 0x000008, "Wrong alignment on UVirtualCameraMovement");
static_assert(sizeof(UVirtualCameraMovement) == 0x000190, "Wrong size on UVirtualCameraMovement");

// Class VirtualCamera.VirtualCameraMovementComponent
// 0x0118 (0x0290 - 0x0178)
class alignas(0x10) UVirtualCameraMovementComponent final : public UPawnMovementComponent
{
public:
	uint8                                         Pad_178[0x100];                                    // 0x0178(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RootUpdatedComponent;                              // 0x0278(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPrimitiveComponent*                    RootUpdatedPrimitive;                              // 0x0280(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraMovementComponent">();
	}
	static class UVirtualCameraMovementComponent* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraMovementComponent>();
	}
};
static_assert(alignof(UVirtualCameraMovementComponent) == 0x000010, "Wrong alignment on UVirtualCameraMovementComponent");
static_assert(sizeof(UVirtualCameraMovementComponent) == 0x000290, "Wrong size on UVirtualCameraMovementComponent");
static_assert(offsetof(UVirtualCameraMovementComponent, RootUpdatedComponent) == 0x000278, "Member 'UVirtualCameraMovementComponent::RootUpdatedComponent' has a wrong offset!");
static_assert(offsetof(UVirtualCameraMovementComponent, RootUpdatedPrimitive) == 0x000280, "Member 'UVirtualCameraMovementComponent::RootUpdatedPrimitive' has a wrong offset!");

// Class VirtualCamera.VirtualCameraPawnBase
// 0x0148 (0x0480 - 0x0338)
class AVirtualCameraPawnBase final : public APawn
{
public:
	uint8                                         Pad_338[0x18];                                     // 0x0338(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UVirtualCameraCineCameraComponent*      CineCamera;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSaveSettingsWhenClosing;                          // 0x0360(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SavedSettingsSlotName;                             // 0x0368(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FVirtualCameraSettingsPreset> SettingsPresets;                        // 0x0378(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0xB1];                                     // 0x03C8(0x00B1)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowFocusVisualization;                          // 0x0479(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HighlightTappedActor(class AActor* HighlightedActor)	 // 0xae1e64;
	void LoadFinished()	 // 0xae1e64;
	void TriggerFocusPlaneTimer()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraPawnBase">();
	}
	static class AVirtualCameraPawnBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVirtualCameraPawnBase>();
	}
};
static_assert(alignof(AVirtualCameraPawnBase) == 0x000008, "Wrong alignment on AVirtualCameraPawnBase");
static_assert(sizeof(AVirtualCameraPawnBase) == 0x000480, "Wrong size on AVirtualCameraPawnBase");
static_assert(offsetof(AVirtualCameraPawnBase, CineCamera) == 0x000350, "Member 'AVirtualCameraPawnBase::CineCamera' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPawnBase, bSaveSettingsWhenClosing) == 0x000360, "Member 'AVirtualCameraPawnBase::bSaveSettingsWhenClosing' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPawnBase, SavedSettingsSlotName) == 0x000368, "Member 'AVirtualCameraPawnBase::SavedSettingsSlotName' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPawnBase, SettingsPresets) == 0x000378, "Member 'AVirtualCameraPawnBase::SettingsPresets' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPawnBase, bAllowFocusVisualization) == 0x000479, "Member 'AVirtualCameraPawnBase::bAllowFocusVisualization' has a wrong offset!");

// Class VirtualCamera.VirtualCameraPlayerControllerBase
// 0x00E8 (0x0958 - 0x0870)
class AVirtualCameraPlayerControllerBase final : public APlayerController
{
public:
	uint8                                         Pad_870[0x10];                                     // 0x0870(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ETrackerInputSource                           InputSource;                                       // 0x0880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_881[0x3];                                      // 0x0881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LiveLinkTargetName;                                // 0x0884(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTrackingOffset                        TrackerPreOffset;                                  // 0x0890(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrackingOffset                        TrackerPostOffset;                                 // 0x08C0(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class ACineCameraActor>           TargetCameraActorClass;                            // 0x08F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           RequiredSequencerRecorderCameraSettings;           // 0x08F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnOffsetReset;                                     // 0x0908(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AVPRootActor*                           RootActor;                                         // 0x0918(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_920[0x20];                                     // 0x0920(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlaybackController*       LevelSequencePlaybackController;                   // 0x0940(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACineCameraActor*                       TargetCameraActor;                                 // 0x0948(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCachedIsVirtualCameraControlledByRemoteSession;   // 0x0950(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCachedShouldUpdateTargetCameraTransform;          // 0x0951(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_952[0x6];                                      // 0x0952(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateGameViewport()	 // 0x4f98510;
	void AddBlendableToCamera(TScriptInterface<class IBlendableInterface> BlendableToAdd, float Weight)	 // 0x4f9852c;
	void BroadcastOffsetReset()	 // 0x4f98688;
	float ChangeAperturePreset(const bool bShiftUp)	 // 0x4f986a4;
	float ChangeFocalLengthPreset(const bool bShiftUp)	 // 0x4f98790;
	void ClearActiveLevelSequence()	 // 0x4f9887c;
	int32 DeletePreset(const class FString& PresetName)	 // 0x4f988a4;
	int32 DeleteScreenshot(const class FString& ScreenshotName)	 // 0x4f989d0;
	int32 DeleteWaypoint(const class FString& WaypointName)	 // 0x4f98afc;
	void FocusMethodChanged(EVirtualCameraFocusMethod NewFocusMethod)	 // 0xae1e64;
	class ULevelSequence* GetActiveLevelSequence()	 // 0x4f98c28;
	class FString GetActiveLevelSequenceName()	 // 0x4f98c50;
	float GetAxisMovementScale(EVirtualCameraAxis AxisToRetrieve)	 // 0x4f98cb0;
	float GetAxisStabilizationScale(EVirtualCameraAxis AxisToRetrieve)	 // 0x4f98d80;
	float GetCurrentAperture()	 // 0x4f98e5c;
	class FString GetCurrentFilmbackName()	 // 0x4f98e94;
	float GetCurrentFocalLength()	 // 0x4f98efc;
	float GetCurrentFocusDistance()	 // 0x4f98f34;
	EVirtualCameraFocusMethod GetCurrentFocusMethod()	 // 0x4f98f6c;
	struct FFrameRate GetCurrentSequenceFrameRate()	 // 0x4f98f84;
	struct FFrameNumber GetCurrentSequencePlaybackEnd()	 // 0x4f98fd0;
	struct FFrameNumber GetCurrentSequencePlaybackStart()	 // 0x4f99010;
	void GetCustomTrackerLocationAndRotation(struct FVector* OutTrackerLocation, struct FRotator* OutTrackerRotation)	 // 0xae1e64;
	EUnit GetDesiredDistanceUnits()	 // 0x4f99050;
	bool GetFilmbackPresetOptions(TArray<class FString>* OutFilmbackPresetsArray)	 // 0x4f99208;
	struct FColor GetFocusPlaneColor()	 // 0x4f99308;
	struct FFrameNumber GetLevelSequenceLength()	 // 0x4f99348;
	void GetLevelSequences(TArray<struct FLevelSequenceData>* OutLevelSequenceNames)	 // 0x4f99388;
	float GetMatteAspectRatio()	 // 0x4f99470;
	float GetMatteOpacity()	 // 0x4f994a8;
	void GetMatteValues(TArray<float>* OutMatteValues)	 // 0x4f994e0;
	struct FFrameTime GetPlaybackPosition()	 // 0x4f995a4;
	struct FTimecode GetPlaybackTimecode()	 // 0x4f931f0;
	void GetScreenshotInfo(const class FString& ScreenshotName, struct FVirtualCameraScreenshot* OutScreenshotInfo)	 // 0x4f99614;
	void GetScreenshotNames(TArray<class FString>* OutArray)	 // 0x4f997b0;
	TMap<class FString, struct FVirtualCameraSettingsPreset> GetSettingsPresets()	 // 0x4f99aa0;
	class ACineCameraActor* GetTargetCamera()	 // 0x4f99b58;
	ETouchInputState GetTouchInputState()	 // 0x4f99b70;
	void GetWaypointInfo(const class FString& WaypointName, struct FVirtualCameraWaypoint* OutWaypointInfo)	 // 0x4f99be0;
	void GetWaypointNames(TArray<class FString>* OutArray)	 // 0x4f99d70;
	void InitializeAutoFocusPoint()	 // 0x4f9a04c;
	bool IsAxisLocked(EVirtualCameraAxis AxisToCheck)	 // 0x4f9a060;
	bool IsFocusVisualizationAllowed()	 // 0x4f9a194;
	bool IsPlaying()	 // 0x1645584;
	bool IsSequencerLockedToCameraCut()	 // 0x1645584;
	bool IsTouchInputInFocusMode()	 // 0x4f9a1d0;
	bool IsUsingGlobalBoom()	 // 0x4f9a1f8;
	void JumpToLevelSequenceEnd()	 // 0x4f9a25c;
	void JumpToLevelSequenceStart()	 // 0x4f9a288;
	void JumpToPlaybackPosition(const struct FFrameNumber& InFrameNumber)	 // 0x4f93de4;
	bool LoadPreset(const class FString& PresetName)	 // 0x4f9a2b4;
	bool LoadScreenshotView(const class FString& ScreenshotName)	 // 0x4f9a3d8;
	void OnRecordEnabledStateChanged(bool bIsRecordEnabled)	 // 0xae1e64;
	void OnStopped()	 // 0xae1e64;
	void PauseLevelSequence()	 // 0x17c7f2c;
	void PlayLevelSequence()	 // 0x17c7f2c;
	void PlayLevelSequenceInReverse()	 // 0x17c7f2c;
	void ResetCameraOffsetsToTracker()	 // 0x4f9a4c4;
	void ResumeLevelSequencePlay()	 // 0x17c7f2c;
	void SaveHomeWaypoint(const class FString& NewHomeWaypointName)	 // 0x4f9a548;
	class FString SavePreset(bool bSaveCameraSettings, bool bSaveStabilization, bool bSaveAxisLocking, bool bSaveMotionScale)	 // 0x4f9a628;
	class FString SaveWaypoint()	 // 0x4f9a8bc;
	bool SetActiveLevelSequence(class ULevelSequence* InNewLevelSequence)	 // 0x4f93f2c;
	void SetAllowFocusPlaneVisualization(bool bShouldAllowFocusVisualization)	 // 0x4f9a920;
	float SetAxisStabilizationScale(EVirtualCameraAxis AxisToAdjust, float NewStabilizationAmount)	 // 0x4f9a9f4;
	void SetCurrentAperture(float NewAperture)	 // 0x4f9ab44;
	void SetCurrentFocalLength(const float NewFocalLength)	 // 0x4f9ac14;
	void SetCurrentFocusDistance(const float NewFocusDistance)	 // 0x4f9ace4;
	void SetDesiredDistanceUnits(const EUnit DesiredUnits)	 // 0x4f9adb4;
	bool SetFilmbackPresetOption(const class FString& NewFilmbackPreset)	 // 0x4f9af44;
	void SetFocusMethod(const EVirtualCameraFocusMethod NewFocusMethod)	 // 0x4f9b0f0;
	void SetFocusPlaneColor(const struct FColor& NewFocusPlaneColor)	 // 0x4f9b1f0;
	void SetFocusVisualization(bool bShowFocusVisualization)	 // 0x4f9b294;
	void SetInputSource(ETrackerInputSource InInputSource)	 // 0x4f9b4cc;
	bool SetMatteAspectRatio(const float NewMatteAspectRatio)	 // 0x4f9ba60;
	void SetMatteOpacity(const float NewMatteOpacity)	 // 0x4f9bb30;
	void SetMovementScale(const EVirtualCameraAxis AxisToAdjust, const float NewMovementScale)	 // 0x4f9bc00;
	void SetPresetFavoriteStatus(const class FString& PresetName, const bool bIsFavorite)	 // 0x4f9bd3c;
	void SetSaveSettingsWhenClosing(bool bShouldSettingsSave)	 // 0x4f9c060;
	void SetScreenshotFavoriteStatus(const class FString& ScreenshotName, const bool bIsFavorite)	 // 0x4f9c134;
	void SetSequencerLockedToCameraCut(bool bLockView)	 // 0x4bc8ec0;
	void SetTouchInputState(ETouchInputState NewInputState)	 // 0x4f9c364;
	void SetUseGlobalBoom(bool bShouldUseGlobalBoom)	 // 0x4f9c424;
	void SetWaypointFavoriteStatus(const class FString& WaypointName, const bool bIsFavorite)	 // 0x4f9c4f8;
	void SetZeroDutchOnLock(const bool bInValue)	 // 0x4f9c66c;
	bool ShouldSaveSettingsWhenClosing()	 // 0x4f9c740;
	void StopLevelSequencePlay()	 // 0x17c7f2c;
	class FString TakeScreenshot()	 // 0x4f9c7a4;
	void TeleportToHomeWaypoint()	 // 0x4f9c808;
	bool TeleportToWaypoint(const class FString& WaypointIndex)	 // 0x4f9c854;
	bool ToggleAxisFreeze(const EVirtualCameraAxis AxisToToggle)	 // 0x4f9c940;
	bool ToggleAxisLock(const EVirtualCameraAxis AxisToToggle)	 // 0x4f9ca10;
	void UpdateFocusReticle(const struct FVector& NewReticleLocation)	 // 0xae1e64;

	class FString GetDistanceInDesiredUnits(const float InputDistance, const EUnit ConversionUnit) const	 // 0x4f990a4;
	bool IsFocusVisualizationActivated() const	 // 0x4f9a154;
	bool IsVirtualCameraControlledByRemoteSession() const	 // 0x4f9a234;
	bool ShouldUpdateTargetCameraTransform() const	 // 0x4f9c77c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraPlayerControllerBase">();
	}
	static class AVirtualCameraPlayerControllerBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVirtualCameraPlayerControllerBase>();
	}
};
static_assert(alignof(AVirtualCameraPlayerControllerBase) == 0x000008, "Wrong alignment on AVirtualCameraPlayerControllerBase");
static_assert(sizeof(AVirtualCameraPlayerControllerBase) == 0x000958, "Wrong size on AVirtualCameraPlayerControllerBase");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, InputSource) == 0x000880, "Member 'AVirtualCameraPlayerControllerBase::InputSource' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, LiveLinkTargetName) == 0x000884, "Member 'AVirtualCameraPlayerControllerBase::LiveLinkTargetName' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, TrackerPreOffset) == 0x000890, "Member 'AVirtualCameraPlayerControllerBase::TrackerPreOffset' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, TrackerPostOffset) == 0x0008C0, "Member 'AVirtualCameraPlayerControllerBase::TrackerPostOffset' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, TargetCameraActorClass) == 0x0008F0, "Member 'AVirtualCameraPlayerControllerBase::TargetCameraActorClass' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, RequiredSequencerRecorderCameraSettings) == 0x0008F8, "Member 'AVirtualCameraPlayerControllerBase::RequiredSequencerRecorderCameraSettings' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, OnOffsetReset) == 0x000908, "Member 'AVirtualCameraPlayerControllerBase::OnOffsetReset' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, RootActor) == 0x000918, "Member 'AVirtualCameraPlayerControllerBase::RootActor' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, LevelSequencePlaybackController) == 0x000940, "Member 'AVirtualCameraPlayerControllerBase::LevelSequencePlaybackController' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, TargetCameraActor) == 0x000948, "Member 'AVirtualCameraPlayerControllerBase::TargetCameraActor' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, bCachedIsVirtualCameraControlledByRemoteSession) == 0x000950, "Member 'AVirtualCameraPlayerControllerBase::bCachedIsVirtualCameraControlledByRemoteSession' has a wrong offset!");
static_assert(offsetof(AVirtualCameraPlayerControllerBase, bCachedShouldUpdateTargetCameraTransform) == 0x000951, "Member 'AVirtualCameraPlayerControllerBase::bCachedShouldUpdateTargetCameraTransform' has a wrong offset!");

// Class VirtualCamera.VirtualCameraSaveGame
// 0x01A8 (0x01D0 - 0x0028)
class UVirtualCameraSaveGame final : public USaveGame
{
public:
	TMap<class FString, struct FVirtualCameraWaypoint> Waypoints;                                    // 0x0028(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, struct FVirtualCameraScreenshot> Screenshots;                                // 0x0078(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 HomeWaypointName;                                  // 0x00C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVirtualCameraSettings                 CameraSettings;                                    // 0x00D8(0x0088)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, struct FVirtualCameraSettingsPreset> SettingsPresets;                        // 0x0160(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	class FString                                 SaveSlotName;                                      // 0x01B0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        UserIndex;                                         // 0x01C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WaypointIndex;                                     // 0x01C4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ScreenshotIndex;                                   // 0x01C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PresetIndex;                                       // 0x01CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraSaveGame">();
	}
	static class UVirtualCameraSaveGame* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraSaveGame>();
	}
};
static_assert(alignof(UVirtualCameraSaveGame) == 0x000008, "Wrong alignment on UVirtualCameraSaveGame");
static_assert(sizeof(UVirtualCameraSaveGame) == 0x0001D0, "Wrong size on UVirtualCameraSaveGame");
static_assert(offsetof(UVirtualCameraSaveGame, Waypoints) == 0x000028, "Member 'UVirtualCameraSaveGame::Waypoints' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, Screenshots) == 0x000078, "Member 'UVirtualCameraSaveGame::Screenshots' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, HomeWaypointName) == 0x0000C8, "Member 'UVirtualCameraSaveGame::HomeWaypointName' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, CameraSettings) == 0x0000D8, "Member 'UVirtualCameraSaveGame::CameraSettings' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, SettingsPresets) == 0x000160, "Member 'UVirtualCameraSaveGame::SettingsPresets' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, SaveSlotName) == 0x0001B0, "Member 'UVirtualCameraSaveGame::SaveSlotName' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, UserIndex) == 0x0001C0, "Member 'UVirtualCameraSaveGame::UserIndex' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, WaypointIndex) == 0x0001C4, "Member 'UVirtualCameraSaveGame::WaypointIndex' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, ScreenshotIndex) == 0x0001C8, "Member 'UVirtualCameraSaveGame::ScreenshotIndex' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSaveGame, PresetIndex) == 0x0001CC, "Member 'UVirtualCameraSaveGame::PresetIndex' has a wrong offset!");

// Class VirtualCamera.VirtualCameraSubsystem
// 0x0060 (0x0090 - 0x0030)
class UVirtualCameraSubsystem final : public UEngineSubsystem
{
public:
	class ULevelSequencePlaybackController*       SequencePlaybackController;                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStreamStartedDelegate;                           // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStreamStoppedDelegate;                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* SelectedActor)> OnSelectedAnyActorDelegate;          // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* SelectedActor)> OnSelectedActorInViewportDelegate;   // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TScriptInterface<class IVirtualCameraController> ActiveCameraController;                         // 0x0078(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetVirtualCameraController(TScriptInterface<class IVirtualCameraController> VirtualCamera)	 // 0x4fac75c;
	bool StartStreaming()	 // 0x4fac820;
	bool StopStreaming()	 // 0x4fac8ac;

	TScriptInterface<class IVirtualCameraController> GetVirtualCameraController() const	 // 0x4fac034;
	bool IsStreaming() const	 // 0x4fac060;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualCameraSubsystem">();
	}
	static class UVirtualCameraSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualCameraSubsystem>();
	}
};
static_assert(alignof(UVirtualCameraSubsystem) == 0x000008, "Wrong alignment on UVirtualCameraSubsystem");
static_assert(sizeof(UVirtualCameraSubsystem) == 0x000090, "Wrong size on UVirtualCameraSubsystem");
static_assert(offsetof(UVirtualCameraSubsystem, SequencePlaybackController) == 0x000030, "Member 'UVirtualCameraSubsystem::SequencePlaybackController' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSubsystem, OnStreamStartedDelegate) == 0x000038, "Member 'UVirtualCameraSubsystem::OnStreamStartedDelegate' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSubsystem, OnStreamStoppedDelegate) == 0x000048, "Member 'UVirtualCameraSubsystem::OnStreamStoppedDelegate' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSubsystem, OnSelectedAnyActorDelegate) == 0x000058, "Member 'UVirtualCameraSubsystem::OnSelectedAnyActorDelegate' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSubsystem, OnSelectedActorInViewportDelegate) == 0x000068, "Member 'UVirtualCameraSubsystem::OnSelectedActorInViewportDelegate' has a wrong offset!");
static_assert(offsetof(UVirtualCameraSubsystem, ActiveCameraController) == 0x000078, "Member 'UVirtualCameraSubsystem::ActiveCameraController' has a wrong offset!");

// Class VirtualCamera.VirtualCameraUserSettings
// 0x0078 (0x00A0 - 0x0028)
class UVirtualCameraUserSettings final : public UObject
{
public:
	float                                         FocusInterpSpeed;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JoysticksSpeed;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
