#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VPBookmark

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "VPBookmark_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VPBookmark.VPBookmarkProvider
// 0x0000 (0x0000 - 0x0000)
class IVPBookmarkProvider final
{
public:
	void GenerateBookmarkName()	 // 0x4a8c26c;
	void HideBookmarkSplineMeshIndicator()	 // 0x4fc1224;
	void OnBookmarkActivation(class UVPBookmark* BookMark, bool bActivate)	 // 0x71e1a68;
	void OnBookmarkChanged(class UVPBookmark* BookMark)	 // 0x71e1bac;
	void UpdateBookmarkSplineMeshIndicator()	 // 0x4e809c8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBookmarkProvider">();
	}
	static class IVPBookmarkProvider* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVPBookmarkProvider>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVPBookmarkProvider) == 0x000001, "Wrong alignment on IVPBookmarkProvider");
static_assert(sizeof(IVPBookmarkProvider) == 0x000001, "Wrong size on IVPBookmarkProvider");

// Class VPBookmark.VPBookmark
// 0x0080 (0x00A8 - 0x0028)
class UVPBookmark final : public UBookmarkBase
{
public:
	bool                                          bIsActive;                                         // 0x0028(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TLazyObjectPtr<class AActor>                  OwnedActor;                                        // 0x002C(0x001C)(IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVPBookmarkCreationContext             CreationContext;                                   // 0x0048(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FVPBookmarkViewportData                CachedViewportData;                                // 0x0070(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	class AActor* GetAssociatedBookmarkActor() const	 // 0x71e19cc;
	int32 GetBookmarkIndex() const	 // 0x71e19f0;
	class FText GetDisplayName() const	 // 0x71e1a14;
	bool IsActive() const	 // 0x46a6c4c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBookmark">();
	}
	static class UVPBookmark* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPBookmark>();
	}
};
static_assert(alignof(UVPBookmark) == 0x000008, "Wrong alignment on UVPBookmark");
static_assert(sizeof(UVPBookmark) == 0x0000A8, "Wrong size on UVPBookmark");
static_assert(offsetof(UVPBookmark, bIsActive) == 0x000028, "Member 'UVPBookmark::bIsActive' has a wrong offset!");
static_assert(offsetof(UVPBookmark, OwnedActor) == 0x00002C, "Member 'UVPBookmark::OwnedActor' has a wrong offset!");
static_assert(offsetof(UVPBookmark, CreationContext) == 0x000048, "Member 'UVPBookmark::CreationContext' has a wrong offset!");
static_assert(offsetof(UVPBookmark, CachedViewportData) == 0x000070, "Member 'UVPBookmark::CachedViewportData' has a wrong offset!");

// Class VPBookmark.VPBookmarkBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UVPBookmarkBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CreateVPBookmarkName(class AActor* BookMark, const class FString& FormatString, class FString* GeneratedNumber, class FString* GeneratedLetter)	 // 0x71e138c;
	static class UVPBookmark* FindVPBookmark(const class AActor* Actor)	 // 0x71e15a4;
	static void GetAllVPBookmark(const class UObject* WorldContextObject, TArray<class UVPBookmark*>* OutBookmarks)	 // 0x71e178c;
	static void GetAllVPBookmarkActors(const class UObject* WorldContextObject, TArray<class AActor*>* OutActors)	 // 0x71e18ac;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBookmarkBlueprintLibrary">();
	}
	static class UVPBookmarkBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPBookmarkBlueprintLibrary>();
	}
};
static_assert(alignof(UVPBookmarkBlueprintLibrary) == 0x000008, "Wrong alignment on UVPBookmarkBlueprintLibrary");
static_assert(sizeof(UVPBookmarkBlueprintLibrary) == 0x000028, "Wrong size on UVPBookmarkBlueprintLibrary");

}

