#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VPRoles

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VPRoles.VPRolesUserSettings
// 0x0080 (0x00A8 - 0x0028)
class UVPRolesUserSettings final : public UObject
{
public:
	struct FGameplayTagContainer                  Roles;                                             // 0x0028(0x0020)(Config, NativeAccessSpecifierPrivate)
	TSet<class FName>                             RoleSources;                                       // 0x0048(0x0050)(Config, NativeAccessSpecifierPrivate)
	TArray<class FString>                         CachedRoles;                                       // 0x0098(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPRolesUserSettings">();
	}
	static class UVPRolesUserSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPRolesUserSettings>();
	}
};
static_assert(alignof(UVPRolesUserSettings) == 0x000008, "Wrong alignment on UVPRolesUserSettings");
static_assert(sizeof(UVPRolesUserSettings) == 0x0000A8, "Wrong size on UVPRolesUserSettings");
static_assert(offsetof(UVPRolesUserSettings, Roles) == 0x000028, "Member 'UVPRolesUserSettings::Roles' has a wrong offset!");
static_assert(offsetof(UVPRolesUserSettings, RoleSources) == 0x000048, "Member 'UVPRolesUserSettings::RoleSources' has a wrong offset!");
static_assert(offsetof(UVPRolesUserSettings, CachedRoles) == 0x000098, "Member 'UVPRolesUserSettings::CachedRoles' has a wrong offset!");

// Class VPRoles.VirtualProductionRolesSubsystem
// 0x0038 (0x0068 - 0x0030)
class UVirtualProductionRolesSubsystem final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void(const TArray<class FString>& EnabledRoles)> OnRolesChangedBP;      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetActiveRoles(const TArray<class FString>& Roles)	 // 0x504ac80;

	TArray<class FString> GetActiveRoles() const	 // 0x504aa2c;
	class FString GetActiveRolesString() const	 // 0x504aa68;
	TArray<class FString> GetAllRoles() const	 // 0x504aab4;
	bool HasActiveRole(const class FString& Role) const	 // 0x504aba0;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VirtualProductionRolesSubsystem">();
	}
	static class UVirtualProductionRolesSubsystem* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVirtualProductionRolesSubsystem>();
	}
};
static_assert(alignof(UVirtualProductionRolesSubsystem) == 0x000008, "Wrong alignment on UVirtualProductionRolesSubsystem");
static_assert(sizeof(UVirtualProductionRolesSubsystem) == 0x000068, "Wrong size on UVirtualProductionRolesSubsystem");
static_assert(offsetof(UVirtualProductionRolesSubsystem, OnRolesChangedBP) == 0x000030, "Member 'UVirtualProductionRolesSubsystem::OnRolesChangedBP' has a wrong offset!");

}

