#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VPUtilities

#include "Basic.hpp"

#include "TimeManagement_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VPUtilities_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VPUtilities.VPContextMenuProvider
// 0x0000 (0x0000 - 0x0000)
class IVPContextMenuProvider final
{
public:
	void OnCreateContextMenu()	 // 0x4a8c26c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPContextMenuProvider">();
	}
	static class IVPContextMenuProvider* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVPContextMenuProvider>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVPContextMenuProvider) == 0x000001, "Wrong alignment on IVPContextMenuProvider");
static_assert(sizeof(IVPContextMenuProvider) == 0x000001, "Wrong size on IVPContextMenuProvider");

// Class VPUtilities.VPInteraction
// 0x0000 (0x0000 - 0x0000)
class IVPInteraction final
{
public:
	void OnActorDroppedFromCarry()	 // 0x4e809c8;
	void OnActorDroppedFromTransform()	 // 0x4a8c26c;
	void OnActorSelectedForTransform()	 // 0x4fc1224;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPInteraction">();
	}
	static class IVPInteraction* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<IVPInteraction>();
	}

	class UObject* AsUObject()	 // 0x0
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const	 // 0x0
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IVPInteraction) == 0x000001, "Wrong alignment on IVPInteraction");
static_assert(sizeof(IVPInteraction) == 0x000001, "Wrong size on IVPInteraction");

// Class VPUtilities.VPBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UVPBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool EditorDeleteSelectedObjects()	 // 0x1645584;
	static bool EditorDuplicate()	 // 0x1645584;
	static bool EditorRedo()	 // 0x1645584;
	static bool EditorUndo()	 // 0x1645584;
	static struct FTransform GetEditorViewportTransform()	 // 0x4fc10b0;
	static struct FTransform GetEditorVRHeadTransform()	 // 0x4fc1058;
	static struct FTransform GetEditorVRRoomTransform()	 // 0x4fc1058;
	static class UWorld* GetEditorWorld()	 // 0x3fa3450;
	static struct FGameplayTagContainer GetVirtualProductionRole()	 // 0x4fc1178;
	static struct FVector GetVREditorLaserHoverLocation()	 // 0x4fc1144;
	static bool IsVREditorModeActive()	 // 0x1645584;
	static bool JumpToBookmarkInLevelEditor(const class UVPBookmark* BookMark)	 // 0x4f93f2c;
	static void Refresh3DEditorViewport()	 // 0x17c7f2c;
	static void SetGrabSpeed(const float Speed)	 // 0x4fc1460;
	static class AActor* SpawnBookmarkAtCurrentLevelEditorPosition(const TSubclassOf<class AActor> ActorClass, const struct FVPBookmarkCreationContext& CreationContext, const struct FVector& Offset, const bool bFlattenRotation)	 // 0x4fc1514;
	static class AVPViewportTickableActorBase* SpawnVPTickableActor(class UObject* ContextObject, const TSubclassOf<class AVPViewportTickableActorBase> ActorClass, const struct FVector& Location, const struct FRotator& Rotation)	 // 0x4fc2194;
	static void VPBookmarkSplineMeshIndicatorDisable(class USplineMeshComponent* SplineMesh)	 // 0x4fc24d4;
	static void VPBookmarkSplineMeshIndicatorSetStartAndEnd(class USplineMeshComponent* SplineMesh)	 // 0x4fc258c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBlueprintLibrary">();
	}
	static class UVPBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPBlueprintLibrary>();
	}
};
static_assert(alignof(UVPBlueprintLibrary) == 0x000008, "Wrong alignment on UVPBlueprintLibrary");
static_assert(sizeof(UVPBlueprintLibrary) == 0x000028, "Wrong size on UVPBlueprintLibrary");

// Class VPUtilities.VPViewportTickableActorBase
// 0x0008 (0x02B8 - 0x02B0)
class AVPViewportTickableActorBase : public AActor
{
public:
	EVPViewportTickableFlags                      ViewportTickType;                                  // 0x02B0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EditorDestroyed()	 // 0x12e6ef8;
	void EditorLockLocation(bool bSetLockLocation)	 // 0x4bc8ec0;
	void EditorTick(float DeltaSeconds)	 // 0x4fc0b00;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPViewportTickableActorBase">();
	}
	static class AVPViewportTickableActorBase* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVPViewportTickableActorBase>();
	}
};
static_assert(alignof(AVPViewportTickableActorBase) == 0x000008, "Wrong alignment on AVPViewportTickableActorBase");
static_assert(sizeof(AVPViewportTickableActorBase) == 0x0002B8, "Wrong size on AVPViewportTickableActorBase");
static_assert(offsetof(AVPViewportTickableActorBase, ViewportTickType) == 0x0002B0, "Member 'AVPViewportTickableActorBase::ViewportTickType' has a wrong offset!");

// Class VPUtilities.VPBookmarkActor
// 0x00B0 (0x0368 - 0x02B8)
class AVPBookmarkActor final : public AVPViewportTickableActorBase
{
public:
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   BookmarkMeshComponent;                             // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextRenderComponent*                   NameTextRenderComponent;                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineMeshComponent*                   SplineMeshComponent;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCineCameraComponent*                   CameraComponent;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BookmarkColor;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVPBookmark*                            BookmarkObject;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHome;                                            // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             SnapshotTexture;                                   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     BookmarkMaterial;                                  // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x18];                                     // 0x0320(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BookmarkStaticMesh;                                // 0x0338(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterial*                              TextMaterial;                                      // 0x0340(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMesh*                            SplineStaticMesh;                                  // 0x0348(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     SplineMaterial;                                    // 0x0350(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     SplineMaterialInstance;                            // 0x0358(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     LabelMaterialInstance;                             // 0x0360(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void GenerateBookmarkName_Implementation()	 // 0x4fc0bc8;
	void HideBookmarkSplineMeshIndicator_Implementation()	 // 0x4fc11d0;
	void OnActorDroppedFromCarry_Implementation()	 // 0x4fc11ec;
	void OnActorDroppedFromTransform_Implementation()	 // 0x4fc1208;
	void OnActorSelectedForTransform_Implementation()	 // 0x4fc1238;
	void OnBookmarkActivation_Implementation(class UVPBookmark* BookMark, bool bActivate)	 // 0x4fc1254;
	void OnBookmarkChanged_Implementation(class UVPBookmark* BookMark)	 // 0x4fc1398;
	void UpdateBookmarkColor(const struct FLinearColor& Color)	 // 0x4fc23f0;
	void UpdateBookmarkSplineMeshIndicator_Implementation()	 // 0x4fc24b8;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBookmarkActor">();
	}
	static class AVPBookmarkActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVPBookmarkActor>();
	}
};
static_assert(alignof(AVPBookmarkActor) == 0x000008, "Wrong alignment on AVPBookmarkActor");
static_assert(sizeof(AVPBookmarkActor) == 0x000368, "Wrong size on AVPBookmarkActor");
static_assert(offsetof(AVPBookmarkActor, BookmarkMeshComponent) == 0x0002C8, "Member 'AVPBookmarkActor::BookmarkMeshComponent' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, NameTextRenderComponent) == 0x0002D0, "Member 'AVPBookmarkActor::NameTextRenderComponent' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, SplineMeshComponent) == 0x0002D8, "Member 'AVPBookmarkActor::SplineMeshComponent' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, CameraComponent) == 0x0002E0, "Member 'AVPBookmarkActor::CameraComponent' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, BookmarkColor) == 0x0002E8, "Member 'AVPBookmarkActor::BookmarkColor' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, BookmarkObject) == 0x0002F8, "Member 'AVPBookmarkActor::BookmarkObject' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, IsHome) == 0x000300, "Member 'AVPBookmarkActor::IsHome' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, SnapshotTexture) == 0x000308, "Member 'AVPBookmarkActor::SnapshotTexture' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, DynamicMaterial) == 0x000310, "Member 'AVPBookmarkActor::DynamicMaterial' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, BookmarkMaterial) == 0x000318, "Member 'AVPBookmarkActor::BookmarkMaterial' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, BookmarkStaticMesh) == 0x000338, "Member 'AVPBookmarkActor::BookmarkStaticMesh' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, TextMaterial) == 0x000340, "Member 'AVPBookmarkActor::TextMaterial' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, SplineStaticMesh) == 0x000348, "Member 'AVPBookmarkActor::SplineStaticMesh' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, SplineMaterial) == 0x000350, "Member 'AVPBookmarkActor::SplineMaterial' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, SplineMaterialInstance) == 0x000358, "Member 'AVPBookmarkActor::SplineMaterialInstance' has a wrong offset!");
static_assert(offsetof(AVPBookmarkActor, LabelMaterialInstance) == 0x000360, "Member 'AVPBookmarkActor::LabelMaterialInstance' has a wrong offset!");

// Class VPUtilities.VPBookmarkSettings
// 0x00A0 (0x00C8 - 0x0028)
class UVPBookmarkSettings final : public UObject
{
public:
	struct FSoftObjectPath                        BookmarkMeshPath;                                  // 0x0028(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BookmarkMaterialPath;                              // 0x0048(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BookmarkSplineMeshPath;                            // 0x0068(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BookmarkSplineMeshMaterialPath;                    // 0x0088(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BookmarkLabelMaterialPath;                         // 0x00A8(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPBookmarkSettings">();
	}
	static class UVPBookmarkSettings* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPBookmarkSettings>();
	}
};
static_assert(alignof(UVPBookmarkSettings) == 0x000008, "Wrong alignment on UVPBookmarkSettings");
static_assert(sizeof(UVPBookmarkSettings) == 0x0000C8, "Wrong size on UVPBookmarkSettings");
static_assert(offsetof(UVPBookmarkSettings, BookmarkMeshPath) == 0x000028, "Member 'UVPBookmarkSettings::BookmarkMeshPath' has a wrong offset!");
static_assert(offsetof(UVPBookmarkSettings, BookmarkMaterialPath) == 0x000048, "Member 'UVPBookmarkSettings::BookmarkMaterialPath' has a wrong offset!");
static_assert(offsetof(UVPBookmarkSettings, BookmarkSplineMeshPath) == 0x000068, "Member 'UVPBookmarkSettings::BookmarkSplineMeshPath' has a wrong offset!");
static_assert(offsetof(UVPBookmarkSettings, BookmarkSplineMeshMaterialPath) == 0x000088, "Member 'UVPBookmarkSettings::BookmarkSplineMeshMaterialPath' has a wrong offset!");
static_assert(offsetof(UVPBookmarkSettings, BookmarkLabelMaterialPath) == 0x0000A8, "Member 'UVPBookmarkSettings::BookmarkLabelMaterialPath' has a wrong offset!");

// Class VPUtilities.VPCameraBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UVPCameraBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class ACameraRig_Rail* SpawnCameraRigFromActors(class UObject* WorldContextObject, const struct FTransform& RigTransform, const TArray<class AActor*>& Actors, const struct FVPCameraRigSpawnParams& Params_0)	 // 0x4fc1794;
	static class ACameraRig_Rail* SpawnCameraRigFromPoints(class UObject* WorldContextObject, const struct FTransform& RigTransform, const TArray<struct FVector>& Points, const struct FVPCameraRigSpawnParams& Params_0)	 // 0x4fc19c4;
	static class ACameraRig_Rail* SpawnCameraRigFromSelectedActors(class UObject* WorldContextObject, const struct FTransform& RigTransform, const struct FVPCameraRigSpawnParams& Params_0)	 // 0x4fc1bf4;
	static class ACameraRig_Rail* SpawnDollyTrackFromPoints(class UObject* WorldContextObject, const TArray<struct FTransform>& Points, ESplinePointType InterpType)	 // 0x4fc1d9c;
	static class ACameraRig_Rail* SpawnDollyTrackFromPointsSmooth(class UObject* WorldContextObject, const TArray<struct FTransform>& Points, ESplinePointType InterpType)	 // 0x4fc1f98;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPCameraBlueprintLibrary">();
	}
	static class UVPCameraBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPCameraBlueprintLibrary>();
	}
};
static_assert(alignof(UVPCameraBlueprintLibrary) == 0x000008, "Wrong alignment on UVPCameraBlueprintLibrary");
static_assert(sizeof(UVPCameraBlueprintLibrary) == 0x000028, "Wrong size on UVPCameraBlueprintLibrary");

// Class VPUtilities.VPFullScreenUserWidget
// 0x00F0 (0x0118 - 0x0028)
class UVPFullScreenUserWidget final : public UObject
{
public:
	EVPWidgetDisplayType                          EditorDisplayType;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVPWidgetDisplayType                          GameDisplayType;                                   // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVPWidgetDisplayType                          PIEDisplayType;                                    // 0x002A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVPFullScreenUserWidget_Viewport       ViewportDisplayType;                               // 0x0030(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVPFullScreenUserWidget_PostProcess    PostProcessDisplayType;                            // 0x0048(0x00B8)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UUserWidget*                            Widget;                                            // 0x0100(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPFullScreenUserWidget">();
	}
	static class UVPFullScreenUserWidget* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPFullScreenUserWidget>();
	}
};
static_assert(alignof(UVPFullScreenUserWidget) == 0x000008, "Wrong alignment on UVPFullScreenUserWidget");
static_assert(sizeof(UVPFullScreenUserWidget) == 0x000118, "Wrong size on UVPFullScreenUserWidget");
static_assert(offsetof(UVPFullScreenUserWidget, EditorDisplayType) == 0x000028, "Member 'UVPFullScreenUserWidget::EditorDisplayType' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, GameDisplayType) == 0x000029, "Member 'UVPFullScreenUserWidget::GameDisplayType' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, PIEDisplayType) == 0x00002A, "Member 'UVPFullScreenUserWidget::PIEDisplayType' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, ViewportDisplayType) == 0x000030, "Member 'UVPFullScreenUserWidget::ViewportDisplayType' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, WidgetClass) == 0x000040, "Member 'UVPFullScreenUserWidget::WidgetClass' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, PostProcessDisplayType) == 0x000048, "Member 'UVPFullScreenUserWidget::PostProcessDisplayType' has a wrong offset!");
static_assert(offsetof(UVPFullScreenUserWidget, Widget) == 0x000100, "Member 'UVPFullScreenUserWidget::Widget' has a wrong offset!");

// Class VPUtilities.FullScreenUserWidgetActor
// 0x0008 (0x02B8 - 0x02B0)
class AFullScreenUserWidgetActor final : public AInfo
{
public:
	class UVPFullScreenUserWidget*                ScreenUserWidget;                                  // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoClear, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"FullScreenUserWidgetActor">();
	}
	static class AFullScreenUserWidgetActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AFullScreenUserWidgetActor>();
	}
};
static_assert(alignof(AFullScreenUserWidgetActor) == 0x000008, "Wrong alignment on AFullScreenUserWidgetActor");
static_assert(sizeof(AFullScreenUserWidgetActor) == 0x0002B8, "Wrong size on AFullScreenUserWidgetActor");
static_assert(offsetof(AFullScreenUserWidgetActor, ScreenUserWidget) == 0x0002B0, "Member 'AFullScreenUserWidgetActor::ScreenUserWidget' has a wrong offset!");

// Class VPUtilities.VPGameMode
// 0x0008 (0x03A0 - 0x0398)
class AVPGameMode final : public AGameMode
{
public:
	class AVPRootActor*                           RootActor;                                         // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class AVPRootActor* GetRootActor() const	 // 0x4fc112c;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPGameMode">();
	}
	static class AVPGameMode* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVPGameMode>();
	}
};
static_assert(alignof(AVPGameMode) == 0x000008, "Wrong alignment on AVPGameMode");
static_assert(sizeof(AVPGameMode) == 0x0003A0, "Wrong size on AVPGameMode");
static_assert(offsetof(AVPGameMode, RootActor) == 0x000398, "Member 'AVPGameMode::RootActor' has a wrong offset!");

// Class VPUtilities.VPRenderingBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UVPRenderingBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GenerateSceneViewExtensionIsActiveFunctorForViewportType(struct FSceneViewExtensionIsActiveFunctor* OutIsActiveFunction, bool bPIE, bool bSIE, bool bEditorActive, bool bGamePrimary)	 // 0x4fc0be4;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPRenderingBlueprintLibrary">();
	}
	static class UVPRenderingBlueprintLibrary* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPRenderingBlueprintLibrary>();
	}
};
static_assert(alignof(UVPRenderingBlueprintLibrary) == 0x000008, "Wrong alignment on UVPRenderingBlueprintLibrary");
static_assert(sizeof(UVPRenderingBlueprintLibrary) == 0x000028, "Wrong size on UVPRenderingBlueprintLibrary");

// Class VPUtilities.VPRootActor
// 0x0018 (0x02C8 - 0x02B0)
class AVPRootActor final : public AActor
{
public:
	class UMeshComponent*                         RealWorldSceneRepresentation;                      // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACineCameraActor*                       CinematicCamera;                                   // 0x02B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAreComponentsVisible;                             // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ACineCameraActor* GetCineCameraActor() const	 // 0x16a0090;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPRootActor">();
	}
	static class AVPRootActor* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<AVPRootActor>();
	}
};
static_assert(alignof(AVPRootActor) == 0x000008, "Wrong alignment on AVPRootActor");
static_assert(sizeof(AVPRootActor) == 0x0002C8, "Wrong size on AVPRootActor");
static_assert(offsetof(AVPRootActor, RealWorldSceneRepresentation) == 0x0002B0, "Member 'AVPRootActor::RealWorldSceneRepresentation' has a wrong offset!");
static_assert(offsetof(AVPRootActor, CinematicCamera) == 0x0002B8, "Member 'AVPRootActor::CinematicCamera' has a wrong offset!");
static_assert(offsetof(AVPRootActor, bAreComponentsVisible) == 0x0002C0, "Member 'AVPRootActor::bAreComponentsVisible' has a wrong offset!");

// Class VPUtilities.VPWorldAssetUserData
// 0x0020 (0x0048 - 0x0028)
class UVPWorldAssetUserData final : public UAssetUserData
{
public:
	TLazyObjectPtr<class AVPRootActor>            LastSelectedRootActor;                             // 0x0028(0x001C)(Edit, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPWorldAssetUserData">();
	}
	static class UVPWorldAssetUserData* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPWorldAssetUserData>();
	}
};
static_assert(alignof(UVPWorldAssetUserData) == 0x000008, "Wrong alignment on UVPWorldAssetUserData");
static_assert(sizeof(UVPWorldAssetUserData) == 0x000048, "Wrong size on UVPWorldAssetUserData");
static_assert(offsetof(UVPWorldAssetUserData, LastSelectedRootActor) == 0x000028, "Member 'UVPWorldAssetUserData::LastSelectedRootActor' has a wrong offset!");

// Class VPUtilities.VPTimecodeCustomTimeStep
// 0x0038 (0x0060 - 0x0028)
class UVPTimecodeCustomTimeStep final : public UFixedFrameRateCustomTimeStep
{
public:
	bool                                          bErrorIfFrameAreNotConsecutive;                    // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bErrorIfTimecodeProviderChanged;                   // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDeltaTime;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticClassImpl<"VPTimecodeCustomTimeStep">();
	}
	static class UVPTimecodeCustomTimeStep* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UVPTimecodeCustomTimeStep>();
	}
};
static_assert(alignof(UVPTimecodeCustomTimeStep) == 0x000008, "Wrong alignment on UVPTimecodeCustomTimeStep");
static_assert(sizeof(UVPTimecodeCustomTimeStep) == 0x000060, "Wrong size on UVPTimecodeCustomTimeStep");
static_assert(offsetof(UVPTimecodeCustomTimeStep, bErrorIfFrameAreNotConsecutive) == 0x000028, "Member 'UVPTimecodeCustomTimeStep::bErrorIfFrameAreNotConsecutive' has a wrong offset!");
static_assert(offsetof(UVPTimecodeCustomTimeStep, bErrorIfTimecodeProviderChanged) == 0x000029, "Member 'UVPTimecodeCustomTimeStep::bErrorIfTimecodeProviderChanged' has a wrong offset!");
static_assert(offsetof(UVPTimecodeCustomTimeStep, MaxDeltaTime) == 0x00002C, "Member 'UVPTimecodeCustomTimeStep::MaxDeltaTime' has a wrong offset!");

}

