#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ActiveContract_ListWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ActiveContract_ListWidget.W_ActiveContract_ListWidget_C
// 0x0048 (0x0308 - 0x02C0)
class UW_ActiveContract_ListWidget_C final : public UP2ActiveContractListWidget
{
public:
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_1;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_2;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_3;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_4;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_5;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_6;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_7;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Plsd_Contract_ItemWidget_C*          W_Plsd_Contract_ItemWidget_8;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ActiveContract_ListWidget_C">();
	}
	static class UW_ActiveContract_ListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ActiveContract_ListWidget_C>();
	}
};
static_assert(alignof(UW_ActiveContract_ListWidget_C) == 0x000008, "Wrong alignment on UW_ActiveContract_ListWidget_C");
static_assert(sizeof(UW_ActiveContract_ListWidget_C) == 0x000308, "Wrong size on UW_ActiveContract_ListWidget_C");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget) == 0x0002C0, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_1) == 0x0002C8, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_2) == 0x0002D0, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_3) == 0x0002D8, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_4) == 0x0002E0, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_5) == 0x0002E8, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_5' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_6) == 0x0002F0, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_6' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_7) == 0x0002F8, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_7' has a wrong offset!");
static_assert(offsetof(UW_ActiveContract_ListWidget_C, W_Plsd_Contract_ItemWidget_8) == 0x000300, "Member 'UW_ActiveContract_ListWidget_C::W_Plsd_Contract_ItemWidget_8' has a wrong offset!");

}

