#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AdminSpectatorOption

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_AdminSpectatorOption.W_AdminSpectatorOption_C
// 0x0020 (0x02E0 - 0x02C0)
class UW_AdminSpectatorOption_C final : public UP2AdminSpectatorOption
{
public:
	class UP2Button*                              Btn_Slider;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_432;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_SettingSlider;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Slider*                              Sldr_SettingSlider;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_AdminSpectatorOption_C">();
	}
	static class UW_AdminSpectatorOption_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_AdminSpectatorOption_C>();
	}
};
static_assert(alignof(UW_AdminSpectatorOption_C) == 0x000008, "Wrong alignment on UW_AdminSpectatorOption_C");
static_assert(sizeof(UW_AdminSpectatorOption_C) == 0x0002E0, "Wrong size on UW_AdminSpectatorOption_C");
static_assert(offsetof(UW_AdminSpectatorOption_C, Btn_Slider) == 0x0002C0, "Member 'UW_AdminSpectatorOption_C::Btn_Slider' has a wrong offset!");
static_assert(offsetof(UW_AdminSpectatorOption_C, Image_432) == 0x0002C8, "Member 'UW_AdminSpectatorOption_C::Image_432' has a wrong offset!");
static_assert(offsetof(UW_AdminSpectatorOption_C, PB_SettingSlider) == 0x0002D0, "Member 'UW_AdminSpectatorOption_C::PB_SettingSlider' has a wrong offset!");
static_assert(offsetof(UW_AdminSpectatorOption_C, Sldr_SettingSlider) == 0x0002D8, "Member 'UW_AdminSpectatorOption_C::Sldr_SettingSlider' has a wrong offset!");

}

