#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AUV_Seat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_AUV_Seat.W_AUV_Seat_C.ExecuteUbergraph_W_AUV_Seat
// 0x0040 (0x0040 - 0x0000)
struct W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsTaken;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0018(0x0018)()
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat) == 0x000008, "Wrong alignment on W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat");
static_assert(sizeof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat) == 0x000040, "Wrong size on W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, EntryPoint) == 0x000000, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, K2Node_CustomEvent_IsTaken) == 0x000011, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::K2Node_CustomEvent_IsTaken' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, K2Node_CustomEvent_Name) == 0x000018, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000030, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'W_AUV_Seat_C_ExecuteUbergraph_W_AUV_Seat::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function W_AUV_Seat.W_AUV_Seat_C.GetColorAndOpacity
// 0x0014 (0x0014 - 0x0000)
struct W_AUV_Seat_C_GetColorAndOpacity final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(W_AUV_Seat_C_GetColorAndOpacity) == 0x000004, "Wrong alignment on W_AUV_Seat_C_GetColorAndOpacity");
static_assert(sizeof(W_AUV_Seat_C_GetColorAndOpacity) == 0x000014, "Wrong size on W_AUV_Seat_C_GetColorAndOpacity");
static_assert(offsetof(W_AUV_Seat_C_GetColorAndOpacity, ReturnValue) == 0x000000, "Member 'W_AUV_Seat_C_GetColorAndOpacity::ReturnValue' has a wrong offset!");

// Function W_AUV_Seat.W_AUV_Seat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_AUV_Seat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AUV_Seat_C_PreConstruct) == 0x000001, "Wrong alignment on W_AUV_Seat_C_PreConstruct");
static_assert(sizeof(W_AUV_Seat_C_PreConstruct) == 0x000001, "Wrong size on W_AUV_Seat_C_PreConstruct");
static_assert(offsetof(W_AUV_Seat_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_AUV_Seat_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_AUV_Seat.W_AUV_Seat_C.SetIsTaken
// 0x0020 (0x0020 - 0x0000)
struct W_AUV_Seat_C_SetIsTaken final
{
public:
	bool                                          IsTaken;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_AUV_Seat_C_SetIsTaken) == 0x000008, "Wrong alignment on W_AUV_Seat_C_SetIsTaken");
static_assert(sizeof(W_AUV_Seat_C_SetIsTaken) == 0x000020, "Wrong size on W_AUV_Seat_C_SetIsTaken");
static_assert(offsetof(W_AUV_Seat_C_SetIsTaken, IsTaken) == 0x000000, "Member 'W_AUV_Seat_C_SetIsTaken::IsTaken' has a wrong offset!");
static_assert(offsetof(W_AUV_Seat_C_SetIsTaken, Name_0) == 0x000008, "Member 'W_AUV_Seat_C_SetIsTaken::Name_0' has a wrong offset!");

}

