#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_AUV_ExtractionScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_AUV_ExtractionScreen.W_AUV_ExtractionScreen_C.ExecuteUbergraph_W_AUV_ExtractionScreen
// 0x0040 (0x0040 - 0x0000)
struct W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SeatIndex;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsOccupied;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerName;                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen) == 0x000008, "Wrong alignment on W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen");
static_assert(sizeof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen) == 0x000040, "Wrong size on W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, EntryPoint) == 0x000000, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, K2Node_Event_SeatIndex) == 0x000004, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::K2Node_Event_SeatIndex' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, K2Node_Event_bIsOccupied) == 0x000008, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::K2Node_Event_bIsOccupied' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, K2Node_Event_PlayerName) == 0x000010, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::K2Node_Event_PlayerName' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'W_AUV_ExtractionScreen_C_ExecuteUbergraph_W_AUV_ExtractionScreen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_AUV_ExtractionScreen.W_AUV_ExtractionScreen_C.SetSeatStatus
// 0x0018 (0x0018 - 0x0000)
struct W_AUV_ExtractionScreen_C_SetSeatStatus final
{
public:
	int32                                         SeatIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOccupied;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerName;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_AUV_ExtractionScreen_C_SetSeatStatus) == 0x000008, "Wrong alignment on W_AUV_ExtractionScreen_C_SetSeatStatus");
static_assert(sizeof(W_AUV_ExtractionScreen_C_SetSeatStatus) == 0x000018, "Wrong size on W_AUV_ExtractionScreen_C_SetSeatStatus");
static_assert(offsetof(W_AUV_ExtractionScreen_C_SetSeatStatus, SeatIndex) == 0x000000, "Member 'W_AUV_ExtractionScreen_C_SetSeatStatus::SeatIndex' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_SetSeatStatus, bIsOccupied) == 0x000004, "Member 'W_AUV_ExtractionScreen_C_SetSeatStatus::bIsOccupied' has a wrong offset!");
static_assert(offsetof(W_AUV_ExtractionScreen_C_SetSeatStatus, PlayerName) == 0x000008, "Member 'W_AUV_ExtractionScreen_C_SetSeatStatus::PlayerName' has a wrong offset!");

}

