#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BasicInformation

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BasicInformation.W_BasicInformation_C
// 0x00D8 (0x0460 - 0x0388)
class UW_BasicInformation_C final : public UP2SelectBaseAppearance
{
public:
	class UW_KeybindWidget_C*                     KeyBind;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeybindWidget_C*                     KeyBind_1;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_1;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_2;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_3;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_4;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_5;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CategoryItem_C*                      W_CategoryItem_6;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_4;                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_9;                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_10;                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_11;                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_14;                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_15;                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_16;                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_17;                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_18;                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_19;                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_20;                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_21;                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_22;                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_23;                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_24;                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_25;                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_197;                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSelection_TileMin_C*        W_CharacterSelection_TileMin_327;                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_BasicInformation_C">();
	}
	static class UW_BasicInformation_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_BasicInformation_C>();
	}
};
static_assert(alignof(UW_BasicInformation_C) == 0x000008, "Wrong alignment on UW_BasicInformation_C");
static_assert(sizeof(UW_BasicInformation_C) == 0x000460, "Wrong size on UW_BasicInformation_C");
static_assert(offsetof(UW_BasicInformation_C, KeyBind) == 0x000388, "Member 'UW_BasicInformation_C::KeyBind' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, KeyBind_1) == 0x000390, "Member 'UW_BasicInformation_C::KeyBind_1' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem) == 0x000398, "Member 'UW_BasicInformation_C::W_CategoryItem' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_1) == 0x0003A0, "Member 'UW_BasicInformation_C::W_CategoryItem_1' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_2) == 0x0003A8, "Member 'UW_BasicInformation_C::W_CategoryItem_2' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_3) == 0x0003B0, "Member 'UW_BasicInformation_C::W_CategoryItem_3' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_4) == 0x0003B8, "Member 'UW_BasicInformation_C::W_CategoryItem_4' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_5) == 0x0003C0, "Member 'UW_BasicInformation_C::W_CategoryItem_5' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CategoryItem_6) == 0x0003C8, "Member 'UW_BasicInformation_C::W_CategoryItem_6' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_4) == 0x0003D0, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_4' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_9) == 0x0003D8, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_9' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_10) == 0x0003E0, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_10' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_11) == 0x0003E8, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_11' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_14) == 0x0003F0, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_14' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_15) == 0x0003F8, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_15' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_16) == 0x000400, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_16' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_17) == 0x000408, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_17' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_18) == 0x000410, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_18' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_19) == 0x000418, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_19' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_20) == 0x000420, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_20' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_21) == 0x000428, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_21' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_22) == 0x000430, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_22' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_23) == 0x000438, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_23' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_24) == 0x000440, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_24' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_25) == 0x000448, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_25' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_197) == 0x000450, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_197' has a wrong offset!");
static_assert(offsetof(UW_BasicInformation_C, W_CharacterSelection_TileMin_327) == 0x000458, "Member 'UW_BasicInformation_C::W_CharacterSelection_TileMin_327' has a wrong offset!");

}

