#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BuffProfile_Effect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BuffProfile_Effect.W_BuffProfile_Effect_C
// 0x0028 (0x03A0 - 0x0378)
class UW_BuffProfile_Effect_C final : public UP2AttributeEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   BuffEffectName;                                    // 0x0380(0x0018)(Edit, BlueprintVisible)
	double                                        BuffEffectValue;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_BuffProfile_Effect(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetEffectColor_Implementation(float InValue, EP2GameplayAttributeDesirableChange InDesirableChange)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_BuffProfile_Effect_C">();
	}
	static class UW_BuffProfile_Effect_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_BuffProfile_Effect_C>();
	}
};
static_assert(alignof(UW_BuffProfile_Effect_C) == 0x000008, "Wrong alignment on UW_BuffProfile_Effect_C");
static_assert(sizeof(UW_BuffProfile_Effect_C) == 0x0003A0, "Wrong size on UW_BuffProfile_Effect_C");
static_assert(offsetof(UW_BuffProfile_Effect_C, UberGraphFrame) == 0x000378, "Member 'UW_BuffProfile_Effect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BuffProfile_Effect_C, BuffEffectName) == 0x000380, "Member 'UW_BuffProfile_Effect_C::BuffEffectName' has a wrong offset!");
static_assert(offsetof(UW_BuffProfile_Effect_C, BuffEffectValue) == 0x000398, "Member 'UW_BuffProfile_Effect_C::BuffEffectValue' has a wrong offset!");

}

