#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BuffFacility

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_BuffFacility.W_BuffFacility_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_BuffFacility_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BuffFacility_C_PreConstruct) == 0x000001, "Wrong alignment on W_BuffFacility_C_PreConstruct");
static_assert(sizeof(W_BuffFacility_C_PreConstruct) == 0x000001, "Wrong size on W_BuffFacility_C_PreConstruct");
static_assert(offsetof(W_BuffFacility_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_BuffFacility_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_BuffFacility.W_BuffFacility_C.ExecuteUbergraph_W_BuffFacility
// 0x001C (0x001C - 0x0000)
struct W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExitWidget_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility) == 0x000004, "Wrong alignment on W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility");
static_assert(sizeof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility) == 0x00001C, "Wrong size on W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility");
static_assert(offsetof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility, EntryPoint) == 0x000000, "Member 'W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility, CallFunc_ExitWidget_ReturnValue) == 0x000004, "Member 'W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility::CallFunc_ExitWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_BuffFacility_C_ExecuteUbergraph_W_BuffFacility::K2Node_Event_IsDesignTime' has a wrong offset!");

}

