#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BuffFacility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BuffFacility.W_BuffFacility_C
// 0x0048 (0x05E8 - 0x05A0)
class UW_BuffFacility_C final : public UP2BuffFacilityWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Title_Line;                                    // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffFacility_Effect_C*               W_BuffFacility_Effect;                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffFacility_Effect_C*               W_BuffFacility_Effect_1;                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffFacility_Effect_C*               W_BuffFacility_Effect_2;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_KeyguideWidget;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   FacilityName;                                      // 0x05D0(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_BuffFacility(int32 EntryPoint)	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BackActionBtnClicked()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_BuffFacility_C">();
	}
	static class UW_BuffFacility_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_BuffFacility_C>();
	}
};
static_assert(alignof(UW_BuffFacility_C) == 0x000008, "Wrong alignment on UW_BuffFacility_C");
static_assert(sizeof(UW_BuffFacility_C) == 0x0005E8, "Wrong size on UW_BuffFacility_C");
static_assert(offsetof(UW_BuffFacility_C, UberGraphFrame) == 0x0005A0, "Member 'UW_BuffFacility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, Img_Title_Line) == 0x0005A8, "Member 'UW_BuffFacility_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, W_BuffFacility_Effect) == 0x0005B0, "Member 'UW_BuffFacility_C::W_BuffFacility_Effect' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, W_BuffFacility_Effect_1) == 0x0005B8, "Member 'UW_BuffFacility_C::W_BuffFacility_Effect_1' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, W_BuffFacility_Effect_2) == 0x0005C0, "Member 'UW_BuffFacility_C::W_BuffFacility_Effect_2' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, W_KeyguideWidget) == 0x0005C8, "Member 'UW_BuffFacility_C::W_KeyguideWidget' has a wrong offset!");
static_assert(offsetof(UW_BuffFacility_C, FacilityName) == 0x0005D0, "Member 'UW_BuffFacility_C::FacilityName' has a wrong offset!");

}

