#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CategoryItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_CategoryItem.W_CategoryItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CategoryItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_PreConstruct) == 0x000001, "Wrong alignment on W_CategoryItem_C_PreConstruct");
static_assert(sizeof(W_CategoryItem_C_PreConstruct) == 0x000001, "Wrong size on W_CategoryItem_C_PreConstruct");
static_assert(offsetof(W_CategoryItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CategoryItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Img_Underline_Accent_ColorAndOpacity
// 0x0044 (0x0044 - 0x0000)
struct W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity) == 0x000004, "Wrong alignment on W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity");
static_assert(sizeof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity) == 0x000044, "Wrong size on W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity");
static_assert(offsetof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity, Temp_bool_Variable) == 0x000010, "Member 'W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity, Temp_struct_Variable) == 0x000014, "Member 'W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity, Temp_struct_Variable_1) == 0x000024, "Member 'W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity, K2Node_Select_Default) == 0x000034, "Member 'W_CategoryItem_C_Get_Img_Underline_Accent_ColorAndOpacity::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Img_SlotDeco_L_Visibility
// 0x0005 (0x0005 - 0x0000)
struct W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility) == 0x000001, "Wrong alignment on W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility");
static_assert(sizeof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility) == 0x000005, "Wrong size on W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility");
static_assert(offsetof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility, Temp_bool_Variable) == 0x000001, "Member 'W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility, Temp_byte_Variable) == 0x000002, "Member 'W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility, K2Node_Select_Default) == 0x000004, "Member 'W_CategoryItem_C_Get_Img_SlotDeco_L_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Img_GradientBg_Visibility
// 0x0006 (0x0006 - 0x0000)
struct W_CategoryItem_C_Get_Img_GradientBg_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Img_GradientBg_Visibility) == 0x000001, "Wrong alignment on W_CategoryItem_C_Get_Img_GradientBg_Visibility");
static_assert(sizeof(W_CategoryItem_C_Get_Img_GradientBg_Visibility) == 0x000006, "Wrong size on W_CategoryItem_C_Get_Img_GradientBg_Visibility");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, Temp_bool_Variable) == 0x000001, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, Temp_byte_Variable) == 0x000002, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, CallFunc_IsHovered_ReturnValue) == 0x000004, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Img_GradientBg_Visibility, K2Node_Select_Default) == 0x000005, "Member 'W_CategoryItem_C_Get_Img_GradientBg_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_img_CategoryIcon_ColorAndOpacity
// 0x0044 (0x0044 - 0x0000)
struct W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity) == 0x000004, "Wrong alignment on W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity");
static_assert(sizeof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity) == 0x000044, "Wrong size on W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity");
static_assert(offsetof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity, Temp_bool_Variable) == 0x000010, "Member 'W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity, Temp_struct_Variable) == 0x000014, "Member 'W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity, Temp_struct_Variable_1) == 0x000024, "Member 'W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity, K2Node_Select_Default) == 0x000034, "Member 'W_CategoryItem_C_Get_img_CategoryIcon_ColorAndOpacity::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Bdr_Underline_BrushColor
// 0x0044 (0x0044 - 0x0000)
struct W_CategoryItem_C_Get_Bdr_Underline_BrushColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor) == 0x000004, "Wrong alignment on W_CategoryItem_C_Get_Bdr_Underline_BrushColor");
static_assert(sizeof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor) == 0x000044, "Wrong size on W_CategoryItem_C_Get_Bdr_Underline_BrushColor");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Bdr_Underline_BrushColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor, Temp_bool_Variable) == 0x000010, "Member 'W_CategoryItem_C_Get_Bdr_Underline_BrushColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor, Temp_struct_Variable) == 0x000014, "Member 'W_CategoryItem_C_Get_Bdr_Underline_BrushColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor, Temp_struct_Variable_1) == 0x000024, "Member 'W_CategoryItem_C_Get_Bdr_Underline_BrushColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Underline_BrushColor, K2Node_Select_Default) == 0x000034, "Member 'W_CategoryItem_C_Get_Bdr_Underline_BrushColor::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Bdr_Slot_Visibility
// 0x0005 (0x0005 - 0x0000)
struct W_CategoryItem_C_Get_Bdr_Slot_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Bdr_Slot_Visibility) == 0x000001, "Wrong alignment on W_CategoryItem_C_Get_Bdr_Slot_Visibility");
static_assert(sizeof(W_CategoryItem_C_Get_Bdr_Slot_Visibility) == 0x000005, "Wrong size on W_CategoryItem_C_Get_Bdr_Slot_Visibility");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_Visibility, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Bdr_Slot_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_Visibility, Temp_bool_Variable) == 0x000001, "Member 'W_CategoryItem_C_Get_Bdr_Slot_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_Visibility, Temp_byte_Variable) == 0x000002, "Member 'W_CategoryItem_C_Get_Bdr_Slot_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'W_CategoryItem_C_Get_Bdr_Slot_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_Visibility, K2Node_Select_Default) == 0x000004, "Member 'W_CategoryItem_C_Get_Bdr_Slot_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_img_Selection_Visibility
// 0x0005 (0x0005 - 0x0000)
struct W_CategoryItem_C_Get_img_Selection_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_img_Selection_Visibility) == 0x000001, "Wrong alignment on W_CategoryItem_C_Get_img_Selection_Visibility");
static_assert(sizeof(W_CategoryItem_C_Get_img_Selection_Visibility) == 0x000005, "Wrong size on W_CategoryItem_C_Get_img_Selection_Visibility");
static_assert(offsetof(W_CategoryItem_C_Get_img_Selection_Visibility, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_img_Selection_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_Selection_Visibility, Temp_bool_Variable) == 0x000001, "Member 'W_CategoryItem_C_Get_img_Selection_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_Selection_Visibility, Temp_byte_Variable) == 0x000002, "Member 'W_CategoryItem_C_Get_img_Selection_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_Selection_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'W_CategoryItem_C_Get_img_Selection_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_img_Selection_Visibility, K2Node_Select_Default) == 0x000004, "Member 'W_CategoryItem_C_Get_img_Selection_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.Get_Bdr_Slot_BrushColor
// 0x0044 (0x0044 - 0x0000)
struct W_CategoryItem_C_Get_Bdr_Slot_BrushColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor) == 0x000004, "Wrong alignment on W_CategoryItem_C_Get_Bdr_Slot_BrushColor");
static_assert(sizeof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor) == 0x000044, "Wrong size on W_CategoryItem_C_Get_Bdr_Slot_BrushColor");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor, ReturnValue) == 0x000000, "Member 'W_CategoryItem_C_Get_Bdr_Slot_BrushColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor, Temp_bool_Variable) == 0x000010, "Member 'W_CategoryItem_C_Get_Bdr_Slot_BrushColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor, Temp_struct_Variable) == 0x000014, "Member 'W_CategoryItem_C_Get_Bdr_Slot_BrushColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor, Temp_struct_Variable_1) == 0x000024, "Member 'W_CategoryItem_C_Get_Bdr_Slot_BrushColor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_Get_Bdr_Slot_BrushColor, K2Node_Select_Default) == 0x000034, "Member 'W_CategoryItem_C_Get_Bdr_Slot_BrushColor::K2Node_Select_Default' has a wrong offset!");

// Function W_CategoryItem.W_CategoryItem_C.ExecuteUbergraph_W_CategoryItem
// 0x0018 (0x0018 - 0x0000)
struct W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem) == 0x000008, "Wrong alignment on W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem");
static_assert(sizeof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem) == 0x000018, "Wrong size on W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem");
static_assert(offsetof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem, EntryPoint) == 0x000000, "Member 'W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_CategoryItem_C_ExecuteUbergraph_W_CategoryItem::K2Node_Event_IsDesignTime' has a wrong offset!");

}

