#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterInfoWidget

#include "Basic.hpp"

#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function W_CharacterInfoWidget.W_CharacterInfoWidget_C.AddScreenLock
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterInfoWidget_C_AddScreenLock final
{
public:
	EP2ScreenLockReason                           LockReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterInfoWidget_C_AddScreenLock) == 0x000001, "Wrong alignment on W_CharacterInfoWidget_C_AddScreenLock");
static_assert(sizeof(W_CharacterInfoWidget_C_AddScreenLock) == 0x000001, "Wrong size on W_CharacterInfoWidget_C_AddScreenLock");
static_assert(offsetof(W_CharacterInfoWidget_C_AddScreenLock, LockReason) == 0x000000, "Member 'W_CharacterInfoWidget_C_AddScreenLock::LockReason' has a wrong offset!");

// Function W_CharacterInfoWidget.W_CharacterInfoWidget_C.ExecuteUbergraph_W_CharacterInfoWidget
// 0x0008 (0x0008 - 0x0000)
struct W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ScreenLockReason                           K2Node_Event_LockReason_1;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ScreenLockReason                           K2Node_Event_LockReason;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_IsEmpty_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget) == 0x000004, "Wrong alignment on W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget");
static_assert(sizeof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget) == 0x000008, "Wrong size on W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget");
static_assert(offsetof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget, EntryPoint) == 0x000000, "Member 'W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget, K2Node_Event_LockReason_1) == 0x000004, "Member 'W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget::K2Node_Event_LockReason_1' has a wrong offset!");
static_assert(offsetof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget, K2Node_Event_LockReason) == 0x000005, "Member 'W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget::K2Node_Event_LockReason' has a wrong offset!");
static_assert(offsetof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget, CallFunc_Set_IsEmpty_ReturnValue) == 0x000006, "Member 'W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget::CallFunc_Set_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget, CallFunc_Set_Remove_ReturnValue) == 0x000007, "Member 'W_CharacterInfoWidget_C_ExecuteUbergraph_W_CharacterInfoWidget::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");

// Function W_CharacterInfoWidget.W_CharacterInfoWidget_C.RemoveScreenLock
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterInfoWidget_C_RemoveScreenLock final
{
public:
	EP2ScreenLockReason                           LockReason;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterInfoWidget_C_RemoveScreenLock) == 0x000001, "Wrong alignment on W_CharacterInfoWidget_C_RemoveScreenLock");
static_assert(sizeof(W_CharacterInfoWidget_C_RemoveScreenLock) == 0x000001, "Wrong size on W_CharacterInfoWidget_C_RemoveScreenLock");
static_assert(offsetof(W_CharacterInfoWidget_C_RemoveScreenLock, LockReason) == 0x000000, "Member 'W_CharacterInfoWidget_C_RemoveScreenLock::LockReason' has a wrong offset!");

}

