#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterConfirmation

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterConfirmation.W_CharacterConfirmation_C
// 0x0080 (0x03A8 - 0x0328)
class UW_CharacterConfirmation_C final : public UP2CharacterCreationConfirmation
{
public:
	class UImage*                                 img_deco_dot;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_deco_dot_1;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_deco_dot_2;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_deco_dot_3;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line2;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line3;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line4;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line5;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line6;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CharacterBackground_1;                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CharacterBackground_Title_1;                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_FactionBonus;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_Main;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FactionItemGroup_C*                  FactionItemGroup;                                  // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2FactionSelectionWidget*              CurrentSelectedFaction;                            // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetNewFactionItemGroup(class UW_FactionItemGroup_C* NewWidget)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterConfirmation_C">();
	}
	static class UW_CharacterConfirmation_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterConfirmation_C>();
	}
};
static_assert(alignof(UW_CharacterConfirmation_C) == 0x000008, "Wrong alignment on UW_CharacterConfirmation_C");
static_assert(sizeof(UW_CharacterConfirmation_C) == 0x0003A8, "Wrong size on UW_CharacterConfirmation_C");
static_assert(offsetof(UW_CharacterConfirmation_C, img_deco_dot) == 0x000328, "Member 'UW_CharacterConfirmation_C::img_deco_dot' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_deco_dot_1) == 0x000330, "Member 'UW_CharacterConfirmation_C::img_deco_dot_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_deco_dot_2) == 0x000338, "Member 'UW_CharacterConfirmation_C::img_deco_dot_2' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_deco_dot_3) == 0x000340, "Member 'UW_CharacterConfirmation_C::img_deco_dot_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line) == 0x000348, "Member 'UW_CharacterConfirmation_C::img_line' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line2) == 0x000350, "Member 'UW_CharacterConfirmation_C::img_line2' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line3) == 0x000358, "Member 'UW_CharacterConfirmation_C::img_line3' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line4) == 0x000360, "Member 'UW_CharacterConfirmation_C::img_line4' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line5) == 0x000368, "Member 'UW_CharacterConfirmation_C::img_line5' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, img_line6) == 0x000370, "Member 'UW_CharacterConfirmation_C::img_line6' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, Txt_CharacterBackground_1) == 0x000378, "Member 'UW_CharacterConfirmation_C::Txt_CharacterBackground_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, Txt_CharacterBackground_Title_1) == 0x000380, "Member 'UW_CharacterConfirmation_C::Txt_CharacterBackground_Title_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, VB_FactionBonus) == 0x000388, "Member 'UW_CharacterConfirmation_C::VB_FactionBonus' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, VB_Main) == 0x000390, "Member 'UW_CharacterConfirmation_C::VB_Main' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, FactionItemGroup) == 0x000398, "Member 'UW_CharacterConfirmation_C::FactionItemGroup' has a wrong offset!");
static_assert(offsetof(UW_CharacterConfirmation_C, CurrentSelectedFaction) == 0x0003A0, "Member 'UW_CharacterConfirmation_C::CurrentSelectedFaction' has a wrong offset!");

}

