#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterConfirmation

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CharacterConfirmation.W_CharacterConfirmation_C.SetNewFactionItemGroup
// 0x0020 (0x0020 - 0x0000)
struct W_CharacterConfirmation_C_SetNewFactionItemGroup final
{
public:
	class UW_FactionItemGroup_C*                  NewWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterConfirmation_C_SetNewFactionItemGroup) == 0x000008, "Wrong alignment on W_CharacterConfirmation_C_SetNewFactionItemGroup");
static_assert(sizeof(W_CharacterConfirmation_C_SetNewFactionItemGroup) == 0x000020, "Wrong size on W_CharacterConfirmation_C_SetNewFactionItemGroup");
static_assert(offsetof(W_CharacterConfirmation_C_SetNewFactionItemGroup, NewWidget) == 0x000000, "Member 'W_CharacterConfirmation_C_SetNewFactionItemGroup::NewWidget' has a wrong offset!");
static_assert(offsetof(W_CharacterConfirmation_C_SetNewFactionItemGroup, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_CharacterConfirmation_C_SetNewFactionItemGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterConfirmation_C_SetNewFactionItemGroup, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'W_CharacterConfirmation_C_SetNewFactionItemGroup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterConfirmation_C_SetNewFactionItemGroup, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'W_CharacterConfirmation_C_SetNewFactionItemGroup::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterConfirmation_C_SetNewFactionItemGroup, CallFunc_IsValid_ReturnValue_2) == 0x000018, "Member 'W_CharacterConfirmation_C_SetNewFactionItemGroup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

