#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterCreator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterCreator.W_CharacterCreator_C
// 0x09F8 (0x1020 - 0x0628)
class UW_CharacterCreator_C final : public UP2CharacterCreationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PaginationSteps;                                   // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonFadeIn_Confirm;                              // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScreenFadeIn;                                      // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScreenFadeOut;                                     // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ConfirmationFadeIn;                                // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AppearanceFadeIn;                                  // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BaseCharFadeIn;                                    // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NicknameFadeIn;                                    // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonFadeIn;                                      // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionTitle;                                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            Button_Back;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            Button_Confirm;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            Button_Forward;                                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DragMouseAreaWidget_C*               DragMouseAreaWidget;                               // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Buttons;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Header;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BlackFade;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_CharacterSelectionIcon;                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_FadeOut_Gradient;                              // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_idle;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_idle_1;                                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_idle_2;                                        // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_idle_3;                                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_idle_4;                                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected;                                      // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected_1;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected_2;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected_3;                                    // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected_4;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_3;                                        // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Back;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Randomize;                                // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Booting;                                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_LockScreen;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 T_Vignette;                                        // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Subtitles;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecoBG_C*                            W_DecoBG;                                          // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WB_Pagination;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           Titles;                                            // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasNetworkLock;                                   // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadValidName;                                      // 0x0779(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Character_Id;                                      // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FText>                           Subtitles;                                         // 0x0790(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ButtonTextConfirm;                                 // 0x07A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ButtonTextContinue;                                // 0x07B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           YesOkBtnStyle;                                     // 0x07D0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DefaultBtnStyle;                                   // 0x0BC0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          MoviePlayed;                                       // 0x0FB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB1[0x7];                                      // 0x0FB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingProcessTask*                    LoadScreenTask;                                    // 0x0FB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         VO_Previous_Index;                                 // 0x0FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC4[0x4];                                      // 0x0FC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VO_Previous_Cooltime;                              // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VO_Previous_IsCooltimePassed;                      // 0x0FD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FD1[0x3];                                      // 0x0FD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VO_Current_Index;                                  // 0x0FD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadingProcessTask*                    LoadingTask;                                       // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_Hero_Mannequin_C*                   Mannequin;                                         // 0x0FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   ConnectionErrorText;                               // 0x0FE8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ConnectionError;                                   // 0x1000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CharacterCreated;                                  // 0x1001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1002[0x6];                                     // 0x1002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AccountID;                                         // 0x1008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bConnectToTutorial;                                // 0x1018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void VR_Boot_Ended()	 // 0xae1e64;
	void UpdateView()	 // 0xae1e64;
	void UpdateLock()	 // 0xae1e64;
	void TutorialPopupClosed(bool LoadTutorial)	 // 0xae1e64;
	void ShowSubtitle(bool IsFactionSelection)	 // 0xae1e64;
	void ShowBriefingVideo()	 // 0xae1e64;
	void SetPreviousVOCooltimePassed()	 // 0xae1e64;
	void Screen_FadeInFinished()	 // 0xae1e64;
	void ProcessForward_Button(EPopupButtonID ButtonID)	 // 0xae1e64;
	void ProcessConnectionError(bool InConnectionError, const class FText& Message)	 // 0xae1e64;
	void ProcessBack_Button(EPopupButtonID ButtonID)	 // 0xae1e64;
	void PlayVOAudio(int32 In_Int)	 // 0xae1e64;
	void Pagination()	 // 0xae1e64;
	void OnInitialized()	 // 0xae1e64;
	void OnFactionPressedDelegate_Event()	 // 0xae1e64;
	void OnFactionConfirm(const struct FGameplayTag& InFactionTag, const class UP2FactionDefaultLoadout* InFactionDefaultLoadout)	 // 0xae1e64;
	void OnCreateCharacterSuccess(const class FString& CharacterId, const class FString& NickName_0)	 // 0xae1e64;
	void OnCreateCharacterFail(const class FText& Error)	 // 0xae1e64;
	void OnClicked_Randomize()	 // 0xae1e64;
	void OnClicked_Back()	 // 0xae1e64;
	void LoadMainMenuOnError()	 // 0xae1e64;
	void ExecuteUbergraph_W_CharacterCreator(int32 EntryPoint)	 // 0xae1e64;
	void DestroyLoadingTask()	 // 0xae1e64;
	void CreateLoadingTask(const class FString& Reason)	 // 0xae1e64;
	void CREATEDELEGATE_PROXYFUNCTION_0(const class FText& Error)	 // 0xae1e64;
	void ConnectSucces(const class FString& Endpoint, const class FString& AccountID_0, const class FString& CharacterId)	 // 0xae1e64;
	void ConnectFailed(const class FText& Error)	 // 0xae1e64;
	void CalculateActiveSubtitle(bool IsFactionSelection, int32* Index_0)	 // 0xae1e64;
	void BP_ProcessForward()	 // 0xae1e64;
	void BP_ProcessBack()	 // 0xae1e64;
	void BP_OnSkinVariationsBakeStarted()	 // 0xae1e64;
	void BP_OnSkinVariationsBakeEnded()	 // 0xae1e64;
	void BP_OnSkinBuildStarted()	 // 0xae1e64;
	void BP_OnSkinBuildEnded()	 // 0xae1e64;
	void BndEvt__W_CharacterCreator_W_NicknameWidget_K2Node_ComponentBoundEvent_5_OnNicknameSet__DelegateSignature(const class FString& NickName_0)	 // 0xae1e64;
	void BindLoginEvents()	 // 0xae1e64;
	void BindKeyguides()	 // 0xae1e64;
	void Apply()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterCreator_C">();
	}
	static class UW_CharacterCreator_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterCreator_C>();
	}
};
static_assert(alignof(UW_CharacterCreator_C) == 0x000010, "Wrong alignment on UW_CharacterCreator_C");
static_assert(sizeof(UW_CharacterCreator_C) == 0x001020, "Wrong size on UW_CharacterCreator_C");
static_assert(offsetof(UW_CharacterCreator_C, UberGraphFrame) == 0x000628, "Member 'UW_CharacterCreator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, PaginationSteps) == 0x000630, "Member 'UW_CharacterCreator_C::PaginationSteps' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ButtonFadeIn_Confirm) == 0x000638, "Member 'UW_CharacterCreator_C::ButtonFadeIn_Confirm' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ScreenFadeIn) == 0x000640, "Member 'UW_CharacterCreator_C::ScreenFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ScreenFadeOut) == 0x000648, "Member 'UW_CharacterCreator_C::ScreenFadeOut' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ConfirmationFadeIn) == 0x000650, "Member 'UW_CharacterCreator_C::ConfirmationFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, AppearanceFadeIn) == 0x000658, "Member 'UW_CharacterCreator_C::AppearanceFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, BaseCharFadeIn) == 0x000660, "Member 'UW_CharacterCreator_C::BaseCharFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, NicknameFadeIn) == 0x000668, "Member 'UW_CharacterCreator_C::NicknameFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ButtonFadeIn) == 0x000670, "Member 'UW_CharacterCreator_C::ButtonFadeIn' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ActionTitle) == 0x000678, "Member 'UW_CharacterCreator_C::ActionTitle' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, BackgroundBlur) == 0x000680, "Member 'UW_CharacterCreator_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Button_Back) == 0x000688, "Member 'UW_CharacterCreator_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Button_Confirm) == 0x000690, "Member 'UW_CharacterCreator_C::Button_Confirm' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Button_Forward) == 0x000698, "Member 'UW_CharacterCreator_C::Button_Forward' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, DragMouseAreaWidget) == 0x0006A0, "Member 'UW_CharacterCreator_C::DragMouseAreaWidget' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, HB_Buttons) == 0x0006A8, "Member 'UW_CharacterCreator_C::HB_Buttons' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, HB_Header) == 0x0006B0, "Member 'UW_CharacterCreator_C::HB_Header' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_BlackFade) == 0x0006B8, "Member 'UW_CharacterCreator_C::Img_BlackFade' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_CharacterSelectionIcon) == 0x0006C0, "Member 'UW_CharacterCreator_C::Img_CharacterSelectionIcon' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_FadeOut_Gradient) == 0x0006C8, "Member 'UW_CharacterCreator_C::img_FadeOut_Gradient' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_idle) == 0x0006D0, "Member 'UW_CharacterCreator_C::img_idle' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_idle_1) == 0x0006D8, "Member 'UW_CharacterCreator_C::img_idle_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_idle_2) == 0x0006E0, "Member 'UW_CharacterCreator_C::img_idle_2' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_idle_3) == 0x0006E8, "Member 'UW_CharacterCreator_C::img_idle_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, img_idle_4) == 0x0006F0, "Member 'UW_CharacterCreator_C::img_idle_4' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_Selected) == 0x0006F8, "Member 'UW_CharacterCreator_C::Img_Selected' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_Selected_1) == 0x000700, "Member 'UW_CharacterCreator_C::Img_Selected_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_Selected_2) == 0x000708, "Member 'UW_CharacterCreator_C::Img_Selected_2' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_Selected_3) == 0x000710, "Member 'UW_CharacterCreator_C::Img_Selected_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Img_Selected_4) == 0x000718, "Member 'UW_CharacterCreator_C::Img_Selected_4' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Keyguide_3) == 0x000720, "Member 'UW_CharacterCreator_C::Keyguide_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Keyguide_Back) == 0x000728, "Member 'UW_CharacterCreator_C::Keyguide_Back' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Keyguide_Randomize) == 0x000730, "Member 'UW_CharacterCreator_C::Keyguide_Randomize' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Ovr_Booting) == 0x000738, "Member 'UW_CharacterCreator_C::Ovr_Booting' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Ovr_LockScreen) == 0x000740, "Member 'UW_CharacterCreator_C::Ovr_LockScreen' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, T_Vignette) == 0x000748, "Member 'UW_CharacterCreator_C::T_Vignette' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Txt_Subtitles) == 0x000750, "Member 'UW_CharacterCreator_C::Txt_Subtitles' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, W_DecoBG) == 0x000758, "Member 'UW_CharacterCreator_C::W_DecoBG' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, WB_Pagination) == 0x000760, "Member 'UW_CharacterCreator_C::WB_Pagination' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Titles) == 0x000768, "Member 'UW_CharacterCreator_C::Titles' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, bHasNetworkLock) == 0x000778, "Member 'UW_CharacterCreator_C::bHasNetworkLock' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, HadValidName) == 0x000779, "Member 'UW_CharacterCreator_C::HadValidName' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Character_Id) == 0x000780, "Member 'UW_CharacterCreator_C::Character_Id' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Subtitles) == 0x000790, "Member 'UW_CharacterCreator_C::Subtitles' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ButtonTextConfirm) == 0x0007A0, "Member 'UW_CharacterCreator_C::ButtonTextConfirm' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ButtonTextContinue) == 0x0007B8, "Member 'UW_CharacterCreator_C::ButtonTextContinue' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, YesOkBtnStyle) == 0x0007D0, "Member 'UW_CharacterCreator_C::YesOkBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, DefaultBtnStyle) == 0x000BC0, "Member 'UW_CharacterCreator_C::DefaultBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, MoviePlayed) == 0x000FB0, "Member 'UW_CharacterCreator_C::MoviePlayed' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, LoadScreenTask) == 0x000FB8, "Member 'UW_CharacterCreator_C::LoadScreenTask' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, VO_Previous_Index) == 0x000FC0, "Member 'UW_CharacterCreator_C::VO_Previous_Index' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, VO_Previous_Cooltime) == 0x000FC8, "Member 'UW_CharacterCreator_C::VO_Previous_Cooltime' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, VO_Previous_IsCooltimePassed) == 0x000FD0, "Member 'UW_CharacterCreator_C::VO_Previous_IsCooltimePassed' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, VO_Current_Index) == 0x000FD4, "Member 'UW_CharacterCreator_C::VO_Current_Index' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, LoadingTask) == 0x000FD8, "Member 'UW_CharacterCreator_C::LoadingTask' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, Mannequin) == 0x000FE0, "Member 'UW_CharacterCreator_C::Mannequin' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ConnectionErrorText) == 0x000FE8, "Member 'UW_CharacterCreator_C::ConnectionErrorText' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, ConnectionError) == 0x001000, "Member 'UW_CharacterCreator_C::ConnectionError' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, CharacterCreated) == 0x001001, "Member 'UW_CharacterCreator_C::CharacterCreated' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, AccountID) == 0x001008, "Member 'UW_CharacterCreator_C::AccountID' has a wrong offset!");
static_assert(offsetof(UW_CharacterCreator_C, bConnectToTutorial) == 0x001018, "Member 'UW_CharacterCreator_C::bConnectToTutorial' has a wrong offset!");

}

