#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSkin_ColorPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterSkin_ColorPicker.W_CharacterSkin_ColorPicker_C
// 0x0048 (0x0318 - 0x02D0)
class UW_CharacterSkin_ColorPicker_C final : public UP2SkinCustomizationItemButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TileUnhover;                                       // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TileHover;                                         // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_230;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BgSelected;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_NoneLabel;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_SelectionBracket;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_TileOutline;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_CustomizationItem;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshSelected()	 // 0xae1e64;
	void OnSelectionChanged(bool bNewSelected)	 // 0xae1e64;
	void ExecuteUbergraph_W_CharacterSkin_ColorPicker(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BP_OnButtonInitialized()	 // 0xae1e64;
	void BndEvt__W_SkinCustomizationItem_Button_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SkinCustomizationItem_Button_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterSkin_ColorPicker_C">();
	}
	static class UW_CharacterSkin_ColorPicker_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterSkin_ColorPicker_C>();
	}
};
static_assert(alignof(UW_CharacterSkin_ColorPicker_C) == 0x000008, "Wrong alignment on UW_CharacterSkin_ColorPicker_C");
static_assert(sizeof(UW_CharacterSkin_ColorPicker_C) == 0x000318, "Wrong size on UW_CharacterSkin_ColorPicker_C");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, UberGraphFrame) == 0x0002D0, "Member 'UW_CharacterSkin_ColorPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, TileUnhover) == 0x0002D8, "Member 'UW_CharacterSkin_ColorPicker_C::TileUnhover' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, TileHover) == 0x0002E0, "Member 'UW_CharacterSkin_ColorPicker_C::TileHover' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, BackgroundBlur_230) == 0x0002E8, "Member 'UW_CharacterSkin_ColorPicker_C::BackgroundBlur_230' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, Img_BgSelected) == 0x0002F0, "Member 'UW_CharacterSkin_ColorPicker_C::Img_BgSelected' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, img_NoneLabel) == 0x0002F8, "Member 'UW_CharacterSkin_ColorPicker_C::img_NoneLabel' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, img_SelectionBracket) == 0x000300, "Member 'UW_CharacterSkin_ColorPicker_C::img_SelectionBracket' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, img_TileOutline) == 0x000308, "Member 'UW_CharacterSkin_ColorPicker_C::img_TileOutline' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkin_ColorPicker_C, SzB_CustomizationItem) == 0x000310, "Member 'UW_CharacterSkin_ColorPicker_C::SzB_CustomizationItem' has a wrong offset!");

}

