#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterInfo_BallisticProtection

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterInfo_BallisticProtection.W_CharacterInfo_BallisticProtection_C
// 0x0090 (0x0318 - 0x0288)
class UW_CharacterInfo_BallisticProtection_C final : public UP2BallisticProtectionWidget
{
public:
	class UImage*                                 img_Neck;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArmorTier_C*                         W_ArmorTier_3;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Arm_BL_C*       W_DamageZoneProtection_Arm_BL;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Arm_BR_C*       W_DamageZoneProtection_Arm_BR;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Arm_UL_C*       W_DamageZoneProtection_Arm_UL;                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Arm_UR_C*       W_DamageZoneProtection_Arm_UR;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Face_C*         W_DamageZoneProtection_Face;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Foot_L_C*       W_DamageZoneProtection_Foot_L;                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Foot_R_C*       W_DamageZoneProtection_Foot_R;                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Hand_L_C*       W_DamageZoneProtection_Hand_L;                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Hand_R_C*       W_DamageZoneProtection_Hand_R;                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Head_C*         W_DamageZoneProtection_Head;                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Leg_BL_C*       W_DamageZoneProtection_Leg_BL;                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Leg_BR_C*       W_DamageZoneProtection_Leg_BR;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Leg_UL_C*       W_DamageZoneProtection_Leg_UL;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Leg_UR_C*       W_DamageZoneProtection_Leg_UR;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Pelvis_C*       W_DamageZoneProtection_Pelvis;                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DamageZoneProtection_Torso_C*        W_DamageZoneProtection_Torso;                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterInfo_BallisticProtection_C">();
	}
	static class UW_CharacterInfo_BallisticProtection_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterInfo_BallisticProtection_C>();
	}
};
static_assert(alignof(UW_CharacterInfo_BallisticProtection_C) == 0x000008, "Wrong alignment on UW_CharacterInfo_BallisticProtection_C");
static_assert(sizeof(UW_CharacterInfo_BallisticProtection_C) == 0x000318, "Wrong size on UW_CharacterInfo_BallisticProtection_C");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, img_Neck) == 0x000288, "Member 'UW_CharacterInfo_BallisticProtection_C::img_Neck' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_ArmorTier_3) == 0x000290, "Member 'UW_CharacterInfo_BallisticProtection_C::W_ArmorTier_3' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Arm_BL) == 0x000298, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Arm_BL' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Arm_BR) == 0x0002A0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Arm_BR' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Arm_UL) == 0x0002A8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Arm_UL' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Arm_UR) == 0x0002B0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Arm_UR' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Face) == 0x0002B8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Face' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Foot_L) == 0x0002C0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Foot_L' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Foot_R) == 0x0002C8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Foot_R' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Hand_L) == 0x0002D0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Hand_L' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Hand_R) == 0x0002D8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Hand_R' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Head) == 0x0002E0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Head' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Leg_BL) == 0x0002E8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Leg_BL' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Leg_BR) == 0x0002F0, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Leg_BR' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Leg_UL) == 0x0002F8, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Leg_UL' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Leg_UR) == 0x000300, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Leg_UR' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Pelvis) == 0x000308, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Pelvis' has a wrong offset!");
static_assert(offsetof(UW_CharacterInfo_BallisticProtection_C, W_DamageZoneProtection_Torso) == 0x000310, "Member 'UW_CharacterInfo_BallisticProtection_C::W_DamageZoneProtection_Torso' has a wrong offset!");

}

