#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSkinSlot_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterSkinSlot_Button.W_CharacterSkinSlot_Button_C
// 0x0048 (0x0318 - 0x02D0)
class UW_CharacterSkinSlot_Button_C final : public UP2SkinCustomizationItemButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur_230;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SelectedBracket;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SelectedBracket_1;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BgSelected;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_NoneLabel;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_sideline;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Selection;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_CustomizationItem;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void RefreshSelected()	 // 0xae1e64;
	void OnSelectionChanged(bool bNewSelected)	 // 0xae1e64;
	void ExecuteUbergraph_W_CharacterSkinSlot_Button(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BP_OnButtonInitialized()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterSkinSlot_Button_C">();
	}
	static class UW_CharacterSkinSlot_Button_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterSkinSlot_Button_C>();
	}
};
static_assert(alignof(UW_CharacterSkinSlot_Button_C) == 0x000008, "Wrong alignment on UW_CharacterSkinSlot_Button_C");
static_assert(sizeof(UW_CharacterSkinSlot_Button_C) == 0x000318, "Wrong size on UW_CharacterSkinSlot_Button_C");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, UberGraphFrame) == 0x0002D0, "Member 'UW_CharacterSkinSlot_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, BackgroundBlur_230) == 0x0002D8, "Member 'UW_CharacterSkinSlot_Button_C::BackgroundBlur_230' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, Bdr_SelectedBracket) == 0x0002E0, "Member 'UW_CharacterSkinSlot_Button_C::Bdr_SelectedBracket' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, Bdr_SelectedBracket_1) == 0x0002E8, "Member 'UW_CharacterSkinSlot_Button_C::Bdr_SelectedBracket_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, Img_BgSelected) == 0x0002F0, "Member 'UW_CharacterSkinSlot_Button_C::Img_BgSelected' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, img_NoneLabel) == 0x0002F8, "Member 'UW_CharacterSkinSlot_Button_C::img_NoneLabel' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, img_sideline) == 0x000300, "Member 'UW_CharacterSkinSlot_Button_C::img_sideline' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, Ovr_Selection) == 0x000308, "Member 'UW_CharacterSkinSlot_Button_C::Ovr_Selection' has a wrong offset!");
static_assert(offsetof(UW_CharacterSkinSlot_Button_C, SzB_CustomizationItem) == 0x000310, "Member 'UW_CharacterSkinSlot_Button_C::SzB_CustomizationItem' has a wrong offset!");

}

