#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterSelection_TileMin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharacterSelection_TileMin.W_CharacterSelection_TileMin_C
// 0x00C0 (0x03A8 - 0x02E8)
class UW_CharacterSelection_TileMin_C final : public UP2CustomizationItemButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnUnhover;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EquipAnim;                                         // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_GradientBg;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SelectHover;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BgSelected;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket_1;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_bracket2;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_bracket2_1;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoQuad;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line_1;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_ItemEmpty;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_SelectionBracket;                              // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_WeaponInfo;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ItemStatus;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_OutfitTile;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ItemNumber;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ItemHeight_90;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemWidth_90;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemHeight_150;                                    // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ItemWidth_150;                                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnItemButtonInitialized()	 // 0xae1e64;
	ESlateVisibility IsEquipped()	 // 0xae1e64;
	void ExecuteUbergraph_W_CharacterSelection_TileMin(int32 EntryPoint)	 // 0xae1e64;
	void BndEvt__W_CharacterSelection_TileMin_Btn_ItemTile_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_CharacterSelection_TileMin_Btn_ItemTile_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_CharacterSelection_TileMin_Btn_ItemTile_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void UseImage()	 // 0xae1e64;
	void SlotSize()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CharacterSelection_TileMin_C">();
	}
	static class UW_CharacterSelection_TileMin_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CharacterSelection_TileMin_C>();
	}
};
static_assert(alignof(UW_CharacterSelection_TileMin_C) == 0x000008, "Wrong alignment on UW_CharacterSelection_TileMin_C");
static_assert(sizeof(UW_CharacterSelection_TileMin_C) == 0x0003A8, "Wrong size on UW_CharacterSelection_TileMin_C");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, UberGraphFrame) == 0x0002E8, "Member 'UW_CharacterSelection_TileMin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, OnUnhover) == 0x0002F0, "Member 'UW_CharacterSelection_TileMin_C::OnUnhover' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, OnHover) == 0x0002F8, "Member 'UW_CharacterSelection_TileMin_C::OnHover' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, EquipAnim) == 0x000300, "Member 'UW_CharacterSelection_TileMin_C::EquipAnim' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Bdr_GradientBg) == 0x000308, "Member 'UW_CharacterSelection_TileMin_C::Bdr_GradientBg' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Bdr_SelectHover) == 0x000310, "Member 'UW_CharacterSelection_TileMin_C::Bdr_SelectHover' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Img_BgSelected) == 0x000318, "Member 'UW_CharacterSelection_TileMin_C::Img_BgSelected' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Img_Bracket) == 0x000320, "Member 'UW_CharacterSelection_TileMin_C::Img_Bracket' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Img_Bracket_1) == 0x000328, "Member 'UW_CharacterSelection_TileMin_C::Img_Bracket_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, img_bracket2) == 0x000330, "Member 'UW_CharacterSelection_TileMin_C::img_bracket2' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, img_bracket2_1) == 0x000338, "Member 'UW_CharacterSelection_TileMin_C::img_bracket2_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, img_DecoQuad) == 0x000340, "Member 'UW_CharacterSelection_TileMin_C::img_DecoQuad' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, img_line) == 0x000348, "Member 'UW_CharacterSelection_TileMin_C::img_line' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, img_line_1) == 0x000350, "Member 'UW_CharacterSelection_TileMin_C::img_line_1' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Ovr_ItemEmpty) == 0x000358, "Member 'UW_CharacterSelection_TileMin_C::Ovr_ItemEmpty' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Ovr_SelectionBracket) == 0x000360, "Member 'UW_CharacterSelection_TileMin_C::Ovr_SelectionBracket' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Ovr_WeaponInfo) == 0x000368, "Member 'UW_CharacterSelection_TileMin_C::Ovr_WeaponInfo' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, SzB_ItemStatus) == 0x000370, "Member 'UW_CharacterSelection_TileMin_C::SzB_ItemStatus' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, SzB_OutfitTile) == 0x000378, "Member 'UW_CharacterSelection_TileMin_C::SzB_OutfitTile' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, Txt_ItemNumber) == 0x000380, "Member 'UW_CharacterSelection_TileMin_C::Txt_ItemNumber' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, ItemHeight_90) == 0x000388, "Member 'UW_CharacterSelection_TileMin_C::ItemHeight_90' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, ItemWidth_90) == 0x000390, "Member 'UW_CharacterSelection_TileMin_C::ItemWidth_90' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, ItemHeight_150) == 0x000398, "Member 'UW_CharacterSelection_TileMin_C::ItemHeight_150' has a wrong offset!");
static_assert(offsetof(UW_CharacterSelection_TileMin_C, ItemWidth_150) == 0x0003A0, "Member 'UW_CharacterSelection_TileMin_C::ItemWidth_150' has a wrong offset!");

}

