#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharacterCreator

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_CharacterCreator.W_CharacterCreator_C.UpdateView
// 0x00B0 (0x00B0 - 0x0000)
struct W_CharacterCreator_C_UpdateView final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_FactionSelection_C*                  K2Node_DynamicCast_AsW_Faction_Selection;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_2;            // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_3;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_4;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_5;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_6;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_7;    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_UpdateView) == 0x000008, "Wrong alignment on W_CharacterCreator_C_UpdateView");
static_assert(sizeof(W_CharacterCreator_C_UpdateView) == 0x0000B0, "Wrong size on W_CharacterCreator_C_UpdateView");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_bool_Variable) == 0x000000, "Member 'W_CharacterCreator_C_UpdateView::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable) == 0x000001, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable_1) == 0x000002, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable_2) == 0x000003, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable_3) == 0x000004, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_bool_Variable_1) == 0x000005, "Member 'W_CharacterCreator_C_UpdateView::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, K2Node_DynamicCast_AsW_Faction_Selection) == 0x000018, "Member 'W_CharacterCreator_C_UpdateView::K2Node_DynamicCast_AsW_Faction_Selection' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_CharacterCreator_C_UpdateView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000028, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000030, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_PlayAnimation_ReturnValue_2) == 0x000048, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable_4) == 0x000050, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue_2) == 0x000058, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000060, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_PlayAnimation_ReturnValue_3) == 0x000068, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_byte_Variable_5) == 0x000070, "Member 'W_CharacterCreator_C_UpdateView::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue_3) == 0x000078, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000080, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, Temp_bool_Variable_2) == 0x000081, "Member 'W_CharacterCreator_C_UpdateView::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000084, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue_4) == 0x000088, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000091, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_5) == 0x000092, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_BooleanOR_ReturnValue) == 0x000093, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidget_ReturnValue_5) == 0x000098, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_6) == 0x0000A0, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_ObjectObject_ReturnValue_7) == 0x0000A1, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_ObjectObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_BooleanOR_ReturnValue_1) == 0x0000A2, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x0000A4, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, K2Node_Select_Default) == 0x0000A9, "Member 'W_CharacterCreator_C_UpdateView::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000AA, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AB, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'W_CharacterCreator_C_UpdateView::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, K2Node_Select_Default_1) == 0x0000AD, "Member 'W_CharacterCreator_C_UpdateView::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateView, K2Node_Select_Default_2) == 0x0000AE, "Member 'W_CharacterCreator_C_UpdateView::K2Node_Select_Default_2' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.UpdateLock
// 0x000B (0x000B - 0x0000)
struct W_CharacterCreator_C_UpdateLock final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_UpdateLock) == 0x000001, "Wrong alignment on W_CharacterCreator_C_UpdateLock");
static_assert(sizeof(W_CharacterCreator_C_UpdateLock) == 0x00000B, "Wrong size on W_CharacterCreator_C_UpdateLock");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, Temp_bool_Variable) == 0x000000, "Member 'W_CharacterCreator_C_UpdateLock::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, Temp_byte_Variable) == 0x000002, "Member 'W_CharacterCreator_C_UpdateLock::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, Temp_byte_Variable_1) == 0x000003, "Member 'W_CharacterCreator_C_UpdateLock::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_BooleanOR_ReturnValue_2) == 0x000006, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, K2Node_Select_Default) == 0x000008, "Member 'W_CharacterCreator_C_UpdateLock::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_Not_PreBool_ReturnValue_1) == 0x000009, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_UpdateLock, CallFunc_Not_PreBool_ReturnValue_2) == 0x00000A, "Member 'W_CharacterCreator_C_UpdateLock::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.TutorialPopupClosed
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreator_C_TutorialPopupClosed final
{
public:
	bool                                          LoadTutorial;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_TutorialPopupClosed) == 0x000001, "Wrong alignment on W_CharacterCreator_C_TutorialPopupClosed");
static_assert(sizeof(W_CharacterCreator_C_TutorialPopupClosed) == 0x000001, "Wrong size on W_CharacterCreator_C_TutorialPopupClosed");
static_assert(offsetof(W_CharacterCreator_C_TutorialPopupClosed, LoadTutorial) == 0x000000, "Member 'W_CharacterCreator_C_TutorialPopupClosed::LoadTutorial' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.ShowSubtitle
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreator_C_ShowSubtitle final
{
public:
	bool                                          IsFactionSelection;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_ShowSubtitle) == 0x000001, "Wrong alignment on W_CharacterCreator_C_ShowSubtitle");
static_assert(sizeof(W_CharacterCreator_C_ShowSubtitle) == 0x000001, "Wrong size on W_CharacterCreator_C_ShowSubtitle");
static_assert(offsetof(W_CharacterCreator_C_ShowSubtitle, IsFactionSelection) == 0x000000, "Member 'W_CharacterCreator_C_ShowSubtitle::IsFactionSelection' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.ProcessForward_Button
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreator_C_ProcessForward_Button final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_ProcessForward_Button) == 0x000001, "Wrong alignment on W_CharacterCreator_C_ProcessForward_Button");
static_assert(sizeof(W_CharacterCreator_C_ProcessForward_Button) == 0x000001, "Wrong size on W_CharacterCreator_C_ProcessForward_Button");
static_assert(offsetof(W_CharacterCreator_C_ProcessForward_Button, ButtonID) == 0x000000, "Member 'W_CharacterCreator_C_ProcessForward_Button::ButtonID' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.ProcessConnectionError
// 0x0028 (0x0028 - 0x0000)
struct W_CharacterCreator_C_ProcessConnectionError final
{
public:
	bool                                          InConnectionError;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_ProcessConnectionError) == 0x000008, "Wrong alignment on W_CharacterCreator_C_ProcessConnectionError");
static_assert(sizeof(W_CharacterCreator_C_ProcessConnectionError) == 0x000028, "Wrong size on W_CharacterCreator_C_ProcessConnectionError");
static_assert(offsetof(W_CharacterCreator_C_ProcessConnectionError, InConnectionError) == 0x000000, "Member 'W_CharacterCreator_C_ProcessConnectionError::InConnectionError' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_ProcessConnectionError, Message) == 0x000008, "Member 'W_CharacterCreator_C_ProcessConnectionError::Message' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_ProcessConnectionError, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CharacterCreator_C_ProcessConnectionError::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.ProcessBack_Button
// 0x0001 (0x0001 - 0x0000)
struct W_CharacterCreator_C_ProcessBack_Button final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_ProcessBack_Button) == 0x000001, "Wrong alignment on W_CharacterCreator_C_ProcessBack_Button");
static_assert(sizeof(W_CharacterCreator_C_ProcessBack_Button) == 0x000001, "Wrong size on W_CharacterCreator_C_ProcessBack_Button");
static_assert(offsetof(W_CharacterCreator_C_ProcessBack_Button, ButtonID) == 0x000000, "Member 'W_CharacterCreator_C_ProcessBack_Button::ButtonID' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.PlayVOAudio
// 0x0040 (0x0040 - 0x0000)
struct W_CharacterCreator_C_PlayVOAudio final
{
public:
	int32                                         In_Int;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_TryPostEventAtLocation_ReturnValue;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRTPCValue_Value_ImplicitCast;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_PlayVOAudio) == 0x000008, "Wrong alignment on W_CharacterCreator_C_PlayVOAudio");
static_assert(sizeof(W_CharacterCreator_C_PlayVOAudio) == 0x000040, "Wrong size on W_CharacterCreator_C_PlayVOAudio");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, In_Int) == 0x000000, "Member 'W_CharacterCreator_C_PlayVOAudio::In_Int' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_Vector_Zero_ReturnValue) == 0x000018, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000030, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_TryPostEventAtLocation_ReturnValue) == 0x000038, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_TryPostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_PlayVOAudio, CallFunc_SetRTPCValue_Value_ImplicitCast) == 0x00003C, "Member 'W_CharacterCreator_C_PlayVOAudio::CallFunc_SetRTPCValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.Pagination
// 0x00A0 (0x00A0 - 0x0000)
struct W_CharacterCreator_C_Pagination final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_2;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_3;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_4;            // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_Pagination) == 0x000008, "Wrong alignment on W_CharacterCreator_C_Pagination");
static_assert(sizeof(W_CharacterCreator_C_Pagination) == 0x0000A0, "Wrong size on W_CharacterCreator_C_Pagination");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000000, "Member 'W_CharacterCreator_C_Pagination::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000008, "Member 'W_CharacterCreator_C_Pagination::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000010, "Member 'W_CharacterCreator_C_Pagination::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000018, "Member 'W_CharacterCreator_C_Pagination::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000020, "Member 'W_CharacterCreator_C_Pagination::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_GetActiveWidget_ReturnValue) == 0x000028, "Member 'W_CharacterCreator_C_Pagination::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'W_CharacterCreator_C_Pagination::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'W_CharacterCreator_C_Pagination::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'W_CharacterCreator_C_Pagination::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000048, "Member 'W_CharacterCreator_C_Pagination::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000050, "Member 'W_CharacterCreator_C_Pagination::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'W_CharacterCreator_C_Pagination::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_GetActiveWidget_ReturnValue_2) == 0x000060, "Member 'W_CharacterCreator_C_Pagination::CallFunc_GetActiveWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000068, "Member 'W_CharacterCreator_C_Pagination::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_PlayAnimation_ReturnValue_3) == 0x000070, "Member 'W_CharacterCreator_C_Pagination::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_GetActiveWidget_ReturnValue_3) == 0x000078, "Member 'W_CharacterCreator_C_Pagination::CallFunc_GetActiveWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_EqualEqual_ObjectObject_ReturnValue_3) == 0x000080, "Member 'W_CharacterCreator_C_Pagination::CallFunc_EqualEqual_ObjectObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_PlayAnimation_ReturnValue_4) == 0x000088, "Member 'W_CharacterCreator_C_Pagination::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_GetActiveWidget_ReturnValue_4) == 0x000090, "Member 'W_CharacterCreator_C_Pagination::CallFunc_GetActiveWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_Pagination, CallFunc_EqualEqual_ObjectObject_ReturnValue_4) == 0x000098, "Member 'W_CharacterCreator_C_Pagination::CallFunc_EqualEqual_ObjectObject_ReturnValue_4' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.OnFactionConfirm
// 0x0010 (0x0010 - 0x0000)
struct W_CharacterCreator_C_OnFactionConfirm final
{
public:
	struct FGameplayTag                           InFactionTag;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	const class UP2FactionDefaultLoadout*         InFactionDefaultLoadout;                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_OnFactionConfirm) == 0x000008, "Wrong alignment on W_CharacterCreator_C_OnFactionConfirm");
static_assert(sizeof(W_CharacterCreator_C_OnFactionConfirm) == 0x000010, "Wrong size on W_CharacterCreator_C_OnFactionConfirm");
static_assert(offsetof(W_CharacterCreator_C_OnFactionConfirm, InFactionTag) == 0x000000, "Member 'W_CharacterCreator_C_OnFactionConfirm::InFactionTag' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_OnFactionConfirm, InFactionDefaultLoadout) == 0x000008, "Member 'W_CharacterCreator_C_OnFactionConfirm::InFactionDefaultLoadout' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.OnCreateCharacterSuccess
// 0x0020 (0x0020 - 0x0000)
struct W_CharacterCreator_C_OnCreateCharacterSuccess final
{
public:
	class FString                                 CharacterId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NickName_0;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CharacterCreator_C_OnCreateCharacterSuccess) == 0x000008, "Wrong alignment on W_CharacterCreator_C_OnCreateCharacterSuccess");
static_assert(sizeof(W_CharacterCreator_C_OnCreateCharacterSuccess) == 0x000020, "Wrong size on W_CharacterCreator_C_OnCreateCharacterSuccess");
static_assert(offsetof(W_CharacterCreator_C_OnCreateCharacterSuccess, CharacterId) == 0x000000, "Member 'W_CharacterCreator_C_OnCreateCharacterSuccess::CharacterId' has a wrong offset!");
static_assert(offsetof(W_CharacterCreator_C_OnCreateCharacterSuccess, NickName_0) == 0x000010, "Member 'W_CharacterCreator_C_OnCreateCharacterSuccess::NickName_0' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.OnCreateCharacterFail
// 0x0018 (0x0018 - 0x0000)
struct W_CharacterCreator_C_OnCreateCharacterFail final
{
public:
	class FText                                   Error;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_CharacterCreator_C_OnCreateCharacterFail) == 0x000008, "Wrong alignment on W_CharacterCreator_C_OnCreateCharacterFail");
static_assert(sizeof(W_CharacterCreator_C_OnCreateCharacterFail) == 0x000018, "Wrong size on W_CharacterCreator_C_OnCreateCharacterFail");
static_assert(offsetof(W_CharacterCreator_C_OnCreateCharacterFail, Error) == 0x000000, "Member 'W_CharacterCreator_C_OnCreateCharacterFail::Error' has a wrong offset!");

// Function W_CharacterCreator.W_CharacterCreator_C.ExecuteUbergraph_W_CharacterCreator
// 0x0380 (0x0380 - 0x0000)
struct W_CharacterCreator_C_ExecuteUbergraph_W_CharacterCreator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ClientLoginSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool LoadTutorial)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ClientLoginSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GenerateOptionsString_ReturnValue;        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Nickname;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& Error)>     K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& Endpoint, const class FString& InAccountId, const class FString& InCharacterId)> K2Node_CreateDelegate_OutputDelegate_5; // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Error_1;                        // 0x00E0(0x0018)(ConstParm)
	class FString                                 K2Node_CustomEvent_Endpoint;                       // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_AccountId;                      // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_CharacterId_1;                  // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBestConnectionEndpoint_ReturnValue;    // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0180(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_2;       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate_6;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID_1;                     // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate_7;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& InFactionTag, const class UP2FactionDefaultLoadout* InFactionDefaultLoadout)> K2Node_CreateDelegate_OutputDelegate_8; // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_FactionSelection_C*                  K2Node_DynamicCast_AsW_Faction_Selection;          // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Hero_Mannequin_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0280(0x0010)(ReferenceParm)
	class ABP_Hero_Mannequin_C*                   CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A7[0x1];                                      // 0x02A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_FactionSelection_C*                  K2Node_DynamicCast_AsW_Faction_Selection_1;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_SystemMenu_PopupWidget_SkipTutorial_C* CallFunc_Create_ReturnValue;                     // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LoadTutorial;                   // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ClientLoginSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
