#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ClothingUpgrade_ItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ClothingUpgrade_ItemWidget.W_ClothingUpgrade_ItemWidget_C
// 0x00D0 (0x0380 - 0x02B0)
class UW_ClothingUpgrade_ItemWidget_C final : public UP2ClothingUpgradeItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Available;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotBg;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotOutline;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectedFont;                                      // 0x02D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NormalFont;                                        // 0x0328(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void SetAvailable(bool InIsAvailable)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_ClothingUpgrade_ItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void BP_SetSelected(bool bInIsSelected)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ClothingUpgrade_ItemWidget_C">();
	}
	static class UW_ClothingUpgrade_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ClothingUpgrade_ItemWidget_C>();
	}
};
static_assert(alignof(UW_ClothingUpgrade_ItemWidget_C) == 0x000008, "Wrong alignment on UW_ClothingUpgrade_ItemWidget_C");
static_assert(sizeof(UW_ClothingUpgrade_ItemWidget_C) == 0x000380, "Wrong size on UW_ClothingUpgrade_ItemWidget_C");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UW_ClothingUpgrade_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, Img_Available) == 0x0002B8, "Member 'UW_ClothingUpgrade_ItemWidget_C::Img_Available' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, Img_SlotBg) == 0x0002C0, "Member 'UW_ClothingUpgrade_ItemWidget_C::Img_SlotBg' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, Img_SlotOutline) == 0x0002C8, "Member 'UW_ClothingUpgrade_ItemWidget_C::Img_SlotOutline' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, SelectedFont) == 0x0002D0, "Member 'UW_ClothingUpgrade_ItemWidget_C::SelectedFont' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_ItemWidget_C, NormalFont) == 0x000328, "Member 'UW_ClothingUpgrade_ItemWidget_C::NormalFont' has a wrong offset!");

}

