#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ClothingUpgrade

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ClothingUpgrade.W_ClothingUpgrade_C
// 0x0030 (0x05F0 - 0x05C0)
class UW_ClothingUpgrade_C final : public UP2ClothingUpgradeWidget
{
public:
	class UImage*                                 Img_Bg;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ClothingUpgrade_GroupWidget_C*       W_ClothingUpgrade_GroupWidgetA;                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ClothingUpgrade_GroupWidget_C*       W_ClothingUpgrade_GroupWidgetB;                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ClothingUpgrade_GroupWidget_C*       W_ClothingUpgrade_GroupWidgetC;                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ClothingUpgrade_C">();
	}
	static class UW_ClothingUpgrade_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ClothingUpgrade_C>();
	}
};
static_assert(alignof(UW_ClothingUpgrade_C) == 0x000008, "Wrong alignment on UW_ClothingUpgrade_C");
static_assert(sizeof(UW_ClothingUpgrade_C) == 0x0005F0, "Wrong size on UW_ClothingUpgrade_C");
static_assert(offsetof(UW_ClothingUpgrade_C, Img_Bg) == 0x0005C0, "Member 'UW_ClothingUpgrade_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_C, Img_Title_Line) == 0x0005C8, "Member 'UW_ClothingUpgrade_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_C, Txt_FacilityTitle) == 0x0005D0, "Member 'UW_ClothingUpgrade_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_C, W_ClothingUpgrade_GroupWidgetA) == 0x0005D8, "Member 'UW_ClothingUpgrade_C::W_ClothingUpgrade_GroupWidgetA' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_C, W_ClothingUpgrade_GroupWidgetB) == 0x0005E0, "Member 'UW_ClothingUpgrade_C::W_ClothingUpgrade_GroupWidgetB' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_C, W_ClothingUpgrade_GroupWidgetC) == 0x0005E8, "Member 'UW_ClothingUpgrade_C::W_ClothingUpgrade_GroupWidgetC' has a wrong offset!");

}

