#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ClothingUpgrade_DetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ClothingUpgrade_DetailWidget.W_ClothingUpgrade_DetailWidget_C
// 0x0028 (0x03B0 - 0x0388)
class UW_ClothingUpgrade_DetailWidget_C final : public UP2ClothingUpgradeDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Checked;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_UpgradedWipe;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ShowLevelInfo()	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_ClothingUpgrade_DetailWidget()	 // 0xae1e64;
	void ExecuteUbergraph_W_ClothingUpgrade_DetailWidget(int32 EntryPoint)	 // 0xae1e64;
	void BP_RefreshWidget(bool bLevelUpAvailable)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ClothingUpgrade_DetailWidget_C">();
	}
	static class UW_ClothingUpgrade_DetailWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ClothingUpgrade_DetailWidget_C>();
	}
};
static_assert(alignof(UW_ClothingUpgrade_DetailWidget_C) == 0x000008, "Wrong alignment on UW_ClothingUpgrade_DetailWidget_C");
static_assert(sizeof(UW_ClothingUpgrade_DetailWidget_C) == 0x0003B0, "Wrong size on UW_ClothingUpgrade_DetailWidget_C");
static_assert(offsetof(UW_ClothingUpgrade_DetailWidget_C, UberGraphFrame) == 0x000388, "Member 'UW_ClothingUpgrade_DetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_DetailWidget_C, Img_Checked) == 0x000390, "Member 'UW_ClothingUpgrade_DetailWidget_C::Img_Checked' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_DetailWidget_C, Img_Outline) == 0x000398, "Member 'UW_ClothingUpgrade_DetailWidget_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_DetailWidget_C, Img_Pattern) == 0x0003A0, "Member 'UW_ClothingUpgrade_DetailWidget_C::Img_Pattern' has a wrong offset!");
static_assert(offsetof(UW_ClothingUpgrade_DetailWidget_C, Img_UpgradedWipe) == 0x0003A8, "Member 'UW_ClothingUpgrade_DetailWidget_C::Img_UpgradedWipe' has a wrong offset!");

}

