#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ClothingUpgrade_DetailWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ClothingUpgrade_DetailWidget.W_ClothingUpgrade_DetailWidget_C.ExecuteUbergraph_W_ClothingUpgrade_DetailWidget
// 0x0058 (0x0058 - 0x0000)
struct W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLevelUpAvailable;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget) == 0x000008, "Wrong alignment on W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget");
static_assert(sizeof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget) == 0x000058, "Wrong size on W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, EntryPoint) == 0x000000, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, K2Node_MakeStruct_Margin) == 0x00002C, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, K2Node_MakeStruct_Margin_1) == 0x00003C, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, K2Node_Event_bLevelUpAvailable) == 0x00004C, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::K2Node_Event_bLevelUpAvailable' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000050, "Member 'W_ClothingUpgrade_DetailWidget_C_ExecuteUbergraph_W_ClothingUpgrade_DetailWidget::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");

// Function W_ClothingUpgrade_DetailWidget.W_ClothingUpgrade_DetailWidget_C.BP_RefreshWidget
// 0x0001 (0x0001 - 0x0000)
struct W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget final
{
public:
	bool                                          bLevelUpAvailable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget) == 0x000001, "Wrong alignment on W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget");
static_assert(sizeof(W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget) == 0x000001, "Wrong size on W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget");
static_assert(offsetof(W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget, bLevelUpAvailable) == 0x000000, "Member 'W_ClothingUpgrade_DetailWidget_C_BP_RefreshWidget::bLevelUpAvailable' has a wrong offset!");

}

