#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ClothingUpgrade_ItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ClothingUpgrade_ItemWidget.W_ClothingUpgrade_ItemWidget_C.SetAvailable
// 0x0001 (0x0001 - 0x0000)
struct W_ClothingUpgrade_ItemWidget_C_SetAvailable final
{
public:
	bool                                          InIsAvailable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ClothingUpgrade_ItemWidget_C_SetAvailable) == 0x000001, "Wrong alignment on W_ClothingUpgrade_ItemWidget_C_SetAvailable");
static_assert(sizeof(W_ClothingUpgrade_ItemWidget_C_SetAvailable) == 0x000001, "Wrong size on W_ClothingUpgrade_ItemWidget_C_SetAvailable");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_SetAvailable, InIsAvailable) == 0x000000, "Member 'W_ClothingUpgrade_ItemWidget_C_SetAvailable::InIsAvailable' has a wrong offset!");

// Function W_ClothingUpgrade_ItemWidget.W_ClothingUpgrade_ItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ClothingUpgrade_ItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ClothingUpgrade_ItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ClothingUpgrade_ItemWidget_C_PreConstruct");
static_assert(sizeof(W_ClothingUpgrade_ItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ClothingUpgrade_ItemWidget_C_PreConstruct");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ClothingUpgrade_ItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ClothingUpgrade_ItemWidget.W_ClothingUpgrade_ItemWidget_C.ExecuteUbergraph_W_ClothingUpgrade_ItemWidget
// 0x004C (0x004C - 0x0000)
struct W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsAvailable;                        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0038(0x0014)()
};
static_assert(alignof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget) == 0x000004, "Wrong alignment on W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget");
static_assert(sizeof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget) == 0x00004C, "Wrong size on W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, EntryPoint) == 0x000000, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_Event_InIsAvailable) == 0x000019, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_Event_InIsAvailable' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_Event_bInIsSelected) == 0x00001A, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, CallFunc_IsValid_ReturnValue) == 0x00001B, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, CallFunc_GetCurrentLevel_ReturnValue) == 0x00001C, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget, K2Node_MakeStruct_SlateColor_2) == 0x000038, "Member 'W_ClothingUpgrade_ItemWidget_C_ExecuteUbergraph_W_ClothingUpgrade_ItemWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function W_ClothingUpgrade_ItemWidget.W_ClothingUpgrade_ItemWidget_C.BP_SetSelected
// 0x0001 (0x0001 - 0x0000)
struct W_ClothingUpgrade_ItemWidget_C_BP_SetSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ClothingUpgrade_ItemWidget_C_BP_SetSelected) == 0x000001, "Wrong alignment on W_ClothingUpgrade_ItemWidget_C_BP_SetSelected");
static_assert(sizeof(W_ClothingUpgrade_ItemWidget_C_BP_SetSelected) == 0x000001, "Wrong size on W_ClothingUpgrade_ItemWidget_C_BP_SetSelected");
static_assert(offsetof(W_ClothingUpgrade_ItemWidget_C_BP_SetSelected, bInIsSelected) == 0x000000, "Member 'W_ClothingUpgrade_ItemWidget_C_BP_SetSelected::bInIsSelected' has a wrong offset!");

}

