#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonCategoryMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.SetWishlistStyle
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategoryMenuWidget_C_SetWishlistStyle final
{
public:
	bool                                          IsWishlist_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_SetWishlistStyle) == 0x000001, "Wrong alignment on W_CommonCategoryMenuWidget_C_SetWishlistStyle");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_SetWishlistStyle) == 0x000001, "Wrong size on W_CommonCategoryMenuWidget_C_SetWishlistStyle");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetWishlistStyle, IsWishlist_0) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_SetWishlistStyle::IsWishlist_0' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.SetSelectedState
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategoryMenuWidget_C_SetSelectedState final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_SetSelectedState) == 0x000001, "Wrong alignment on W_CommonCategoryMenuWidget_C_SetSelectedState");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_SetSelectedState) == 0x000001, "Wrong size on W_CommonCategoryMenuWidget_C_SetSelectedState");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetSelectedState, IsSelected_0) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_SetSelectedState::IsSelected_0' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.SetExpandedState
// 0x0002 (0x0002 - 0x0000)
struct W_CommonCategoryMenuWidget_C_SetExpandedState final
{
public:
	bool                                          IsExpandable_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExpanded_0;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_SetExpandedState) == 0x000001, "Wrong alignment on W_CommonCategoryMenuWidget_C_SetExpandedState");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_SetExpandedState) == 0x000002, "Wrong size on W_CommonCategoryMenuWidget_C_SetExpandedState");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetExpandedState, IsExpandable_0) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_SetExpandedState::IsExpandable_0' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetExpandedState, IsExpanded_0) == 0x000001, "Member 'W_CommonCategoryMenuWidget_C_SetExpandedState::IsExpanded_0' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.SetCategoryType
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategoryMenuWidget_C_SetCategoryType final
{
public:
	bool                                          IsExpandable_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_SetCategoryType) == 0x000001, "Wrong alignment on W_CommonCategoryMenuWidget_C_SetCategoryType");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_SetCategoryType) == 0x000001, "Wrong size on W_CommonCategoryMenuWidget_C_SetCategoryType");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryType, IsExpandable_0) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryType::IsExpandable_0' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.SetCategoryInfo
// 0x00B0 (0x00B0 - 0x0000)
struct W_CommonCategoryMenuWidget_C_SetCategoryInfo final
{
public:
	class FText                                   CategoryNameText_0;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CategoryCountInt_0;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_SetCategoryInfo) == 0x000008, "Wrong alignment on W_CommonCategoryMenuWidget_C_SetCategoryInfo");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_SetCategoryInfo) == 0x0000B0, "Wrong size on W_CommonCategoryMenuWidget_C_SetCategoryInfo");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, CategoryNameText_0) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::CategoryNameText_0' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, CategoryCountInt_0) == 0x000018, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::CategoryCountInt_0' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, K2Node_MakeArray_Array) == 0x000088, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_SetCategoryInfo, CallFunc_Format_ReturnValue) == 0x000098, "Member 'W_CommonCategoryMenuWidget_C_SetCategoryInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategoryMenuWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_CommonCategoryMenuWidget_C_PreConstruct");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_PreConstruct) == 0x000001, "Wrong size on W_CommonCategoryMenuWidget_C_PreConstruct");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C.ExecuteUbergraph_W_CommonCategoryMenuWidget
// 0x0008 (0x0008 - 0x0000)
struct W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget) == 0x000004, "Wrong alignment on W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget");
static_assert(sizeof(W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget) == 0x000008, "Wrong size on W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget, EntryPoint) == 0x000000, "Member 'W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_CommonCategoryMenuWidget_C_ExecuteUbergraph_W_CommonCategoryMenuWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

