#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonVirtualSlot

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CommonVirtualSlot.W_CommonVirtualSlot_C.InitializeSlotDesign
// 0x0001 (0x0001 - 0x0000)
struct W_CommonVirtualSlot_C_InitializeSlotDesign final
{
public:
	EP2SlotWidgetType                             SlotIndex;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonVirtualSlot_C_InitializeSlotDesign) == 0x000001, "Wrong alignment on W_CommonVirtualSlot_C_InitializeSlotDesign");
static_assert(sizeof(W_CommonVirtualSlot_C_InitializeSlotDesign) == 0x000001, "Wrong size on W_CommonVirtualSlot_C_InitializeSlotDesign");
static_assert(offsetof(W_CommonVirtualSlot_C_InitializeSlotDesign, SlotIndex) == 0x000000, "Member 'W_CommonVirtualSlot_C_InitializeSlotDesign::SlotIndex' has a wrong offset!");

// Function W_CommonVirtualSlot.W_CommonVirtualSlot_C.ExecuteUbergraph_W_CommonVirtualSlot
// 0x0128 (0x0128 - 0x0000)
struct W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_8;                        // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_9;                        // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_10;                       // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_11;                       // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_12;                       // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_13;                       // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_14;                       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_15;                       // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EP2SlotWidgetType                             K2Node_Event_SlotIndex;                            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot) == 0x000008, "Wrong alignment on W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot");
static_assert(sizeof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot) == 0x000128, "Wrong size on W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, EntryPoint) == 0x000000, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_2) == 0x000024, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_3) == 0x000034, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_4) == 0x000044, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_5) == 0x000054, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_6) == 0x000064, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_7) == 0x000074, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_7' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_8) == 0x000084, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_8' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_9) == 0x000094, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_9' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_10) == 0x0000A4, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_10' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B8, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_11) == 0x0000C0, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_11' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_12) == 0x0000D0, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_12' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_13) == 0x0000E0, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_13' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_14) == 0x0000F0, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_14' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_MakeStruct_Margin_15) == 0x000100, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_MakeStruct_Margin_15' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_Event_SlotIndex) == 0x000110, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_Event_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, K2Node_SwitchEnum_CmpSuccess) == 0x000111, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x000118, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'W_CommonVirtualSlot_C_ExecuteUbergraph_W_CommonVirtualSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

