#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ContractMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ContractMain.W_ContractMain_C
// 0x0060 (0x0778 - 0x0718)
class UW_ContractMain_C final : public UP2ContractMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Contract_ItemListGroupWidget_C*      Contract_ItemListGroup_Alpha;                      // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemListGroupWidget_C*      Contract_ItemListGroup_Bravo;                      // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemListGroupWidget_C*      Contract_ItemListGroup_Charlie;                    // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_Skip;                                   // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         FactionInt;                                        // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ContractName;                                      // 0x0748(0x0018)(Edit, BlueprintVisible)
	class FText                                   ContractBody;                                      // 0x0760(0x0018)(Edit, BlueprintVisible)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_ContractMain(int32 EntryPoint)	 // 0xae1e64;
	void MakeContracrListGroup()	 // 0xae1e64;
	void OnFinishAdded()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetFaction(int32 FactionInt_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ContractMain_C">();
	}
	static class UW_ContractMain_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ContractMain_C>();
	}
};
static_assert(alignof(UW_ContractMain_C) == 0x000008, "Wrong alignment on UW_ContractMain_C");
static_assert(sizeof(UW_ContractMain_C) == 0x000778, "Wrong size on UW_ContractMain_C");
static_assert(offsetof(UW_ContractMain_C, UberGraphFrame) == 0x000718, "Member 'UW_ContractMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, Contract_ItemListGroup_Alpha) == 0x000720, "Member 'UW_ContractMain_C::Contract_ItemListGroup_Alpha' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, Contract_ItemListGroup_Bravo) == 0x000728, "Member 'UW_ContractMain_C::Contract_ItemListGroup_Bravo' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, Contract_ItemListGroup_Charlie) == 0x000730, "Member 'UW_ContractMain_C::Contract_ItemListGroup_Charlie' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, W_Keyguide_Skip) == 0x000738, "Member 'UW_ContractMain_C::W_Keyguide_Skip' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, FactionInt) == 0x000740, "Member 'UW_ContractMain_C::FactionInt' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, ContractName) == 0x000748, "Member 'UW_ContractMain_C::ContractName' has a wrong offset!");
static_assert(offsetof(UW_ContractMain_C, ContractBody) == 0x000760, "Member 'UW_ContractMain_C::ContractBody' has a wrong offset!");

}

