#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ItemWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.ExecuteUbergraph_W_Contract_ItemWidget
// 0x000C (0x000C - 0x0000)
struct W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractItemWidgetState                    K2Node_Event_InWidgetState;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractState                              K2Node_Event_InContractState;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget) == 0x000004, "Wrong alignment on W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget");
static_assert(sizeof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget) == 0x00000C, "Wrong size on W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, EntryPoint) == 0x000000, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, K2Node_Event_InWidgetState) == 0x000005, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::K2Node_Event_InWidgetState' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x000007, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget, K2Node_Event_InContractState) == 0x000008, "Member 'W_Contract_ItemWidget_C_ExecuteUbergraph_W_Contract_ItemWidget::K2Node_Event_InContractState' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.OnSetContractState_Implementation
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ItemWidget_C_OnSetContractState_Implementation final
{
public:
	EP2ContractState                              InContractState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_OnSetContractState_Implementation) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_OnSetContractState_Implementation");
static_assert(sizeof(W_Contract_ItemWidget_C_OnSetContractState_Implementation) == 0x000001, "Wrong size on W_Contract_ItemWidget_C_OnSetContractState_Implementation");
static_assert(offsetof(W_Contract_ItemWidget_C_OnSetContractState_Implementation, InContractState) == 0x000000, "Member 'W_Contract_ItemWidget_C_OnSetContractState_Implementation::InContractState' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.OnSetWidgetState_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent final
{
public:
	EP2ContractItemWidgetState                    InWidgetState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent");
static_assert(sizeof(W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent) == 0x000001, "Wrong size on W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent");
static_assert(offsetof(W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent, InWidgetState) == 0x000000, "Member 'W_Contract_ItemWidget_C_OnSetWidgetState_ImplementableEvent::InWidgetState' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_PreConstruct");
static_assert(sizeof(W_Contract_ItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Contract_ItemWidget_C_PreConstruct");
static_assert(offsetof(W_Contract_ItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Contract_ItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.SetContractInfo
// 0x0040 (0x0040 - 0x0000)
struct W_Contract_ItemWidget_C_SetContractInfo final
{
public:
	bool                                          InIsThread;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsLeaderThread;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_SetContractInfo) == 0x000008, "Wrong alignment on W_Contract_ItemWidget_C_SetContractInfo");
static_assert(sizeof(W_Contract_ItemWidget_C_SetContractInfo) == 0x000040, "Wrong size on W_Contract_ItemWidget_C_SetContractInfo");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, InIsThread) == 0x000000, "Member 'W_Contract_ItemWidget_C_SetContractInfo::InIsThread' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, InIsLeaderThread) == 0x000001, "Member 'W_Contract_ItemWidget_C_SetContractInfo::InIsLeaderThread' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_Contract_ItemWidget_C_SetContractInfo::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_Contract_ItemWidget_C_SetContractInfo::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, K2Node_MakeStruct_Margin_2) == 0x000024, "Member 'W_Contract_ItemWidget_C_SetContractInfo::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractInfo, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'W_Contract_ItemWidget_C_SetContractInfo::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.SetContractState
// 0x0094 (0x0094 - 0x0000)
struct W_Contract_ItemWidget_C_SetContractState final
{
public:
	EP2ContractState                              InContractState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0058(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x006C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0080(0x0014)()
};
static_assert(alignof(W_Contract_ItemWidget_C_SetContractState) == 0x000004, "Wrong alignment on W_Contract_ItemWidget_C_SetContractState");
static_assert(sizeof(W_Contract_ItemWidget_C_SetContractState) == 0x000094, "Wrong size on W_Contract_ItemWidget_C_SetContractState");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, InContractState) == 0x000000, "Member 'W_Contract_ItemWidget_C_SetContractState::InContractState' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_4) == 0x000058, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_5) == 0x00006C, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetContractState, K2Node_MakeStruct_SlateColor_6) == 0x000080, "Member 'W_Contract_ItemWidget_C_SetContractState::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.SetItemState
// 0x0002 (0x0002 - 0x0000)
struct W_Contract_ItemWidget_C_SetItemState final
{
public:
	EP2ContractItemWidgetState                    InWidgetState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_SetItemState) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_SetItemState");
static_assert(sizeof(W_Contract_ItemWidget_C_SetItemState) == 0x000002, "Wrong size on W_Contract_ItemWidget_C_SetItemState");
static_assert(offsetof(W_Contract_ItemWidget_C_SetItemState, InWidgetState) == 0x000000, "Member 'W_Contract_ItemWidget_C_SetItemState::InWidgetState' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetItemState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'W_Contract_ItemWidget_C_SetItemState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.SetNotiDotVisibility
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ItemWidget_C_SetNotiDotVisibility final
{
public:
	bool                                          ShowNotiDot_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_SetNotiDotVisibility) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_SetNotiDotVisibility");
static_assert(sizeof(W_Contract_ItemWidget_C_SetNotiDotVisibility) == 0x000001, "Wrong size on W_Contract_ItemWidget_C_SetNotiDotVisibility");
static_assert(offsetof(W_Contract_ItemWidget_C_SetNotiDotVisibility, ShowNotiDot_0) == 0x000000, "Member 'W_Contract_ItemWidget_C_SetNotiDotVisibility::ShowNotiDot_0' has a wrong offset!");

// Function W_Contract_ItemWidget.W_Contract_ItemWidget_C.SetThreadOpenState
// 0x0004 (0x0004 - 0x0000)
struct W_Contract_ItemWidget_C_SetThreadOpenState final
{
public:
	bool                                          IsThreadOpened_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContractItemWidgetState                    ItemState_0;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemWidget_C_SetThreadOpenState) == 0x000001, "Wrong alignment on W_Contract_ItemWidget_C_SetThreadOpenState");
static_assert(sizeof(W_Contract_ItemWidget_C_SetThreadOpenState) == 0x000004, "Wrong size on W_Contract_ItemWidget_C_SetThreadOpenState");
static_assert(offsetof(W_Contract_ItemWidget_C_SetThreadOpenState, IsThreadOpened_0) == 0x000000, "Member 'W_Contract_ItemWidget_C_SetThreadOpenState::IsThreadOpened_0' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetThreadOpenState, ItemState_0) == 0x000001, "Member 'W_Contract_ItemWidget_C_SetThreadOpenState::ItemState_0' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetThreadOpenState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'W_Contract_ItemWidget_C_SetThreadOpenState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemWidget_C_SetThreadOpenState, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'W_Contract_ItemWidget_C_SetThreadOpenState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

