#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassExtractionTunnel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.ExecuteUbergraph_W_CompassExtractionTunnel
// 0x0190 (0x0190 - 0x0000)
struct W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExtractionTunnel_C*                 K2Node_DynamicCast_AsBP_Extraction_Tunnel;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearInTimeAnomaly_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      Temp_byte_Variable_10;                             // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2ExtractionTunnel* InAUV, EP2ExtractionTunnelState InState)> K2Node_CreateDelegate_OutputDelegate; // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDegree;                             // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      Temp_byte_Variable_11;                             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2MapMarkerComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetLocalHUD_ReturnValue;                  // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExtractionTunnel_C*                 K2Node_DynamicCast_AsBP_Extraction_Tunnel_1;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExtractionTunnel*                    K2Node_CustomEvent_InAUV;                          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      K2Node_CustomEvent_InState;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel) == 0x000008, "Wrong alignment on W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel");
static_assert(sizeof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel) == 0x000190, "Wrong size on W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, EntryPoint) == 0x000000, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable) == 0x000004, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_DynamicCast_AsBP_Extraction_Tunnel) == 0x000018, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_DynamicCast_AsBP_Extraction_Tunnel' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_IsNearInTimeAnomaly_ReturnValue) == 0x000021, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_IsNearInTimeAnomaly_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_1) == 0x000024, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_2) == 0x000038, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_3) == 0x000048, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_4) == 0x000058, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_5) == 0x000068, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_struct_Variable_6) == 0x000078, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable) == 0x000088, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_1) == 0x000089, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_2) == 0x00008A, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_3) == 0x00008B, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_4) == 0x00008C, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_5) == 0x00008D, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_6) == 0x00008E, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_7) == 0x00008F, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable) == 0x000090, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_8) == 0x000091, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_9) == 0x000092, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_10) == 0x000093, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_1) == 0x0000A4, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_2) == 0x0000A5, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_3) == 0x0000A6, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_4) == 0x0000A7, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_5) == 0x0000A8, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_6) == 0x0000A9, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_bool_Variable_7) == 0x0000AA, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Event_InDegree) == 0x0000AC, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Event_InDegree' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B0, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, Temp_byte_Variable_11) == 0x0000B8, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_IsValid_ReturnValue) == 0x0000B9, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Event_MyGeometry) == 0x0000C8, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Event_InDeltaTime) == 0x000100, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000108, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_IsValid_ReturnValue_1) == 0x000110, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetComponentByClass_ReturnValue) == 0x000118, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetLocalHUD_ReturnValue) == 0x000120, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetLocalHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000128, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_K2_GetPawn_ReturnValue) == 0x000130, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_GetDistanceTo_ReturnValue) == 0x000138, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00013C, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_DynamicCast_AsBP_Extraction_Tunnel_1) == 0x000140, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_DynamicCast_AsBP_Extraction_Tunnel_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Select_Default) == 0x000149, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_CustomEvent_InAUV) == 0x000150, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_CustomEvent_InAUV' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_CustomEvent_InState) == 0x000158, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Select_Default_1) == 0x00015C, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Select_Default_2) == 0x00016C, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_Select_Default_3) == 0x00016D, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, K2Node_SwitchEnum_CmpSuccess) == 0x00016E, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_BooleanAND_ReturnValue) == 0x00016F, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_SelectColor_ReturnValue) == 0x000170, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000180, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000188, "Member 'W_CompassExtractionTunnel_C_ExecuteUbergraph_W_CompassExtractionTunnel::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.Set Squad Member Index
// 0x0050 (0x0050 - 0x0000)
struct W_CompassExtractionTunnel_C_Set_Squad_Member_Index final
{
public:
	int32                                         InSquadIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetHudFromWorld_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SquadMemberColorData                CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData; // 0x0024(0x0024)(NoDestructor)
	bool                                          CallFunc_GetColorBySquadMemberIndex_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index) == 0x000008, "Wrong alignment on W_CompassExtractionTunnel_C_Set_Squad_Member_Index");
static_assert(sizeof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index) == 0x000050, "Wrong size on W_CompassExtractionTunnel_C_Set_Squad_Member_Index");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, InSquadIndex) == 0x000000, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::InSquadIndex' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_GetHudFromWorld_ReturnValue) == 0x000018, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_GetHudFromWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData) == 0x000024, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_ReturnValue) == 0x000048, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Set_Squad_Member_Index, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00004C, "Member 'W_CompassExtractionTunnel_C_Set_Squad_Member_Index::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.SetMarkerType
// 0x0028 (0x0028 - 0x0000)
struct W_CompassExtractionTunnel_C_SetMarkerType final
{
public:
	EP2MarkerType                                 InMarkerType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MarkerTypeIndex_0;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_SetMarkerType) == 0x000008, "Wrong alignment on W_CompassExtractionTunnel_C_SetMarkerType");
static_assert(sizeof(W_CompassExtractionTunnel_C_SetMarkerType) == 0x000028, "Wrong size on W_CompassExtractionTunnel_C_SetMarkerType");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, InMarkerType) == 0x000000, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::InMarkerType' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, MarkerTypeIndex_0) == 0x000008, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::MarkerTypeIndex_0' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_SetMarkerType, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000024, "Member 'W_CompassExtractionTunnel_C_SetMarkerType::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.State Changed
// 0x0010 (0x0010 - 0x0000)
struct W_CompassExtractionTunnel_C_State_Changed final
{
public:
	class AP2ExtractionTunnel*                    InAUV;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_State_Changed) == 0x000008, "Wrong alignment on W_CompassExtractionTunnel_C_State_Changed");
static_assert(sizeof(W_CompassExtractionTunnel_C_State_Changed) == 0x000010, "Wrong size on W_CompassExtractionTunnel_C_State_Changed");
static_assert(offsetof(W_CompassExtractionTunnel_C_State_Changed, InAUV) == 0x000000, "Member 'W_CompassExtractionTunnel_C_State_Changed::InAUV' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_State_Changed, InState) == 0x000008, "Member 'W_CompassExtractionTunnel_C_State_Changed::InState' has a wrong offset!");

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CompassExtractionTunnel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_Tick) == 0x000004, "Wrong alignment on W_CompassExtractionTunnel_C_Tick");
static_assert(sizeof(W_CompassExtractionTunnel_C_Tick) == 0x00003C, "Wrong size on W_CompassExtractionTunnel_C_Tick");
static_assert(offsetof(W_CompassExtractionTunnel_C_Tick, MyGeometry) == 0x000000, "Member 'W_CompassExtractionTunnel_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionTunnel_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CompassExtractionTunnel_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_CompassExtractionTunnel.W_CompassExtractionTunnel_C.UpdateDegreeDesign
// 0x0004 (0x0004 - 0x0000)
struct W_CompassExtractionTunnel_C_UpdateDegreeDesign final
{
public:
	float                                         InDegree;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionTunnel_C_UpdateDegreeDesign) == 0x000004, "Wrong alignment on W_CompassExtractionTunnel_C_UpdateDegreeDesign");
static_assert(sizeof(W_CompassExtractionTunnel_C_UpdateDegreeDesign) == 0x000004, "Wrong size on W_CompassExtractionTunnel_C_UpdateDegreeDesign");
static_assert(offsetof(W_CompassExtractionTunnel_C_UpdateDegreeDesign, InDegree) == 0x000000, "Member 'W_CompassExtractionTunnel_C_UpdateDegreeDesign::InDegree' has a wrong offset!");

}

