#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassOffScreenMapMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CompassOffScreenMapMarker.W_CompassOffScreenMapMarker_C
// 0x0018 (0x02A0 - 0x0288)
class UW_CompassOffScreenMapMarker_C final : public UP2OffScreenCompassPingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Marker;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SquadMemberIndex;                                  // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_CompassOffScreenMapMarker(int32 EntryPoint)	 // 0xae1e64;
	void SetCompassPingDesign(class UP2CompassPingWidget* InCompassPingWidget)	 // 0xae1e64;
	void SetWidgetDesign(int32 InSquadMemberIndex)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CompassOffScreenMapMarker_C">();
	}
	static class UW_CompassOffScreenMapMarker_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CompassOffScreenMapMarker_C>();
	}
};
static_assert(alignof(UW_CompassOffScreenMapMarker_C) == 0x000008, "Wrong alignment on UW_CompassOffScreenMapMarker_C");
static_assert(sizeof(UW_CompassOffScreenMapMarker_C) == 0x0002A0, "Wrong size on UW_CompassOffScreenMapMarker_C");
static_assert(offsetof(UW_CompassOffScreenMapMarker_C, UberGraphFrame) == 0x000288, "Member 'UW_CompassOffScreenMapMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CompassOffScreenMapMarker_C, Img_Marker) == 0x000290, "Member 'UW_CompassOffScreenMapMarker_C::Img_Marker' has a wrong offset!");
static_assert(offsetof(UW_CompassOffScreenMapMarker_C, SquadMemberIndex) == 0x000298, "Member 'UW_CompassOffScreenMapMarker_C::SquadMemberIndex' has a wrong offset!");

}

