#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ContractMain

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ContractMain.W_ContractMain_C.ExecuteUbergraph_W_ContractMain
// 0x0098 (0x0098 - 0x0000)
struct W_ContractMain_C_ExecuteUbergraph_W_ContractMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UP2RadioButton*                         CallFunc_GetRadioButton_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Common_LNB_Special_C*                K2Node_DynamicCast_AsW_Common_LNB_Special;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0044(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2RadioButton*                         CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain) == 0x000008, "Wrong alignment on W_ContractMain_C_ExecuteUbergraph_W_ContractMain");
static_assert(sizeof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain) == 0x000098, "Wrong size on W_ContractMain_C_ExecuteUbergraph_W_ContractMain");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, EntryPoint) == 0x000000, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_GetAllRadioButtons_ReturnValue) == 0x000018, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_GetAllRadioButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_GetRadioButton_ReturnValue) == 0x000028, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_GetRadioButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_DynamicCast_AsW_Common_LNB_Special) == 0x000038, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_DynamicCast_AsW_Common_LNB_Special' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_MakeStruct_SlateChildSize) == 0x000044, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000050, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_Event_IsDesignTime) == 0x000058, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_Array_Get_Item) == 0x000070, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000078, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_ExecuteUbergraph_W_ContractMain, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'W_ContractMain_C_ExecuteUbergraph_W_ContractMain::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function W_ContractMain.W_ContractMain_C.MakeContracrListGroup
// 0x000C (0x000C - 0x0000)
struct W_ContractMain_C_MakeContracrListGroup final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContractMain_C_MakeContracrListGroup) == 0x000004, "Wrong alignment on W_ContractMain_C_MakeContracrListGroup");
static_assert(sizeof(W_ContractMain_C_MakeContracrListGroup) == 0x00000C, "Wrong size on W_ContractMain_C_MakeContracrListGroup");
static_assert(offsetof(W_ContractMain_C_MakeContracrListGroup, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'W_ContractMain_C_MakeContracrListGroup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_MakeContracrListGroup, CallFunc_Array_Add_ReturnValue_1) == 0x000004, "Member 'W_ContractMain_C_MakeContracrListGroup::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ContractMain_C_MakeContracrListGroup, CallFunc_Array_Add_ReturnValue_2) == 0x000008, "Member 'W_ContractMain_C_MakeContracrListGroup::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function W_ContractMain.W_ContractMain_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ContractMain_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContractMain_C_PreConstruct) == 0x000001, "Wrong alignment on W_ContractMain_C_PreConstruct");
static_assert(sizeof(W_ContractMain_C_PreConstruct) == 0x000001, "Wrong size on W_ContractMain_C_PreConstruct");
static_assert(offsetof(W_ContractMain_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ContractMain_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ContractMain.W_ContractMain_C.SetFaction
// 0x0004 (0x0004 - 0x0000)
struct W_ContractMain_C_SetFaction final
{
public:
	int32                                         FactionInt_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContractMain_C_SetFaction) == 0x000004, "Wrong alignment on W_ContractMain_C_SetFaction");
static_assert(sizeof(W_ContractMain_C_SetFaction) == 0x000004, "Wrong size on W_ContractMain_C_SetFaction");
static_assert(offsetof(W_ContractMain_C_SetFaction, FactionInt_0) == 0x000000, "Member 'W_ContractMain_C_SetFaction::FactionInt_0' has a wrong offset!");

}

