#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonRewardWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonRewardWidget.W_CommonRewardWidget_C
// 0x0030 (0x03E8 - 0x03B8)
class UW_CommonRewardWidget_C final : public UP2CommonRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             GP_Reward;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ClaimedIcon;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkinColorGradient;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_Reward;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           Reward_Tag;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CommonRewardWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnSetRewardAnim_ImplementableEvent(bool InIsAnim)	 // 0xae1e64;
	void RefreshWidgetOnBP()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonRewardWidget_C">();
	}
	static class UW_CommonRewardWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonRewardWidget_C>();
	}
};
static_assert(alignof(UW_CommonRewardWidget_C) == 0x000008, "Wrong alignment on UW_CommonRewardWidget_C");
static_assert(sizeof(UW_CommonRewardWidget_C) == 0x0003E8, "Wrong size on UW_CommonRewardWidget_C");
static_assert(offsetof(UW_CommonRewardWidget_C, UberGraphFrame) == 0x0003B8, "Member 'UW_CommonRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonRewardWidget_C, GP_Reward) == 0x0003C0, "Member 'UW_CommonRewardWidget_C::GP_Reward' has a wrong offset!");
static_assert(offsetof(UW_CommonRewardWidget_C, Img_ClaimedIcon) == 0x0003C8, "Member 'UW_CommonRewardWidget_C::Img_ClaimedIcon' has a wrong offset!");
static_assert(offsetof(UW_CommonRewardWidget_C, Img_SkinColorGradient) == 0x0003D0, "Member 'UW_CommonRewardWidget_C::Img_SkinColorGradient' has a wrong offset!");
static_assert(offsetof(UW_CommonRewardWidget_C, SclB_Reward) == 0x0003D8, "Member 'UW_CommonRewardWidget_C::SclB_Reward' has a wrong offset!");
static_assert(offsetof(UW_CommonRewardWidget_C, Reward_Tag) == 0x0003E0, "Member 'UW_CommonRewardWidget_C::Reward_Tag' has a wrong offset!");

}

