#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassPingHud

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_CompassPingHud.W_CompassPingHud_C.ExecuteUbergraph_W_CompassPingHud
// 0x0018 (0x0018 - 0x0000)
struct W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDegree;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud) == 0x000008, "Wrong alignment on W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud");
static_assert(sizeof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud) == 0x000018, "Wrong size on W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud");
static_assert(offsetof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud, EntryPoint) == 0x000000, "Member 'W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud, K2Node_Event_InDegree) == 0x000014, "Member 'W_CompassPingHud_C_ExecuteUbergraph_W_CompassPingHud::K2Node_Event_InDegree' has a wrong offset!");

// Function W_CompassPingHud.W_CompassPingHud_C.Set Squad Member Index
// 0x0050 (0x0050 - 0x0000)
struct W_CompassPingHud_C_Set_Squad_Member_Index final
{
public:
	int32                                         InSquadIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetHudFromWorld_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SquadMemberColorData                CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData; // 0x0024(0x0024)(NoDestructor)
	bool                                          CallFunc_GetColorBySquadMemberIndex_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassPingHud_C_Set_Squad_Member_Index) == 0x000008, "Wrong alignment on W_CompassPingHud_C_Set_Squad_Member_Index");
static_assert(sizeof(W_CompassPingHud_C_Set_Squad_Member_Index) == 0x000050, "Wrong size on W_CompassPingHud_C_Set_Squad_Member_Index");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, InSquadIndex) == 0x000000, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::InSquadIndex' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_GetHudFromWorld_ReturnValue) == 0x000018, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_GetHudFromWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData) == 0x000024, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_ReturnValue) == 0x000048, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_Set_Squad_Member_Index, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00004C, "Member 'W_CompassPingHud_C_Set_Squad_Member_Index::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassPingHud.W_CompassPingHud_C.SetPingType
// 0x0020 (0x0020 - 0x0000)
struct W_CompassPingHud_C_SetPingType final
{
public:
	EP2PingType                                   InPingType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassPingHud_C_SetPingType) == 0x000008, "Wrong alignment on W_CompassPingHud_C_SetPingType");
static_assert(sizeof(W_CompassPingHud_C_SetPingType) == 0x000020, "Wrong size on W_CompassPingHud_C_SetPingType");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, InPingType) == 0x000000, "Member 'W_CompassPingHud_C_SetPingType::InPingType' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'W_CompassPingHud_C_SetPingType::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_CompassPingHud_C_SetPingType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'W_CompassPingHud_C_SetPingType::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'W_CompassPingHud_C_SetPingType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassPingHud_C_SetPingType, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00001C, "Member 'W_CompassPingHud_C_SetPingType::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassPingHud.W_CompassPingHud_C.UpdateDegreeDesign
// 0x0004 (0x0004 - 0x0000)
struct W_CompassPingHud_C_UpdateDegreeDesign final
{
public:
	float                                         InDegree;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassPingHud_C_UpdateDegreeDesign) == 0x000004, "Wrong alignment on W_CompassPingHud_C_UpdateDegreeDesign");
static_assert(sizeof(W_CompassPingHud_C_UpdateDegreeDesign) == 0x000004, "Wrong size on W_CompassPingHud_C_UpdateDegreeDesign");
static_assert(offsetof(W_CompassPingHud_C_UpdateDegreeDesign, InDegree) == 0x000000, "Member 'W_CompassPingHud_C_UpdateDegreeDesign::InDegree' has a wrong offset!");

}

