#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ContainersLayout_Example_SS20_Modded

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ContainersLayout_Example_SS20_Modded.W_ContainersLayout_Example_SS20_Modded_C
// 0x0038 (0x02C0 - 0x0288)
class UW_ContainersLayout_Example_SS20_Modded_C final : public UP2ContainersLayoutWidget
{
public:
	class UW_Inventory_Container_C*               W_Inventory_Container;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_1;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_2;                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_3;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_4;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_5;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container_6;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ContainersLayout_Example_SS20_Modded_C">();
	}
	static class UW_ContainersLayout_Example_SS20_Modded_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ContainersLayout_Example_SS20_Modded_C>();
	}
};
static_assert(alignof(UW_ContainersLayout_Example_SS20_Modded_C) == 0x000008, "Wrong alignment on UW_ContainersLayout_Example_SS20_Modded_C");
static_assert(sizeof(UW_ContainersLayout_Example_SS20_Modded_C) == 0x0002C0, "Wrong size on UW_ContainersLayout_Example_SS20_Modded_C");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container) == 0x000288, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_1) == 0x000290, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_1' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_2) == 0x000298, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_2' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_3) == 0x0002A0, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_3' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_4) == 0x0002A8, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_4' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_5) == 0x0002B0, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_5' has a wrong offset!");
static_assert(offsetof(UW_ContainersLayout_Example_SS20_Modded_C, W_Inventory_Container_6) == 0x0002B8, "Member 'UW_ContainersLayout_Example_SS20_Modded_C::W_Inventory_Container_6' has a wrong offset!");

}

