#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonCategorySubMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonCategorySubMenuWidget.W_CommonCategorySubMenuWidget_C
// 0x0040 (0x0330 - 0x02F0)
class UW_CommonCategorySubMenuWidget_C final : public UP2CommonCategorySubMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_SubCategoryName;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Dot;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectBg;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SubCategoryNameText;                               // 0x0310(0x0018)(Edit, BlueprintVisible)
	int32                                         SubCategoryCountInt;                               // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CommonCategorySubMenuWidget(int32 EntryPoint)	 // 0xae1e64;
	void BndEvt__W_CommonCategorySubMenuWidget_Btn_SubCategoryMenu_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_CommonCategorySubMenuWidget_Btn_SubCategoryMenu_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void OnRefreshBtnWidgets()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetSelectedState(bool IsSelected_0)	 // 0xae1e64;
	void SetSubCategoryInfo(const class FText& SubCategoryNameText_0, int32 SubCategoryCountInt_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonCategorySubMenuWidget_C">();
	}
	static class UW_CommonCategorySubMenuWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonCategorySubMenuWidget_C>();
	}
};
static_assert(alignof(UW_CommonCategorySubMenuWidget_C) == 0x000008, "Wrong alignment on UW_CommonCategorySubMenuWidget_C");
static_assert(sizeof(UW_CommonCategorySubMenuWidget_C) == 0x000330, "Wrong size on UW_CommonCategorySubMenuWidget_C");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UW_CommonCategorySubMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, Bdr_SubCategoryName) == 0x0002F8, "Member 'UW_CommonCategorySubMenuWidget_C::Bdr_SubCategoryName' has a wrong offset!");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, Img_Dot) == 0x000300, "Member 'UW_CommonCategorySubMenuWidget_C::Img_Dot' has a wrong offset!");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, Img_SelectBg) == 0x000308, "Member 'UW_CommonCategorySubMenuWidget_C::Img_SelectBg' has a wrong offset!");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, SubCategoryNameText) == 0x000310, "Member 'UW_CommonCategorySubMenuWidget_C::SubCategoryNameText' has a wrong offset!");
static_assert(offsetof(UW_CommonCategorySubMenuWidget_C, SubCategoryCountInt) == 0x000328, "Member 'UW_CommonCategorySubMenuWidget_C::SubCategoryCountInt' has a wrong offset!");

}

