#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassExtractionAUV

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct W_CompassExtractionAUV_C_CustomEvent final
{
public:
	class AP2ExfiltrationAUV*                     InAUV;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_CustomEvent) == 0x000008, "Wrong alignment on W_CompassExtractionAUV_C_CustomEvent");
static_assert(sizeof(W_CompassExtractionAUV_C_CustomEvent) == 0x000010, "Wrong size on W_CompassExtractionAUV_C_CustomEvent");
static_assert(offsetof(W_CompassExtractionAUV_C_CustomEvent, InAUV) == 0x000000, "Member 'W_CompassExtractionAUV_C_CustomEvent::InAUV' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_CustomEvent, InState) == 0x000008, "Member 'W_CompassExtractionAUV_C_CustomEvent::InState' has a wrong offset!");

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.ExecuteUbergraph_W_CompassExtractionAUV
// 0x01A8 (0x01A8 - 0x0000)
struct W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ExfilAUV_Managed_C*                 K2Node_DynamicCast_AsBP_Exfil_AUV_Managed;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearInTimeAnomaly_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_11;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_12;                             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDegree;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2MapMarkerComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetLocalHUD_ReturnValue;                  // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_CustomEvent_InAUV;                          // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       K2Node_CustomEvent_InState;                        // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ExfilAUV_Managed_C*                 K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1;       // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV) == 0x000008, "Wrong alignment on W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV");
static_assert(sizeof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV) == 0x0001A8, "Wrong size on W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, EntryPoint) == 0x000000, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable) == 0x000004, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_DynamicCast_AsBP_Exfil_AUV_Managed) == 0x000008, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_DynamicCast_AsBP_Exfil_AUV_Managed' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_IsNearInTimeAnomaly_ReturnValue) == 0x000011, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_IsNearInTimeAnomaly_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_1) == 0x000012, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_2) == 0x000014, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_3) == 0x000028, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_4) == 0x000029, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_5) == 0x00002A, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_6) == 0x00002B, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_7) == 0x00002C, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_8) == 0x00002D, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_9) == 0x00002E, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_10) == 0x00002F, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_11) == 0x000030, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable) == 0x000034, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_1) == 0x000044, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_2) == 0x000054, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_3) == 0x000064, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_4) == 0x000074, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_5) == 0x000084, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_6) == 0x000094, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_struct_Variable_7) == 0x0000A4, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_byte_Variable_12) == 0x0000B4, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable) == 0x0000B5, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_1) == 0x0000B6, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_2) == 0x0000B7, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_3) == 0x0000B8, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_4) == 0x0000B9, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_5) == 0x0000BA, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_6) == 0x0000BB, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_7) == 0x0000BC, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Event_InDegree) == 0x0000C0, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Event_InDegree' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000C8, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Event_MyGeometry) == 0x0000E0, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Event_InDeltaTime) == 0x000118, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000120, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_IsValid_ReturnValue_1) == 0x000128, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, Temp_bool_Variable_8) == 0x000129, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetComponentByClass_ReturnValue) == 0x000130, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetLocalHUD_ReturnValue) == 0x000138, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetLocalHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000140, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_K2_GetPawn_ReturnValue) == 0x000148, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_GetDistanceTo_ReturnValue) == 0x000150, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_CustomEvent_InAUV) == 0x000158, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_CustomEvent_InAUV' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_CustomEvent_InState) == 0x000160, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000161, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Select_Default) == 0x000162, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Select_Default_1) == 0x000163, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Select_Default_2) == 0x000164, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_Select_Default_3) == 0x000174, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_SwitchEnum_CmpSuccess) == 0x000175, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_BooleanAND_ReturnValue) == 0x000176, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_SelectColor_ReturnValue) == 0x000178, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1) == 0x000188, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_DynamicCast_AsBP_Exfil_AUV_Managed_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x000198, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'W_CompassExtractionAUV_C_ExecuteUbergraph_W_CompassExtractionAUV::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.Set Squad Member Index
// 0x0050 (0x0050 - 0x0000)
struct W_CompassExtractionAUV_C_Set_Squad_Member_Index final
{
public:
	int32                                         InSquadIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetHudFromWorld_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SquadMemberColorData                CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData; // 0x0024(0x0024)(NoDestructor)
	bool                                          CallFunc_GetColorBySquadMemberIndex_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_Set_Squad_Member_Index) == 0x000008, "Wrong alignment on W_CompassExtractionAUV_C_Set_Squad_Member_Index");
static_assert(sizeof(W_CompassExtractionAUV_C_Set_Squad_Member_Index) == 0x000050, "Wrong size on W_CompassExtractionAUV_C_Set_Squad_Member_Index");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, InSquadIndex) == 0x000000, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::InSquadIndex' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_GetHudFromWorld_ReturnValue) == 0x000018, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_GetHudFromWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData) == 0x000024, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_GetColorBySquadMemberIndex_ReturnValue) == 0x000048, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_GetColorBySquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Set_Squad_Member_Index, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00004C, "Member 'W_CompassExtractionAUV_C_Set_Squad_Member_Index::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.SetMarkerType
// 0x0028 (0x0028 - 0x0000)
struct W_CompassExtractionAUV_C_SetMarkerType final
{
public:
	EP2MarkerType                                 InMarkerType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MarkerTypeIndex_0;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_SetMarkerType) == 0x000008, "Wrong alignment on W_CompassExtractionAUV_C_SetMarkerType");
static_assert(sizeof(W_CompassExtractionAUV_C_SetMarkerType) == 0x000028, "Wrong size on W_CompassExtractionAUV_C_SetMarkerType");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, InMarkerType) == 0x000000, "Member 'W_CompassExtractionAUV_C_SetMarkerType::InMarkerType' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, MarkerTypeIndex_0) == 0x000008, "Member 'W_CompassExtractionAUV_C_SetMarkerType::MarkerTypeIndex_0' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'W_CompassExtractionAUV_C_SetMarkerType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'W_CompassExtractionAUV_C_SetMarkerType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_CompassExtractionAUV_C_SetMarkerType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_SetMarkerType, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000024, "Member 'W_CompassExtractionAUV_C_SetMarkerType::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_CompassExtractionAUV_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_Tick) == 0x000004, "Wrong alignment on W_CompassExtractionAUV_C_Tick");
static_assert(sizeof(W_CompassExtractionAUV_C_Tick) == 0x00003C, "Wrong size on W_CompassExtractionAUV_C_Tick");
static_assert(offsetof(W_CompassExtractionAUV_C_Tick, MyGeometry) == 0x000000, "Member 'W_CompassExtractionAUV_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_CompassExtractionAUV_C_Tick, InDeltaTime) == 0x000038, "Member 'W_CompassExtractionAUV_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_CompassExtractionAUV.W_CompassExtractionAUV_C.UpdateDegreeDesign
// 0x0004 (0x0004 - 0x0000)
struct W_CompassExtractionAUV_C_UpdateDegreeDesign final
{
public:
	float                                         InDegree;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassExtractionAUV_C_UpdateDegreeDesign) == 0x000004, "Wrong alignment on W_CompassExtractionAUV_C_UpdateDegreeDesign");
static_assert(sizeof(W_CompassExtractionAUV_C_UpdateDegreeDesign) == 0x000004, "Wrong size on W_CompassExtractionAUV_C_UpdateDegreeDesign");
static_assert(offsetof(W_CompassExtractionAUV_C_UpdateDegreeDesign, InDegree) == 0x000000, "Member 'W_CompassExtractionAUV_C_UpdateDegreeDesign::InDegree' has a wrong offset!");

}

