#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonSlot.W_CommonSlot_C
// 0x0018 (0x0360 - 0x0348)
class UW_CommonSlot_C final : public UP2CommonSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                SlotBgBorder;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SlotOutlineBorder;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CommonSlot(int32 EntryPoint)	 // 0xae1e64;
	void InitializeSlotDesign(EP2SlotWidgetType SlotIndex)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonSlot_C">();
	}
	static class UW_CommonSlot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonSlot_C>();
	}
};
static_assert(alignof(UW_CommonSlot_C) == 0x000008, "Wrong alignment on UW_CommonSlot_C");
static_assert(sizeof(UW_CommonSlot_C) == 0x000360, "Wrong size on UW_CommonSlot_C");
static_assert(offsetof(UW_CommonSlot_C, UberGraphFrame) == 0x000348, "Member 'UW_CommonSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonSlot_C, SlotBgBorder) == 0x000350, "Member 'UW_CommonSlot_C::SlotBgBorder' has a wrong offset!");
static_assert(offsetof(UW_CommonSlot_C, SlotOutlineBorder) == 0x000358, "Member 'UW_CommonSlot_C::SlotOutlineBorder' has a wrong offset!");

}

