#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ObjectiveTypeWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Contract_ObjectiveTypeWidget.W_Contract_ObjectiveTypeWidget_C.ExecuteUbergraph_W_Contract_ObjectiveTypeWidget
// 0x0130 (0x0130 - 0x0000)
struct W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
static_assert(alignof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget) == 0x000008, "Wrong alignment on W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget");
static_assert(sizeof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget) == 0x000130, "Wrong size on W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget, EntryPoint) == 0x000000, "Member 'W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'W_Contract_ObjectiveTypeWidget_C_ExecuteUbergraph_W_Contract_ObjectiveTypeWidget::K2Node_Event_MouseEvent' has a wrong offset!");

// Function W_Contract_ObjectiveTypeWidget.W_Contract_ObjectiveTypeWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_Contract_ObjectiveTypeWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Contract_ObjectiveTypeWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_Contract_ObjectiveTypeWidget_C_OnMouseEnter");
static_assert(sizeof(W_Contract_ObjectiveTypeWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_Contract_ObjectiveTypeWidget_C_OnMouseEnter");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_Contract_ObjectiveTypeWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_Contract_ObjectiveTypeWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_Contract_ObjectiveTypeWidget.W_Contract_ObjectiveTypeWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_Contract_ObjectiveTypeWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Contract_ObjectiveTypeWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_Contract_ObjectiveTypeWidget_C_OnMouseLeave");
static_assert(sizeof(W_Contract_ObjectiveTypeWidget_C_OnMouseLeave) == 0x000078, "Wrong size on W_Contract_ObjectiveTypeWidget_C_OnMouseLeave");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_Contract_ObjectiveTypeWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_Contract_ObjectiveTypeWidget.W_Contract_ObjectiveTypeWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ObjectiveTypeWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ObjectiveTypeWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Contract_ObjectiveTypeWidget_C_PreConstruct");
static_assert(sizeof(W_Contract_ObjectiveTypeWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Contract_ObjectiveTypeWidget_C_PreConstruct");
static_assert(offsetof(W_Contract_ObjectiveTypeWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Contract_ObjectiveTypeWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

