#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Common_Tab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Common_Tab.W_Common_Tab_C
// 0x0110 (0x03E8 - 0x02D8)
class UW_Common_Tab_C final : public UP2NotificationNB
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Bottom;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockedIcon;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_NotiDot;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBar;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBg;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBg02;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Select;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LNBTitle;                                          // 0x0318(0x0018)(Edit, BlueprintVisible)
	bool                                          IsDisabled;                                        // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsChecked;                                         // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         UncheckedFont;                                     // 0x0338(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         CheckedFont;                                       // 0x0390(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Common_Tab_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Common_Tab_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Common_Tab(int32 EntryPoint)	 // 0xae1e64;
	void OnNotiActive_ImplementableEvent(bool InIsActive)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetState()	 // 0xae1e64;
	void UpdateSelectedDesign(bool InbSelected)	 // 0xae1e64;
	void UpdateUnlockedDesign(bool InbUnlocked)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Common_Tab_C">();
	}
	static class UW_Common_Tab_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Common_Tab_C>();
	}
};
static_assert(alignof(UW_Common_Tab_C) == 0x000008, "Wrong alignment on UW_Common_Tab_C");
static_assert(sizeof(UW_Common_Tab_C) == 0x0003E8, "Wrong size on UW_Common_Tab_C");
static_assert(offsetof(UW_Common_Tab_C, UberGraphFrame) == 0x0002D8, "Member 'UW_Common_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_Bottom) == 0x0002E0, "Member 'UW_Common_Tab_C::Img_Bottom' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_LockedIcon) == 0x0002E8, "Member 'UW_Common_Tab_C::Img_LockedIcon' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_NotiDot) == 0x0002F0, "Member 'UW_Common_Tab_C::Img_NotiDot' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_SelectedBar) == 0x0002F8, "Member 'UW_Common_Tab_C::Img_SelectedBar' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_SelectedBg) == 0x000300, "Member 'UW_Common_Tab_C::Img_SelectedBg' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Img_SelectedBg02) == 0x000308, "Member 'UW_Common_Tab_C::Img_SelectedBg02' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, Txt_Select) == 0x000310, "Member 'UW_Common_Tab_C::Txt_Select' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, LNBTitle) == 0x000318, "Member 'UW_Common_Tab_C::LNBTitle' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, IsDisabled) == 0x000330, "Member 'UW_Common_Tab_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, IsChecked) == 0x000331, "Member 'UW_Common_Tab_C::IsChecked' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, UncheckedFont) == 0x000338, "Member 'UW_Common_Tab_C::UncheckedFont' has a wrong offset!");
static_assert(offsetof(UW_Common_Tab_C, CheckedFont) == 0x000390, "Member 'UW_Common_Tab_C::CheckedFont' has a wrong offset!");

}

