#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonCategoryWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonCategoryWidget.W_CommonCategoryWidget_C
// 0x0028 (0x02C0 - 0x0298)
class UW_CommonCategoryWidget_C final : public UP2CommonCategoryWidget
{
public:
	class UW_CommonCategoryMenuWidget_C*          W_CommonCategoryMenuWidget;                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategoryMenuWidget_C*          W_CommonCategoryMenuWidget_1;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategoryMenuWidget_C*          W_CommonCategoryMenuWidget_2;                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategoryMenuWidget_C*          W_CommonCategoryMenuWidget_3;                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategoryMenuWidget_C*          W_CommonCategoryMenuWidget_4;                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonCategoryWidget_C">();
	}
	static class UW_CommonCategoryWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonCategoryWidget_C>();
	}
};
static_assert(alignof(UW_CommonCategoryWidget_C) == 0x000008, "Wrong alignment on UW_CommonCategoryWidget_C");
static_assert(sizeof(UW_CommonCategoryWidget_C) == 0x0002C0, "Wrong size on UW_CommonCategoryWidget_C");
static_assert(offsetof(UW_CommonCategoryWidget_C, W_CommonCategoryMenuWidget) == 0x000298, "Member 'UW_CommonCategoryWidget_C::W_CommonCategoryMenuWidget' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryWidget_C, W_CommonCategoryMenuWidget_1) == 0x0002A0, "Member 'UW_CommonCategoryWidget_C::W_CommonCategoryMenuWidget_1' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryWidget_C, W_CommonCategoryMenuWidget_2) == 0x0002A8, "Member 'UW_CommonCategoryWidget_C::W_CommonCategoryMenuWidget_2' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryWidget_C, W_CommonCategoryMenuWidget_3) == 0x0002B0, "Member 'UW_CommonCategoryWidget_C::W_CommonCategoryMenuWidget_3' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryWidget_C, W_CommonCategoryMenuWidget_4) == 0x0002B8, "Member 'UW_CommonCategoryWidget_C::W_CommonCategoryMenuWidget_4' has a wrong offset!");

}

