#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonItemWidget.W_CommonItemWidget_C
// 0x0110 (0x09D8 - 0x08C8)
class UW_CommonItemWidget_C final : public UP2CommonItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AmmoHorizontalBox;                                 // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ItemMarkBorder;                                // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ItemMarkIconBG;                                // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Quantity;                                      // 0x08E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_TypeIconShadow;                                // 0x08F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EquippedGradient;                              // 0x08F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_ItemType;                                      // 0x0900(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_LockIcon;                                      // 0x0908(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ValueInfoSlot;                                     // 0x0910(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_TL;                                             // 0x0918(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ItemIcon;                                          // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         ArmorDurabilityFont;                               // 0x0928(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         WeaponAmmoFont;                                    // 0x0980(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_CommonItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void InitializeItemWidgetDesign(EP2SlotWidgetType InSlotType)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateItemMark_ImplementableEvent(bool bIsContractRequired, bool bIsWishlist)	 // 0xae1e64;
	void UpdateItemWidgetPropertiesSize(EP2ItemWidgetPropertiesSize InItemWidgetPropertiesSize)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonItemWidget_C">();
	}
	static class UW_CommonItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonItemWidget_C>();
	}
};
static_assert(alignof(UW_CommonItemWidget_C) == 0x000008, "Wrong alignment on UW_CommonItemWidget_C");
static_assert(sizeof(UW_CommonItemWidget_C) == 0x0009D8, "Wrong size on UW_CommonItemWidget_C");
static_assert(offsetof(UW_CommonItemWidget_C, UberGraphFrame) == 0x0008C8, "Member 'UW_CommonItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, AmmoHorizontalBox) == 0x0008D0, "Member 'UW_CommonItemWidget_C::AmmoHorizontalBox' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Bdr_ItemMarkBorder) == 0x0008D8, "Member 'UW_CommonItemWidget_C::Bdr_ItemMarkBorder' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Bdr_ItemMarkIconBG) == 0x0008E0, "Member 'UW_CommonItemWidget_C::Bdr_ItemMarkIconBG' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Bdr_Quantity) == 0x0008E8, "Member 'UW_CommonItemWidget_C::Bdr_Quantity' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Bdr_TypeIconShadow) == 0x0008F0, "Member 'UW_CommonItemWidget_C::Bdr_TypeIconShadow' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Img_EquippedGradient) == 0x0008F8, "Member 'UW_CommonItemWidget_C::Img_EquippedGradient' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, Ovr_ItemType) == 0x000900, "Member 'UW_CommonItemWidget_C::Ovr_ItemType' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, SzB_LockIcon) == 0x000908, "Member 'UW_CommonItemWidget_C::SzB_LockIcon' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, ValueInfoSlot) == 0x000910, "Member 'UW_CommonItemWidget_C::ValueInfoSlot' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, VB_TL) == 0x000918, "Member 'UW_CommonItemWidget_C::VB_TL' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, ItemIcon) == 0x000920, "Member 'UW_CommonItemWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, ArmorDurabilityFont) == 0x000928, "Member 'UW_CommonItemWidget_C::ArmorDurabilityFont' has a wrong offset!");
static_assert(offsetof(UW_CommonItemWidget_C, WeaponAmmoFont) == 0x000980, "Member 'UW_CommonItemWidget_C::WeaponAmmoFont' has a wrong offset!");

}

