#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonCategorySubMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_CommonCategorySubMenuWidget.W_CommonCategorySubMenuWidget_C.ExecuteUbergraph_W_CommonCategorySubMenuWidget
// 0x0008 (0x0008 - 0x0000)
struct W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget) == 0x000004, "Wrong alignment on W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget");
static_assert(sizeof(W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget) == 0x000008, "Wrong size on W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget, EntryPoint) == 0x000000, "Member 'W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_CommonCategorySubMenuWidget_C_ExecuteUbergraph_W_CommonCategorySubMenuWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_CommonCategorySubMenuWidget.W_CommonCategorySubMenuWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategorySubMenuWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategorySubMenuWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_CommonCategorySubMenuWidget_C_PreConstruct");
static_assert(sizeof(W_CommonCategorySubMenuWidget_C_PreConstruct) == 0x000001, "Wrong size on W_CommonCategorySubMenuWidget_C_PreConstruct");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CommonCategorySubMenuWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CommonCategorySubMenuWidget.W_CommonCategorySubMenuWidget_C.SetSelectedState
// 0x0001 (0x0001 - 0x0000)
struct W_CommonCategorySubMenuWidget_C_SetSelectedState final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonCategorySubMenuWidget_C_SetSelectedState) == 0x000001, "Wrong alignment on W_CommonCategorySubMenuWidget_C_SetSelectedState");
static_assert(sizeof(W_CommonCategorySubMenuWidget_C_SetSelectedState) == 0x000001, "Wrong size on W_CommonCategorySubMenuWidget_C_SetSelectedState");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSelectedState, IsSelected_0) == 0x000000, "Member 'W_CommonCategorySubMenuWidget_C_SetSelectedState::IsSelected_0' has a wrong offset!");

// Function W_CommonCategorySubMenuWidget.W_CommonCategorySubMenuWidget_C.SetSubCategoryInfo
// 0x00B0 (0x00B0 - 0x0000)
struct W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo final
{
public:
	class FText                                   SubCategoryNameText_0;                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         SubCategoryCountInt_0;                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo) == 0x000008, "Wrong alignment on W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo");
static_assert(sizeof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo) == 0x0000B0, "Wrong size on W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, SubCategoryNameText_0) == 0x000000, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::SubCategoryNameText_0' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, SubCategoryCountInt_0) == 0x000018, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::SubCategoryCountInt_0' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, K2Node_MakeArray_Array) == 0x000088, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo, CallFunc_Format_ReturnValue) == 0x000098, "Member 'W_CommonCategorySubMenuWidget_C_SetSubCategoryInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

}

