#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Common_GNB

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Common_GNB.W_Common_GNB_C
// 0x0100 (0x03D8 - 0x02D8)
class UW_Common_GNB_C final : public UP2NotificationNB
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MinimizeAnim;                                      // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ExpandAnim;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Init;                                              // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Selected;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Btn_HoverOutline;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockedIcon;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_NotiDot;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Laptop_GNB;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Slash;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NormalGNBTitleFont;                                // 0x0328(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectedGNBTitleFont;                              // 0x0380(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Laptop_GNB_Btn_GNB_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Laptop_GNB_Btn_GNB_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Common_GNB(int32 EntryPoint)	 // 0xae1e64;
	void OnNotiActive_ImplementableEvent(bool InIsActive)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateSelectedDesign(bool InbSelected)	 // 0xae1e64;
	void UpdateUnlockedDesign(bool InbUnlocked)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Common_GNB_C">();
	}
	static class UW_Common_GNB_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Common_GNB_C>();
	}
};
static_assert(alignof(UW_Common_GNB_C) == 0x000008, "Wrong alignment on UW_Common_GNB_C");
static_assert(sizeof(UW_Common_GNB_C) == 0x0003D8, "Wrong size on UW_Common_GNB_C");
static_assert(offsetof(UW_Common_GNB_C, UberGraphFrame) == 0x0002D8, "Member 'UW_Common_GNB_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, MinimizeAnim) == 0x0002E0, "Member 'UW_Common_GNB_C::MinimizeAnim' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, ExpandAnim) == 0x0002E8, "Member 'UW_Common_GNB_C::ExpandAnim' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Init) == 0x0002F0, "Member 'UW_Common_GNB_C::Init' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Bdr_Selected) == 0x0002F8, "Member 'UW_Common_GNB_C::Bdr_Selected' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Img_Btn_HoverOutline) == 0x000300, "Member 'UW_Common_GNB_C::Img_Btn_HoverOutline' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Img_LockedIcon) == 0x000308, "Member 'UW_Common_GNB_C::Img_LockedIcon' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Img_NotiDot) == 0x000310, "Member 'UW_Common_GNB_C::Img_NotiDot' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, SzB_Laptop_GNB) == 0x000318, "Member 'UW_Common_GNB_C::SzB_Laptop_GNB' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, Txt_Slash) == 0x000320, "Member 'UW_Common_GNB_C::Txt_Slash' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, NormalGNBTitleFont) == 0x000328, "Member 'UW_Common_GNB_C::NormalGNBTitleFont' has a wrong offset!");
static_assert(offsetof(UW_Common_GNB_C, SelectedGNBTitleFont) == 0x000380, "Member 'UW_Common_GNB_C::SelectedGNBTitleFont' has a wrong offset!");

}

