#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassOffScreenMapMarker

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_CompassOffScreenMapMarker.W_CompassOffScreenMapMarker_C.ExecuteUbergraph_W_CompassOffScreenMapMarker
// 0x0050 (0x0050 - 0x0000)
struct W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InSquadMemberIndex;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP2HUD*                                 CallFunc_GetHudFromWorld_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2SquadMemberColorData                CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData; // 0x0020(0x0024)(NoDestructor)
	bool                                          CallFunc_GetColorBySquadMemberIndex_ReturnValue;   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker) == 0x000008, "Wrong alignment on W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker");
static_assert(sizeof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker) == 0x000050, "Wrong size on W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, EntryPoint) == 0x000000, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, K2Node_Event_InSquadMemberIndex) == 0x000004, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::K2Node_Event_InSquadMemberIndex' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_GetHudFromWorld_ReturnValue) == 0x000010, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_GetHudFromWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData) == 0x000020, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_GetColorBySquadMemberIndex_OutSquadMemberColorData' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_GetColorBySquadMemberIndex_ReturnValue) == 0x000044, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_GetColorBySquadMemberIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000048, "Member 'W_CompassOffScreenMapMarker_C_ExecuteUbergraph_W_CompassOffScreenMapMarker::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function W_CompassOffScreenMapMarker.W_CompassOffScreenMapMarker_C.SetCompassPingDesign
// 0x0048 (0x0048 - 0x0000)
struct W_CompassOffScreenMapMarker_C_SetCompassPingDesign final
{
public:
	class UP2CompassPingWidget*                   InCompassPingWidget;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_CompassMapMarker_C*                  K2Node_DynamicCast_AsW_Compass_Map_Marker;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UW_CompassWaypoint_C*                   K2Node_DynamicCast_AsW_Compass_Waypoint;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign) == 0x000008, "Wrong alignment on W_CompassOffScreenMapMarker_C_SetCompassPingDesign");
static_assert(sizeof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign) == 0x000048, "Wrong size on W_CompassOffScreenMapMarker_C_SetCompassPingDesign");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, InCompassPingWidget) == 0x000000, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::InCompassPingWidget' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, K2Node_DynamicCast_AsW_Compass_Map_Marker) == 0x000008, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::K2Node_DynamicCast_AsW_Compass_Map_Marker' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, K2Node_DynamicCast_AsW_Compass_Waypoint) == 0x000020, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::K2Node_DynamicCast_AsW_Compass_Waypoint' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000040, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetCompassPingDesign, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000044, "Member 'W_CompassOffScreenMapMarker_C_SetCompassPingDesign::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");

// Function W_CompassOffScreenMapMarker.W_CompassOffScreenMapMarker_C.SetWidgetDesign
// 0x0004 (0x0004 - 0x0000)
struct W_CompassOffScreenMapMarker_C_SetWidgetDesign final
{
public:
	int32                                         InSquadMemberIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassOffScreenMapMarker_C_SetWidgetDesign) == 0x000004, "Wrong alignment on W_CompassOffScreenMapMarker_C_SetWidgetDesign");
static_assert(sizeof(W_CompassOffScreenMapMarker_C_SetWidgetDesign) == 0x000004, "Wrong size on W_CompassOffScreenMapMarker_C_SetWidgetDesign");
static_assert(offsetof(W_CompassOffScreenMapMarker_C_SetWidgetDesign, InSquadMemberIndex) == 0x000000, "Member 'W_CompassOffScreenMapMarker_C_SetWidgetDesign::InSquadMemberIndex' has a wrong offset!");

}

