#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonRewardWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_CommonRewardWidget.W_CommonRewardWidget_C.ExecuteUbergraph_W_CommonRewardWidget
// 0x0140 (0x0140 - 0x0000)
struct W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InIsAnim;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00B8(0x0014)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2FactionData*                   CallFunc_GetFactionData_ReturnValue;               // 0x00D0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2;      // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_3;      // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget) == 0x000008, "Wrong alignment on W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget");
static_assert(sizeof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget) == 0x000140, "Wrong size on W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, EntryPoint) == 0x000000, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_IsValid_ReturnValue_1) == 0x00002D, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin) == 0x000058, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_1) == 0x000068, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_2) == 0x000078, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_3) == 0x000088, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_4) == 0x000098, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_Event_InIsAnim) == 0x0000A8, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_Event_InIsAnim' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B0, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_SlateColor_4) == 0x0000B8, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0000CC, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_SwitchEnum_CmpSuccess) == 0x0000CD, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_GetFactionData_ReturnValue) == 0x0000D0, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_GetFactionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000D8, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_DynamicCast_AsTexture_2D) == 0x0000E0, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x0000F0, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_MatchesTag_ReturnValue) == 0x0000F8, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_MatchesTag_ReturnValue_1) == 0x0000F9, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000FA, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_5) == 0x0000FC, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000110, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000118, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, K2Node_MakeStruct_Margin_6) == 0x000120, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2) == 0x000130, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_3) == 0x000138, "Member 'W_CommonRewardWidget_C_ExecuteUbergraph_W_CommonRewardWidget::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_3' has a wrong offset!");

// Function W_CommonRewardWidget.W_CommonRewardWidget_C.OnSetRewardAnim_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent final
{
public:
	bool                                          InIsAnim;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent) == 0x000001, "Wrong alignment on W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent");
static_assert(sizeof(W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent) == 0x000001, "Wrong size on W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent");
static_assert(offsetof(W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent, InIsAnim) == 0x000000, "Member 'W_CommonRewardWidget_C_OnSetRewardAnim_ImplementableEvent::InIsAnim' has a wrong offset!");

}

