#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ItemThreadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Contract_ItemThreadWidget.W_Contract_ItemThreadWidget_C
// 0x0028 (0x02D8 - 0x02B0)
class UW_Contract_ItemThreadWidget_C final : public UP2ContractThread
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Contract_ItemWidget_C*               W_Contract_ItemWidget_1;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemWidget_C*               W_Contract_ItemWidget_2;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemWidget_C*               W_Contract_ItemWidget_3;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLeadSelected;                                    // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeadOpened;                                      // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Contract_ItemThreadWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Contract_ItemThreadWidget_C">();
	}
	static class UW_Contract_ItemThreadWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Contract_ItemThreadWidget_C>();
	}
};
static_assert(alignof(UW_Contract_ItemThreadWidget_C) == 0x000008, "Wrong alignment on UW_Contract_ItemThreadWidget_C");
static_assert(sizeof(UW_Contract_ItemThreadWidget_C) == 0x0002D8, "Wrong size on UW_Contract_ItemThreadWidget_C");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UW_Contract_ItemThreadWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, W_Contract_ItemWidget_1) == 0x0002B8, "Member 'UW_Contract_ItemThreadWidget_C::W_Contract_ItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, W_Contract_ItemWidget_2) == 0x0002C0, "Member 'UW_Contract_ItemThreadWidget_C::W_Contract_ItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, W_Contract_ItemWidget_3) == 0x0002C8, "Member 'UW_Contract_ItemThreadWidget_C::W_Contract_ItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, IsLeadSelected) == 0x0002D0, "Member 'UW_Contract_ItemThreadWidget_C::IsLeadSelected' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemThreadWidget_C, IsLeadOpened) == 0x0002D1, "Member 'UW_Contract_ItemThreadWidget_C::IsLeadOpened' has a wrong offset!");

}

