#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassExtractionAUV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CompassExtractionAUV.W_CompassExtractionAUV_C
// 0x0030 (0x0320 - 0x02F0)
class UW_CompassExtractionAUV_C final : public UP2CompassPingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pulse;                                             // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_CompassMapMarker;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MarkerTypeIndex;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Show_Compass_Widget_Distance;                      // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  HudOwner;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void CustomEvent(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)	 // 0xae1e64;
	void ExecuteUbergraph_W_CompassExtractionAUV(int32 EntryPoint)	 // 0xae1e64;
	void Set_Squad_Member_Index(int32 InSquadIndex)	 // 0xae1e64;
	void SetMarkerType(EP2MarkerType InMarkerType)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void UpdateDegreeDesign(float InDegree)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CompassExtractionAUV_C">();
	}
	static class UW_CompassExtractionAUV_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CompassExtractionAUV_C>();
	}
};
static_assert(alignof(UW_CompassExtractionAUV_C) == 0x000008, "Wrong alignment on UW_CompassExtractionAUV_C");
static_assert(sizeof(UW_CompassExtractionAUV_C) == 0x000320, "Wrong size on UW_CompassExtractionAUV_C");
static_assert(offsetof(UW_CompassExtractionAUV_C, UberGraphFrame) == 0x0002F0, "Member 'UW_CompassExtractionAUV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CompassExtractionAUV_C, Pulse) == 0x0002F8, "Member 'UW_CompassExtractionAUV_C::Pulse' has a wrong offset!");
static_assert(offsetof(UW_CompassExtractionAUV_C, Img_CompassMapMarker) == 0x000300, "Member 'UW_CompassExtractionAUV_C::Img_CompassMapMarker' has a wrong offset!");
static_assert(offsetof(UW_CompassExtractionAUV_C, MarkerTypeIndex) == 0x000308, "Member 'UW_CompassExtractionAUV_C::MarkerTypeIndex' has a wrong offset!");
static_assert(offsetof(UW_CompassExtractionAUV_C, Show_Compass_Widget_Distance) == 0x000310, "Member 'UW_CompassExtractionAUV_C::Show_Compass_Widget_Distance' has a wrong offset!");
static_assert(offsetof(UW_CompassExtractionAUV_C, HudOwner) == 0x000318, "Member 'UW_CompassExtractionAUV_C::HudOwner' has a wrong offset!");

}

