#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Common_LNB_Tall

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Common_LNB_Tall.W_Common_LNB_Tall_C
// 0x0108 (0x03E0 - 0x02D8)
class UW_Common_LNB_Tall_C final : public UP2NotificationNB
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Selected;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockedIcon;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_NotiDot;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Common_LNB_Tall;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Select;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelect;                                          // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LNBTitle;                                          // 0x0310(0x0018)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         NormalLNBTitleFont;                                // 0x0328(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectedLNBTitleFont;                              // 0x0380(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         LnbWidth;                                          // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsSelect;                                        // 0x03DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateUnlockedDesign(bool InbUnlocked)	 // 0xae1e64;
	void UpdateSelectedDesign(bool InbSelected)	 // 0xae1e64;
	void SetSelectedLayout()	 // 0xae1e64;
	void SetHoveredLayout()	 // 0xae1e64;
	void SetDefaultLayout()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnNotiActive_ImplementableEvent(bool InIsActive)	 // 0xae1e64;
	void ExecuteUbergraph_W_Common_LNB_Tall(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BndEvt__W_Contract_LNBWidget_Btn_LNB_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Contract_LNBWidget_Btn_LNB_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Common_LNB_Tall_C">();
	}
	static class UW_Common_LNB_Tall_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Common_LNB_Tall_C>();
	}
};
static_assert(alignof(UW_Common_LNB_Tall_C) == 0x000008, "Wrong alignment on UW_Common_LNB_Tall_C");
static_assert(sizeof(UW_Common_LNB_Tall_C) == 0x0003E0, "Wrong size on UW_Common_LNB_Tall_C");
static_assert(offsetof(UW_Common_LNB_Tall_C, UberGraphFrame) == 0x0002D8, "Member 'UW_Common_LNB_Tall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, Bdr_Selected) == 0x0002E0, "Member 'UW_Common_LNB_Tall_C::Bdr_Selected' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, Img_LockedIcon) == 0x0002E8, "Member 'UW_Common_LNB_Tall_C::Img_LockedIcon' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, Img_NotiDot) == 0x0002F0, "Member 'UW_Common_LNB_Tall_C::Img_NotiDot' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, SzB_Common_LNB_Tall) == 0x0002F8, "Member 'UW_Common_LNB_Tall_C::SzB_Common_LNB_Tall' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, Txt_Select) == 0x000300, "Member 'UW_Common_LNB_Tall_C::Txt_Select' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, IsSelect) == 0x000308, "Member 'UW_Common_LNB_Tall_C::IsSelect' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, LNBTitle) == 0x000310, "Member 'UW_Common_LNB_Tall_C::LNBTitle' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, NormalLNBTitleFont) == 0x000328, "Member 'UW_Common_LNB_Tall_C::NormalLNBTitleFont' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, SelectedLNBTitleFont) == 0x000380, "Member 'UW_Common_LNB_Tall_C::SelectedLNBTitleFont' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, LnbWidth) == 0x0003D8, "Member 'UW_Common_LNB_Tall_C::LnbWidth' has a wrong offset!");
static_assert(offsetof(UW_Common_LNB_Tall_C, InIsSelect) == 0x0003DC, "Member 'UW_Common_LNB_Tall_C::InIsSelect' has a wrong offset!");

}

