#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ContextualHelper_ObjectiveWidget

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ContextualHelper_ObjectiveWidget.W_ContextualHelper_ObjectiveWidget_C.BP_OnIsCheckedChanged
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged final
{
public:
	bool                                          bInIsChecked;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged) == 0x000001, "Wrong alignment on W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged");
static_assert(sizeof(W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged) == 0x000001, "Wrong size on W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged, bInIsChecked) == 0x000000, "Member 'W_ContextualHelper_ObjectiveWidget_C_BP_OnIsCheckedChanged::bInIsChecked' has a wrong offset!");

// Function W_ContextualHelper_ObjectiveWidget.W_ContextualHelper_ObjectiveWidget_C.ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget
// 0x0068 (0x0068 - 0x0000)
struct W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsChecked;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget) == 0x000008, "Wrong alignment on W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget");
static_assert(sizeof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget) == 0x000068, "Wrong size on W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, EntryPoint) == 0x000000, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, Temp_delegate_Variable) == 0x000004, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, Temp_delegate_Variable_1) == 0x000014, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, K2Node_MakeStruct_SlateColor_1) == 0x00003C, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000050, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, K2Node_Event_IsDesignTime) == 0x000058, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, CallFunc_PostEvent_ReturnValue_1) == 0x00005C, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget, K2Node_Event_bInIsChecked) == 0x000060, "Member 'W_ContextualHelper_ObjectiveWidget_C_ExecuteUbergraph_W_ContextualHelper_ObjectiveWidget::K2Node_Event_bInIsChecked' has a wrong offset!");

// Function W_ContextualHelper_ObjectiveWidget.W_ContextualHelper_ObjectiveWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelper_ObjectiveWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelper_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ContextualHelper_ObjectiveWidget_C_PreConstruct");
static_assert(sizeof(W_ContextualHelper_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ContextualHelper_ObjectiveWidget_C_PreConstruct");
static_assert(offsetof(W_ContextualHelper_ObjectiveWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ContextualHelper_ObjectiveWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

