#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_TimeLimitWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Contract_TimeLimitWidget.W_Contract_TimeLimitWidget_C.ExecuteUbergraph_W_Contract_TimeLimitWidget
// 0x0130 (0x0130 - 0x0000)
struct W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
static_assert(alignof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget) == 0x000008, "Wrong alignment on W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget");
static_assert(sizeof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget) == 0x000130, "Wrong size on W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget, EntryPoint) == 0x000000, "Member 'W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'W_Contract_TimeLimitWidget_C_ExecuteUbergraph_W_Contract_TimeLimitWidget::K2Node_Event_MouseEvent' has a wrong offset!");

// Function W_Contract_TimeLimitWidget.W_Contract_TimeLimitWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_Contract_TimeLimitWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Contract_TimeLimitWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_Contract_TimeLimitWidget_C_OnMouseEnter");
static_assert(sizeof(W_Contract_TimeLimitWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_Contract_TimeLimitWidget_C_OnMouseEnter");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_Contract_TimeLimitWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_Contract_TimeLimitWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_Contract_TimeLimitWidget.W_Contract_TimeLimitWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_Contract_TimeLimitWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Contract_TimeLimitWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_Contract_TimeLimitWidget_C_OnMouseLeave");
static_assert(sizeof(W_Contract_TimeLimitWidget_C_OnMouseLeave) == 0x000078, "Wrong size on W_Contract_TimeLimitWidget_C_OnMouseLeave");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_Contract_TimeLimitWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_Contract_TimeLimitWidget.W_Contract_TimeLimitWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_TimeLimitWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_TimeLimitWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Contract_TimeLimitWidget_C_PreConstruct");
static_assert(sizeof(W_Contract_TimeLimitWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Contract_TimeLimitWidget_C_PreConstruct");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Contract_TimeLimitWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Contract_TimeLimitWidget.W_Contract_TimeLimitWidget_C.SetTime
// 0x02B0 (0x02B0 - 0x0000)
struct W_Contract_TimeLimitWidget_C_SetTime final
{
public:
	double                                        TimeRemSec_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SecondToTimer_OutHour;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutMinute;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutSecond;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutHour_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutMinute_1;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutSecond_1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_3;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0168(0x0010)(ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0180(0x0018)()
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x01A0(0x0018)()
	int64                                         CallFunc_Multiply_Int64Int64_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Subtract_Int64Int64_ReturnValue;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0230(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0290(0x0018)()
	float                                         CallFunc_SecondToTimer_Second_ImplicitCast;        // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SecondToTimer_Second_ImplicitCast_1;      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_TimeLimitWidget_C_SetTime) == 0x000008, "Wrong alignment on W_Contract_TimeLimitWidget_C_SetTime");
static_assert(sizeof(W_Contract_TimeLimitWidget_C_SetTime) == 0x0002B0, "Wrong size on W_Contract_TimeLimitWidget_C_SetTime");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, TimeRemSec_0) == 0x000000, "Member 'W_Contract_TimeLimitWidget_C_SetTime::TimeRemSec_0' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000009, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutHour) == 0x00000C, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutHour' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutMinute) == 0x000010, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutMinute' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutSecond) == 0x000014, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutSecond' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutHour_1) == 0x000018, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutHour_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutMinute_1) == 0x00001C, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutMinute_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_OutSecond_1) == 0x000020, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_OutSecond_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000030, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x0000D8, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeArray_Array) == 0x0000E0, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_IntToInt64_ReturnValue_3) == 0x0000F0, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_IntToInt64_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000160, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeArray_Array_1) == 0x000168, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000178, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Format_ReturnValue_1) == 0x000180, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_FFloor64_ReturnValue) == 0x000198, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0001A0, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Multiply_Int64Int64_ReturnValue) == 0x0001B8, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Multiply_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C0, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Subtract_Int64Int64_ReturnValue) == 0x000210, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Subtract_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000218, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeStruct_FormatArgumentData_4) == 0x000230, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, K2Node_MakeArray_Array_2) == 0x000280, "Member 'W_Contract_TimeLimitWidget_C_SetTime::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_Format_ReturnValue_2) == 0x000290, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_Second_ImplicitCast) == 0x0002A8, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_Second_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Contract_TimeLimitWidget_C_SetTime, CallFunc_SecondToTimer_Second_ImplicitCast_1) == 0x0002AC, "Member 'W_Contract_TimeLimitWidget_C_SetTime::CallFunc_SecondToTimer_Second_ImplicitCast_1' has a wrong offset!");

}

