#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_TransactionPopupWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Contract_TransactionPopupWidget.W_Contract_TransactionPopupWidget_C
// 0x0038 (0x05E8 - 0x05B0)
class UW_Contract_TransactionPopupWidget_C final : public UP2ContractTransactionPopup
{
public:
	class UTextBlock*                             AttachmentSlotTitleText;                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ContentDesc;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TopBarTitle;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transaction_ItemWidget_C*            W_Transaction_ItemWidget;                          // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transaction_ItemWidget_C*            W_Transaction_ItemWidget_1;                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transaction_ItemWidget_C*            W_Transaction_ItemWidget_2;                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Transaction_ItemWidget_C*            W_Transaction_ItemWidget_3;                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Contract_TransactionPopupWidget_C">();
	}
	static class UW_Contract_TransactionPopupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Contract_TransactionPopupWidget_C>();
	}
};
static_assert(alignof(UW_Contract_TransactionPopupWidget_C) == 0x000008, "Wrong alignment on UW_Contract_TransactionPopupWidget_C");
static_assert(sizeof(UW_Contract_TransactionPopupWidget_C) == 0x0005E8, "Wrong size on UW_Contract_TransactionPopupWidget_C");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, AttachmentSlotTitleText) == 0x0005B0, "Member 'UW_Contract_TransactionPopupWidget_C::AttachmentSlotTitleText' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, Txt_ContentDesc) == 0x0005B8, "Member 'UW_Contract_TransactionPopupWidget_C::Txt_ContentDesc' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, Txt_TopBarTitle) == 0x0005C0, "Member 'UW_Contract_TransactionPopupWidget_C::Txt_TopBarTitle' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, W_Transaction_ItemWidget) == 0x0005C8, "Member 'UW_Contract_TransactionPopupWidget_C::W_Transaction_ItemWidget' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, W_Transaction_ItemWidget_1) == 0x0005D0, "Member 'UW_Contract_TransactionPopupWidget_C::W_Transaction_ItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, W_Transaction_ItemWidget_2) == 0x0005D8, "Member 'UW_Contract_TransactionPopupWidget_C::W_Transaction_ItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Contract_TransactionPopupWidget_C, W_Transaction_ItemWidget_3) == 0x0005E0, "Member 'UW_Contract_TransactionPopupWidget_C::W_Transaction_ItemWidget_3' has a wrong offset!");

}

