#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassHud

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_CompassHud.W_CompassHud_C.CheckStateADS
// 0x000C (0x000C - 0x0000)
struct W_CompassHud_C_CheckStateADS final
{
public:
	bool                                          IsIsADS;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewLocalVar_0;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_CheckStateADS) == 0x000004, "Wrong alignment on W_CompassHud_C_CheckStateADS");
static_assert(sizeof(W_CompassHud_C_CheckStateADS) == 0x00000C, "Wrong size on W_CompassHud_C_CheckStateADS");
static_assert(offsetof(W_CompassHud_C_CheckStateADS, IsIsADS) == 0x000000, "Member 'W_CompassHud_C_CheckStateADS::IsIsADS' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_CheckStateADS, NewLocalVar_0) == 0x000004, "Member 'W_CompassHud_C_CheckStateADS::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_CheckStateADS, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'W_CompassHud_C_CheckStateADS::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_CheckStateADS, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000009, "Member 'W_CompassHud_C_CheckStateADS::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.ClearTimerHandle
// 0x0010 (0x0010 - 0x0000)
struct W_CompassHud_C_ClearTimerHandle final
{
public:
	struct FTimerHandle                           InTimerHandle;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_ClearTimerHandle) == 0x000008, "Wrong alignment on W_CompassHud_C_ClearTimerHandle");
static_assert(sizeof(W_CompassHud_C_ClearTimerHandle) == 0x000010, "Wrong size on W_CompassHud_C_ClearTimerHandle");
static_assert(offsetof(W_CompassHud_C_ClearTimerHandle, InTimerHandle) == 0x000000, "Member 'W_CompassHud_C_ClearTimerHandle::InTimerHandle' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_ClearTimerHandle, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000008, "Member 'W_CompassHud_C_ClearTimerHandle::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.ExecuteUbergraph_W_CompassHud
// 0x0008 (0x0008 - 0x0000)
struct W_CompassHud_C_ExecuteUbergraph_W_CompassHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsAds;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_ExecuteUbergraph_W_CompassHud) == 0x000004, "Wrong alignment on W_CompassHud_C_ExecuteUbergraph_W_CompassHud");
static_assert(sizeof(W_CompassHud_C_ExecuteUbergraph_W_CompassHud) == 0x000008, "Wrong size on W_CompassHud_C_ExecuteUbergraph_W_CompassHud");
static_assert(offsetof(W_CompassHud_C_ExecuteUbergraph_W_CompassHud, EntryPoint) == 0x000000, "Member 'W_CompassHud_C_ExecuteUbergraph_W_CompassHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_ExecuteUbergraph_W_CompassHud, K2Node_Event_IsAds) == 0x000004, "Member 'W_CompassHud_C_ExecuteUbergraph_W_CompassHud::K2Node_Event_IsAds' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.GetOverlayForCompassPing
// 0x0018 (0x0018 - 0x0000)
struct W_CompassHud_C_GetOverlayForCompassPing final
{
public:
	class UP2CompassPingWidget*                   InCompassPing;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_GetOverlayForCompassPing) == 0x000008, "Wrong alignment on W_CompassHud_C_GetOverlayForCompassPing");
static_assert(sizeof(W_CompassHud_C_GetOverlayForCompassPing) == 0x000018, "Wrong size on W_CompassHud_C_GetOverlayForCompassPing");
static_assert(offsetof(W_CompassHud_C_GetOverlayForCompassPing, InCompassPing) == 0x000000, "Member 'W_CompassHud_C_GetOverlayForCompassPing::InCompassPing' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_GetOverlayForCompassPing, ReturnValue) == 0x000008, "Member 'W_CompassHud_C_GetOverlayForCompassPing::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_GetOverlayForCompassPing, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_CompassHud_C_GetOverlayForCompassPing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_GetOverlayForCompassPing, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'W_CompassHud_C_GetOverlayForCompassPing::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.InitFadeOutTimer
// 0x0001 (0x0001 - 0x0000)
struct W_CompassHud_C_InitFadeOutTimer final
{
public:
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_InitFadeOutTimer) == 0x000001, "Wrong alignment on W_CompassHud_C_InitFadeOutTimer");
static_assert(sizeof(W_CompassHud_C_InitFadeOutTimer) == 0x000001, "Wrong size on W_CompassHud_C_InitFadeOutTimer");
static_assert(offsetof(W_CompassHud_C_InitFadeOutTimer, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000000, "Member 'W_CompassHud_C_InitFadeOutTimer::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.OnUpdateADSStatus_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent final
{
public:
	bool                                          IsAds;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent) == 0x000001, "Wrong alignment on W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent");
static_assert(sizeof(W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent) == 0x000001, "Wrong size on W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent");
static_assert(offsetof(W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent, IsAds) == 0x000000, "Member 'W_CompassHud_C_OnUpdateADSStatus_ImplementableEvent::IsAds' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.PlayFadeInAnim
// 0x0038 (0x0038 - 0x0000)
struct W_CompassHud_C_PlayFadeInAnim final
{
public:
	bool                                          InUseFadeOutTimer;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InFadeOutTime;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CompassPingWidget*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_PlayFadeInAnim) == 0x000008, "Wrong alignment on W_CompassHud_C_PlayFadeInAnim");
static_assert(sizeof(W_CompassHud_C_PlayFadeInAnim) == 0x000038, "Wrong size on W_CompassHud_C_PlayFadeInAnim");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, InUseFadeOutTimer) == 0x000000, "Member 'W_CompassHud_C_PlayFadeInAnim::InUseFadeOutTimer' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, InFadeOutTime) == 0x000008, "Member 'W_CompassHud_C_PlayFadeInAnim::InFadeOutTime' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_CompassHud_C_PlayFadeInAnim::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_CompassHud_C_PlayFadeInAnim::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_Array_Get_Item) == 0x000028, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeInAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000035, "Member 'W_CompassHud_C_PlayFadeInAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.PlayFadeOutAnim
// 0x0028 (0x0028 - 0x0000)
struct W_CompassHud_C_PlayFadeOutAnim final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2CompassPingWidget*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_PlayFadeOutAnim) == 0x000008, "Wrong alignment on W_CompassHud_C_PlayFadeOutAnim");
static_assert(sizeof(W_CompassHud_C_PlayFadeOutAnim) == 0x000028, "Wrong size on W_CompassHud_C_PlayFadeOutAnim");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, Temp_int_Array_Index_Variable) == 0x000000, "Member 'W_CompassHud_C_PlayFadeOutAnim::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_CompassHud_C_PlayFadeOutAnim::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_Array_Get_Item) == 0x000018, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_PlayFadeOutAnim, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000025, "Member 'W_CompassHud_C_PlayFadeOutAnim::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function W_CompassHud.W_CompassHud_C.SetFadeOutTimer
// 0x0018 (0x0018 - 0x0000)
struct W_CompassHud_C_SetFadeOutTimer final
{
public:
	double                                        Time;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CompassHud_C_SetFadeOutTimer) == 0x000008, "Wrong alignment on W_CompassHud_C_SetFadeOutTimer");
static_assert(sizeof(W_CompassHud_C_SetFadeOutTimer) == 0x000018, "Wrong size on W_CompassHud_C_SetFadeOutTimer");
static_assert(offsetof(W_CompassHud_C_SetFadeOutTimer, Time) == 0x000000, "Member 'W_CompassHud_C_SetFadeOutTimer::Time' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_SetFadeOutTimer, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'W_CompassHud_C_SetFadeOutTimer::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CompassHud_C_SetFadeOutTimer, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000010, "Member 'W_CompassHud_C_SetFadeOutTimer::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

}

