#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonButtonWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonButtonWidget.W_CommonButtonWidget_C
// 0x1040 (0x1400 - 0x03C0)
class UW_CommonButtonWidget_C final : public UP2CommonButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ButtonBg;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Button;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_BtnName;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Sldr_ShineAnim;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Button;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonName;                                        // 0x0400(0x0018)(Edit, BlueprintVisible)
	EPopupButtonID                                ButtonID;                                          // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x2];                                      // 0x041A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BtnWidth;                                          // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BtnHeight;                                         // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0xC];                                      // 0x0424(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           CancelNoBtnStyle;                                  // 0x0430(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           YesOkBtnStyle;                                     // 0x0820(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           NeutralBtnStyle;                                   // 0x0C10(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DefaultBtnStyle;                                   // 0x1000(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BtnNameScale;                                      // 0x13F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveKeyFocus()	 // 0xae1e64;
	void DeActiveKeyFocus()	 // 0xae1e64;
	void ExecuteUbergraph_W_CommonButtonWidget(int32 EntryPoint)	 // 0xae1e64;
	void Hovered_ImplementableEvent()	 // 0xae1e64;
	void Init(bool IsEnabled)	 // 0xae1e64;
	void OnSetButtonEnabled_ImplementableEvent(bool InIsEnable)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Release_ImplementableEvent()	 // 0xae1e64;
	void UnHovered_ImplementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonButtonWidget_C">();
	}
	static class UW_CommonButtonWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonButtonWidget_C>();
	}
};
static_assert(alignof(UW_CommonButtonWidget_C) == 0x000010, "Wrong alignment on UW_CommonButtonWidget_C");
static_assert(sizeof(UW_CommonButtonWidget_C) == 0x001400, "Wrong size on UW_CommonButtonWidget_C");
static_assert(offsetof(UW_CommonButtonWidget_C, UberGraphFrame) == 0x0003C0, "Member 'UW_CommonButtonWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, Bdr_ButtonBg) == 0x0003C8, "Member 'UW_CommonButtonWidget_C::Bdr_ButtonBg' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, Img_Stroke) == 0x0003D0, "Member 'UW_CommonButtonWidget_C::Img_Stroke' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, Img_Underline) == 0x0003D8, "Member 'UW_CommonButtonWidget_C::Img_Underline' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, Ovr_Button) == 0x0003E0, "Member 'UW_CommonButtonWidget_C::Ovr_Button' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, SclB_BtnName) == 0x0003E8, "Member 'UW_CommonButtonWidget_C::SclB_BtnName' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, Sldr_ShineAnim) == 0x0003F0, "Member 'UW_CommonButtonWidget_C::Sldr_ShineAnim' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, SzB_Button) == 0x0003F8, "Member 'UW_CommonButtonWidget_C::SzB_Button' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, ButtonName) == 0x000400, "Member 'UW_CommonButtonWidget_C::ButtonName' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, ButtonID) == 0x000418, "Member 'UW_CommonButtonWidget_C::ButtonID' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, IsDisabled) == 0x000419, "Member 'UW_CommonButtonWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, BtnWidth) == 0x00041C, "Member 'UW_CommonButtonWidget_C::BtnWidth' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, BtnHeight) == 0x000420, "Member 'UW_CommonButtonWidget_C::BtnHeight' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, CancelNoBtnStyle) == 0x000430, "Member 'UW_CommonButtonWidget_C::CancelNoBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, YesOkBtnStyle) == 0x000820, "Member 'UW_CommonButtonWidget_C::YesOkBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, NeutralBtnStyle) == 0x000C10, "Member 'UW_CommonButtonWidget_C::NeutralBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, DefaultBtnStyle) == 0x001000, "Member 'UW_CommonButtonWidget_C::DefaultBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_CommonButtonWidget_C, BtnNameScale) == 0x0013F0, "Member 'UW_CommonButtonWidget_C::BtnNameScale' has a wrong offset!");

}

