#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ItemListGroupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Contract_ItemListGroupWidget.W_Contract_ItemListGroupWidget_C.ExecuteUbergraph_W_Contract_ItemListGroupWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget) == 0x000004, "Wrong alignment on W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget");
static_assert(sizeof(W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget) == 0x000008, "Wrong size on W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget, EntryPoint) == 0x000000, "Member 'W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget, CallFunc_HasAnyChildren_ReturnValue) == 0x000005, "Member 'W_Contract_ItemListGroupWidget_C_ExecuteUbergraph_W_Contract_ItemListGroupWidget::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");

// Function W_Contract_ItemListGroupWidget.W_Contract_ItemListGroupWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Contract_ItemListGroupWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Contract_ItemListGroupWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Contract_ItemListGroupWidget_C_PreConstruct");
static_assert(sizeof(W_Contract_ItemListGroupWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Contract_ItemListGroupWidget_C_PreConstruct");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Contract_ItemListGroupWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Contract_ItemListGroupWidget.W_Contract_ItemListGroupWidget_C.SetItemListHeader
// 0x0088 (0x0088 - 0x0000)
struct W_Contract_ItemListGroupWidget_C_SetItemListHeader final
{
public:
	bool                                          IsStory_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDaily_0;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
};
static_assert(alignof(W_Contract_ItemListGroupWidget_C_SetItemListHeader) == 0x000008, "Wrong alignment on W_Contract_ItemListGroupWidget_C_SetItemListHeader");
static_assert(sizeof(W_Contract_ItemListGroupWidget_C_SetItemListHeader) == 0x000088, "Wrong size on W_Contract_ItemListGroupWidget_C_SetItemListHeader");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, IsStory_0) == 0x000000, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::IsStory_0' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, IsDaily_0) == 0x000001, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::IsDaily_0' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, K2Node_MakeArray_Array) == 0x000060, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Contract_ItemListGroupWidget_C_SetItemListHeader, CallFunc_Format_ReturnValue) == 0x000070, "Member 'W_Contract_ItemListGroupWidget_C_SetItemListHeader::CallFunc_Format_ReturnValue' has a wrong offset!");

}

