#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_DifficultyLabelWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Contract_DifficultyLabelWidget.W_Contract_DifficultyLabelWidget_C
// 0x0018 (0x0298 - 0x0280)
class UW_Contract_DifficultyLabelWidget_C final : public UP2ContractDifficultyLabel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_Difficulty;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Difficulty;                                        // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Contract_DifficultyLabelWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnSetDifficulty_ImplementableEvent(int32 InDifficulty)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetDifficulty(int32 Difficulty_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Contract_DifficultyLabelWidget_C">();
	}
	static class UW_Contract_DifficultyLabelWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Contract_DifficultyLabelWidget_C>();
	}
};
static_assert(alignof(UW_Contract_DifficultyLabelWidget_C) == 0x000008, "Wrong alignment on UW_Contract_DifficultyLabelWidget_C");
static_assert(sizeof(UW_Contract_DifficultyLabelWidget_C) == 0x000298, "Wrong size on UW_Contract_DifficultyLabelWidget_C");
static_assert(offsetof(UW_Contract_DifficultyLabelWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_Contract_DifficultyLabelWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Contract_DifficultyLabelWidget_C, Txt_Difficulty) == 0x000288, "Member 'UW_Contract_DifficultyLabelWidget_C::Txt_Difficulty' has a wrong offset!");
static_assert(offsetof(UW_Contract_DifficultyLabelWidget_C, Difficulty) == 0x000290, "Member 'UW_Contract_DifficultyLabelWidget_C::Difficulty' has a wrong offset!");

}

