#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CommonCategoryMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CommonCategoryMenuWidget.W_CommonCategoryMenuWidget_C
// 0x0078 (0x0398 - 0x0320)
class UW_CommonCategoryMenuWidget_C final : public UP2CommonCategoryMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_CategoryName;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Expand;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectBg;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_CategoryType;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_SubCategory;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategorySubMenuWidget_C*       W_CommonCategorySubMenuWidget;                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategorySubMenuWidget_C*       W_CommonCategorySubMenuWidget_1;                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategorySubMenuWidget_C*       W_CommonCategorySubMenuWidget_2;                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategorySubMenuWidget_C*       W_CommonCategorySubMenuWidget_3;                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCategorySubMenuWidget_C*       W_CommonCategorySubMenuWidget_4;                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CategoryNameText;                                  // 0x0378(0x0018)(Edit, BlueprintVisible)
	int32                                         CategoryCountInt;                                  // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetWishlistStyle(bool IsWishlist_0)	 // 0xae1e64;
	void SetSelectedState(bool IsSelected_0)	 // 0xae1e64;
	void SetExpandedState(bool IsExpandable_0, bool IsExpanded_0)	 // 0xae1e64;
	void SetCategoryType(bool IsExpandable_0)	 // 0xae1e64;
	void SetCategoryInfo(const class FText& CategoryNameText_0, int32 CategoryCountInt_0)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnRefreshBtnWidgets()	 // 0xae1e64;
	void ExecuteUbergraph_W_CommonCategoryMenuWidget(int32 EntryPoint)	 // 0xae1e64;
	void BndEvt__W_CommonCategoryMenuWidget_Btn_CategoryMenu_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_CommonCategoryMenuWidget_Btn_CategoryMenu_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CommonCategoryMenuWidget_C">();
	}
	static class UW_CommonCategoryMenuWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CommonCategoryMenuWidget_C>();
	}
};
static_assert(alignof(UW_CommonCategoryMenuWidget_C) == 0x000008, "Wrong alignment on UW_CommonCategoryMenuWidget_C");
static_assert(sizeof(UW_CommonCategoryMenuWidget_C) == 0x000398, "Wrong size on UW_CommonCategoryMenuWidget_C");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, UberGraphFrame) == 0x000320, "Member 'UW_CommonCategoryMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, Bdr_CategoryName) == 0x000328, "Member 'UW_CommonCategoryMenuWidget_C::Bdr_CategoryName' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, Bdr_Expand) == 0x000330, "Member 'UW_CommonCategoryMenuWidget_C::Bdr_Expand' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, Img_SelectBg) == 0x000338, "Member 'UW_CommonCategoryMenuWidget_C::Img_SelectBg' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, SzB_CategoryType) == 0x000340, "Member 'UW_CommonCategoryMenuWidget_C::SzB_CategoryType' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, VB_SubCategory) == 0x000348, "Member 'UW_CommonCategoryMenuWidget_C::VB_SubCategory' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, W_CommonCategorySubMenuWidget) == 0x000350, "Member 'UW_CommonCategoryMenuWidget_C::W_CommonCategorySubMenuWidget' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, W_CommonCategorySubMenuWidget_1) == 0x000358, "Member 'UW_CommonCategoryMenuWidget_C::W_CommonCategorySubMenuWidget_1' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, W_CommonCategorySubMenuWidget_2) == 0x000360, "Member 'UW_CommonCategoryMenuWidget_C::W_CommonCategorySubMenuWidget_2' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, W_CommonCategorySubMenuWidget_3) == 0x000368, "Member 'UW_CommonCategoryMenuWidget_C::W_CommonCategorySubMenuWidget_3' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, W_CommonCategorySubMenuWidget_4) == 0x000370, "Member 'UW_CommonCategoryMenuWidget_C::W_CommonCategorySubMenuWidget_4' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, CategoryNameText) == 0x000378, "Member 'UW_CommonCategoryMenuWidget_C::CategoryNameText' has a wrong offset!");
static_assert(offsetof(UW_CommonCategoryMenuWidget_C, CategoryCountInt) == 0x000390, "Member 'UW_CommonCategoryMenuWidget_C::CategoryCountInt' has a wrong offset!");

}

