#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ObjectiveTypeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Contract_ObjectiveTypeWidget.W_Contract_ObjectiveTypeWidget_C
// 0x0010 (0x02E8 - 0x02D8)
class UW_Contract_ObjectiveTypeWidget_C final : public UP2ContractObjectiveTypeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         IconHeight;                                        // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconWidth;                                         // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Contract_ObjectiveTypeWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)	 // 0xae1e64;
	void OnMouseLeave(const struct FPointerEvent& MouseEvent)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Contract_ObjectiveTypeWidget_C">();
	}
	static class UW_Contract_ObjectiveTypeWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Contract_ObjectiveTypeWidget_C>();
	}
};
static_assert(alignof(UW_Contract_ObjectiveTypeWidget_C) == 0x000008, "Wrong alignment on UW_Contract_ObjectiveTypeWidget_C");
static_assert(sizeof(UW_Contract_ObjectiveTypeWidget_C) == 0x0002E8, "Wrong size on UW_Contract_ObjectiveTypeWidget_C");
static_assert(offsetof(UW_Contract_ObjectiveTypeWidget_C, UberGraphFrame) == 0x0002D8, "Member 'UW_Contract_ObjectiveTypeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Contract_ObjectiveTypeWidget_C, IconHeight) == 0x0002E0, "Member 'UW_Contract_ObjectiveTypeWidget_C::IconHeight' has a wrong offset!");
static_assert(offsetof(UW_Contract_ObjectiveTypeWidget_C, IconWidth) == 0x0002E4, "Member 'UW_Contract_ObjectiveTypeWidget_C::IconWidth' has a wrong offset!");

}

