#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Contract_ItemListGroupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Contract_ItemListGroupWidget.W_Contract_ItemListGroupWidget_C
// 0x0038 (0x0350 - 0x0318)
class UW_Contract_ItemListGroupWidget_C final : public UP2ContractListGroup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_FactionIcon;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemThreadWidget_C*         W_Contract_ItemThreadWidget;                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Contract_ItemThreadWidget_C*         W_Contract_ItemThreadWidget_1;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsStory;                                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDaily;                                           // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             FactionIcon;                                       // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemCount;                                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Contract_ItemListGroupWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetItemListHeader(bool IsStory_0, bool IsDaily_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Contract_ItemListGroupWidget_C">();
	}
	static class UW_Contract_ItemListGroupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Contract_ItemListGroupWidget_C>();
	}
};
static_assert(alignof(UW_Contract_ItemListGroupWidget_C) == 0x000008, "Wrong alignment on UW_Contract_ItemListGroupWidget_C");
static_assert(sizeof(UW_Contract_ItemListGroupWidget_C) == 0x000350, "Wrong size on UW_Contract_ItemListGroupWidget_C");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, UberGraphFrame) == 0x000318, "Member 'UW_Contract_ItemListGroupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, Img_FactionIcon) == 0x000320, "Member 'UW_Contract_ItemListGroupWidget_C::Img_FactionIcon' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, W_Contract_ItemThreadWidget) == 0x000328, "Member 'UW_Contract_ItemListGroupWidget_C::W_Contract_ItemThreadWidget' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, W_Contract_ItemThreadWidget_1) == 0x000330, "Member 'UW_Contract_ItemListGroupWidget_C::W_Contract_ItemThreadWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, IsStory) == 0x000338, "Member 'UW_Contract_ItemListGroupWidget_C::IsStory' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, IsDaily) == 0x000339, "Member 'UW_Contract_ItemListGroupWidget_C::IsDaily' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, FactionIcon) == 0x000340, "Member 'UW_Contract_ItemListGroupWidget_C::FactionIcon' has a wrong offset!");
static_assert(offsetof(UW_Contract_ItemListGroupWidget_C, ItemCount) == 0x000348, "Member 'UW_Contract_ItemListGroupWidget_C::ItemCount' has a wrong offset!");

}

