#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CompassHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CompassHud.W_CompassHud_C
// 0x0078 (0x0490 - 0x0418)
class UW_CompassHud_C final : public UP2CompassWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               MapMarkerOverlay;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PingMarkerOverlay;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WaypointMarkerOverlay;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AP2HeroCharacter*                       Hero;                                              // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerViewPointYaw;                                // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IndividualShowTimeSec;                             // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FullViewShowTimeSec;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CompassDegreeTimerHandle;                          // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FadeOutTimerHandle;                                // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_CompassPingHud_C*>            CompassPingMap;                                    // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CheckStateADS(bool IsIsADS)	 // 0xae1e64;
	void ClearTimerHandle(const struct FTimerHandle& InTimerHandle)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_CompassHud(int32 EntryPoint)	 // 0xae1e64;
	class UOverlay* GetOverlayForCompassPing(class UP2CompassPingWidget* InCompassPing)	 // 0xae1e64;
	void InitFadeOutTimer()	 // 0xae1e64;
	void OnUpdateADSStatus_ImplementableEvent(bool IsAds)	 // 0xae1e64;
	void PlayFadeInAnim(bool InUseFadeOutTimer, double InFadeOutTime)	 // 0xae1e64;
	void PlayFadeOutAnim()	 // 0xae1e64;
	void SetFadeOutTimer(double Time)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CompassHud_C">();
	}
	static class UW_CompassHud_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CompassHud_C>();
	}
};
static_assert(alignof(UW_CompassHud_C) == 0x000008, "Wrong alignment on UW_CompassHud_C");
static_assert(sizeof(UW_CompassHud_C) == 0x000490, "Wrong size on UW_CompassHud_C");
static_assert(offsetof(UW_CompassHud_C, UberGraphFrame) == 0x000418, "Member 'UW_CompassHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, Init) == 0x000420, "Member 'UW_CompassHud_C::Init' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, FadeOutAnim) == 0x000428, "Member 'UW_CompassHud_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, FadeInAnim) == 0x000430, "Member 'UW_CompassHud_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, MapMarkerOverlay) == 0x000438, "Member 'UW_CompassHud_C::MapMarkerOverlay' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, PingMarkerOverlay) == 0x000440, "Member 'UW_CompassHud_C::PingMarkerOverlay' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, WaypointMarkerOverlay) == 0x000448, "Member 'UW_CompassHud_C::WaypointMarkerOverlay' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, Hero) == 0x000450, "Member 'UW_CompassHud_C::Hero' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, PlayerViewPointYaw) == 0x000458, "Member 'UW_CompassHud_C::PlayerViewPointYaw' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, IndividualShowTimeSec) == 0x000460, "Member 'UW_CompassHud_C::IndividualShowTimeSec' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, FullViewShowTimeSec) == 0x000468, "Member 'UW_CompassHud_C::FullViewShowTimeSec' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, CompassDegreeTimerHandle) == 0x000470, "Member 'UW_CompassHud_C::CompassDegreeTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, FadeOutTimerHandle) == 0x000478, "Member 'UW_CompassHud_C::FadeOutTimerHandle' has a wrong offset!");
static_assert(offsetof(UW_CompassHud_C, CompassPingMap) == 0x000480, "Member 'UW_CompassHud_C::CompassPingMap' has a wrong offset!");

}

