#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ContextualHelperWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_ContextualHelperWidget.W_ContextualHelperWidget_C.BP_OnMessageTypeChanged
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelperWidget_C_BP_OnMessageTypeChanged final
{
public:
	EP2GameplayContextMessageType                 InMessageType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelperWidget_C_BP_OnMessageTypeChanged) == 0x000001, "Wrong alignment on W_ContextualHelperWidget_C_BP_OnMessageTypeChanged");
static_assert(sizeof(W_ContextualHelperWidget_C_BP_OnMessageTypeChanged) == 0x000001, "Wrong size on W_ContextualHelperWidget_C_BP_OnMessageTypeChanged");
static_assert(offsetof(W_ContextualHelperWidget_C_BP_OnMessageTypeChanged, InMessageType) == 0x000000, "Member 'W_ContextualHelperWidget_C_BP_OnMessageTypeChanged::InMessageType' has a wrong offset!");

// Function W_ContextualHelperWidget.W_ContextualHelperWidget_C.BP_OnShowIconChanged
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelperWidget_C_BP_OnShowIconChanged final
{
public:
	bool                                          bInShowWidgetIcon;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelperWidget_C_BP_OnShowIconChanged) == 0x000001, "Wrong alignment on W_ContextualHelperWidget_C_BP_OnShowIconChanged");
static_assert(sizeof(W_ContextualHelperWidget_C_BP_OnShowIconChanged) == 0x000001, "Wrong size on W_ContextualHelperWidget_C_BP_OnShowIconChanged");
static_assert(offsetof(W_ContextualHelperWidget_C_BP_OnShowIconChanged, bInShowWidgetIcon) == 0x000000, "Member 'W_ContextualHelperWidget_C_BP_OnShowIconChanged::bInShowWidgetIcon' has a wrong offset!");

// Function W_ContextualHelperWidget.W_ContextualHelperWidget_C.BP_SetTitleIcon
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelperWidget_C_BP_SetTitleIcon final
{
public:
	EP2ContextualHelperWidgetIconType             InIconType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelperWidget_C_BP_SetTitleIcon) == 0x000001, "Wrong alignment on W_ContextualHelperWidget_C_BP_SetTitleIcon");
static_assert(sizeof(W_ContextualHelperWidget_C_BP_SetTitleIcon) == 0x000001, "Wrong size on W_ContextualHelperWidget_C_BP_SetTitleIcon");
static_assert(offsetof(W_ContextualHelperWidget_C_BP_SetTitleIcon, InIconType) == 0x000000, "Member 'W_ContextualHelperWidget_C_BP_SetTitleIcon::InIconType' has a wrong offset!");

// Function W_ContextualHelperWidget.W_ContextualHelperWidget_C.ExecuteUbergraph_W_ContextualHelperWidget
// 0x0030 (0x0030 - 0x0000)
struct W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShowWidgetIcon;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2GameplayContextMessageType                 K2Node_Event_InMessageType;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContextualHelperWidgetIconType             K2Node_Event_InIconType;                           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget) == 0x000008, "Wrong alignment on W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget");
static_assert(sizeof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget) == 0x000030, "Wrong size on W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, EntryPoint) == 0x000000, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, Temp_delegate_Variable) == 0x000004, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_Event_IsDesignTime) == 0x000020, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, CallFunc_PostEvent_ReturnValue) == 0x000024, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_Event_bInShowWidgetIcon) == 0x000028, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_Event_bInShowWidgetIcon' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_Event_InMessageType) == 0x000029, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_Event_InMessageType' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_Event_InIconType) == 0x00002B, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_Event_InIconType' has a wrong offset!");
static_assert(offsetof(W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget, K2Node_SwitchEnum_CmpSuccess_1) == 0x00002C, "Member 'W_ContextualHelperWidget_C_ExecuteUbergraph_W_ContextualHelperWidget::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function W_ContextualHelperWidget.W_ContextualHelperWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ContextualHelperWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ContextualHelperWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ContextualHelperWidget_C_PreConstruct");
static_assert(sizeof(W_ContextualHelperWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ContextualHelperWidget_C_PreConstruct");
static_assert(offsetof(W_ContextualHelperWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ContextualHelperWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

