#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_MainWidget

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Crafting_MainWidget.W_Crafting_MainWidget_C
// 0x0020 (0x0858 - 0x0838)
class UW_Crafting_MainWidget_C final : public UP2ProductionWidget
{
public:
	class UP2CheckBox*                            ChkB_ShowWishlistOnly;                             // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTxt_ShowWishlistOnly;                             // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Warning;                                       // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Crafting_MainWidget_C">();
	}
	static class UW_Crafting_MainWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Crafting_MainWidget_C>();
	}
};
static_assert(alignof(UW_Crafting_MainWidget_C) == 0x000008, "Wrong alignment on UW_Crafting_MainWidget_C");
static_assert(sizeof(UW_Crafting_MainWidget_C) == 0x000858, "Wrong size on UW_Crafting_MainWidget_C");
static_assert(offsetof(UW_Crafting_MainWidget_C, ChkB_ShowWishlistOnly) == 0x000838, "Member 'UW_Crafting_MainWidget_C::ChkB_ShowWishlistOnly' has a wrong offset!");
static_assert(offsetof(UW_Crafting_MainWidget_C, Img_Title_Line) == 0x000840, "Member 'UW_Crafting_MainWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_Crafting_MainWidget_C, RTxt_ShowWishlistOnly) == 0x000848, "Member 'UW_Crafting_MainWidget_C::RTxt_ShowWishlistOnly' has a wrong offset!");
static_assert(offsetof(UW_Crafting_MainWidget_C, Txt_Warning) == 0x000850, "Member 'UW_Crafting_MainWidget_C::Txt_Warning' has a wrong offset!");

}

