#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CraftingWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_CraftingWidget.W_CraftingWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_CraftingWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftingWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_CraftingWidget_C_PreConstruct");
static_assert(sizeof(W_CraftingWidget_C_PreConstruct) == 0x000001, "Wrong size on W_CraftingWidget_C_PreConstruct");
static_assert(offsetof(W_CraftingWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_CraftingWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_CraftingWidget.W_CraftingWidget_C.ExecuteUbergraph_W_CraftingWidget
// 0x0008 (0x0008 - 0x0000)
struct W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget) == 0x000004, "Wrong alignment on W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget");
static_assert(sizeof(W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget) == 0x000008, "Wrong size on W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget");
static_assert(offsetof(W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget, EntryPoint) == 0x000000, "Member 'W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_CraftingWidget_C_ExecuteUbergraph_W_CraftingWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_CraftingWidget.W_CraftingWidget_C.BP_OnHandleBackAction
// 0x0010 (0x0010 - 0x0000)
struct W_CraftingWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2Facility_Craft*                      CallFunc_GetCraftingFacility_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_CraftingWidget_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on W_CraftingWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(W_CraftingWidget_C_BP_OnHandleBackAction) == 0x000010, "Wrong size on W_CraftingWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(W_CraftingWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_CraftingWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_CraftingWidget_C_BP_OnHandleBackAction, CallFunc_GetCraftingFacility_ReturnValue) == 0x000008, "Member 'W_CraftingWidget_C_BP_OnHandleBackAction::CallFunc_GetCraftingFacility_ReturnValue' has a wrong offset!");

}

