#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_Combobox_Category

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Crafting_Combobox_Category.W_Crafting_Combobox_Category_C.ExecuteUbergraph_W_Crafting_Combobox_Category
// 0x0008 (0x0008 - 0x0000)
struct W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category) == 0x000004, "Wrong alignment on W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category");
static_assert(sizeof(W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category) == 0x000008, "Wrong size on W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category");
static_assert(offsetof(W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category, EntryPoint) == 0x000000, "Member 'W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Crafting_Combobox_Category_C_ExecuteUbergraph_W_Crafting_Combobox_Category::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Crafting_Combobox_Category.W_Crafting_Combobox_Category_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Crafting_Combobox_Category_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Combobox_Category_C_PreConstruct) == 0x000001, "Wrong alignment on W_Crafting_Combobox_Category_C_PreConstruct");
static_assert(sizeof(W_Crafting_Combobox_Category_C_PreConstruct) == 0x000001, "Wrong size on W_Crafting_Combobox_Category_C_PreConstruct");
static_assert(offsetof(W_Crafting_Combobox_Category_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Crafting_Combobox_Category_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

