#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CraftingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CraftingWidget.W_CraftingWidget_C
// 0x0030 (0x0708 - 0x06D8)
class UW_CraftingWidget_C final : public UP2CraftingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Title_Line;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2CraftEvent*                          CraftOngoingEvent;                                 // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   FacilityTitle;                                     // 0x06F0(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_CraftingWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_CraftingWidget_C">();
	}
	static class UW_CraftingWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_CraftingWidget_C>();
	}
};
static_assert(alignof(UW_CraftingWidget_C) == 0x000008, "Wrong alignment on UW_CraftingWidget_C");
static_assert(sizeof(UW_CraftingWidget_C) == 0x000708, "Wrong size on UW_CraftingWidget_C");
static_assert(offsetof(UW_CraftingWidget_C, UberGraphFrame) == 0x0006D8, "Member 'UW_CraftingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CraftingWidget_C, Img_Title_Line) == 0x0006E0, "Member 'UW_CraftingWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_CraftingWidget_C, CraftOngoingEvent) == 0x0006E8, "Member 'UW_CraftingWidget_C::CraftOngoingEvent' has a wrong offset!");
static_assert(offsetof(UW_CraftingWidget_C, FacilityTitle) == 0x0006F0, "Member 'UW_CraftingWidget_C::FacilityTitle' has a wrong offset!");

}

