#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Crafting_Item.W_Crafting_Item_C
// 0x0028 (0x0398 - 0x0370)
class UW_Crafting_Item_C final : public UP2CraftingItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_Infos;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bg;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TimeIcon;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked)	 // 0xae1e64;
	void ExecuteUbergraph_W_Crafting_Item(int32 EntryPoint)	 // 0xae1e64;
	void OnSetIsChecked(bool bInIsChecked, bool bPlaySelectedAnimation)	 // 0xae1e64;
	void OnSetIsEnabled(bool bInIsEnabled)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Crafting_Item_C">();
	}
	static class UW_Crafting_Item_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Crafting_Item_C>();
	}
};
static_assert(alignof(UW_Crafting_Item_C) == 0x000008, "Wrong alignment on UW_Crafting_Item_C");
static_assert(sizeof(UW_Crafting_Item_C) == 0x000398, "Wrong size on UW_Crafting_Item_C");
static_assert(offsetof(UW_Crafting_Item_C, UberGraphFrame) == 0x000370, "Member 'UW_Crafting_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Crafting_Item_C, HB_Infos) == 0x000378, "Member 'UW_Crafting_Item_C::HB_Infos' has a wrong offset!");
static_assert(offsetof(UW_Crafting_Item_C, Img_Bg) == 0x000380, "Member 'UW_Crafting_Item_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_Crafting_Item_C, Img_Outline) == 0x000388, "Member 'UW_Crafting_Item_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Crafting_Item_C, Img_TimeIcon) == 0x000390, "Member 'UW_Crafting_Item_C::Img_TimeIcon' has a wrong offset!");

}

