#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_DetailWidget

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Crafting_DetailWidget.W_Crafting_DetailWidget_C
// 0x0048 (0x0400 - 0x03B8)
class UW_Crafting_DetailWidget_C final : public UP2ProductionDetailWidget
{
public:
	class USizeBox*                               SzB_StackCount;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_Details;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_Details_StatsWidget_C*      W_Crafting_Details_StatsWidget;                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HideoutCommonItemWidget_C*           W_HideoutCommonItemWidget_1;                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HideoutCommonItemWidget_C*           W_HideoutCommonItemWidget_2;                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HideoutCommonItemWidget_C*           W_HideoutCommonItemWidget_3;                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget_1;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_UnlockRequirementWidget_C*           W_UnlockRequirementWidget_2;                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Crafting_DetailWidget_C">();
	}
	static class UW_Crafting_DetailWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Crafting_DetailWidget_C>();
	}
};
static_assert(alignof(UW_Crafting_DetailWidget_C) == 0x000008, "Wrong alignment on UW_Crafting_DetailWidget_C");
static_assert(sizeof(UW_Crafting_DetailWidget_C) == 0x000400, "Wrong size on UW_Crafting_DetailWidget_C");
static_assert(offsetof(UW_Crafting_DetailWidget_C, SzB_StackCount) == 0x0003B8, "Member 'UW_Crafting_DetailWidget_C::SzB_StackCount' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, VB_Details) == 0x0003C0, "Member 'UW_Crafting_DetailWidget_C::VB_Details' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_Crafting_Details_StatsWidget) == 0x0003C8, "Member 'UW_Crafting_DetailWidget_C::W_Crafting_Details_StatsWidget' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_HideoutCommonItemWidget_1) == 0x0003D0, "Member 'UW_Crafting_DetailWidget_C::W_HideoutCommonItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_HideoutCommonItemWidget_2) == 0x0003D8, "Member 'UW_Crafting_DetailWidget_C::W_HideoutCommonItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_HideoutCommonItemWidget_3) == 0x0003E0, "Member 'UW_Crafting_DetailWidget_C::W_HideoutCommonItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_UnlockRequirementWidget) == 0x0003E8, "Member 'UW_Crafting_DetailWidget_C::W_UnlockRequirementWidget' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_UnlockRequirementWidget_1) == 0x0003F0, "Member 'UW_Crafting_DetailWidget_C::W_UnlockRequirementWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Crafting_DetailWidget_C, W_UnlockRequirementWidget_2) == 0x0003F8, "Member 'UW_Crafting_DetailWidget_C::W_UnlockRequirementWidget_2' has a wrong offset!");

}

