#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_ContractIconWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Crafting_ContractIconWidget.W_Crafting_ContractIconWidget_C
// 0x0020 (0x02C8 - 0x02A8)
class UW_Crafting_ContractIconWidget_C final : public UP2CraftingContractIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_BG_Gradient;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Inner_Glow;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ContractIcon;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Crafting_ContractIconWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Crafting_ContractIconWidget_C">();
	}
	static class UW_Crafting_ContractIconWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Crafting_ContractIconWidget_C>();
	}
};
static_assert(alignof(UW_Crafting_ContractIconWidget_C) == 0x000008, "Wrong alignment on UW_Crafting_ContractIconWidget_C");
static_assert(sizeof(UW_Crafting_ContractIconWidget_C) == 0x0002C8, "Wrong size on UW_Crafting_ContractIconWidget_C");
static_assert(offsetof(UW_Crafting_ContractIconWidget_C, UberGraphFrame) == 0x0002A8, "Member 'UW_Crafting_ContractIconWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Crafting_ContractIconWidget_C, Bdr_BG_Gradient) == 0x0002B0, "Member 'UW_Crafting_ContractIconWidget_C::Bdr_BG_Gradient' has a wrong offset!");
static_assert(offsetof(UW_Crafting_ContractIconWidget_C, Img_Inner_Glow) == 0x0002B8, "Member 'UW_Crafting_ContractIconWidget_C::Img_Inner_Glow' has a wrong offset!");
static_assert(offsetof(UW_Crafting_ContractIconWidget_C, SzB_ContractIcon) == 0x0002C0, "Member 'UW_Crafting_ContractIconWidget_C::SzB_ContractIcon' has a wrong offset!");

}

