#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Crafting_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Crafting_Item.W_Crafting_Item_C.BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_Crafting_Item_C_BndEvt__W_Crafting_Item_ChkB_CraftItem_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_Crafting_Item.W_Crafting_Item_C.ExecuteUbergraph_W_Crafting_Item
// 0x01B0 (0x01B0 - 0x0000)
struct W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0060(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_2;                 // 0x00B8(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_3;                 // 0x0110(0x0058)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0168(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x017C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0190(0x0014)()
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsChecked;                         // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlaySelectedAnimation;               // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsEnabled;                         // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue;              // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item) == 0x000008, "Wrong alignment on W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item");
static_assert(sizeof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item) == 0x0001B0, "Wrong size on W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, EntryPoint) == 0x000000, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateFontInfo_1) == 0x000060, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateFontInfo_2) == 0x0000B8, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateFontInfo_2' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateFontInfo_3) == 0x000110, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateFontInfo_3' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateColor) == 0x000168, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateColor_1) == 0x00017C, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_MakeStruct_SlateColor_2) == 0x000190, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_ComponentBoundEvent_bIsChecked) == 0x0001A4, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_Event_bInIsChecked) == 0x0001A5, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_Event_bInIsChecked' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_Event_bPlaySelectedAnimation) == 0x0001A6, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_Event_bPlaySelectedAnimation' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_Event_bInIsEnabled) == 0x0001A7, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_Event_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_Event_IsDesignTime) == 0x0001A8, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, CallFunc_GetCheckedState_ReturnValue) == 0x0001A9, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::CallFunc_GetCheckedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item, K2Node_SwitchEnum_CmpSuccess) == 0x0001AA, "Member 'W_Crafting_Item_C_ExecuteUbergraph_W_Crafting_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_Crafting_Item.W_Crafting_Item_C.OnSetIsChecked
// 0x0002 (0x0002 - 0x0000)
struct W_Crafting_Item_C_OnSetIsChecked final
{
public:
	bool                                          bInIsChecked;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlaySelectedAnimation;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Item_C_OnSetIsChecked) == 0x000001, "Wrong alignment on W_Crafting_Item_C_OnSetIsChecked");
static_assert(sizeof(W_Crafting_Item_C_OnSetIsChecked) == 0x000002, "Wrong size on W_Crafting_Item_C_OnSetIsChecked");
static_assert(offsetof(W_Crafting_Item_C_OnSetIsChecked, bInIsChecked) == 0x000000, "Member 'W_Crafting_Item_C_OnSetIsChecked::bInIsChecked' has a wrong offset!");
static_assert(offsetof(W_Crafting_Item_C_OnSetIsChecked, bPlaySelectedAnimation) == 0x000001, "Member 'W_Crafting_Item_C_OnSetIsChecked::bPlaySelectedAnimation' has a wrong offset!");

// Function W_Crafting_Item.W_Crafting_Item_C.OnSetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct W_Crafting_Item_C_OnSetIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Item_C_OnSetIsEnabled) == 0x000001, "Wrong alignment on W_Crafting_Item_C_OnSetIsEnabled");
static_assert(sizeof(W_Crafting_Item_C_OnSetIsEnabled) == 0x000001, "Wrong size on W_Crafting_Item_C_OnSetIsEnabled");
static_assert(offsetof(W_Crafting_Item_C_OnSetIsEnabled, bInIsEnabled) == 0x000000, "Member 'W_Crafting_Item_C_OnSetIsEnabled::bInIsEnabled' has a wrong offset!");

// Function W_Crafting_Item.W_Crafting_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Crafting_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Crafting_Item_C_PreConstruct) == 0x000001, "Wrong alignment on W_Crafting_Item_C_PreConstruct");
static_assert(sizeof(W_Crafting_Item_C_PreConstruct) == 0x000001, "Wrong size on W_Crafting_Item_C_PreConstruct");
static_assert(offsetof(W_Crafting_Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Crafting_Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

