#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DamageZoneProtection_Hand_R

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_DamageZoneProtection_Hand_R.W_DamageZoneProtection_Hand_R_C.ExecuteUbergraph_W_DamageZoneProtection_Hand_R
// 0x0030 (0x0030 - 0x0000)
struct W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasArmor;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
};
static_assert(alignof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R) == 0x000004, "Wrong alignment on W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R");
static_assert(sizeof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R) == 0x000030, "Wrong size on W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R");
static_assert(offsetof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R, EntryPoint) == 0x000000, "Member 'W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R, K2Node_Event_bInHasArmor) == 0x000004, "Member 'W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R::K2Node_Event_bInHasArmor' has a wrong offset!");
static_assert(offsetof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_DamageZoneProtection_Hand_R_C_ExecuteUbergraph_W_DamageZoneProtection_Hand_R::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_DamageZoneProtection_Hand_R.W_DamageZoneProtection_Hand_R_C.UpdateArmorWidgetStyle
// 0x0001 (0x0001 - 0x0000)
struct W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle final
{
public:
	bool                                          bInHasArmor;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle) == 0x000001, "Wrong alignment on W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle");
static_assert(sizeof(W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle) == 0x000001, "Wrong size on W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle");
static_assert(offsetof(W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle, bInHasArmor) == 0x000000, "Member 'W_DamageZoneProtection_Hand_R_C_UpdateArmorWidgetStyle::bInHasArmor' has a wrong offset!");

}

