#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DbnoStageTwoCountdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DbnoStageTwoCountdown.W_DbnoStageTwoCountdown_C
// 0x0018 (0x05A8 - 0x0590)
class UW_DbnoStageTwoCountdown_C final : public UP2DbnoStateTwoCountdownWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_DbnoBannerBg;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_DbnoStageTwoCountdown(int32 EntryPoint)	 // 0xae1e64;
	void OnEffectApplied(const struct FActiveGameplayEffectHandle& ActiveGEHandle, const struct FGameplayEffectSpec& GESpec)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DbnoStageTwoCountdown_C">();
	}
	static class UW_DbnoStageTwoCountdown_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DbnoStageTwoCountdown_C>();
	}
};
static_assert(alignof(UW_DbnoStageTwoCountdown_C) == 0x000008, "Wrong alignment on UW_DbnoStageTwoCountdown_C");
static_assert(sizeof(UW_DbnoStageTwoCountdown_C) == 0x0005A8, "Wrong size on UW_DbnoStageTwoCountdown_C");
static_assert(offsetof(UW_DbnoStageTwoCountdown_C, UberGraphFrame) == 0x000590, "Member 'UW_DbnoStageTwoCountdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DbnoStageTwoCountdown_C, FadeIn) == 0x000598, "Member 'UW_DbnoStageTwoCountdown_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UW_DbnoStageTwoCountdown_C, Bdr_DbnoBannerBg) == 0x0005A0, "Member 'UW_DbnoStageTwoCountdown_C::Bdr_DbnoBannerBg' has a wrong offset!");

}

