#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DecorationBuildMode_Icon_KeyBind

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DecorationBuildMode_Icon_KeyBind.W_DecorationBuildMode_Icon_KeyBind_C
// 0x0030 (0x0380 - 0x0350)
class UW_DecorationBuildMode_Icon_KeyBind_C final : public UP2DecorationBuildModeQuickSlotIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_EmptySlot;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeybindWidget_C*                     W_KeybindWidget;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           Input_Action;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PlayerMappableOptionsName;                         // 0x0374(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_DecorationBuildMode_Icon_KeyBind(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DecorationBuildMode_Icon_KeyBind_C">();
	}
	static class UW_DecorationBuildMode_Icon_KeyBind_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DecorationBuildMode_Icon_KeyBind_C>();
	}
};
static_assert(alignof(UW_DecorationBuildMode_Icon_KeyBind_C) == 0x000010, "Wrong alignment on UW_DecorationBuildMode_Icon_KeyBind_C");
static_assert(sizeof(UW_DecorationBuildMode_Icon_KeyBind_C) == 0x000380, "Wrong size on UW_DecorationBuildMode_Icon_KeyBind_C");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, UberGraphFrame) == 0x000350, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, Img_EmptySlot) == 0x000358, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::Img_EmptySlot' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, W_KeybindWidget) == 0x000360, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::W_KeybindWidget' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, Input_Action) == 0x000368, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::Input_Action' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, NewVar) == 0x000370, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::NewVar' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_Icon_KeyBind_C, PlayerMappableOptionsName) == 0x000374, "Member 'UW_DecorationBuildMode_Icon_KeyBind_C::PlayerMappableOptionsName' has a wrong offset!");

}

