#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DecorationButton_OSSFriendListEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_DecorationButton_OSSFriendListEntry.W_DecorationButton_OSSFriendListEntry_C.ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry
// 0x0070 (0x0070 - 0x0000)
struct W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry) == 0x000004, "Wrong alignment on W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry");
static_assert(sizeof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry) == 0x000070, "Wrong size on W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, EntryPoint) == 0x000000, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_Event_MyGeometry) == 0x000030, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_Event_InDeltaTime) == 0x000068, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, CallFunc_GetVisibility_ReturnValue) == 0x00006C, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry, K2Node_SwitchEnum_CmpSuccess) == 0x00006D, "Member 'W_DecorationButton_OSSFriendListEntry_C_ExecuteUbergraph_W_DecorationButton_OSSFriendListEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_DecorationButton_OSSFriendListEntry.W_DecorationButton_OSSFriendListEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_DecorationButton_OSSFriendListEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DecorationButton_OSSFriendListEntry_C_PreConstruct) == 0x000001, "Wrong alignment on W_DecorationButton_OSSFriendListEntry_C_PreConstruct");
static_assert(sizeof(W_DecorationButton_OSSFriendListEntry_C_PreConstruct) == 0x000001, "Wrong size on W_DecorationButton_OSSFriendListEntry_C_PreConstruct");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_DecorationButton_OSSFriendListEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_DecorationButton_OSSFriendListEntry.W_DecorationButton_OSSFriendListEntry_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_DecorationButton_OSSFriendListEntry_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DecorationButton_OSSFriendListEntry_C_Tick) == 0x000004, "Wrong alignment on W_DecorationButton_OSSFriendListEntry_C_Tick");
static_assert(sizeof(W_DecorationButton_OSSFriendListEntry_C_Tick) == 0x00003C, "Wrong size on W_DecorationButton_OSSFriendListEntry_C_Tick");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_Tick, MyGeometry) == 0x000000, "Member 'W_DecorationButton_OSSFriendListEntry_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_DecorationButton_OSSFriendListEntry_C_Tick, InDeltaTime) == 0x000038, "Member 'W_DecorationButton_OSSFriendListEntry_C_Tick::InDeltaTime' has a wrong offset!");

}

