#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DecorationBuildMode_Popup

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_DecorationBuildMode_Popup.W_DecorationBuildMode_Popup_C.ExecuteUbergraph_W_DecorationBuildMode_Popup
// 0x0018 (0x0018 - 0x0000)
struct W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup) == 0x000008, "Wrong alignment on W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup");
static_assert(sizeof(W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup) == 0x000018, "Wrong size on W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup");
static_assert(offsetof(W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup, EntryPoint) == 0x000000, "Member 'W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'W_DecorationBuildMode_Popup_C_ExecuteUbergraph_W_DecorationBuildMode_Popup::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

