#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DeploymentWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DeploymentWidget.W_DeploymentWidget_C
// 0x0030 (0x03F0 - 0x03C0)
class UW_DeploymentWidget_C final : public UP2DeploymentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CancelNoticeAnim;                                  // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SzB_CancelBtn;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Cancel;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ReturnBtn;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ActiveContract_ListWidget_C*         W_Deployment_ContractListWidget;                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_DeploymentWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnFinishAdded_Event()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DeploymentWidget_C">();
	}
	static class UW_DeploymentWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DeploymentWidget_C>();
	}
};
static_assert(alignof(UW_DeploymentWidget_C) == 0x000008, "Wrong alignment on UW_DeploymentWidget_C");
static_assert(sizeof(UW_DeploymentWidget_C) == 0x0003F0, "Wrong size on UW_DeploymentWidget_C");
static_assert(offsetof(UW_DeploymentWidget_C, UberGraphFrame) == 0x0003C0, "Member 'UW_DeploymentWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DeploymentWidget_C, CancelNoticeAnim) == 0x0003C8, "Member 'UW_DeploymentWidget_C::CancelNoticeAnim' has a wrong offset!");
static_assert(offsetof(UW_DeploymentWidget_C, SzB_CancelBtn) == 0x0003D0, "Member 'UW_DeploymentWidget_C::SzB_CancelBtn' has a wrong offset!");
static_assert(offsetof(UW_DeploymentWidget_C, Txt_Cancel) == 0x0003D8, "Member 'UW_DeploymentWidget_C::Txt_Cancel' has a wrong offset!");
static_assert(offsetof(UW_DeploymentWidget_C, Txt_ReturnBtn) == 0x0003E0, "Member 'UW_DeploymentWidget_C::Txt_ReturnBtn' has a wrong offset!");
static_assert(offsetof(UW_DeploymentWidget_C, W_Deployment_ContractListWidget) == 0x0003E8, "Member 'UW_DeploymentWidget_C::W_Deployment_ContractListWidget' has a wrong offset!");

}

