#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Debug_HealthBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Debug_HealthBar.W_Debug_HealthBar_C.SetP2Pawn
// 0x0060 (0x0060 - 0x0000)
struct W_Debug_HealthBar_C_SetP2Pawn final
{
public:
	class AP2BaseCharacter*                       Pawn_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UP2HealthComponent* HealthComponent, float OldValue, float NewValue)> K2Node_CreateDelegate_OutputDelegate; // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Debug_HealthBar_C_SetP2Pawn) == 0x000008, "Wrong alignment on W_Debug_HealthBar_C_SetP2Pawn");
static_assert(sizeof(W_Debug_HealthBar_C_SetP2Pawn) == 0x000060, "Wrong size on W_Debug_HealthBar_C_SetP2Pawn");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, Pawn_0) == 0x000000, "Member 'W_Debug_HealthBar_C_SetP2Pawn::Pawn_0' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, Temp_bool_Variable) == 0x000008, "Member 'W_Debug_HealthBar_C_SetP2Pawn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, K2Node_DynamicCast_AsP2Hero_Character) == 0x000010, "Member 'W_Debug_HealthBar_C_SetP2Pawn::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Debug_HealthBar_C_SetP2Pawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, Temp_struct_Variable) == 0x00001C, "Member 'W_Debug_HealthBar_C_SetP2Pawn::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, Temp_struct_Variable_1) == 0x00002C, "Member 'W_Debug_HealthBar_C_SetP2Pawn::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, K2Node_Select_Default) == 0x00003C, "Member 'W_Debug_HealthBar_C_SetP2Pawn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_SetP2Pawn, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'W_Debug_HealthBar_C_SetP2Pawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function W_Debug_HealthBar.W_Debug_HealthBar_C.UpdateHealth
// 0x0018 (0x0018 - 0x0000)
struct W_Debug_HealthBar_C_UpdateHealth final
{
public:
	class UP2HealthComponent*                     HealthComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealthNormalized_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Debug_HealthBar_C_UpdateHealth) == 0x000008, "Wrong alignment on W_Debug_HealthBar_C_UpdateHealth");
static_assert(sizeof(W_Debug_HealthBar_C_UpdateHealth) == 0x000018, "Wrong size on W_Debug_HealthBar_C_UpdateHealth");
static_assert(offsetof(W_Debug_HealthBar_C_UpdateHealth, HealthComponent) == 0x000000, "Member 'W_Debug_HealthBar_C_UpdateHealth::HealthComponent' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_UpdateHealth, OldValue) == 0x000008, "Member 'W_Debug_HealthBar_C_UpdateHealth::OldValue' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_UpdateHealth, NewValue) == 0x00000C, "Member 'W_Debug_HealthBar_C_UpdateHealth::NewValue' has a wrong offset!");
static_assert(offsetof(W_Debug_HealthBar_C_UpdateHealth, CallFunc_GetHealthNormalized_ReturnValue) == 0x000010, "Member 'W_Debug_HealthBar_C_UpdateHealth::CallFunc_GetHealthNormalized_ReturnValue' has a wrong offset!");

}

