#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DetailedBuffs_List

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DetailedBuffs_List.W_DetailedBuffs_List_C
// 0x0038 (0x02E8 - 0x02B0)
class UW_DetailedBuffs_List_C final : public UP2BuffsListWidget
{
public:
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect;                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_1;                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_2;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_3;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_4;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_5;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_6;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DetailedBuffs_List_C">();
	}
	static class UW_DetailedBuffs_List_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DetailedBuffs_List_C>();
	}
};
static_assert(alignof(UW_DetailedBuffs_List_C) == 0x000008, "Wrong alignment on UW_DetailedBuffs_List_C");
static_assert(sizeof(UW_DetailedBuffs_List_C) == 0x0002E8, "Wrong size on UW_DetailedBuffs_List_C");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect) == 0x0002B0, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_1) == 0x0002B8, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_1' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_2) == 0x0002C0, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_2' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_3) == 0x0002C8, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_3' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_4) == 0x0002D0, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_4' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_5) == 0x0002D8, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_5' has a wrong offset!");
static_assert(offsetof(UW_DetailedBuffs_List_C, W_BuffFacility_Effect_6) == 0x0002E0, "Member 'UW_DetailedBuffs_List_C::W_BuffFacility_Effect_6' has a wrong offset!");

}

