#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DecorationBuildMode_CategoryButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DecorationBuildMode_CategoryButton.W_DecorationBuildMode_CategoryButton_C
// 0x08F0 (0x0BC0 - 0x02D0)
class UW_DecorationBuildMode_CategoryButton_C final : public UP2DecorationButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UP2Button*                              Btn_DecorationBuildMode_CategoryButton;            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DDD;                                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DecorationBuildMode_Select;                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LNB_Line;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TitleDotPattern;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TitleIconGlow;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TitleUnderline;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlotIconImage;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Button;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsGnb;                                             // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           GnbStyle;                                          // 0x0330(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           LnbStyle;                                          // 0x0720(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         GnbFont;                                           // 0x0B10(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         LnbFont;                                           // 0x0B68(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DecorationBuildMode_CategoryButton(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DecorationBuildMode_CategoryButton_C">();
	}
	static class UW_DecorationBuildMode_CategoryButton_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DecorationBuildMode_CategoryButton_C>();
	}
};
static_assert(alignof(UW_DecorationBuildMode_CategoryButton_C) == 0x000010, "Wrong alignment on UW_DecorationBuildMode_CategoryButton_C");
static_assert(sizeof(UW_DecorationBuildMode_CategoryButton_C) == 0x000BC0, "Wrong size on UW_DecorationBuildMode_CategoryButton_C");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, UberGraphFrame) == 0x0002D0, "Member 'UW_DecorationBuildMode_CategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Btn_DecorationBuildMode_CategoryButton) == 0x0002D8, "Member 'UW_DecorationBuildMode_CategoryButton_C::Btn_DecorationBuildMode_CategoryButton' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, DDD) == 0x0002E0, "Member 'UW_DecorationBuildMode_CategoryButton_C::DDD' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Image) == 0x0002E8, "Member 'UW_DecorationBuildMode_CategoryButton_C::Image' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Img_DecorationBuildMode_Select) == 0x0002F0, "Member 'UW_DecorationBuildMode_CategoryButton_C::Img_DecorationBuildMode_Select' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Img_LNB_Line) == 0x0002F8, "Member 'UW_DecorationBuildMode_CategoryButton_C::Img_LNB_Line' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Img_TitleDotPattern) == 0x000300, "Member 'UW_DecorationBuildMode_CategoryButton_C::Img_TitleDotPattern' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Img_TitleIconGlow) == 0x000308, "Member 'UW_DecorationBuildMode_CategoryButton_C::Img_TitleIconGlow' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, Img_TitleUnderline) == 0x000310, "Member 'UW_DecorationBuildMode_CategoryButton_C::Img_TitleUnderline' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, SlotIconImage) == 0x000318, "Member 'UW_DecorationBuildMode_CategoryButton_C::SlotIconImage' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, SzB_Button) == 0x000320, "Member 'UW_DecorationBuildMode_CategoryButton_C::SzB_Button' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, IsGnb) == 0x000328, "Member 'UW_DecorationBuildMode_CategoryButton_C::IsGnb' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, GnbStyle) == 0x000330, "Member 'UW_DecorationBuildMode_CategoryButton_C::GnbStyle' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, LnbStyle) == 0x000720, "Member 'UW_DecorationBuildMode_CategoryButton_C::LnbStyle' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, GnbFont) == 0x000B10, "Member 'UW_DecorationBuildMode_CategoryButton_C::GnbFont' has a wrong offset!");
static_assert(offsetof(UW_DecorationBuildMode_CategoryButton_C, LnbFont) == 0x000B68, "Member 'UW_DecorationBuildMode_CategoryButton_C::LnbFont' has a wrong offset!");

}

