#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DecoBG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DecoBG.W_DecoBG_C
// 0x00B0 (0x0330 - 0x0280)
class UW_DecoBG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Idle;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 img_Decoline;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_1;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_2;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_3;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_4;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_5;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_6;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_7;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_8;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_9;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_10;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_11;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_12;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_13;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_14;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Decoline_15;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoQuad;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoQuad_1;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoQuad_2;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoQuad_3;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DecoBG(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DecoBG_C">();
	}
	static class UW_DecoBG_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DecoBG_C>();
	}
};
static_assert(alignof(UW_DecoBG_C) == 0x000008, "Wrong alignment on UW_DecoBG_C");
static_assert(sizeof(UW_DecoBG_C) == 0x000330, "Wrong size on UW_DecoBG_C");
static_assert(offsetof(UW_DecoBG_C, UberGraphFrame) == 0x000280, "Member 'UW_DecoBG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, Idle) == 0x000288, "Member 'UW_DecoBG_C::Idle' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline) == 0x000290, "Member 'UW_DecoBG_C::img_Decoline' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_1) == 0x000298, "Member 'UW_DecoBG_C::img_Decoline_1' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_2) == 0x0002A0, "Member 'UW_DecoBG_C::img_Decoline_2' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_3) == 0x0002A8, "Member 'UW_DecoBG_C::img_Decoline_3' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_4) == 0x0002B0, "Member 'UW_DecoBG_C::img_Decoline_4' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_5) == 0x0002B8, "Member 'UW_DecoBG_C::img_Decoline_5' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_6) == 0x0002C0, "Member 'UW_DecoBG_C::img_Decoline_6' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_7) == 0x0002C8, "Member 'UW_DecoBG_C::img_Decoline_7' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_8) == 0x0002D0, "Member 'UW_DecoBG_C::img_Decoline_8' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_9) == 0x0002D8, "Member 'UW_DecoBG_C::img_Decoline_9' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_10) == 0x0002E0, "Member 'UW_DecoBG_C::img_Decoline_10' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_11) == 0x0002E8, "Member 'UW_DecoBG_C::img_Decoline_11' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_12) == 0x0002F0, "Member 'UW_DecoBG_C::img_Decoline_12' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_13) == 0x0002F8, "Member 'UW_DecoBG_C::img_Decoline_13' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_14) == 0x000300, "Member 'UW_DecoBG_C::img_Decoline_14' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_Decoline_15) == 0x000308, "Member 'UW_DecoBG_C::img_Decoline_15' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_DecoQuad) == 0x000310, "Member 'UW_DecoBG_C::img_DecoQuad' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_DecoQuad_1) == 0x000318, "Member 'UW_DecoBG_C::img_DecoQuad_1' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_DecoQuad_2) == 0x000320, "Member 'UW_DecoBG_C::img_DecoQuad_2' has a wrong offset!");
static_assert(offsetof(UW_DecoBG_C, img_DecoQuad_3) == 0x000328, "Member 'UW_DecoBG_C::img_DecoQuad_3' has a wrong offset!");

}

