#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DirectFacilityInstallWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C
// 0x0020 (0x0790 - 0x0770)
class UW_DirectFacilityInstallWidget_C final : public UP2DirectFacilityInstallWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0770(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Title_Line;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_KeyguideWidget;                                  // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_KeyguideWidget_1;                                // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BindFacilitySpotEvent_ImplementableEvent()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void EnterBuildMode()	 // 0xae1e64;
	void EvevntOnFacilitySpotStatusChanged(class AP2FacilitySpot* InFacilitySpot, const struct FP2FacilitySpotStatusInfo& InOldStatus, const struct FP2FacilitySpotStatusInfo& InNewStatus)	 // 0xae1e64;
	void ExecuteUbergraph_W_DirectFacilityInstallWidget(int32 EntryPoint)	 // 0xae1e64;
	void ExitFacilityInstall()	 // 0xae1e64;
	void OnBackAction()	 // 0xae1e64;
	void PressedCancelBtn_ImplementableEvent(const TDelegate<void(EPopupButtonID ButtonID)>& InDelegateResumeBtn)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DirectFacilityInstallWidget_C">();
	}
	static class UW_DirectFacilityInstallWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DirectFacilityInstallWidget_C>();
	}
};
static_assert(alignof(UW_DirectFacilityInstallWidget_C) == 0x000008, "Wrong alignment on UW_DirectFacilityInstallWidget_C");
static_assert(sizeof(UW_DirectFacilityInstallWidget_C) == 0x000790, "Wrong size on UW_DirectFacilityInstallWidget_C");
static_assert(offsetof(UW_DirectFacilityInstallWidget_C, UberGraphFrame) == 0x000770, "Member 'UW_DirectFacilityInstallWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DirectFacilityInstallWidget_C, Img_Title_Line) == 0x000778, "Member 'UW_DirectFacilityInstallWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_DirectFacilityInstallWidget_C, W_KeyguideWidget) == 0x000780, "Member 'UW_DirectFacilityInstallWidget_C::W_KeyguideWidget' has a wrong offset!");
static_assert(offsetof(UW_DirectFacilityInstallWidget_C, W_KeyguideWidget_1) == 0x000788, "Member 'UW_DirectFacilityInstallWidget_C::W_KeyguideWidget_1' has a wrong offset!");

}

