#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DirectFacilityInstallWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Hideout_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_DirectFacilityInstallWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C.EvevntOnFacilitySpotStatusChanged
// 0x0028 (0x0028 - 0x0000)
struct W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged final
{
public:
	class AP2FacilitySpot*                        InFacilitySpot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilitySpotStatusInfo              InOldStatus;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FP2FacilitySpotStatusInfo              InNewStatus;                                       // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged) == 0x000008, "Wrong alignment on W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged");
static_assert(sizeof(W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged) == 0x000028, "Wrong size on W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged, InFacilitySpot) == 0x000000, "Member 'W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged::InFacilitySpot' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged, InOldStatus) == 0x000008, "Member 'W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged::InOldStatus' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged, InNewStatus) == 0x000018, "Member 'W_DirectFacilityInstallWidget_C_EvevntOnFacilitySpotStatusChanged::InNewStatus' has a wrong offset!");

// Function W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C.ExecuteUbergraph_W_DirectFacilityInstallWidget
// 0x0198 (0x0198 - 0x0000)
struct W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue;           // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0024(0x0008)(NoDestructor)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x002C(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AP2FacilitySpot* InFacilitySpot, const struct FP2FacilitySpotStatusInfo& InOldStatus, const struct FP2FacilitySpotStatusInfo& InNewStatus)> K2Node_CreateDelegate_OutputDelegate; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_2;                // 0x0060(0x0008)(NoDestructor)
	class UP2RadioButton*                         CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2FacilitySpot*                        K2Node_CustomEvent_InFacilitySpot;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FP2FacilitySpotStatusInfo              K2Node_CustomEvent_InOldStatus;                    // 0x0098(0x0010)(ConstParm, NoDestructor)
	struct FP2FacilitySpotStatusInfo              K2Node_CustomEvent_InNewStatus;                    // 0x00A8(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_InDelegateResumeBtn;                  // 0x00BC(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00E8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0100(0x0018)()
	class UUserWidget*                            CallFunc_ShowPopup_ReturnValue;                    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue_1;         // 0x0130(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UP2RadioButton*                         CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue_2;         // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2RadioButton*                         CallFunc_Array_Get_Item_2;                         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget) == 0x000008, "Wrong alignment on W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget");
static_assert(sizeof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget) == 0x000198, "Wrong size on W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, EntryPoint) == 0x000000, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_GetAllRadioButtons_ReturnValue) == 0x000008, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_GetAllRadioButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_MakeStruct_SlateChildSize) == 0x000024, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_MakeStruct_SlateChildSize_1) == 0x00002C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Loop_Counter_Variable_2) == 0x000050, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, Temp_int_Array_Index_Variable_2) == 0x00005C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_MakeStruct_SlateChildSize_2) == 0x000060, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_MakeStruct_SlateChildSize_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Get_Item) == 0x000068, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000070, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CustomEvent_InFacilitySpot) == 0x000090, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CustomEvent_InFacilitySpot' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CustomEvent_InOldStatus) == 0x000098, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CustomEvent_InOldStatus' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CustomEvent_InNewStatus) == 0x0000A8, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CustomEvent_InNewStatus' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_Event_InDelegateResumeBtn) == 0x0000BC, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_Event_InDelegateResumeBtn' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x0000D0, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000E8, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000100, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_ShowPopup_ReturnValue) == 0x000118, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_ShowPopup_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000120, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_GetAllRadioButtons_ReturnValue_1) == 0x000130, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_GetAllRadioButtons_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1) == 0x000150, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000158, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_IsValid_ReturnValue_2) == 0x000159, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_GetAllRadioButtons_ReturnValue_2) == 0x000160, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_GetAllRadioButtons_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Length_ReturnValue_2) == 0x000170, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Array_Get_Item_2) == 0x000178, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_Less_IntInt_ReturnValue_2) == 0x000180, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2) == 0x000188, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget, CallFunc_IsValid_ReturnValue_3) == 0x000190, "Member 'W_DirectFacilityInstallWidget_C_ExecuteUbergraph_W_DirectFacilityInstallWidget::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C.ExitFacilityInstall
// 0x0040 (0x0040 - 0x0000)
struct W_DirectFacilityInstallWidget_C_ExitFacilityInstall final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetStateInstall_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall) == 0x000008, "Wrong alignment on W_DirectFacilityInstallWidget_C_ExitFacilityInstall");
static_assert(sizeof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall) == 0x000040, "Wrong size on W_DirectFacilityInstallWidget_C_ExitFacilityInstall");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000008, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, CallFunc_IsWidgetStateInstall_ReturnValue) == 0x000010, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::CallFunc_IsWidgetStateInstall_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, CallFunc_GetDisplayName_ReturnValue) == 0x000018, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000028, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, K2Node_DynamicCast_AsP2Hero_Character) == 0x000030, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_ExitFacilityInstall, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_DirectFacilityInstallWidget_C_ExitFacilityInstall::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_DirectFacilityInstallWidget.W_DirectFacilityInstallWidget_C.PressedCancelBtn_ImplementableEvent
// 0x0010 (0x0010 - 0x0000)
struct W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent final
{
public:
	TDelegate<void(EPopupButtonID ButtonID)>      InDelegateResumeBtn;                               // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent) == 0x000004, "Wrong alignment on W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent");
static_assert(sizeof(W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent) == 0x000010, "Wrong size on W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent");
static_assert(offsetof(W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent, InDelegateResumeBtn) == 0x000000, "Member 'W_DirectFacilityInstallWidget_C_PressedCancelBtn_ImplementableEvent::InDelegateResumeBtn' has a wrong offset!");

}

