#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Drone_QuickPurchasePopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Drone_QuickPurchasePopupWidget.W_Drone_QuickPurchasePopupWidget_C
// 0x0068 (0x0658 - 0x05F0)
class UW_Drone_QuickPurchasePopupWidget_C final : public UP2DroneQuickPurchaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ActionTexture;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ActionTexture;                                 // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnCancel;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnDefault;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_WarningIcon;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Body;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_SubText;                                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Total;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Drone_QuickPurchaseItemWidget_C*     W_Drone_QuickPurchaseItemWidget;                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Drone_QuickPurchaseItemWidget_C*     W_Drone_QuickPurchaseItemWidget_1;                 // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Drone_QuickPurchaseItemWidget_C*     W_Drone_QuickPurchaseItemWidget_2;                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdatePopupState_ImplementableEvent(EP2QuickPurchasePopupState InQuickPurchasePopupState)	 // 0xae1e64;
	void ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Drone_QuickPurchasePopupWidget_C">();
	}
	static class UW_Drone_QuickPurchasePopupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Drone_QuickPurchasePopupWidget_C>();
	}
};
static_assert(alignof(UW_Drone_QuickPurchasePopupWidget_C) == 0x000008, "Wrong alignment on UW_Drone_QuickPurchasePopupWidget_C");
static_assert(sizeof(UW_Drone_QuickPurchasePopupWidget_C) == 0x000658, "Wrong size on UW_Drone_QuickPurchasePopupWidget_C");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, UberGraphFrame) == 0x0005F0, "Member 'UW_Drone_QuickPurchasePopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Bdr_ActionTexture) == 0x0005F8, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Bdr_ActionTexture' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Img_ActionTexture) == 0x000600, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Img_ActionTexture' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Img_Divider) == 0x000608, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, SzB_BtnCancel) == 0x000610, "Member 'UW_Drone_QuickPurchasePopupWidget_C::SzB_BtnCancel' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, SzB_BtnDefault) == 0x000618, "Member 'UW_Drone_QuickPurchasePopupWidget_C::SzB_BtnDefault' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, SzB_WarningIcon) == 0x000620, "Member 'UW_Drone_QuickPurchasePopupWidget_C::SzB_WarningIcon' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Txt_Body) == 0x000628, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Txt_Body' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Txt_SubText) == 0x000630, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Txt_SubText' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, Txt_Total) == 0x000638, "Member 'UW_Drone_QuickPurchasePopupWidget_C::Txt_Total' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, W_Drone_QuickPurchaseItemWidget) == 0x000640, "Member 'UW_Drone_QuickPurchasePopupWidget_C::W_Drone_QuickPurchaseItemWidget' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, W_Drone_QuickPurchaseItemWidget_1) == 0x000648, "Member 'UW_Drone_QuickPurchasePopupWidget_C::W_Drone_QuickPurchaseItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Drone_QuickPurchasePopupWidget_C, W_Drone_QuickPurchaseItemWidget_2) == 0x000650, "Member 'UW_Drone_QuickPurchasePopupWidget_C::W_Drone_QuickPurchaseItemWidget_2' has a wrong offset!");

}

