#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dropdown

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Dropdown.W_Dropdown_C.ArrowRotate
// 0x0002 (0x0002 - 0x0000)
struct W_Dropdown_C_ArrowRotate final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dropdown_C_ArrowRotate) == 0x000001, "Wrong alignment on W_Dropdown_C_ArrowRotate");
static_assert(sizeof(W_Dropdown_C_ArrowRotate) == 0x000002, "Wrong size on W_Dropdown_C_ArrowRotate");
static_assert(offsetof(W_Dropdown_C_ArrowRotate, Temp_bool_Variable) == 0x000000, "Member 'W_Dropdown_C_ArrowRotate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ArrowRotate, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'W_Dropdown_C_ArrowRotate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function W_Dropdown.W_Dropdown_C.SetMainButton
// 0x0001 (0x0001 - 0x0000)
struct W_Dropdown_C_SetMainButton final
{
public:
	bool                                          IsMainBtn_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dropdown_C_SetMainButton) == 0x000001, "Wrong alignment on W_Dropdown_C_SetMainButton");
static_assert(sizeof(W_Dropdown_C_SetMainButton) == 0x000001, "Wrong size on W_Dropdown_C_SetMainButton");
static_assert(offsetof(W_Dropdown_C_SetMainButton, IsMainBtn_0) == 0x000000, "Member 'W_Dropdown_C_SetMainButton::IsMainBtn_0' has a wrong offset!");

// Function W_Dropdown.W_Dropdown_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Dropdown_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dropdown_C_PreConstruct) == 0x000001, "Wrong alignment on W_Dropdown_C_PreConstruct");
static_assert(sizeof(W_Dropdown_C_PreConstruct) == 0x000001, "Wrong size on W_Dropdown_C_PreConstruct");
static_assert(offsetof(W_Dropdown_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Dropdown_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Dropdown.W_Dropdown_C.Init
// 0x0002 (0x0002 - 0x0000)
struct W_Dropdown_C_Init final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dropdown_C_Init) == 0x000001, "Wrong alignment on W_Dropdown_C_Init");
static_assert(sizeof(W_Dropdown_C_Init) == 0x000002, "Wrong size on W_Dropdown_C_Init");
static_assert(offsetof(W_Dropdown_C_Init, IsEnabled) == 0x000000, "Member 'W_Dropdown_C_Init::IsEnabled' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_Init, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'W_Dropdown_C_Init::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_Dropdown.W_Dropdown_C.ExecuteUbergraph_W_Dropdown
// 0x0020 (0x0020 - 0x0000)
struct W_Dropdown_C_ExecuteUbergraph_W_Dropdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown) == 0x000004, "Wrong alignment on W_Dropdown_C_ExecuteUbergraph_W_Dropdown");
static_assert(sizeof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown) == 0x000020, "Wrong size on W_Dropdown_C_ExecuteUbergraph_W_Dropdown");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, EntryPoint) == 0x000000, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, Temp_bool_Variable) == 0x000004, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, Temp_real_Variable) == 0x000008, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, Temp_real_Variable_1) == 0x00000C, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, K2Node_SwitchEnum_CmpSuccess_1) == 0x000011, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, K2Node_Event_IsDesignTime) == 0x000012, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, Temp_bool_Variable_1) == 0x000013, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, K2Node_Select_Default) == 0x000018, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Dropdown_C_ExecuteUbergraph_W_Dropdown, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001C, "Member 'W_Dropdown_C_ExecuteUbergraph_W_Dropdown::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

