#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Drone_QuickPurchasePopupWidget

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Drone_QuickPurchasePopupWidget.W_Drone_QuickPurchasePopupWidget_C.UpdatePopupState_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent final
{
public:
	EP2QuickPurchasePopupState                    InQuickPurchasePopupState;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent) == 0x000001, "Wrong alignment on W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent");
static_assert(sizeof(W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent) == 0x000001, "Wrong size on W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent, InQuickPurchasePopupState) == 0x000000, "Member 'W_Drone_QuickPurchasePopupWidget_C_UpdatePopupState_ImplementableEvent::InQuickPurchasePopupState' has a wrong offset!");

// Function W_Drone_QuickPurchasePopupWidget.W_Drone_QuickPurchasePopupWidget_C.ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget
// 0x005C (0x005C - 0x0000)
struct W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2QuickPurchasePopupState                    K2Node_Event_InQuickPurchasePopupState;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0020(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0034(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0048(0x0014)()
};
static_assert(alignof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget) == 0x000004, "Wrong alignment on W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget");
static_assert(sizeof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget) == 0x00005C, "Wrong size on W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, EntryPoint) == 0x000000, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_Event_InQuickPurchasePopupState) == 0x000004, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_Event_InQuickPurchasePopupState' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_MakeStruct_SlateColor_1) == 0x000020, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_MakeStruct_SlateColor_2) == 0x000034, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget, K2Node_MakeStruct_SlateColor_3) == 0x000048, "Member 'W_Drone_QuickPurchasePopupWidget_C_ExecuteUbergraph_W_Drone_QuickPurchasePopupWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

