#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dropdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Dropdown.W_Dropdown_C
// 0x0078 (0x0438 - 0x03C0)
class UW_Dropdown_C final : public UP2CommonButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DropdownArrow_Down;                                // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DropdownArrow_Up;                                  // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Button;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Gradient;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_BtnName;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Sldr_ShineAnim;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Button;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonName;                                        // 0x0410(0x0018)(Edit, BlueprintVisible)
	EPopupButtonID                                ButtonID;                                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMainBtn;                                         // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x042A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42B[0x1];                                      // 0x042B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BtnWidth;                                          // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BtnHeight;                                         // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BtnNameScale;                                      // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ArrowRotate()	 // 0xae1e64;
	void SetMainButton(bool IsMainBtn_0)	 // 0xae1e64;
	void Release_ImplementableEvent()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Init(bool IsEnabled)	 // 0xae1e64;
	void ExecuteUbergraph_W_Dropdown(int32 EntryPoint)	 // 0xae1e64;
	void DeActiveKeyFocus()	 // 0xae1e64;
	void BndEvt__W_Dropdown_Btn_Button_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature()	 // 0xae1e64;
	void ActiveKeyFocus()	 // 0xae1e64;
	void UnHovered_ImplementableEvent()	 // 0xae1e64;
	void Hovered_ImplementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Dropdown_C">();
	}
	static class UW_Dropdown_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Dropdown_C>();
	}
};
static_assert(alignof(UW_Dropdown_C) == 0x000008, "Wrong alignment on UW_Dropdown_C");
static_assert(sizeof(UW_Dropdown_C) == 0x000438, "Wrong size on UW_Dropdown_C");
static_assert(offsetof(UW_Dropdown_C, UberGraphFrame) == 0x0003C0, "Member 'UW_Dropdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, DropdownArrow_Down) == 0x0003C8, "Member 'UW_Dropdown_C::DropdownArrow_Down' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, DropdownArrow_Up) == 0x0003D0, "Member 'UW_Dropdown_C::DropdownArrow_Up' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, Bdr_Button) == 0x0003D8, "Member 'UW_Dropdown_C::Bdr_Button' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, Img_Arrow) == 0x0003E0, "Member 'UW_Dropdown_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, Img_Deco) == 0x0003E8, "Member 'UW_Dropdown_C::Img_Deco' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, Img_Gradient) == 0x0003F0, "Member 'UW_Dropdown_C::Img_Gradient' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, SclB_BtnName) == 0x0003F8, "Member 'UW_Dropdown_C::SclB_BtnName' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, Sldr_ShineAnim) == 0x000400, "Member 'UW_Dropdown_C::Sldr_ShineAnim' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, SzB_Button) == 0x000408, "Member 'UW_Dropdown_C::SzB_Button' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, ButtonName) == 0x000410, "Member 'UW_Dropdown_C::ButtonName' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, ButtonID) == 0x000428, "Member 'UW_Dropdown_C::ButtonID' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, IsMainBtn) == 0x000429, "Member 'UW_Dropdown_C::IsMainBtn' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, IsDisabled) == 0x00042A, "Member 'UW_Dropdown_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, BtnWidth) == 0x00042C, "Member 'UW_Dropdown_C::BtnWidth' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, BtnHeight) == 0x000430, "Member 'UW_Dropdown_C::BtnHeight' has a wrong offset!");
static_assert(offsetof(UW_Dropdown_C, BtnNameScale) == 0x000434, "Member 'UW_Dropdown_C::BtnNameScale' has a wrong offset!");

}

