#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DynamicFactionRep_TooltipWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DynamicFactionRep_TooltipWidget.W_DynamicFactionRep_TooltipWidget_C
// 0x0018 (0x0328 - 0x0310)
class UW_DynamicFactionRep_TooltipWidget_C final : public UP2DynamicFactionRepTooltipWidget
{
public:
	class UW_DynamicFactionRep_TooltipInfoWidget_C* W_DynamicFactionRep_TooltipInfoWidget;           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DynamicFactionRep_TooltipInfoWidget_C* W_DynamicFactionRep_TooltipInfoWidget_2;         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DynamicFactionRep_TooltipInfoWidget_C* W_DynamicFactionRep_TooltipInfoWidget_3;         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DynamicFactionRep_TooltipWidget_C">();
	}
	static class UW_DynamicFactionRep_TooltipWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DynamicFactionRep_TooltipWidget_C>();
	}
};
static_assert(alignof(UW_DynamicFactionRep_TooltipWidget_C) == 0x000008, "Wrong alignment on UW_DynamicFactionRep_TooltipWidget_C");
static_assert(sizeof(UW_DynamicFactionRep_TooltipWidget_C) == 0x000328, "Wrong size on UW_DynamicFactionRep_TooltipWidget_C");
static_assert(offsetof(UW_DynamicFactionRep_TooltipWidget_C, W_DynamicFactionRep_TooltipInfoWidget) == 0x000310, "Member 'UW_DynamicFactionRep_TooltipWidget_C::W_DynamicFactionRep_TooltipInfoWidget' has a wrong offset!");
static_assert(offsetof(UW_DynamicFactionRep_TooltipWidget_C, W_DynamicFactionRep_TooltipInfoWidget_2) == 0x000318, "Member 'UW_DynamicFactionRep_TooltipWidget_C::W_DynamicFactionRep_TooltipInfoWidget_2' has a wrong offset!");
static_assert(offsetof(UW_DynamicFactionRep_TooltipWidget_C, W_DynamicFactionRep_TooltipInfoWidget_3) == 0x000320, "Member 'UW_DynamicFactionRep_TooltipWidget_C::W_DynamicFactionRep_TooltipInfoWidget_3' has a wrong offset!");

}

