#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DynamicFactionRep_TooltipInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DynamicFactionRep_TooltipInfoWidget.W_DynamicFactionRep_TooltipInfoWidget_C
// 0x0018 (0x02D0 - 0x02B8)
class UW_DynamicFactionRep_TooltipInfoWidget_C final : public UP2DynamicFactionRepTooltipInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Values;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Change;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DynamicFactionRep_TooltipInfoWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetFactionInfo(const class FText& FactionName, int32 FactionRepLvl)	 // 0xae1e64;
	void SetPosNegState(int32 AfterValue, int32 BeforeValue)	 // 0xae1e64;
	void SetValues(bool IsCurrencyValue, int32 BeforeValue, int32 AfterValue)	 // 0xae1e64;
	void UpdateTooltipInfo_ImplementableEvent(const struct FP2DynamicFactionReqData& InDynamicFactionReqData)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_DynamicFactionRep_TooltipInfoWidget_C">();
	}
	static class UW_DynamicFactionRep_TooltipInfoWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_DynamicFactionRep_TooltipInfoWidget_C>();
	}
};
static_assert(alignof(UW_DynamicFactionRep_TooltipInfoWidget_C) == 0x000008, "Wrong alignment on UW_DynamicFactionRep_TooltipInfoWidget_C");
static_assert(sizeof(UW_DynamicFactionRep_TooltipInfoWidget_C) == 0x0002D0, "Wrong size on UW_DynamicFactionRep_TooltipInfoWidget_C");
static_assert(offsetof(UW_DynamicFactionRep_TooltipInfoWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UW_DynamicFactionRep_TooltipInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DynamicFactionRep_TooltipInfoWidget_C, Bdr_Values) == 0x0002C0, "Member 'UW_DynamicFactionRep_TooltipInfoWidget_C::Bdr_Values' has a wrong offset!");
static_assert(offsetof(UW_DynamicFactionRep_TooltipInfoWidget_C, Img_Change) == 0x0002C8, "Member 'UW_DynamicFactionRep_TooltipInfoWidget_C::Img_Change' has a wrong offset!");

}

