#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndofRaid

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_EndofRaid.W_EndofRaid_C.CheckNeedUpdateValue
// 0x0018 (0x0018 - 0x0000)
struct W_EndofRaid_C_CheckNeedUpdateValue final
{
public:
	bool                                          return_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartSpectating_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_CheckNeedUpdateValue) == 0x000008, "Wrong alignment on W_EndofRaid_C_CheckNeedUpdateValue");
static_assert(sizeof(W_EndofRaid_C_CheckNeedUpdateValue) == 0x000018, "Wrong size on W_EndofRaid_C_CheckNeedUpdateValue");
static_assert(offsetof(W_EndofRaid_C_CheckNeedUpdateValue, return_0) == 0x000000, "Member 'W_EndofRaid_C_CheckNeedUpdateValue::return_0' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_CheckNeedUpdateValue, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_EndofRaid_C_CheckNeedUpdateValue::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_CheckNeedUpdateValue, CallFunc_CanStartSpectating_ReturnValue) == 0x000010, "Member 'W_EndofRaid_C_CheckNeedUpdateValue::CallFunc_CanStartSpectating_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_CheckNeedUpdateValue, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'W_EndofRaid_C_CheckNeedUpdateValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_CheckNeedUpdateValue, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000012, "Member 'W_EndofRaid_C_CheckNeedUpdateValue::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.ExecuteUbergraph_W_EndofRaid
// 0x0188 (0x0188 - 0x0000)
struct W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartSpectating_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInTutorial_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpectating_ReturnValue;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckNeedUpdateValue_return;              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDeathReason_ReturnValue;               // 0x0080(0x0018)()
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ABP_TutorialManager_C*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2DeathState                                 CallFunc_GetDeathState_ReturnValue;                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_1; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_2; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0148(0x0018)()
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_A_ImplicitCast;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_A_ImplicitCast_1;             // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid) == 0x000008, "Wrong alignment on W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid");
static_assert(sizeof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid) == 0x000188, "Wrong size on W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, EntryPoint) == 0x000000, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000010, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_CanStartSpectating_ReturnValue) == 0x000018, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_CanStartSpectating_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetIsInTutorial_ReturnValue) == 0x000019, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetIsInTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_SetTimer_ReturnValue) == 0x000020, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000028, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_Event_MyGeometry) == 0x00002C, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_Event_InDeltaTime) == 0x000064, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000068, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_FTrunc_ReturnValue) == 0x000070, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_IsSpectating_ReturnValue) == 0x000074, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_IsSpectating_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_CheckNeedUpdateValue_return) == 0x000075, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_CheckNeedUpdateValue_return' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_PlayAnimation_ReturnValue) == 0x000078, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetDeathReason_ReturnValue) == 0x000080, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetDeathReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x000098, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000AC, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetActorOfClass_ReturnValue) == 0x0000B8, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000C0, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_DynamicCast_AsP2Hero_Character) == 0x0000C8, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D4, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetDeathState_ReturnValue) == 0x0000E4, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetDeathState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000E8, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000F0, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_1) == 0x000100, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_SwitchEnum_CmpSuccess) == 0x000104, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, K2Node_CreateDelegate_OutputDelegate_2) == 0x000108, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000118, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_2) == 0x000120, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_SelectFloat_ReturnValue) == 0x000128, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_SelectFloat_ReturnValue_1) == 0x000130, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_Round_ReturnValue) == 0x000138, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_Clamp_ReturnValue) == 0x00013C, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_Conv_IntToText_ReturnValue) == 0x000148, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_SelectFloat_B_ImplicitCast) == 0x000160, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_FTrunc_A_ImplicitCast) == 0x000168, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000170, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_SelectFloat_A_ImplicitCast) == 0x000178, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_SelectFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid, CallFunc_SelectFloat_A_ImplicitCast_1) == 0x000180, "Member 'W_EndofRaid_C_ExecuteUbergraph_W_EndofRaid::CallFunc_SelectFloat_A_ImplicitCast_1' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.ExittoHideout
// 0x0020 (0x0020 - 0x0000)
struct W_EndofRaid_C_ExittoHideout final
{
public:
	class ULoadingProcessTask*                    CallFunc_CreateLoadingScreenProcessTask_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2PlayerController*                    K2Node_DynamicCast_AsP2Player_Controller;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_ExittoHideout) == 0x000008, "Wrong alignment on W_EndofRaid_C_ExittoHideout");
static_assert(sizeof(W_EndofRaid_C_ExittoHideout) == 0x000020, "Wrong size on W_EndofRaid_C_ExittoHideout");
static_assert(offsetof(W_EndofRaid_C_ExittoHideout, CallFunc_CreateLoadingScreenProcessTask_ReturnValue) == 0x000000, "Member 'W_EndofRaid_C_ExittoHideout::CallFunc_CreateLoadingScreenProcessTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExittoHideout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_EndofRaid_C_ExittoHideout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExittoHideout, K2Node_DynamicCast_AsP2Player_Controller) == 0x000010, "Member 'W_EndofRaid_C_ExittoHideout::K2Node_DynamicCast_AsP2Player_Controller' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_ExittoHideout, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_EndofRaid_C_ExittoHideout::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.PlayAppearAnimation
// 0x0018 (0x0018 - 0x0000)
struct W_EndofRaid_C_PlayAppearAnimation final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_PlayAppearAnimation) == 0x000008, "Wrong alignment on W_EndofRaid_C_PlayAppearAnimation");
static_assert(sizeof(W_EndofRaid_C_PlayAppearAnimation) == 0x000018, "Wrong size on W_EndofRaid_C_PlayAppearAnimation");
static_assert(offsetof(W_EndofRaid_C_PlayAppearAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_EndofRaid_C_PlayAppearAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_PlayAppearAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_EndofRaid_C_PlayAppearAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.StopRaidSounds
// 0x0078 (0x0078 - 0x0000)
struct W_EndofRaid_C_StopRaidSounds final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDeathReason_ReturnValue;               // 0x0030(0x0018)()
	EP2DeathState                                 CallFunc_GetDeathState_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue; // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsInTutorial_ReturnValue;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartSpectating_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_StopRaidSounds) == 0x000008, "Wrong alignment on W_EndofRaid_C_StopRaidSounds");
static_assert(sizeof(W_EndofRaid_C_StopRaidSounds) == 0x000078, "Wrong size on W_EndofRaid_C_StopRaidSounds");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, Temp_delegate_Variable) == 0x000000, "Member 'W_EndofRaid_C_StopRaidSounds::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000010, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_PostEvent_ReturnValue) == 0x000018, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, K2Node_DynamicCast_AsP2Hero_Character) == 0x000020, "Member 'W_EndofRaid_C_StopRaidSounds::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_EndofRaid_C_StopRaidSounds::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetDeathReason_ReturnValue) == 0x000030, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetDeathReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetDeathState_ReturnValue) == 0x000048, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetDeathState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue) == 0x000049, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000050, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'W_EndofRaid_C_StopRaidSounds::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetIsInTutorial_ReturnValue) == 0x000061, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetIsInTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_StopRaidSounds, CallFunc_CanStartSpectating_ReturnValue) == 0x000070, "Member 'W_EndofRaid_C_StopRaidSounds::CallFunc_CanStartSpectating_ReturnValue' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_EndofRaid_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_Tick) == 0x000004, "Wrong alignment on W_EndofRaid_C_Tick");
static_assert(sizeof(W_EndofRaid_C_Tick) == 0x00003C, "Wrong size on W_EndofRaid_C_Tick");
static_assert(offsetof(W_EndofRaid_C_Tick, MyGeometry) == 0x000000, "Member 'W_EndofRaid_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_Tick, InDeltaTime) == 0x000038, "Member 'W_EndofRaid_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.UpdateText
// 0x0018 (0x0018 - 0x0000)
struct W_EndofRaid_C_UpdateText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_EndofRaid_C_UpdateText) == 0x000008, "Wrong alignment on W_EndofRaid_C_UpdateText");
static_assert(sizeof(W_EndofRaid_C_UpdateText) == 0x000018, "Wrong size on W_EndofRaid_C_UpdateText");
static_assert(offsetof(W_EndofRaid_C_UpdateText, Text) == 0x000000, "Member 'W_EndofRaid_C_UpdateText::Text' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.UpdateUI
// 0x0070 (0x0070 - 0x0000)
struct W_EndofRaid_C_UpdateUI final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDeathReason_ReturnValue;               // 0x0018(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0014)()
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2DownedState                                CallFunc_GetDownedState_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_UpdateUI) == 0x000008, "Wrong alignment on W_EndofRaid_C_UpdateUI");
static_assert(sizeof(W_EndofRaid_C_UpdateUI) == 0x000070, "Wrong size on W_EndofRaid_C_UpdateUI");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_EndofRaid_C_UpdateUI::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_GetDeathReason_ReturnValue) == 0x000018, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_GetDeathReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'W_EndofRaid_C_UpdateUI::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000048, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, K2Node_DynamicCast_AsP2Hero_Character) == 0x000050, "Member 'W_EndofRaid_C_UpdateUI::K2Node_DynamicCast_AsP2Hero_Character' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'W_EndofRaid_C_UpdateUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_GetDownedState_ReturnValue) == 0x000059, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_GetDownedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateUI, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'W_EndofRaid_C_UpdateUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_EndofRaid.W_EndofRaid_C.UpdateValue
// 0x0050 (0x0050 - 0x0000)
struct W_EndofRaid_C_UpdateValue final
{
public:
	double                                        Temp_real_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       K2Node_DynamicCast_AsP2Hero_Character;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2DeathState                                 CallFunc_GetDeathState_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartSpectating_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndofRaid_C_UpdateValue) == 0x000008, "Wrong alignment on W_EndofRaid_C_UpdateValue");
static_assert(sizeof(W_EndofRaid_C_UpdateValue) == 0x000050, "Wrong size on W_EndofRaid_C_UpdateValue");
static_assert(offsetof(W_EndofRaid_C_UpdateValue, Temp_real_Variable) == 0x000000, "Member 'W_EndofRaid_C_UpdateValue::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateValue, Temp_real_Variable_1) == 0x000008, "Member 'W_EndofRaid_C_UpdateValue::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndofRaid_C_UpdateValue, Temp_bool_Variable) == 0x000010, "Member 'W_EndofRaid_C_UpdateValue::Temp_bool_Variable' has a wrong offset!");
