#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EnemyPingWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_EnemyPingWidget.W_EnemyPingWidget_C.ExecuteUbergraph_W_EnemyPingWidget
// 0x0050 (0x0050 - 0x0000)
struct W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsADS;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InDist;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsInRange;                          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_InDetailLevel;                        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget) == 0x000008, "Wrong alignment on W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget");
static_assert(sizeof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget) == 0x000050, "Wrong size on W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, EntryPoint) == 0x000000, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_Event_InIsADS) == 0x000004, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_Event_InIsADS' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_Event_InDist) == 0x000008, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_Event_InDist' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_Event_InIsInRange) == 0x00000C, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_Event_InIsInRange' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_Event_InDetailLevel) == 0x00000D, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_Event_InDetailLevel' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_MakeStruct_LinearColor_1) == 0x000030, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000040, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget, K2Node_MakeStruct_A_ImplicitCast) == 0x000048, "Member 'W_EnemyPingWidget_C_ExecuteUbergraph_W_EnemyPingWidget::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

// Function W_EnemyPingWidget.W_EnemyPingWidget_C.OnRefreshVisible
// 0x000C (0x000C - 0x0000)
struct W_EnemyPingWidget_C_OnRefreshVisible final
{
public:
	bool                                          InIsADS;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InDist;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsInRange;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         InDetailLevel;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EnemyPingWidget_C_OnRefreshVisible) == 0x000004, "Wrong alignment on W_EnemyPingWidget_C_OnRefreshVisible");
static_assert(sizeof(W_EnemyPingWidget_C_OnRefreshVisible) == 0x00000C, "Wrong size on W_EnemyPingWidget_C_OnRefreshVisible");
static_assert(offsetof(W_EnemyPingWidget_C_OnRefreshVisible, InIsADS) == 0x000000, "Member 'W_EnemyPingWidget_C_OnRefreshVisible::InIsADS' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_OnRefreshVisible, InDist) == 0x000004, "Member 'W_EnemyPingWidget_C_OnRefreshVisible::InDist' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_OnRefreshVisible, InIsInRange) == 0x000008, "Member 'W_EnemyPingWidget_C_OnRefreshVisible::InIsInRange' has a wrong offset!");
static_assert(offsetof(W_EnemyPingWidget_C_OnRefreshVisible, InDetailLevel) == 0x000009, "Member 'W_EnemyPingWidget_C_OnRefreshVisible::InDetailLevel' has a wrong offset!");

}

