#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndofRaid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EndofRaid.W_EndofRaid_C
// 0x0100 (0x0690 - 0x0590)
class UW_EndofRaid_C final : public UP2EndOfRaid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeResult;                                        // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Background;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_Timer;                                          // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Btns;                                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RaidResultUnderline;                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_HideoutButton;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RestartButton;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SpectateButton;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Timer;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_RaidResult;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Timer;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TimerTitle;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2RaidResultRecordAccessor*            Accessor;                                          // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeath;                                           // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TxtPopupBody;                                      // 0x0620(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanSpectate;                                       // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Wait_Duration;                                     // 0x063C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BottomText;                                        // 0x0640(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UpdateBottomText;                                  // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WentToHideout;                                     // 0x0659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A[0x6];                                      // 0x065A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AWOL;                                              // 0x0660(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        FadeOutDelay;                                      // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TutorialManager_C*                  NewVar;                                            // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULoadingProcessTask*                    LoadingScreenTask;                                 // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckNeedUpdateValue(bool* return_0)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_EndofRaid(int32 EntryPoint)	 // 0xae1e64;
	void ExittoHideout()	 // 0xae1e64;
	void HideUIOnSpectate()	 // 0xae1e64;
	void OnFadeOutComplete()	 // 0xae1e64;
	void PlayAppearAnimation()	 // 0xae1e64;
	void Restart()	 // 0xae1e64;
	void Spectate()	 // 0xae1e64;
	void StopRaidSounds()	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void UpdateText(const class FText& Text)	 // 0xae1e64;
	void UpdateUI()	 // 0xae1e64;
	void UpdateValue()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_EndofRaid_C">();
	}
	static class UW_EndofRaid_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_EndofRaid_C>();
	}
};
static_assert(alignof(UW_EndofRaid_C) == 0x000008, "Wrong alignment on UW_EndofRaid_C");
static_assert(sizeof(UW_EndofRaid_C) == 0x000690, "Wrong size on UW_EndofRaid_C");
static_assert(offsetof(UW_EndofRaid_C, UberGraphFrame) == 0x000590, "Member 'UW_EndofRaid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, FadeResult) == 0x000598, "Member 'UW_EndofRaid_C::FadeResult' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, FadeIn) == 0x0005A0, "Member 'UW_EndofRaid_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, FadeOut) == 0x0005A8, "Member 'UW_EndofRaid_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Background) == 0x0005B0, "Member 'UW_EndofRaid_C::Background' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, GP_Timer) == 0x0005B8, "Member 'UW_EndofRaid_C::GP_Timer' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, HB_Btns) == 0x0005C0, "Member 'UW_EndofRaid_C::HB_Btns' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Img_Pattern) == 0x0005C8, "Member 'UW_EndofRaid_C::Img_Pattern' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Img_RaidResultUnderline) == 0x0005D0, "Member 'UW_EndofRaid_C::Img_RaidResultUnderline' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, SzB_HideoutButton) == 0x0005D8, "Member 'UW_EndofRaid_C::SzB_HideoutButton' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, SzB_RestartButton) == 0x0005E0, "Member 'UW_EndofRaid_C::SzB_RestartButton' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, SzB_SpectateButton) == 0x0005E8, "Member 'UW_EndofRaid_C::SzB_SpectateButton' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, SzB_Timer) == 0x0005F0, "Member 'UW_EndofRaid_C::SzB_Timer' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Txt_RaidResult) == 0x0005F8, "Member 'UW_EndofRaid_C::Txt_RaidResult' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Txt_Timer) == 0x000600, "Member 'UW_EndofRaid_C::Txt_Timer' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Txt_TimerTitle) == 0x000608, "Member 'UW_EndofRaid_C::Txt_TimerTitle' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Accessor) == 0x000610, "Member 'UW_EndofRaid_C::Accessor' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, IsDeath) == 0x000618, "Member 'UW_EndofRaid_C::IsDeath' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, TxtPopupBody) == 0x000620, "Member 'UW_EndofRaid_C::TxtPopupBody' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, CanSpectate) == 0x000638, "Member 'UW_EndofRaid_C::CanSpectate' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, Wait_Duration) == 0x00063C, "Member 'UW_EndofRaid_C::Wait_Duration' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, BottomText) == 0x000640, "Member 'UW_EndofRaid_C::BottomText' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, UpdateBottomText) == 0x000658, "Member 'UW_EndofRaid_C::UpdateBottomText' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, WentToHideout) == 0x000659, "Member 'UW_EndofRaid_C::WentToHideout' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, AWOL) == 0x000660, "Member 'UW_EndofRaid_C::AWOL' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, FadeOutDelay) == 0x000678, "Member 'UW_EndofRaid_C::FadeOutDelay' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, NewVar) == 0x000680, "Member 'UW_EndofRaid_C::NewVar' has a wrong offset!");
static_assert(offsetof(UW_EndofRaid_C, LoadingScreenTask) == 0x000688, "Member 'UW_EndofRaid_C::LoadingScreenTask' has a wrong offset!");

}

