#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Extraction_Stem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Extraction_Stem.W_Extraction_Stem_C.ExecuteUbergraph_W_Extraction_Stem
// 0x0050 (0x0050 - 0x0000)
struct W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_CustomEvent_InExfiltrationAUV;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem) == 0x000008, "Wrong alignment on W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem");
static_assert(sizeof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem) == 0x000050, "Wrong size on W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem");
static_assert(offsetof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem, EntryPoint) == 0x000000, "Member 'W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem, K2Node_CustomEvent_InExfiltrationAUV) == 0x000008, "Member 'W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem::K2Node_CustomEvent_InExfiltrationAUV' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem, K2Node_Event_MyGeometry) == 0x000010, "Member 'W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem, K2Node_Event_InDeltaTime) == 0x000048, "Member 'W_Extraction_Stem_C_ExecuteUbergraph_W_Extraction_Stem::K2Node_Event_InDeltaTime' has a wrong offset!");

// Function W_Extraction_Stem.W_Extraction_Stem_C.FloatToTime
// 0x0120 (0x0120 - 0x0000)
struct W_Extraction_Stem_C_FloatToTime final
{
public:
	double                                        InFloat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   FormattedTime;                                     // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
};
static_assert(alignof(W_Extraction_Stem_C_FloatToTime) == 0x000008, "Wrong alignment on W_Extraction_Stem_C_FloatToTime");
static_assert(sizeof(W_Extraction_Stem_C_FloatToTime) == 0x000120, "Wrong size on W_Extraction_Stem_C_FloatToTime");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, InFloat) == 0x000000, "Member 'W_Extraction_Stem_C_FloatToTime::InFloat' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, FormattedTime) == 0x000008, "Member 'W_Extraction_Stem_C_FloatToTime::FormattedTime' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_Extraction_Stem_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Round_ReturnValue) == 0x000098, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000A0, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'W_Extraction_Stem_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, K2Node_MakeArray_Array) == 0x0000F8, "Member 'W_Extraction_Stem_C_FloatToTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_FloatToTime, CallFunc_Format_ReturnValue) == 0x000108, "Member 'W_Extraction_Stem_C_FloatToTime::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_Extraction_Stem.W_Extraction_Stem_C.InitFunction
// 0x0008 (0x0008 - 0x0000)
struct W_Extraction_Stem_C_InitFunction final
{
public:
	class AP2ExfiltrationAUV*                     InExfiltrationAUV;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Extraction_Stem_C_InitFunction) == 0x000008, "Wrong alignment on W_Extraction_Stem_C_InitFunction");
static_assert(sizeof(W_Extraction_Stem_C_InitFunction) == 0x000008, "Wrong size on W_Extraction_Stem_C_InitFunction");
static_assert(offsetof(W_Extraction_Stem_C_InitFunction, InExfiltrationAUV) == 0x000000, "Member 'W_Extraction_Stem_C_InitFunction::InExfiltrationAUV' has a wrong offset!");

// Function W_Extraction_Stem.W_Extraction_Stem_C.SetExtractionTunnel
// 0x0008 (0x0008 - 0x0000)
struct W_Extraction_Stem_C_SetExtractionTunnel final
{
public:
	class AP2ExtractionTunnel*                    InTunnel;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Extraction_Stem_C_SetExtractionTunnel) == 0x000008, "Wrong alignment on W_Extraction_Stem_C_SetExtractionTunnel");
static_assert(sizeof(W_Extraction_Stem_C_SetExtractionTunnel) == 0x000008, "Wrong size on W_Extraction_Stem_C_SetExtractionTunnel");
static_assert(offsetof(W_Extraction_Stem_C_SetExtractionTunnel, InTunnel) == 0x000000, "Member 'W_Extraction_Stem_C_SetExtractionTunnel::InTunnel' has a wrong offset!");

// Function W_Extraction_Stem.W_Extraction_Stem_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Extraction_Stem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Extraction_Stem_C_Tick) == 0x000004, "Wrong alignment on W_Extraction_Stem_C_Tick");
static_assert(sizeof(W_Extraction_Stem_C_Tick) == 0x00003C, "Wrong size on W_Extraction_Stem_C_Tick");
static_assert(offsetof(W_Extraction_Stem_C_Tick, MyGeometry) == 0x000000, "Member 'W_Extraction_Stem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Extraction_Stem_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Extraction_Stem_C_Tick::InDeltaTime' has a wrong offset!");

}

