#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Exfiltration

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_Exfiltration.W_Exfiltration_C.ExecuteUbergraph_W_Exfiltration
// 0x0130 (0x0130 - 0x0000)
struct W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)> K2Node_CreateDelegate_OutputDelegate; // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       Temp_byte_Variable_7;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_CustomEvent_InExfiltrationAUV;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRemainingTimeBeforeActivation_ReturnValue; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2ExfiltrationAUV*                     K2Node_CustomEvent_InAUV;                          // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       K2Node_CustomEvent_InState;                        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration) == 0x000008, "Wrong alignment on W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration");
static_assert(sizeof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration) == 0x000130, "Wrong size on W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, EntryPoint) == 0x000000, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable) == 0x000040, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_1) == 0x000041, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_2) == 0x000042, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_3) == 0x000043, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_4) == 0x000044, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_5) == 0x000045, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_6) == 0x000046, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_7) == 0x000058, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_CustomEvent_InExfiltrationAUV) == 0x000060, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_CustomEvent_InExfiltrationAUV' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_GetRemainingTimeBeforeActivation_ReturnValue) == 0x00006C, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_GetRemainingTimeBeforeActivation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_TimeSecondsToString_ReturnValue) == 0x000070, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_IsValid_ReturnValue_1) == 0x0000E8, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_MakeArray_Array) == 0x0000F0, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_Format_ReturnValue) == 0x000100, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, CallFunc_IsValid_ReturnValue_2) == 0x000118, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_CustomEvent_InAUV) == 0x000120, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_CustomEvent_InAUV' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_CustomEvent_InState) == 0x000128, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, Temp_byte_Variable_8) == 0x000129, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration, K2Node_Select_Default) == 0x00012A, "Member 'W_Exfiltration_C_ExecuteUbergraph_W_Exfiltration::K2Node_Select_Default' has a wrong offset!");

// Function W_Exfiltration.W_Exfiltration_C.FloatToTime
// 0x0120 (0x0120 - 0x0000)
struct W_Exfiltration_C_FloatToTime final
{
public:
	double                                        InFloat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   FormattedTime;                                     // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
};
static_assert(alignof(W_Exfiltration_C_FloatToTime) == 0x000008, "Wrong alignment on W_Exfiltration_C_FloatToTime");
static_assert(sizeof(W_Exfiltration_C_FloatToTime) == 0x000120, "Wrong size on W_Exfiltration_C_FloatToTime");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, InFloat) == 0x000000, "Member 'W_Exfiltration_C_FloatToTime::InFloat' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, FormattedTime) == 0x000008, "Member 'W_Exfiltration_C_FloatToTime::FormattedTime' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_Exfiltration_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Round_ReturnValue) == 0x000098, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000A0, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'W_Exfiltration_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, K2Node_MakeArray_Array) == 0x0000F8, "Member 'W_Exfiltration_C_FloatToTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_FloatToTime, CallFunc_Format_ReturnValue) == 0x000108, "Member 'W_Exfiltration_C_FloatToTime::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_Exfiltration.W_Exfiltration_C.InitFunction
// 0x0008 (0x0008 - 0x0000)
struct W_Exfiltration_C_InitFunction final
{
public:
	class AP2ExfiltrationAUV*                     InExfiltrationAUV;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Exfiltration_C_InitFunction) == 0x000008, "Wrong alignment on W_Exfiltration_C_InitFunction");
static_assert(sizeof(W_Exfiltration_C_InitFunction) == 0x000008, "Wrong size on W_Exfiltration_C_InitFunction");
static_assert(offsetof(W_Exfiltration_C_InitFunction, InExfiltrationAUV) == 0x000000, "Member 'W_Exfiltration_C_InitFunction::InExfiltrationAUV' has a wrong offset!");

// Function W_Exfiltration.W_Exfiltration_C.OnStateChanged
// 0x0010 (0x0010 - 0x0000)
struct W_Exfiltration_C_OnStateChanged final
{
public:
	class AP2ExfiltrationAUV*                     InAUV;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExfiltrationAUVState                       InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Exfiltration_C_OnStateChanged) == 0x000008, "Wrong alignment on W_Exfiltration_C_OnStateChanged");
static_assert(sizeof(W_Exfiltration_C_OnStateChanged) == 0x000010, "Wrong size on W_Exfiltration_C_OnStateChanged");
static_assert(offsetof(W_Exfiltration_C_OnStateChanged, InAUV) == 0x000000, "Member 'W_Exfiltration_C_OnStateChanged::InAUV' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_OnStateChanged, InState) == 0x000008, "Member 'W_Exfiltration_C_OnStateChanged::InState' has a wrong offset!");

// Function W_Exfiltration.W_Exfiltration_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Exfiltration_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Exfiltration_C_Tick) == 0x000004, "Wrong alignment on W_Exfiltration_C_Tick");
static_assert(sizeof(W_Exfiltration_C_Tick) == 0x00003C, "Wrong size on W_Exfiltration_C_Tick");
static_assert(offsetof(W_Exfiltration_C_Tick, MyGeometry) == 0x000000, "Member 'W_Exfiltration_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Exfiltration_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Exfiltration_C_Tick::InDeltaTime' has a wrong offset!");

}

