#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Exfiltration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Exfiltration.W_Exfiltration_C
// 0x0028 (0x02A8 - 0x0280)
class UW_Exfiltration_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Icon;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AP2ExfiltrationAUV*                     In_Exfiltration_AUV;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Exfiltration(int32 EntryPoint)	 // 0xae1e64;
	void FloatToTime(double InFloat, class FText* FormattedTime)	 // 0xae1e64;
	void InitFunction(class AP2ExfiltrationAUV* InExfiltrationAUV)	 // 0xae1e64;
	void OnStateChanged(class AP2ExfiltrationAUV* InAUV, EP2ExfiltrationAUVState InState)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Exfiltration_C">();
	}
	static class UW_Exfiltration_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Exfiltration_C>();
	}
};
static_assert(alignof(UW_Exfiltration_C) == 0x000008, "Wrong alignment on UW_Exfiltration_C");
static_assert(sizeof(UW_Exfiltration_C) == 0x0002A8, "Wrong size on UW_Exfiltration_C");
static_assert(offsetof(UW_Exfiltration_C, UberGraphFrame) == 0x000280, "Member 'UW_Exfiltration_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Exfiltration_C, Img_Icon) == 0x000288, "Member 'UW_Exfiltration_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UW_Exfiltration_C, Time) == 0x000290, "Member 'UW_Exfiltration_C::Time' has a wrong offset!");
static_assert(offsetof(UW_Exfiltration_C, In_Exfiltration_AUV) == 0x000298, "Member 'UW_Exfiltration_C::In_Exfiltration_AUV' has a wrong offset!");
static_assert(offsetof(UW_Exfiltration_C, TimerHandle) == 0x0002A0, "Member 'UW_Exfiltration_C::TimerHandle' has a wrong offset!");

}

