#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExtractionTunnel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_ExtractionTunnel.W_ExtractionTunnel_C.ExecuteUbergraph_W_ExtractionTunnel
// 0x0128 (0x0128 - 0x0000)
struct W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AP2ExtractionTunnel* InAUV, EP2ExtractionTunnelState InState)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      Temp_byte_Variable_6;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStateTimeRemaining_ReturnValue;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class AP2ExtractionTunnel*                    K2Node_CustomEvent_InAUV;                          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      K2Node_CustomEvent_InState;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      CallFunc_GetTunnelState_ReturnValue_1;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel) == 0x000008, "Wrong alignment on W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel");
static_assert(sizeof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel) == 0x000128, "Wrong size on W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, EntryPoint) == 0x000000, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable) == 0x000004, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_1) == 0x000005, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_2) == 0x000006, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_3) == 0x000007, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_4) == 0x000008, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_5) == 0x000009, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_6) == 0x00001C, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_IsValid_ReturnValue) == 0x00001D, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_IsValid_ReturnValue_1) == 0x00001E, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_IsValid_ReturnValue_2) == 0x00001F, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_GetStateTimeRemaining_ReturnValue) == 0x000020, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_GetStateTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_TimeSecondsToString_ReturnValue) == 0x000028, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_TimeSecondsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_CustomEvent_InAUV) == 0x000050, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_CustomEvent_InAUV' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_CustomEvent_InState) == 0x000058, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_CustomEvent_InState' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, Temp_byte_Variable_7) == 0x0000B0, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_MakeArray_Array) == 0x0000B8, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue) == 0x0000E0, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_Event_MyGeometry) == 0x0000E4, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_Event_InDeltaTime) == 0x00011C, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, CallFunc_GetTunnelState_ReturnValue_1) == 0x000120, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::CallFunc_GetTunnelState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel, K2Node_Select_Default) == 0x000121, "Member 'W_ExtractionTunnel_C_ExecuteUbergraph_W_ExtractionTunnel::K2Node_Select_Default' has a wrong offset!");

// Function W_ExtractionTunnel.W_ExtractionTunnel_C.FloatToTime
// 0x0120 (0x0120 - 0x0000)
struct W_ExtractionTunnel_C_FloatToTime final
{
public:
	double                                        InFloat;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   FormattedTime;                                     // 0x0008(0x0018)(Parm, OutParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
};
static_assert(alignof(W_ExtractionTunnel_C_FloatToTime) == 0x000008, "Wrong alignment on W_ExtractionTunnel_C_FloatToTime");
static_assert(sizeof(W_ExtractionTunnel_C_FloatToTime) == 0x000120, "Wrong size on W_ExtractionTunnel_C_FloatToTime");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, InFloat) == 0x000000, "Member 'W_ExtractionTunnel_C_FloatToTime::InFloat' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, FormattedTime) == 0x000008, "Member 'W_ExtractionTunnel_C_FloatToTime::FormattedTime' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000028, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_ExtractionTunnel_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Round_ReturnValue) == 0x000098, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000A0, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'W_ExtractionTunnel_C_FloatToTime::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, K2Node_MakeArray_Array) == 0x0000F8, "Member 'W_ExtractionTunnel_C_FloatToTime::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_FloatToTime, CallFunc_Format_ReturnValue) == 0x000108, "Member 'W_ExtractionTunnel_C_FloatToTime::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function W_ExtractionTunnel.W_ExtractionTunnel_C.OnStateChanged
// 0x0010 (0x0010 - 0x0000)
struct W_ExtractionTunnel_C_OnStateChanged final
{
public:
	class AP2ExtractionTunnel*                    InAUV;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EP2ExtractionTunnelState                      InState;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExtractionTunnel_C_OnStateChanged) == 0x000008, "Wrong alignment on W_ExtractionTunnel_C_OnStateChanged");
static_assert(sizeof(W_ExtractionTunnel_C_OnStateChanged) == 0x000010, "Wrong size on W_ExtractionTunnel_C_OnStateChanged");
static_assert(offsetof(W_ExtractionTunnel_C_OnStateChanged, InAUV) == 0x000000, "Member 'W_ExtractionTunnel_C_OnStateChanged::InAUV' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_OnStateChanged, InState) == 0x000008, "Member 'W_ExtractionTunnel_C_OnStateChanged::InState' has a wrong offset!");

// Function W_ExtractionTunnel.W_ExtractionTunnel_C.SetExtractionTunnel
// 0x0008 (0x0008 - 0x0000)
struct W_ExtractionTunnel_C_SetExtractionTunnel final
{
public:
	class AP2ExtractionTunnel*                    InTunnel;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExtractionTunnel_C_SetExtractionTunnel) == 0x000008, "Wrong alignment on W_ExtractionTunnel_C_SetExtractionTunnel");
static_assert(sizeof(W_ExtractionTunnel_C_SetExtractionTunnel) == 0x000008, "Wrong size on W_ExtractionTunnel_C_SetExtractionTunnel");
static_assert(offsetof(W_ExtractionTunnel_C_SetExtractionTunnel, InTunnel) == 0x000000, "Member 'W_ExtractionTunnel_C_SetExtractionTunnel::InTunnel' has a wrong offset!");

// Function W_ExtractionTunnel.W_ExtractionTunnel_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_ExtractionTunnel_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExtractionTunnel_C_Tick) == 0x000004, "Wrong alignment on W_ExtractionTunnel_C_Tick");
static_assert(sizeof(W_ExtractionTunnel_C_Tick) == 0x00003C, "Wrong size on W_ExtractionTunnel_C_Tick");
static_assert(offsetof(W_ExtractionTunnel_C_Tick, MyGeometry) == 0x000000, "Member 'W_ExtractionTunnel_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ExtractionTunnel_C_Tick, InDeltaTime) == 0x000038, "Member 'W_ExtractionTunnel_C_Tick::InDeltaTime' has a wrong offset!");

}

