#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExpMoneyIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ExpMoneyIcon.W_ExpMoneyIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ExpMoneyIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExpMoneyIcon_C_PreConstruct) == 0x000001, "Wrong alignment on W_ExpMoneyIcon_C_PreConstruct");
static_assert(sizeof(W_ExpMoneyIcon_C_PreConstruct) == 0x000001, "Wrong size on W_ExpMoneyIcon_C_PreConstruct");
static_assert(offsetof(W_ExpMoneyIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ExpMoneyIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ExpMoneyIcon.W_ExpMoneyIcon_C.OnRefreshExpMoneyIconOnBP
// 0x000C (0x000C - 0x0000)
struct W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP final
{
public:
	bool                                          IsMoney;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InValue;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InEnough;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP) == 0x000004, "Wrong alignment on W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP");
static_assert(sizeof(W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP) == 0x00000C, "Wrong size on W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP");
static_assert(offsetof(W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP, IsMoney) == 0x000000, "Member 'W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP::IsMoney' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP, InValue) == 0x000004, "Member 'W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP::InValue' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP, InEnough) == 0x000008, "Member 'W_ExpMoneyIcon_C_OnRefreshExpMoneyIconOnBP::InEnough' has a wrong offset!");

// Function W_ExpMoneyIcon.W_ExpMoneyIcon_C.ExecuteUbergraph_W_ExpMoneyIcon
// 0x0080 (0x0080 - 0x0000)
struct W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsMoney;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InValue;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InEnough;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon) == 0x000008, "Wrong alignment on W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon");
static_assert(sizeof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon) == 0x000080, "Wrong size on W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, EntryPoint) == 0x000000, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_BreakVector2D_X) == 0x000008, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000018, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_BreakVector2D_X_1) == 0x000020, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_BreakVector2D_Y_1) == 0x000028, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_MakeStruct_Margin) == 0x000030, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_Event_IsMoney) == 0x000041, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_Event_IsMoney' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_Event_InValue) == 0x000044, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_Event_InEnough) == 0x000048, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_Event_InEnough' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000068, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00006C, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_MakeStruct_Left_ImplicitCast) == 0x000070, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, K2Node_MakeStruct_Right_ImplicitCast) == 0x000074, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1) == 0x000078, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x00007C, "Member 'W_ExpMoneyIcon_C_ExecuteUbergraph_W_ExpMoneyIcon::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

}

