#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExpMoneyIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ExpMoneyIcon.W_ExpMoneyIcon_C
// 0x0068 (0x02E8 - 0x0280)
class UW_ExpMoneyIcon_C final : public UP2ExpMoneyIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ExpMoney;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ExpMoney;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Icon;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Money;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Value;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_ExpMoney;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TileWidthHeight;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TileLeftRightPadding;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconSize;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnRefreshExpMoneyIconOnBP(bool IsMoney, int32 InValue, bool InEnough)	 // 0xae1e64;
	void ExecuteUbergraph_W_ExpMoneyIcon(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ExpMoneyIcon_C">();
	}
	static class UW_ExpMoneyIcon_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ExpMoneyIcon_C>();
	}
};
static_assert(alignof(UW_ExpMoneyIcon_C) == 0x000008, "Wrong alignment on UW_ExpMoneyIcon_C");
static_assert(sizeof(UW_ExpMoneyIcon_C) == 0x0002E8, "Wrong size on UW_ExpMoneyIcon_C");
static_assert(offsetof(UW_ExpMoneyIcon_C, UberGraphFrame) == 0x000280, "Member 'UW_ExpMoneyIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, Bdr_ExpMoney) == 0x000288, "Member 'UW_ExpMoneyIcon_C::Bdr_ExpMoney' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, Img_Icon) == 0x000290, "Member 'UW_ExpMoneyIcon_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, SzB_ExpMoney) == 0x000298, "Member 'UW_ExpMoneyIcon_C::SzB_ExpMoney' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, SzB_Icon) == 0x0002A0, "Member 'UW_ExpMoneyIcon_C::SzB_Icon' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, Txt_Money) == 0x0002A8, "Member 'UW_ExpMoneyIcon_C::Txt_Money' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, Txt_Value) == 0x0002B0, "Member 'UW_ExpMoneyIcon_C::Txt_Value' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, VB_ExpMoney) == 0x0002B8, "Member 'UW_ExpMoneyIcon_C::VB_ExpMoney' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, TileWidthHeight) == 0x0002C0, "Member 'UW_ExpMoneyIcon_C::TileWidthHeight' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, TileLeftRightPadding) == 0x0002D0, "Member 'UW_ExpMoneyIcon_C::TileLeftRightPadding' has a wrong offset!");
static_assert(offsetof(UW_ExpMoneyIcon_C, IconSize) == 0x0002E0, "Member 'UW_ExpMoneyIcon_C::IconSize' has a wrong offset!");

}

