#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionWage_ModInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FactionWage_ModInfo.W_FactionWage_ModInfo_C
// 0x0018 (0x02D0 - 0x02B8)
class UW_FactionWage_ModInfo_C final : public UP2FactionWageModInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsModRate;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WageBaseValue;                                     // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WageModValue;                                      // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_FactionWage_ModInfo(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FactionWage_ModInfo_C">();
	}
	static class UW_FactionWage_ModInfo_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FactionWage_ModInfo_C>();
	}
};
static_assert(alignof(UW_FactionWage_ModInfo_C) == 0x000008, "Wrong alignment on UW_FactionWage_ModInfo_C");
static_assert(sizeof(UW_FactionWage_ModInfo_C) == 0x0002D0, "Wrong size on UW_FactionWage_ModInfo_C");
static_assert(offsetof(UW_FactionWage_ModInfo_C, UberGraphFrame) == 0x0002B8, "Member 'UW_FactionWage_ModInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_ModInfo_C, IsModRate) == 0x0002C0, "Member 'UW_FactionWage_ModInfo_C::IsModRate' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_ModInfo_C, WageBaseValue) == 0x0002C4, "Member 'UW_FactionWage_ModInfo_C::WageBaseValue' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_ModInfo_C, WageModValue) == 0x0002C8, "Member 'UW_FactionWage_ModInfo_C::WageModValue' has a wrong offset!");

}

