#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityInstall_Detail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityInstall_Detail.W_FacilityInstall_Detail_C
// 0x00D8 (0x0460 - 0x0388)
class UW_FacilityInstall_Detail_C final : public UP2FacilityInstallDetail
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Bg;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockIcon;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Bracket_L;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Bracket_R;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget_1;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget_2;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget_3;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget_4;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InProgress;                                        // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x6];                                      // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FacilityName;                                      // 0x03E0(0x0018)(Edit, BlueprintVisible)
	class FText                                   FacilityType;                                      // 0x03F8(0x0018)(Edit, BlueprintVisible)
	class FText                                   FacilityDesc;                                      // 0x0410(0x0018)(Edit, BlueprintVisible)
	class FText                                   PlayerName;                                        // 0x0428(0x0018)(Edit, BlueprintVisible)
	int32                                         DeliveryTimeInSecs;                                // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeliveryRemainingTimeInSecs;                       // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DeliveryCost;                                      // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ProgressMaxPadding;                                // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FacilityIcon;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          NotEnoughMoney;                                    // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NotEnoughLevel;                                    // 0x0459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_FacilityInstall_Detail(int32 EntryPoint)	 // 0xae1e64;
	void GetHrMinSec(double InSec, double* Hr, double* Min, double* Sec)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityInstall_Detail_C">();
	}
	static class UW_FacilityInstall_Detail_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityInstall_Detail_C>();
	}
};
static_assert(alignof(UW_FacilityInstall_Detail_C) == 0x000008, "Wrong alignment on UW_FacilityInstall_Detail_C");
static_assert(sizeof(UW_FacilityInstall_Detail_C) == 0x000460, "Wrong size on UW_FacilityInstall_Detail_C");
static_assert(offsetof(UW_FacilityInstall_Detail_C, UberGraphFrame) == 0x000388, "Member 'UW_FacilityInstall_Detail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, Img_Bg) == 0x000390, "Member 'UW_FacilityInstall_Detail_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, Img_LockIcon) == 0x000398, "Member 'UW_FacilityInstall_Detail_C::Img_LockIcon' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, Txt_Bracket_L) == 0x0003A0, "Member 'UW_FacilityInstall_Detail_C::Txt_Bracket_L' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, Txt_Bracket_R) == 0x0003A8, "Member 'UW_FacilityInstall_Detail_C::Txt_Bracket_R' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, W_CommonItemWidget) == 0x0003B0, "Member 'UW_FacilityInstall_Detail_C::W_CommonItemWidget' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, W_CommonItemWidget_1) == 0x0003B8, "Member 'UW_FacilityInstall_Detail_C::W_CommonItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, W_CommonItemWidget_2) == 0x0003C0, "Member 'UW_FacilityInstall_Detail_C::W_CommonItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, W_CommonItemWidget_3) == 0x0003C8, "Member 'UW_FacilityInstall_Detail_C::W_CommonItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, W_CommonItemWidget_4) == 0x0003D0, "Member 'UW_FacilityInstall_Detail_C::W_CommonItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, IsSelected) == 0x0003D8, "Member 'UW_FacilityInstall_Detail_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, InProgress) == 0x0003D9, "Member 'UW_FacilityInstall_Detail_C::InProgress' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, FacilityName) == 0x0003E0, "Member 'UW_FacilityInstall_Detail_C::FacilityName' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, FacilityType) == 0x0003F8, "Member 'UW_FacilityInstall_Detail_C::FacilityType' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, FacilityDesc) == 0x000410, "Member 'UW_FacilityInstall_Detail_C::FacilityDesc' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, PlayerName) == 0x000428, "Member 'UW_FacilityInstall_Detail_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, DeliveryTimeInSecs) == 0x000440, "Member 'UW_FacilityInstall_Detail_C::DeliveryTimeInSecs' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, DeliveryRemainingTimeInSecs) == 0x000444, "Member 'UW_FacilityInstall_Detail_C::DeliveryRemainingTimeInSecs' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, DeliveryCost) == 0x000448, "Member 'UW_FacilityInstall_Detail_C::DeliveryCost' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, ProgressMaxPadding) == 0x00044C, "Member 'UW_FacilityInstall_Detail_C::ProgressMaxPadding' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, FacilityIcon) == 0x000450, "Member 'UW_FacilityInstall_Detail_C::FacilityIcon' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, NotEnoughMoney) == 0x000458, "Member 'UW_FacilityInstall_Detail_C::NotEnoughMoney' has a wrong offset!");
static_assert(offsetof(UW_FacilityInstall_Detail_C, NotEnoughLevel) == 0x000459, "Member 'UW_FacilityInstall_Detail_C::NotEnoughLevel' has a wrong offset!");

}

