#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_FactionItem.W_FactionItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_FactionItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItem_C_PreConstruct) == 0x000001, "Wrong alignment on W_FactionItem_C_PreConstruct");
static_assert(sizeof(W_FactionItem_C_PreConstruct) == 0x000001, "Wrong size on W_FactionItem_C_PreConstruct");
static_assert(offsetof(W_FactionItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_FactionItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_FactionItem.W_FactionItem_C.Init
// 0x0830 (0x0830 - 0x0000)
struct W_FactionItem_C_Init final
{
public:
	struct FButtonStyle                           HardcoreStyle;                                     // 0x0000(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           DefaultStyle;                                      // 0x03F0(0x03F0)(Edit, BlueprintVisible)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x07E0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x07F4(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0808(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x081C(0x0014)()
};
static_assert(alignof(W_FactionItem_C_Init) == 0x000010, "Wrong alignment on W_FactionItem_C_Init");
static_assert(sizeof(W_FactionItem_C_Init) == 0x000830, "Wrong size on W_FactionItem_C_Init");
static_assert(offsetof(W_FactionItem_C_Init, HardcoreStyle) == 0x000000, "Member 'W_FactionItem_C_Init::HardcoreStyle' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_Init, DefaultStyle) == 0x0003F0, "Member 'W_FactionItem_C_Init::DefaultStyle' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_Init, K2Node_MakeStruct_SlateColor) == 0x0007E0, "Member 'W_FactionItem_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x0007F4, "Member 'W_FactionItem_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_Init, K2Node_MakeStruct_SlateColor_2) == 0x000808, "Member 'W_FactionItem_C_Init::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_Init, K2Node_MakeStruct_SlateColor_3) == 0x00081C, "Member 'W_FactionItem_C_Init::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function W_FactionItem.W_FactionItem_C.ExecuteUbergraph_W_FactionItem
// 0x0008 (0x0008 - 0x0000)
struct W_FactionItem_C_ExecuteUbergraph_W_FactionItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsChangeItem;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItem_C_ExecuteUbergraph_W_FactionItem) == 0x000004, "Wrong alignment on W_FactionItem_C_ExecuteUbergraph_W_FactionItem");
static_assert(sizeof(W_FactionItem_C_ExecuteUbergraph_W_FactionItem) == 0x000008, "Wrong size on W_FactionItem_C_ExecuteUbergraph_W_FactionItem");
static_assert(offsetof(W_FactionItem_C_ExecuteUbergraph_W_FactionItem, EntryPoint) == 0x000000, "Member 'W_FactionItem_C_ExecuteUbergraph_W_FactionItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_ExecuteUbergraph_W_FactionItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_FactionItem_C_ExecuteUbergraph_W_FactionItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_FactionItem_C_ExecuteUbergraph_W_FactionItem, K2Node_Event_bIsChangeItem) == 0x000005, "Member 'W_FactionItem_C_ExecuteUbergraph_W_FactionItem::K2Node_Event_bIsChangeItem' has a wrong offset!");

// Function W_FactionItem.W_FactionItem_C.OnRefreshWidgetBP
// 0x0001 (0x0001 - 0x0000)
struct W_FactionItem_C_OnRefreshWidgetBP final
{
public:
	bool                                          bIsChangeItem;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItem_C_OnRefreshWidgetBP) == 0x000001, "Wrong alignment on W_FactionItem_C_OnRefreshWidgetBP");
static_assert(sizeof(W_FactionItem_C_OnRefreshWidgetBP) == 0x000001, "Wrong size on W_FactionItem_C_OnRefreshWidgetBP");
static_assert(offsetof(W_FactionItem_C_OnRefreshWidgetBP, bIsChangeItem) == 0x000000, "Member 'W_FactionItem_C_OnRefreshWidgetBP::bIsChangeItem' has a wrong offset!");

}

