#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_FacilityUpgrade.W_FacilityUpgrade_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_FacilityUpgrade_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_C_Tick) == 0x000004, "Wrong alignment on W_FacilityUpgrade_C_Tick");
static_assert(sizeof(W_FacilityUpgrade_C_Tick) == 0x00003C, "Wrong size on W_FacilityUpgrade_C_Tick");
static_assert(offsetof(W_FacilityUpgrade_C_Tick, MyGeometry) == 0x000000, "Member 'W_FacilityUpgrade_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_Tick, InDeltaTime) == 0x000038, "Member 'W_FacilityUpgrade_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_FacilityUpgrade.W_FacilityUpgrade_C.OnClicked_Apply
// 0x0001 (0x0001 - 0x0000)
struct W_FacilityUpgrade_C_OnClicked_Apply final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_C_OnClicked_Apply) == 0x000001, "Wrong alignment on W_FacilityUpgrade_C_OnClicked_Apply");
static_assert(sizeof(W_FacilityUpgrade_C_OnClicked_Apply) == 0x000001, "Wrong size on W_FacilityUpgrade_C_OnClicked_Apply");
static_assert(offsetof(W_FacilityUpgrade_C_OnClicked_Apply, ButtonID) == 0x000000, "Member 'W_FacilityUpgrade_C_OnClicked_Apply::ButtonID' has a wrong offset!");

// Function W_FacilityUpgrade.W_FacilityUpgrade_C.ExecuteUbergraph_W_FacilityUpgrade
// 0x0054 (0x0054 - 0x0000)
struct W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade) == 0x000004, "Wrong alignment on W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade");
static_assert(sizeof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade) == 0x000054, "Wrong size on W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, EntryPoint) == 0x000000, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, K2Node_Event_MyGeometry) == 0x000014, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, K2Node_CustomEvent_ButtonID) == 0x000050, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'W_FacilityUpgrade_C_ExecuteUbergraph_W_FacilityUpgrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

