#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionWage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FactionWage.W_FactionWage_C
// 0x0060 (0x0660 - 0x0600)
class UW_FactionWage_C final : public UP2FactionWageMainWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ProgressBarOutline;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            CommonBtn_Collect;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Back;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_WageUnit;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TimeInSec;                                         // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WagePerMin;                                        // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxWage;                                           // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxTimeInSec;                                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WageRecieveInSec;                                  // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_FactionWage(int32 EntryPoint)	 // 0xae1e64;
	void OnChangedPaymentState_ImplementableEvent(bool InIsPaymentState)	 // 0xae1e64;
	void OnClickCollect()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FactionWage_C">();
	}
	static class UW_FactionWage_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FactionWage_C>();
	}
};
static_assert(alignof(UW_FactionWage_C) == 0x000008, "Wrong alignment on UW_FactionWage_C");
static_assert(sizeof(UW_FactionWage_C) == 0x000660, "Wrong size on UW_FactionWage_C");
static_assert(offsetof(UW_FactionWage_C, UberGraphFrame) == 0x000600, "Member 'UW_FactionWage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, Bdr_ProgressBarOutline) == 0x000608, "Member 'UW_FactionWage_C::Bdr_ProgressBarOutline' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, CommonBtn_Collect) == 0x000610, "Member 'UW_FactionWage_C::CommonBtn_Collect' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, Img_Title_Line) == 0x000618, "Member 'UW_FactionWage_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, Keyguide_Back) == 0x000620, "Member 'UW_FactionWage_C::Keyguide_Back' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, Txt_FacilityTitle) == 0x000628, "Member 'UW_FactionWage_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, Txt_WageUnit) == 0x000630, "Member 'UW_FactionWage_C::Txt_WageUnit' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, TimeInSec) == 0x000638, "Member 'UW_FactionWage_C::TimeInSec' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, WagePerMin) == 0x000640, "Member 'UW_FactionWage_C::WagePerMin' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, MaxWage) == 0x000648, "Member 'UW_FactionWage_C::MaxWage' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, MaxTimeInSec) == 0x000650, "Member 'UW_FactionWage_C::MaxTimeInSec' has a wrong offset!");
static_assert(offsetof(UW_FactionWage_C, WageRecieveInSec) == 0x000658, "Member 'UW_FactionWage_C::WageRecieveInSec' has a wrong offset!");

}

