#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityUpgrade_Item.W_FacilityUpgrade_Item_C
// 0x0C40 (0x0F30 - 0x02F0)
class UW_FacilityUpgrade_Item_C final : public UP2FacilityUpgradeListItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DeselectAnim;                                      // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectAnim;                                        // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_ItemInfo;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ItemOutline;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Select;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SelectBg;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ItemSelected;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Normal;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             ItemIcon;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x0340(0x0018)(Edit, BlueprintVisible)
	bool                                          IsEmpty;                                           // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefault;                                         // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x035A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x035B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TradeAccess;                                       // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CraftAccess;                                       // 0x035D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           NormalBtnStyle;                                    // 0x0360(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           SelectedBtnStyle;                                  // 0x0750(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DisabledBtnStyle;                                  // 0x0B40(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Select_ImplementableEvent(bool InIsSelected)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_FacilityUpgrade_Item(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BndEvt__W_Modding_ModItem_Btn_Item_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Modding_ModItem_Btn_Item_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Modding_ModItem_Btn_Item_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityUpgrade_Item_C">();
	}
	static class UW_FacilityUpgrade_Item_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityUpgrade_Item_C>();
	}
};
static_assert(alignof(UW_FacilityUpgrade_Item_C) == 0x000010, "Wrong alignment on UW_FacilityUpgrade_Item_C");
static_assert(sizeof(UW_FacilityUpgrade_Item_C) == 0x000F30, "Wrong size on UW_FacilityUpgrade_Item_C");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, UberGraphFrame) == 0x0002F0, "Member 'UW_FacilityUpgrade_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, DeselectAnim) == 0x0002F8, "Member 'UW_FacilityUpgrade_Item_C::DeselectAnim' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, SelectAnim) == 0x000300, "Member 'UW_FacilityUpgrade_Item_C::SelectAnim' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Bdr_ItemInfo) == 0x000308, "Member 'UW_FacilityUpgrade_Item_C::Bdr_ItemInfo' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Bdr_ItemOutline) == 0x000310, "Member 'UW_FacilityUpgrade_Item_C::Bdr_ItemOutline' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Bdr_Select) == 0x000318, "Member 'UW_FacilityUpgrade_Item_C::Bdr_Select' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Bdr_SelectBg) == 0x000320, "Member 'UW_FacilityUpgrade_Item_C::Bdr_SelectBg' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Img_ItemSelected) == 0x000328, "Member 'UW_FacilityUpgrade_Item_C::Img_ItemSelected' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, Img_Normal) == 0x000330, "Member 'UW_FacilityUpgrade_Item_C::Img_Normal' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, ItemIcon) == 0x000338, "Member 'UW_FacilityUpgrade_Item_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, ItemName) == 0x000340, "Member 'UW_FacilityUpgrade_Item_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, IsEmpty) == 0x000358, "Member 'UW_FacilityUpgrade_Item_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, IsDefault) == 0x000359, "Member 'UW_FacilityUpgrade_Item_C::IsDefault' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, IsSelected) == 0x00035A, "Member 'UW_FacilityUpgrade_Item_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, IsDisabled) == 0x00035B, "Member 'UW_FacilityUpgrade_Item_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, TradeAccess) == 0x00035C, "Member 'UW_FacilityUpgrade_Item_C::TradeAccess' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, CraftAccess) == 0x00035D, "Member 'UW_FacilityUpgrade_Item_C::CraftAccess' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, NormalBtnStyle) == 0x000360, "Member 'UW_FacilityUpgrade_Item_C::NormalBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, SelectedBtnStyle) == 0x000750, "Member 'UW_FacilityUpgrade_Item_C::SelectedBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Item_C, DisabledBtnStyle) == 0x000B40, "Member 'UW_FacilityUpgrade_Item_C::DisabledBtnStyle' has a wrong offset!");

}

