#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade_Slot

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_FacilityUpgrade_Slot.W_FacilityUpgrade_Slot_C.Select_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_FacilityUpgrade_Slot_C_Select_ImplementableEvent final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_Slot_C_Select_ImplementableEvent) == 0x000001, "Wrong alignment on W_FacilityUpgrade_Slot_C_Select_ImplementableEvent");
static_assert(sizeof(W_FacilityUpgrade_Slot_C_Select_ImplementableEvent) == 0x000001, "Wrong size on W_FacilityUpgrade_Slot_C_Select_ImplementableEvent");
static_assert(offsetof(W_FacilityUpgrade_Slot_C_Select_ImplementableEvent, InIsSelected) == 0x000000, "Member 'W_FacilityUpgrade_Slot_C_Select_ImplementableEvent::InIsSelected' has a wrong offset!");

// Function W_FacilityUpgrade_Slot.W_FacilityUpgrade_Slot_C.ExecuteUbergraph_W_FacilityUpgrade_Slot
// 0x0008 (0x0008 - 0x0000)
struct W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelected;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot) == 0x000004, "Wrong alignment on W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot");
static_assert(sizeof(W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot) == 0x000008, "Wrong size on W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot");
static_assert(offsetof(W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot, EntryPoint) == 0x000000, "Member 'W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot, K2Node_Event_InIsSelected) == 0x000004, "Member 'W_FacilityUpgrade_Slot_C_ExecuteUbergraph_W_FacilityUpgrade_Slot::K2Node_Event_InIsSelected' has a wrong offset!");

}

