#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FactionSelection.W_FactionSelection_C
// 0x0070 (0x0698 - 0x0628)
class UW_FactionSelection_C final : public UP2FactionSelectionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CardsFadeIn;                                       // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonFadeIn;                                      // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Subtitles;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2FactionOptionWidget*                 CurrentSelectedFaction;                            // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 AllowedCharacters;                                 // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   ValidationErrorText;                               // 0x0660(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Subtitles;                                         // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnFactionPressedDelegate;                          // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateConfirmState()	 // 0xae1e64;
	void SelectFaction(class UP2FactionOptionWidget* NewFaction)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void PlayFadeInAnim()	 // 0xae1e64;
	void OnFactionPressed_XCAL()	 // 0xae1e64;
	void OnFactionPressed_None()	 // 0xae1e64;
	void OnFactionPressed_Gnosys()	 // 0xae1e64;
	void OnFactionPressed_Baekho()	 // 0xae1e64;
	void GetSelectedFactionIndex(int32* selectedIndex)	 // 0xae1e64;
	void ExecuteUbergraph_W_FactionSelection(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FactionSelection_C">();
	}
	static class UW_FactionSelection_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FactionSelection_C>();
	}
};
static_assert(alignof(UW_FactionSelection_C) == 0x000008, "Wrong alignment on UW_FactionSelection_C");
static_assert(sizeof(UW_FactionSelection_C) == 0x000698, "Wrong size on UW_FactionSelection_C");
static_assert(offsetof(UW_FactionSelection_C, UberGraphFrame) == 0x000628, "Member 'UW_FactionSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, CardsFadeIn) == 0x000630, "Member 'UW_FactionSelection_C::CardsFadeIn' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, ButtonFadeIn) == 0x000638, "Member 'UW_FactionSelection_C::ButtonFadeIn' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, Txt_Subtitles) == 0x000640, "Member 'UW_FactionSelection_C::Txt_Subtitles' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, CurrentSelectedFaction) == 0x000648, "Member 'UW_FactionSelection_C::CurrentSelectedFaction' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, AllowedCharacters) == 0x000650, "Member 'UW_FactionSelection_C::AllowedCharacters' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, ValidationErrorText) == 0x000660, "Member 'UW_FactionSelection_C::ValidationErrorText' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, Subtitles) == 0x000678, "Member 'UW_FactionSelection_C::Subtitles' has a wrong offset!");
static_assert(offsetof(UW_FactionSelection_C, OnFactionPressedDelegate) == 0x000688, "Member 'UW_FactionSelection_C::OnFactionPressedDelegate' has a wrong offset!");

}

