#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionItemGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_FactionItemGroup.W_FactionItemGroup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_FactionItemGroup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItemGroup_C_PreConstruct) == 0x000001, "Wrong alignment on W_FactionItemGroup_C_PreConstruct");
static_assert(sizeof(W_FactionItemGroup_C_PreConstruct) == 0x000001, "Wrong size on W_FactionItemGroup_C_PreConstruct");
static_assert(offsetof(W_FactionItemGroup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_FactionItemGroup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_FactionItemGroup.W_FactionItemGroup_C.Init
// 0x0028 (0x0028 - 0x0000)
struct W_FactionItemGroup_C_Init final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0014(0x0014)()
};
static_assert(alignof(W_FactionItemGroup_C_Init) == 0x000004, "Wrong alignment on W_FactionItemGroup_C_Init");
static_assert(sizeof(W_FactionItemGroup_C_Init) == 0x000028, "Wrong size on W_FactionItemGroup_C_Init");
static_assert(offsetof(W_FactionItemGroup_C_Init, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'W_FactionItemGroup_C_Init::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_Init, K2Node_MakeStruct_SlateColor_1) == 0x000014, "Member 'W_FactionItemGroup_C_Init::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_FactionItemGroup.W_FactionItemGroup_C.GetItemListNum
// 0x0008 (0x0008 - 0x0000)
struct W_FactionItemGroup_C_GetItemListNum final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItemGroup_C_GetItemListNum) == 0x000004, "Wrong alignment on W_FactionItemGroup_C_GetItemListNum");
static_assert(sizeof(W_FactionItemGroup_C_GetItemListNum) == 0x000008, "Wrong size on W_FactionItemGroup_C_GetItemListNum");
static_assert(offsetof(W_FactionItemGroup_C_GetItemListNum, NewParam) == 0x000000, "Member 'W_FactionItemGroup_C_GetItemListNum::NewParam' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_GetItemListNum, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'W_FactionItemGroup_C_GetItemListNum::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

// Function W_FactionItemGroup.W_FactionItemGroup_C.ExecuteUbergraph_W_FactionItemGroup
// 0x01A8 (0x01A8 - 0x0000)
struct W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class UW_FactionItem_C*                       K2Node_DynamicCast_AsW_Faction_Item;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0188(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup) == 0x000008, "Wrong alignment on W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup");
static_assert(sizeof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup) == 0x0001A8, "Wrong size on W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, EntryPoint) == 0x000000, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_Event_IsDesignTime) == 0x000008, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_GetChildrenCount_ReturnValue) == 0x000060, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000068, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_GetAllChildren_ReturnValue) == 0x0000C0, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_MakeArray_Array) == 0x0000D0, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_DynamicCast_AsW_Faction_Item) == 0x000100, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_DynamicCast_AsW_Faction_Item' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Array_Length_ReturnValue_1) == 0x000110, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000118, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, K2Node_MakeArray_Array_1) == 0x000178, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Format_ReturnValue_1) == 0x000188, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup, CallFunc_Add_IntInt_ReturnValue) == 0x0001A0, "Member 'W_FactionItemGroup_C_ExecuteUbergraph_W_FactionItemGroup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

