#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Faction_RepGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Faction_RepGauge.W_Faction_RepGauge_C
// 0x0080 (0x0358 - 0x02D8)
class W_Faction_RepGauge::UW_Faction_RepGauge_C final : public UP2FactionReputationGaugeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_MaxLevel;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_LevelGaugeBack;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_LevelGaugeFront;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_LevelGaugeLine;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Faction;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_FactionLogo;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RepGauge;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             FactionIcon;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         FactionLevel;                                      // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GaugeWidth;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GaugeMargin;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExpectedVisualReputation;                          // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        IconHeight;                                        // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IconBottomtPadding;                                // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Faction_RepGauge(int32 EntryPoint)	 // 0xae1e64;
	void OnRefreshFactionLv_ImplementableEvent(bool IsMaxLevel)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetExpDecrease()	 // 0xae1e64;
	void SetExpIncrease()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass W_Faction_RepGauge.W_Faction_RepGauge_C", true, "W_Faction_RepGauge_C">();
	}
	static class W_Faction_RepGauge::UW_Faction_RepGauge_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<W_Faction_RepGauge::UW_Faction_RepGauge_C>();
	}
};
static_assert(alignof(W_Faction_RepGauge::UW_Faction_RepGauge_C) == 0x000008, "Wrong alignment on W_Faction_RepGauge::UW_Faction_RepGauge_C");
static_assert(sizeof(W_Faction_RepGauge::UW_Faction_RepGauge_C) == 0x000358, "Wrong size on W_Faction_RepGauge::UW_Faction_RepGauge_C");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, UberGraphFrame) == 0x0002D8, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, Bdr_MaxLevel) == 0x0002E0, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::Bdr_MaxLevel' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, Img_Icon) == 0x0002E8, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, PB_LevelGaugeBack) == 0x0002F0, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::PB_LevelGaugeBack' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, PB_LevelGaugeFront) == 0x0002F8, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::PB_LevelGaugeFront' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, PB_LevelGaugeLine) == 0x000300, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::PB_LevelGaugeLine' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, SzB_Faction) == 0x000308, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::SzB_Faction' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, SzB_FactionLogo) == 0x000310, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::SzB_FactionLogo' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, SzB_RepGauge) == 0x000318, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::SzB_RepGauge' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, FactionIcon) == 0x000320, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::FactionIcon' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, FactionLevel) == 0x000328, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::FactionLevel' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, GaugeWidth) == 0x000330, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::GaugeWidth' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, GaugeMargin) == 0x000338, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::GaugeMargin' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, ExpectedVisualReputation) == 0x000340, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::ExpectedVisualReputation' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, IconHeight) == 0x000348, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::IconHeight' has a wrong offset!");
static_assert(offsetof(W_Faction_RepGauge::UW_Faction_RepGauge_C, IconBottomtPadding) == 0x000350, "Member 'W_Faction_RepGauge::UW_Faction_RepGauge_C::IconBottomtPadding' has a wrong offset!");

}

