#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_FacilityUpgrade_Item.W_FacilityUpgrade_Item_C.Select_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_FacilityUpgrade_Item_C_Select_ImplementableEvent final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_Item_C_Select_ImplementableEvent) == 0x000001, "Wrong alignment on W_FacilityUpgrade_Item_C_Select_ImplementableEvent");
static_assert(sizeof(W_FacilityUpgrade_Item_C_Select_ImplementableEvent) == 0x000001, "Wrong size on W_FacilityUpgrade_Item_C_Select_ImplementableEvent");
static_assert(offsetof(W_FacilityUpgrade_Item_C_Select_ImplementableEvent, InIsSelected) == 0x000000, "Member 'W_FacilityUpgrade_Item_C_Select_ImplementableEvent::InIsSelected' has a wrong offset!");

// Function W_FacilityUpgrade_Item.W_FacilityUpgrade_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_FacilityUpgrade_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_Item_C_PreConstruct) == 0x000001, "Wrong alignment on W_FacilityUpgrade_Item_C_PreConstruct");
static_assert(sizeof(W_FacilityUpgrade_Item_C_PreConstruct) == 0x000001, "Wrong size on W_FacilityUpgrade_Item_C_PreConstruct");
static_assert(offsetof(W_FacilityUpgrade_Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_FacilityUpgrade_Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_FacilityUpgrade_Item.W_FacilityUpgrade_Item_C.ExecuteUbergraph_W_FacilityUpgrade_Item
// 0x0008 (0x0008 - 0x0000)
struct W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelected;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item) == 0x000004, "Wrong alignment on W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item");
static_assert(sizeof(W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item) == 0x000008, "Wrong size on W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item");
static_assert(offsetof(W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item, EntryPoint) == 0x000000, "Member 'W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item, K2Node_Event_InIsSelected) == 0x000005, "Member 'W_FacilityUpgrade_Item_C_ExecuteUbergraph_W_FacilityUpgrade_Item::K2Node_Event_InIsSelected' has a wrong offset!");

}

