#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionItemGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FactionItemGroup.W_FactionItemGroup_C
// 0x0050 (0x02E8 - 0x0298)
class UW_FactionItemGroup_C final : public UP2FactionItemGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_FactionItemGroupTitle;                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FactionItem_C*                       W_FactionItem;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FactionItem_C*                       W_FactionItem_55;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FactionItem_C*                       W_FactionItem_162;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FactionItem_C*                       W_FactionItem_238;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsNoFaction;                                       // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FactionItemGroupTitle;                             // 0x02D0(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnCreateItemListBP()	 // 0xae1e64;
	void Init()	 // 0xae1e64;
	void GetItemListNum(int32* NewParam)	 // 0xae1e64;
	void ExecuteUbergraph_W_FactionItemGroup(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FactionItemGroup_C">();
	}
	static class UW_FactionItemGroup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FactionItemGroup_C>();
	}
};
static_assert(alignof(UW_FactionItemGroup_C) == 0x000008, "Wrong alignment on UW_FactionItemGroup_C");
static_assert(sizeof(UW_FactionItemGroup_C) == 0x0002E8, "Wrong size on UW_FactionItemGroup_C");
static_assert(offsetof(UW_FactionItemGroup_C, UberGraphFrame) == 0x000298, "Member 'UW_FactionItemGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, Txt_FactionItemGroupTitle) == 0x0002A0, "Member 'UW_FactionItemGroup_C::Txt_FactionItemGroupTitle' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, W_FactionItem) == 0x0002A8, "Member 'UW_FactionItemGroup_C::W_FactionItem' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, W_FactionItem_55) == 0x0002B0, "Member 'UW_FactionItemGroup_C::W_FactionItem_55' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, W_FactionItem_162) == 0x0002B8, "Member 'UW_FactionItemGroup_C::W_FactionItem_162' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, W_FactionItem_238) == 0x0002C0, "Member 'UW_FactionItemGroup_C::W_FactionItem_238' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, IsNoFaction) == 0x0002C8, "Member 'UW_FactionItemGroup_C::IsNoFaction' has a wrong offset!");
static_assert(offsetof(UW_FactionItemGroup_C, FactionItemGroupTitle) == 0x0002D0, "Member 'UW_FactionItemGroup_C::FactionItemGroupTitle' has a wrong offset!");

}

