#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Facility_DeliveryTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Facility_DeliveryTimer.W_Facility_DeliveryTimer_C
// 0x0028 (0x02E8 - 0x02C0)
class UW_Facility_DeliveryTimer_C final : public UP2FacilityDeliveryTimerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Color;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Gradient_Radial;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_117;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Txt_Timer;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Facility_DeliveryTimer(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Facility_DeliveryTimer_C">();
	}
	static class UW_Facility_DeliveryTimer_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Facility_DeliveryTimer_C>();
	}
};
static_assert(alignof(UW_Facility_DeliveryTimer_C) == 0x000008, "Wrong alignment on UW_Facility_DeliveryTimer_C");
static_assert(sizeof(UW_Facility_DeliveryTimer_C) == 0x0002E8, "Wrong size on UW_Facility_DeliveryTimer_C");
static_assert(offsetof(UW_Facility_DeliveryTimer_C, UberGraphFrame) == 0x0002C0, "Member 'UW_Facility_DeliveryTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Facility_DeliveryTimer_C, Bdr_Color) == 0x0002C8, "Member 'UW_Facility_DeliveryTimer_C::Bdr_Color' has a wrong offset!");
static_assert(offsetof(UW_Facility_DeliveryTimer_C, Bdr_Gradient_Radial) == 0x0002D0, "Member 'UW_Facility_DeliveryTimer_C::Bdr_Gradient_Radial' has a wrong offset!");
static_assert(offsetof(UW_Facility_DeliveryTimer_C, Image_117) == 0x0002D8, "Member 'UW_Facility_DeliveryTimer_C::Image_117' has a wrong offset!");
static_assert(offsetof(UW_Facility_DeliveryTimer_C, Txt_Timer) == 0x0002E0, "Member 'UW_Facility_DeliveryTimer_C::Txt_Timer' has a wrong offset!");

}

