#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityProgress_3D

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityProgress_3D.W_FacilityProgress_3D_C
// 0x0060 (0x0310 - 0x02B0)
class UW_FacilityProgress_3D_C final : public UP2FacilityProgressWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ProgressAnimOn;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ProgressAnimOff;                                   // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Color;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Gradient_Radial;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_L;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern_L;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern_R;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_R;                                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ProductionProgressQueueSlot_C*       W_ProductionProgressQueueSlot;                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ProductionProgressQueueSlot_C*       W_ProductionProgressQueueSlot_1;                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ProductionProgressQueueSlot_C*       W_ProductionProgressQueueSlot_2;                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_FacilityProgress_3D(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Set_Layout(bool IsProgressing)	 // 0xae1e64;
	void SetPercent_ImplementableEvent(int32 InPercent)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityProgress_3D_C">();
	}
	static class UW_FacilityProgress_3D_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityProgress_3D_C>();
	}
};
static_assert(alignof(UW_FacilityProgress_3D_C) == 0x000008, "Wrong alignment on UW_FacilityProgress_3D_C");
static_assert(sizeof(UW_FacilityProgress_3D_C) == 0x000310, "Wrong size on UW_FacilityProgress_3D_C");
static_assert(offsetof(UW_FacilityProgress_3D_C, UberGraphFrame) == 0x0002B0, "Member 'UW_FacilityProgress_3D_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, ProgressAnimOn) == 0x0002B8, "Member 'UW_FacilityProgress_3D_C::ProgressAnimOn' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, ProgressAnimOff) == 0x0002C0, "Member 'UW_FacilityProgress_3D_C::ProgressAnimOff' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Bdr_Color) == 0x0002C8, "Member 'UW_FacilityProgress_3D_C::Bdr_Color' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Img_Gradient_Radial) == 0x0002D0, "Member 'UW_FacilityProgress_3D_C::Img_Gradient_Radial' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Img_L) == 0x0002D8, "Member 'UW_FacilityProgress_3D_C::Img_L' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Img_Pattern_L) == 0x0002E0, "Member 'UW_FacilityProgress_3D_C::Img_Pattern_L' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Img_Pattern_R) == 0x0002E8, "Member 'UW_FacilityProgress_3D_C::Img_Pattern_R' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, Img_R) == 0x0002F0, "Member 'UW_FacilityProgress_3D_C::Img_R' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, W_ProductionProgressQueueSlot) == 0x0002F8, "Member 'UW_FacilityProgress_3D_C::W_ProductionProgressQueueSlot' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, W_ProductionProgressQueueSlot_1) == 0x000300, "Member 'UW_FacilityProgress_3D_C::W_ProductionProgressQueueSlot_1' has a wrong offset!");
static_assert(offsetof(UW_FacilityProgress_3D_C, W_ProductionProgressQueueSlot_2) == 0x000308, "Member 'UW_FacilityProgress_3D_C::W_ProductionProgressQueueSlot_2' has a wrong offset!");

}

