#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityUpgrade.W_FacilityUpgrade_C
// 0x0060 (0x0730 - 0x06D0)
class UW_FacilityUpgrade_C final : public UP2FacilityUpgradeMain
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_FacilityIcon;                                  // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotDividerLine;                               // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Title_Line;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityUpgrade;                               // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FacilityUpgrade_Item_C*              W_FacilityUpgrade_Item;                            // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FacilityUpgrade_Slot_C*              W_FacilityUpgrade_Slot;                            // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FacilityUpgrade_Slot_C*              W_FacilityUpgrade_Slot_1;                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMouseDown;                                       // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PopupWidget;                                       // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 PopupName;                                         // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void OnClicked_Apply(EPopupButtonID ButtonID)	 // 0xae1e64;
	void ExecuteUbergraph_W_FacilityUpgrade(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityUpgrade_C">();
	}
	static class UW_FacilityUpgrade_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityUpgrade_C>();
	}
};
static_assert(alignof(UW_FacilityUpgrade_C) == 0x000008, "Wrong alignment on UW_FacilityUpgrade_C");
static_assert(sizeof(UW_FacilityUpgrade_C) == 0x000730, "Wrong size on UW_FacilityUpgrade_C");
static_assert(offsetof(UW_FacilityUpgrade_C, UberGraphFrame) == 0x0006D0, "Member 'UW_FacilityUpgrade_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, Img_FacilityIcon) == 0x0006D8, "Member 'UW_FacilityUpgrade_C::Img_FacilityIcon' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, Img_SlotDividerLine) == 0x0006E0, "Member 'UW_FacilityUpgrade_C::Img_SlotDividerLine' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, Img_Title_Line) == 0x0006E8, "Member 'UW_FacilityUpgrade_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, Txt_FacilityUpgrade) == 0x0006F0, "Member 'UW_FacilityUpgrade_C::Txt_FacilityUpgrade' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, W_FacilityUpgrade_Item) == 0x0006F8, "Member 'UW_FacilityUpgrade_C::W_FacilityUpgrade_Item' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, W_FacilityUpgrade_Slot) == 0x000700, "Member 'UW_FacilityUpgrade_C::W_FacilityUpgrade_Slot' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, W_FacilityUpgrade_Slot_1) == 0x000708, "Member 'UW_FacilityUpgrade_C::W_FacilityUpgrade_Slot_1' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, IsMouseDown) == 0x000710, "Member 'UW_FacilityUpgrade_C::IsMouseDown' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, PopupWidget) == 0x000718, "Member 'UW_FacilityUpgrade_C::PopupWidget' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_C, PopupName) == 0x000720, "Member 'UW_FacilityUpgrade_C::PopupName' has a wrong offset!");

}

