#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityUpgrade_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityUpgrade_Slot.W_FacilityUpgrade_Slot_C
// 0x0038 (0x0398 - 0x0360)
class UW_FacilityUpgrade_Slot_C final : public UP2FacilityUpgradeSlotListItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Outline;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SlotInfo;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Btn_Slot;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Slot;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSmallVersion;                                    // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRecentlyChanged;                                 // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefault;                                         // 0x0393(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Select_ImplementableEvent(bool InIsSelected)	 // 0xae1e64;
	void ExecuteUbergraph_W_FacilityUpgrade_Slot(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BndEvt__W_FacilityUpgrade_Slot_Btn_Slot_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_FacilityUpgrade_Slot_Btn_Slot_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_FacilityUpgrade_Slot_Btn_Slot_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityUpgrade_Slot_C">();
	}
	static class UW_FacilityUpgrade_Slot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityUpgrade_Slot_C>();
	}
};
static_assert(alignof(UW_FacilityUpgrade_Slot_C) == 0x000008, "Wrong alignment on UW_FacilityUpgrade_Slot_C");
static_assert(sizeof(UW_FacilityUpgrade_Slot_C) == 0x000398, "Wrong size on UW_FacilityUpgrade_Slot_C");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, UberGraphFrame) == 0x000360, "Member 'UW_FacilityUpgrade_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, Bdr_Outline) == 0x000368, "Member 'UW_FacilityUpgrade_Slot_C::Bdr_Outline' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, Bdr_SlotInfo) == 0x000370, "Member 'UW_FacilityUpgrade_Slot_C::Bdr_SlotInfo' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, Btn_Slot) == 0x000378, "Member 'UW_FacilityUpgrade_Slot_C::Btn_Slot' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, Img_Divider) == 0x000380, "Member 'UW_FacilityUpgrade_Slot_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, SzB_Slot) == 0x000388, "Member 'UW_FacilityUpgrade_Slot_C::SzB_Slot' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, IsSelected) == 0x000390, "Member 'UW_FacilityUpgrade_Slot_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, IsSmallVersion) == 0x000391, "Member 'UW_FacilityUpgrade_Slot_C::IsSmallVersion' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, IsRecentlyChanged) == 0x000392, "Member 'UW_FacilityUpgrade_Slot_C::IsRecentlyChanged' has a wrong offset!");
static_assert(offsetof(UW_FacilityUpgrade_Slot_C, IsDefault) == 0x000393, "Member 'UW_FacilityUpgrade_Slot_C::IsDefault' has a wrong offset!");

}

