#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FacilityBuildMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FacilityBuildMode.W_FacilityBuildMode_C
// 0x0028 (0x07A0 - 0x0778)
class UW_FacilityBuildMode_C final : public UP2DirectFacilityBuildMode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ErrorMsgHighlight;                                 // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_WarningIcon;                                   // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeybindWidget_C*                     Keybind_LeftRotation_1;                            // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeybindWidget_C*                     Keybind_RightRotation_1;                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayErrorMsgTextAnimation()	 // 0xae1e64;
	void ExecuteUbergraph_W_FacilityBuildMode(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FacilityBuildMode_C">();
	}
	static class UW_FacilityBuildMode_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FacilityBuildMode_C>();
	}
};
static_assert(alignof(UW_FacilityBuildMode_C) == 0x000008, "Wrong alignment on UW_FacilityBuildMode_C");
static_assert(sizeof(UW_FacilityBuildMode_C) == 0x0007A0, "Wrong size on UW_FacilityBuildMode_C");
static_assert(offsetof(UW_FacilityBuildMode_C, UberGraphFrame) == 0x000778, "Member 'UW_FacilityBuildMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FacilityBuildMode_C, ErrorMsgHighlight) == 0x000780, "Member 'UW_FacilityBuildMode_C::ErrorMsgHighlight' has a wrong offset!");
static_assert(offsetof(UW_FacilityBuildMode_C, Img_WarningIcon) == 0x000788, "Member 'UW_FacilityBuildMode_C::Img_WarningIcon' has a wrong offset!");
static_assert(offsetof(UW_FacilityBuildMode_C, Keybind_LeftRotation_1) == 0x000790, "Member 'UW_FacilityBuildMode_C::Keybind_LeftRotation_1' has a wrong offset!");
static_assert(offsetof(UW_FacilityBuildMode_C, Keybind_RightRotation_1) == 0x000798, "Member 'UW_FacilityBuildMode_C::Keybind_RightRotation_1' has a wrong offset!");

}

