#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionOption

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FactionOption.W_FactionOption_C
// 0x1698 (0x19D0 - 0x0338)
class UW_FactionOption_C final : public UP2FactionOptionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TileUhovered;                                      // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TileHovered;                                       // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleUnfocused;                                    // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleFocused;                                      // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardBacksideFadeOut;                               // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CardBacksideFadeIn;                                // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TileUnfocused;                                     // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TileFocused;                                       // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_FactionOptionBg;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_FactionOptionOutline;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                bdr_PatternUnavailable;                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icn_Locked;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_CardBacksideBG;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_CharacterBackground;                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_deco_dot;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_deco_dot_1;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoCross;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_DecoCross_1;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_div;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_FactionLogo;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_FactionLogo_Shadow;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_FadeGradient;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_HoloLines;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_SelectionFrame;                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_TileBackground;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_BonusItems;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_CharacterBackground;                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_DecoSelected;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTxt_BackgroundDescription;                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_CharBackgroundItem;                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_CharBackgroundTile;                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_NotAvailable;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_PatternUnavailable;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleSelectionFill;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ComingSoon;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FactionDescription;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_BackgroundDescription;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_FactionBonus;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_LockedState;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dropdown_C*                          W_Dropdown;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_Contents;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             FactionLogo;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   FactionName;                                       // 0x0490(0x0018)(Edit, BlueprintVisible)
	class FText                                   FactionDescription;                                // 0x04A8(0x0018)(Edit, BlueprintVisible)
	bool                                          bIsRedacted;                                       // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoFaction;                                       // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0xE];                                      // 0x04C2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           DefaultStyle;                                      // 0x04D0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           SelectedStyle;                                     // 0x08C0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           RedactedStyle;                                     // 0x0CB0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           NoFactionStyle;                                    // 0x10A0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         FactionBonusDefaultText_Style;                     // 0x1490(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         Pad_14E8[0x8];                                     // 0x14E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           NoFactionSelectedStyle;                            // 0x14F0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StartingRep;                                       // 0x18E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingMoney;                                     // 0x18E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingItemCount;                                 // 0x18E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentWSIndex;                                    // 0x18EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_Button_Name;                                    // 0x18F0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_HideDetails;                                  // 0x1908(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_ShowDetails;                                  // 0x1920(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             BackgroundImage;                                   // 0x1938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   BackgroundName;                                    // 0x1940(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             TileBackground;                                    // 0x1958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TileTitleSelectedFill;                             // 0x1960(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TileTitleUnselectedFill;                           // 0x1974(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RedactedCharacterBackgroundFill;                   // 0x1988(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TextColorRedacted;                                 // 0x199C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BackgroundColorRedacted;                           // 0x19B0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnRefreshItemListOnBP()	 // 0xae1e64;
	void OnClickStartingItems(EPopupButtonID ButtonID)	 // 0xae1e64;
	void ExecuteUbergraph_W_FactionOption(int32 EntryPoint)	 // 0xae1e64;
	void BP_OnSelectionChanged(bool bNewIsSelected)	 // 0xae1e64;
	void BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility)	 // 0xae1e64;
	void BndEvt__W_FactionOption_Btn_FactionOption_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_FactionOption_Btn_FactionOption_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_FactionOption_C">();
	}
	static class UW_FactionOption_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_FactionOption_C>();
	}
};
static_assert(alignof(UW_FactionOption_C) == 0x000010, "Wrong alignment on UW_FactionOption_C");
static_assert(sizeof(UW_FactionOption_C) == 0x0019D0, "Wrong size on UW_FactionOption_C");
static_assert(offsetof(UW_FactionOption_C, UberGraphFrame) == 0x000338, "Member 'UW_FactionOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileUhovered) == 0x000340, "Member 'UW_FactionOption_C::TileUhovered' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileHovered) == 0x000348, "Member 'UW_FactionOption_C::TileHovered' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TitleUnfocused) == 0x000350, "Member 'UW_FactionOption_C::TitleUnfocused' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TitleFocused) == 0x000358, "Member 'UW_FactionOption_C::TitleFocused' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, CardBacksideFadeOut) == 0x000360, "Member 'UW_FactionOption_C::CardBacksideFadeOut' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, CardBacksideFadeIn) == 0x000368, "Member 'UW_FactionOption_C::CardBacksideFadeIn' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileUnfocused) == 0x000370, "Member 'UW_FactionOption_C::TileUnfocused' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileFocused) == 0x000378, "Member 'UW_FactionOption_C::TileFocused' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Bdr_FactionOptionBg) == 0x000380, "Member 'UW_FactionOption_C::Bdr_FactionOptionBg' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Bdr_FactionOptionOutline) == 0x000388, "Member 'UW_FactionOption_C::Bdr_FactionOptionOutline' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, bdr_PatternUnavailable) == 0x000390, "Member 'UW_FactionOption_C::bdr_PatternUnavailable' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, icn_Locked) == 0x000398, "Member 'UW_FactionOption_C::icn_Locked' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_CardBacksideBG) == 0x0003A0, "Member 'UW_FactionOption_C::img_CardBacksideBG' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_CharacterBackground) == 0x0003A8, "Member 'UW_FactionOption_C::img_CharacterBackground' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_deco_dot) == 0x0003B0, "Member 'UW_FactionOption_C::img_deco_dot' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_deco_dot_1) == 0x0003B8, "Member 'UW_FactionOption_C::img_deco_dot_1' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_DecoCross) == 0x0003C0, "Member 'UW_FactionOption_C::img_DecoCross' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_DecoCross_1) == 0x0003C8, "Member 'UW_FactionOption_C::img_DecoCross_1' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Img_div) == 0x0003D0, "Member 'UW_FactionOption_C::Img_div' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Img_FactionLogo) == 0x0003D8, "Member 'UW_FactionOption_C::Img_FactionLogo' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Img_FactionLogo_Shadow) == 0x0003E0, "Member 'UW_FactionOption_C::Img_FactionLogo_Shadow' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_FadeGradient) == 0x0003E8, "Member 'UW_FactionOption_C::img_FadeGradient' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_HoloLines) == 0x0003F0, "Member 'UW_FactionOption_C::img_HoloLines' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_SelectionFrame) == 0x0003F8, "Member 'UW_FactionOption_C::img_SelectionFrame' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, img_TileBackground) == 0x000400, "Member 'UW_FactionOption_C::img_TileBackground' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Ovr_BonusItems) == 0x000408, "Member 'UW_FactionOption_C::Ovr_BonusItems' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Ovr_CharacterBackground) == 0x000410, "Member 'UW_FactionOption_C::Ovr_CharacterBackground' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Ovr_DecoSelected) == 0x000418, "Member 'UW_FactionOption_C::Ovr_DecoSelected' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, RTxt_BackgroundDescription) == 0x000420, "Member 'UW_FactionOption_C::RTxt_BackgroundDescription' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, SzB_CharBackgroundItem) == 0x000428, "Member 'UW_FactionOption_C::SzB_CharBackgroundItem' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, SzB_CharBackgroundTile) == 0x000430, "Member 'UW_FactionOption_C::SzB_CharBackgroundTile' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, SzB_NotAvailable) == 0x000438, "Member 'UW_FactionOption_C::SzB_NotAvailable' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, SzB_PatternUnavailable) == 0x000440, "Member 'UW_FactionOption_C::SzB_PatternUnavailable' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TitleSelectionFill) == 0x000448, "Member 'UW_FactionOption_C::TitleSelectionFill' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Txt_ComingSoon) == 0x000450, "Member 'UW_FactionOption_C::Txt_ComingSoon' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Txt_FactionDescription) == 0x000458, "Member 'UW_FactionOption_C::Txt_FactionDescription' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, VB_BackgroundDescription) == 0x000460, "Member 'UW_FactionOption_C::VB_BackgroundDescription' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, VB_FactionBonus) == 0x000468, "Member 'UW_FactionOption_C::VB_FactionBonus' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, VB_LockedState) == 0x000470, "Member 'UW_FactionOption_C::VB_LockedState' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, W_Dropdown) == 0x000478, "Member 'UW_FactionOption_C::W_Dropdown' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, WS_Contents) == 0x000480, "Member 'UW_FactionOption_C::WS_Contents' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, FactionLogo) == 0x000488, "Member 'UW_FactionOption_C::FactionLogo' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, FactionName) == 0x000490, "Member 'UW_FactionOption_C::FactionName' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, FactionDescription) == 0x0004A8, "Member 'UW_FactionOption_C::FactionDescription' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, bIsRedacted) == 0x0004C0, "Member 'UW_FactionOption_C::bIsRedacted' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, IsNoFaction) == 0x0004C1, "Member 'UW_FactionOption_C::IsNoFaction' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, DefaultStyle) == 0x0004D0, "Member 'UW_FactionOption_C::DefaultStyle' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, SelectedStyle) == 0x0008C0, "Member 'UW_FactionOption_C::SelectedStyle' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, RedactedStyle) == 0x000CB0, "Member 'UW_FactionOption_C::RedactedStyle' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, NoFactionStyle) == 0x0010A0, "Member 'UW_FactionOption_C::NoFactionStyle' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, FactionBonusDefaultText_Style) == 0x001490, "Member 'UW_FactionOption_C::FactionBonusDefaultText_Style' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, NoFactionSelectedStyle) == 0x0014F0, "Member 'UW_FactionOption_C::NoFactionSelectedStyle' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, StartingRep) == 0x0018E0, "Member 'UW_FactionOption_C::StartingRep' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, StartingMoney) == 0x0018E4, "Member 'UW_FactionOption_C::StartingMoney' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, StartingItemCount) == 0x0018E8, "Member 'UW_FactionOption_C::StartingItemCount' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, CurrentWSIndex) == 0x0018EC, "Member 'UW_FactionOption_C::CurrentWSIndex' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, In_Button_Name) == 0x0018F0, "Member 'UW_FactionOption_C::In_Button_Name' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Text_HideDetails) == 0x001908, "Member 'UW_FactionOption_C::Text_HideDetails' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, Text_ShowDetails) == 0x001920, "Member 'UW_FactionOption_C::Text_ShowDetails' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, BackgroundImage) == 0x001938, "Member 'UW_FactionOption_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, BackgroundName) == 0x001940, "Member 'UW_FactionOption_C::BackgroundName' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileBackground) == 0x001958, "Member 'UW_FactionOption_C::TileBackground' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileTitleSelectedFill) == 0x001960, "Member 'UW_FactionOption_C::TileTitleSelectedFill' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TileTitleUnselectedFill) == 0x001974, "Member 'UW_FactionOption_C::TileTitleUnselectedFill' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, RedactedCharacterBackgroundFill) == 0x001988, "Member 'UW_FactionOption_C::RedactedCharacterBackgroundFill' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, TextColorRedacted) == 0x00199C, "Member 'UW_FactionOption_C::TextColorRedacted' has a wrong offset!");
static_assert(offsetof(UW_FactionOption_C, BackgroundColorRedacted) == 0x0019B0, "Member 'UW_FactionOption_C::BackgroundColorRedacted' has a wrong offset!");

}

