#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FactionOption

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_FactionOption.W_FactionOption_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_FactionOption_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_Tick) == 0x000004, "Wrong alignment on W_FactionOption_C_Tick");
static_assert(sizeof(W_FactionOption_C_Tick) == 0x00003C, "Wrong size on W_FactionOption_C_Tick");
static_assert(offsetof(W_FactionOption_C_Tick, MyGeometry) == 0x000000, "Member 'W_FactionOption_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_Tick, InDeltaTime) == 0x000038, "Member 'W_FactionOption_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_FactionOption.W_FactionOption_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_FactionOption_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_PreConstruct) == 0x000001, "Wrong alignment on W_FactionOption_C_PreConstruct");
static_assert(sizeof(W_FactionOption_C_PreConstruct) == 0x000001, "Wrong size on W_FactionOption_C_PreConstruct");
static_assert(offsetof(W_FactionOption_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_FactionOption_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_FactionOption.W_FactionOption_C.OnClickStartingItems
// 0x0001 (0x0001 - 0x0000)
struct W_FactionOption_C_OnClickStartingItems final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_OnClickStartingItems) == 0x000001, "Wrong alignment on W_FactionOption_C_OnClickStartingItems");
static_assert(sizeof(W_FactionOption_C_OnClickStartingItems) == 0x000001, "Wrong size on W_FactionOption_C_OnClickStartingItems");
static_assert(offsetof(W_FactionOption_C_OnClickStartingItems, ButtonID) == 0x000000, "Member 'W_FactionOption_C_OnClickStartingItems::ButtonID' has a wrong offset!");

// Function W_FactionOption.W_FactionOption_C.ExecuteUbergraph_W_FactionOption
// 0x02E8 (0x02E8 - 0x0000)
struct W_FactionOption_C_ExecuteUbergraph_W_FactionOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_FactionItemGroup_C*                  K2Node_DynamicCast_AsW_Faction_Item_Group;         // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0164(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2FactionData*                         CallFunc_GetFactionDataAsset_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0188(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_GetFactionInitialReputation_ReturnValue;  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01F0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0224(0x0014)()
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x023C(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0260(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x02D0(0x0014)()
	bool                                          K2Node_Event_bNewIsSelected;                       // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption) == 0x000008, "Wrong alignment on W_FactionOption_C_ExecuteUbergraph_W_FactionOption");
static_assert(sizeof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption) == 0x0002E8, "Wrong size on W_FactionOption_C_ExecuteUbergraph_W_FactionOption");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, EntryPoint) == 0x000000, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000070, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Conv_IntToInt64_ReturnValue_2) == 0x000078, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Conv_IntToInt64_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeArray_Array) == 0x000120, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Format_ReturnValue) == 0x000130, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_CustomEvent_ButtonID) == 0x000148, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00014C, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_SwitchInteger_CmpSuccess) == 0x000150, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_DynamicCast_AsW_Faction_Item_Group) == 0x000158, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_DynamicCast_AsW_Faction_Item_Group' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, Temp_bool_Variable) == 0x000161, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Not_PreBool_ReturnValue) == 0x000162, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_SlateColor) == 0x000164, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_Event_IsDesignTime) == 0x000178, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_GetFactionDataAsset_ReturnValue) == 0x000180, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_GetFactionDataAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_FormatArgumentData_3) == 0x000188, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_GetFactionInitialReputation_ReturnValue) == 0x0001D8, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_GetFactionInitialReputation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Format_ReturnValue_1) == 0x0001F0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000210, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_DynamicCast_AsTexture_2D) == 0x000218, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_SlateColor_1) == 0x000224, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_ComponentBoundEvent_InVisibility) == 0x000238, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_SlateColor_2) == 0x00023C, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue) == 0x000250, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_1) == 0x000258, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_Event_MyGeometry) == 0x000260, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_Event_InDeltaTime) == 0x000298, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002A0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_3) == 0x0002A8, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_4) == 0x0002B0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_5) == 0x0002B8, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_6) == 0x0002C0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, CallFunc_PlayAnimation_ReturnValue_7) == 0x0002C8, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_MakeStruct_SlateColor_3) == 0x0002D0, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_FactionOption_C_ExecuteUbergraph_W_FactionOption, K2Node_Event_bNewIsSelected) == 0x0002E4, "Member 'W_FactionOption_C_ExecuteUbergraph_W_FactionOption::K2Node_Event_bNewIsSelected' has a wrong offset!");

// Function W_FactionOption.W_FactionOption_C.BP_OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct W_FactionOption_C_BP_OnSelectionChanged final
{
public:
	bool                                          bNewIsSelected;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_BP_OnSelectionChanged) == 0x000001, "Wrong alignment on W_FactionOption_C_BP_OnSelectionChanged");
static_assert(sizeof(W_FactionOption_C_BP_OnSelectionChanged) == 0x000001, "Wrong size on W_FactionOption_C_BP_OnSelectionChanged");
static_assert(offsetof(W_FactionOption_C_BP_OnSelectionChanged, bNewIsSelected) == 0x000000, "Member 'W_FactionOption_C_BP_OnSelectionChanged::bNewIsSelected' has a wrong offset!");

// Function W_FactionOption.W_FactionOption_C.BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'W_FactionOption_C_BndEvt__W_FactionOption_W_Dropdown_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

}

