#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GameNewsPagination

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GameNewsPagination.W_GameNewsPagination_C
// 0x0018 (0x02C0 - 0x02A8)
class UW_GameNewsPagination_C final : public UP2GameNewsPaginationWidget
{
public:
	class UW_GameNewsPaginationButton_C*          W_GameNewsPaginationButton;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GameNewsPaginationButton_C*          W_GameNewsPaginationButton_135;                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GameNewsPaginationButton_C*          W_GameNewsPaginationButton_201;                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_GameNewsPagination_C">();
	}
	static class UW_GameNewsPagination_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_GameNewsPagination_C>();
	}
};
static_assert(alignof(UW_GameNewsPagination_C) == 0x000008, "Wrong alignment on UW_GameNewsPagination_C");
static_assert(sizeof(UW_GameNewsPagination_C) == 0x0002C0, "Wrong size on UW_GameNewsPagination_C");
static_assert(offsetof(UW_GameNewsPagination_C, W_GameNewsPaginationButton) == 0x0002A8, "Member 'UW_GameNewsPagination_C::W_GameNewsPaginationButton' has a wrong offset!");
static_assert(offsetof(UW_GameNewsPagination_C, W_GameNewsPaginationButton_135) == 0x0002B0, "Member 'UW_GameNewsPagination_C::W_GameNewsPaginationButton_135' has a wrong offset!");
static_assert(offsetof(UW_GameNewsPagination_C, W_GameNewsPaginationButton_201) == 0x0002B8, "Member 'UW_GameNewsPagination_C::W_GameNewsPaginationButton_201' has a wrong offset!");

}

