#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GearSkinContainer_Picker

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GearSkinContainer_Picker.W_GearSkinContainer_Picker_C
// 0x0040 (0x0318 - 0x02D8)
class UW_GearSkinContainer_Picker_C final : public UP2ItemSkinContainerPicker
{
public:
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_1;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_2;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_3;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_4;                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_5;                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_6;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GearSkinItem_Button_C*               W_GearSkinItem_Button_7;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_GearSkinContainer_Picker_C">();
	}
	static class UW_GearSkinContainer_Picker_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_GearSkinContainer_Picker_C>();
	}
};
static_assert(alignof(UW_GearSkinContainer_Picker_C) == 0x000008, "Wrong alignment on UW_GearSkinContainer_Picker_C");
static_assert(sizeof(UW_GearSkinContainer_Picker_C) == 0x000318, "Wrong size on UW_GearSkinContainer_Picker_C");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button) == 0x0002D8, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_1) == 0x0002E0, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_1' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_2) == 0x0002E8, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_2' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_3) == 0x0002F0, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_3' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_4) == 0x0002F8, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_4' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_5) == 0x000300, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_5' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_6) == 0x000308, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_6' has a wrong offset!");
static_assert(offsetof(UW_GearSkinContainer_Picker_C, W_GearSkinItem_Button_7) == 0x000310, "Member 'UW_GearSkinContainer_Picker_C::W_GearSkinItem_Button_7' has a wrong offset!");

}

