#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HealthHud

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_HealthHud.W_HealthHud_C.UpdateHealthText_ImplementableEvent
// 0x00A4 (0x00A4 - 0x0000)
struct W_HealthHud_C_UpdateHealthText_ImplementableEvent final
{
public:
	EP2HealthHUDStatus                            InHealthStatus;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2HealthHUDStatus                            Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x003C(0x0014)()
	float                                         K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x007C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0090(0x0014)()
};
static_assert(alignof(W_HealthHud_C_UpdateHealthText_ImplementableEvent) == 0x000004, "Wrong alignment on W_HealthHud_C_UpdateHealthText_ImplementableEvent");
static_assert(sizeof(W_HealthHud_C_UpdateHealthText_ImplementableEvent) == 0x0000A4, "Wrong size on W_HealthHud_C_UpdateHealthText_ImplementableEvent");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, InHealthStatus) == 0x000000, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::InHealthStatus' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_byte_Variable) == 0x000001, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable) == 0x000004, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_1) == 0x000008, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_2) == 0x00000C, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_3) == 0x000010, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_4) == 0x000014, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_5) == 0x000018, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_6) == 0x00001C, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_7) == 0x000020, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, Temp_real_Variable_8) == 0x000024, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor_1) == 0x00003C, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_Select_Default) == 0x000050, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor_2) == 0x000054, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor_3) == 0x000068, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor_4) == 0x00007C, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_HealthHud_C_UpdateHealthText_ImplementableEvent, K2Node_MakeStruct_SlateColor_5) == 0x000090, "Member 'W_HealthHud_C_UpdateHealthText_ImplementableEvent::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");

}

