#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HudMain

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_HudMain.W_HudMain_C.AllWidgetShowOrHide
// 0x0018 (0x0018 - 0x0000)
struct W_HudMain_C_AllWidgetShowOrHide final
{
public:
	ESlateVisibility                              InSelection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InShowTimeSec;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayFadeInAnim_InShowTimeSec_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_C_AllWidgetShowOrHide) == 0x000008, "Wrong alignment on W_HudMain_C_AllWidgetShowOrHide");
static_assert(sizeof(W_HudMain_C_AllWidgetShowOrHide) == 0x000018, "Wrong size on W_HudMain_C_AllWidgetShowOrHide");
static_assert(offsetof(W_HudMain_C_AllWidgetShowOrHide, InSelection) == 0x000000, "Member 'W_HudMain_C_AllWidgetShowOrHide::InSelection' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_AllWidgetShowOrHide, InShowTimeSec) == 0x000008, "Member 'W_HudMain_C_AllWidgetShowOrHide::InShowTimeSec' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_AllWidgetShowOrHide, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'W_HudMain_C_AllWidgetShowOrHide::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_AllWidgetShowOrHide, CallFunc_PlayFadeInAnim_InShowTimeSec_ImplicitCast) == 0x000014, "Member 'W_HudMain_C_AllWidgetShowOrHide::CallFunc_PlayFadeInAnim_InShowTimeSec_ImplicitCast' has a wrong offset!");

// Function W_HudMain.W_HudMain_C.ExecuteUbergraph_W_HudMain
// 0x0038 (0x0038 - 0x0000)
struct W_HudMain_C_ExecuteUbergraph_W_HudMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_HudMain_Top_C*                       K2Node_DynamicCast_AsW_Hud_Main_Top;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InShowTimeSec;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InSlateVisibility;                    // 0x0020(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InUseFadeOutTimer;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_C_ExecuteUbergraph_W_HudMain) == 0x000008, "Wrong alignment on W_HudMain_C_ExecuteUbergraph_W_HudMain");
static_assert(sizeof(W_HudMain_C_ExecuteUbergraph_W_HudMain) == 0x000038, "Wrong size on W_HudMain_C_ExecuteUbergraph_W_HudMain");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, EntryPoint) == 0x000000, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, K2Node_DynamicCast_AsW_Hud_Main_Top) == 0x000010, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::K2Node_DynamicCast_AsW_Hud_Main_Top' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, K2Node_Event_InShowTimeSec) == 0x00001C, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::K2Node_Event_InShowTimeSec' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, K2Node_Event_InSlateVisibility) == 0x000020, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::K2Node_Event_InSlateVisibility' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, K2Node_Event_InUseFadeOutTimer) == 0x000021, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::K2Node_Event_InUseFadeOutTimer' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast) == 0x000028, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_ExecuteUbergraph_W_HudMain, CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast_1) == 0x000030, "Member 'W_HudMain_C_ExecuteUbergraph_W_HudMain::CallFunc_AllWidgetShowOrHide_InShowTimeSec_ImplicitCast_1' has a wrong offset!");

// Function W_HudMain.W_HudMain_C.OnAllWidgetShowOrHide
// 0x0008 (0x0008 - 0x0000)
struct W_HudMain_C_OnAllWidgetShowOrHide final
{
public:
	float                                         InShowTimeSec;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InSlateVisibility;                                 // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InUseFadeOutTimer;                                 // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_C_OnAllWidgetShowOrHide) == 0x000004, "Wrong alignment on W_HudMain_C_OnAllWidgetShowOrHide");
static_assert(sizeof(W_HudMain_C_OnAllWidgetShowOrHide) == 0x000008, "Wrong size on W_HudMain_C_OnAllWidgetShowOrHide");
static_assert(offsetof(W_HudMain_C_OnAllWidgetShowOrHide, InShowTimeSec) == 0x000000, "Member 'W_HudMain_C_OnAllWidgetShowOrHide::InShowTimeSec' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_OnAllWidgetShowOrHide, InSlateVisibility) == 0x000004, "Member 'W_HudMain_C_OnAllWidgetShowOrHide::InSlateVisibility' has a wrong offset!");
static_assert(offsetof(W_HudMain_C_OnAllWidgetShowOrHide, InUseFadeOutTimer) == 0x000005, "Member 'W_HudMain_C_OnAllWidgetShowOrHide::InUseFadeOutTimer' has a wrong offset!");

}

