#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HudMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HudMain.W_HudMain_C
// 0x0050 (0x0988 - 0x0938)
class UW_HudMain_C final : public UP2HUDMain_Raid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0938(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeaponHudFadeOutAnim;                              // 0x0940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponHudFadeInAnim;                               // 0x0948(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Landing;                                           // 0x0950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Jumping;                                           // 0x0958(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HitEffect;                                         // 0x0960(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_SmartHealGuide_C*                    W_SmartHealGuide_LowHealth;                        // 0x0968(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SmartHealGuide_C*                    W_SmartHealGuide_Status;                           // 0x0970(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WeaponList_C*                        W_WeaponListHud;                                   // 0x0978(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAbilitySystemComponent*                ACS;                                               // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AllWidgetShowOrHide(ESlateVisibility InSelection, double InShowTimeSec)	 // 0xae1e64;
	void CollapseAllWidget()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_HudMain(int32 EntryPoint)	 // 0xae1e64;
	void OnAllWidgetShowOrHide(float InShowTimeSec, const ESlateVisibility InSlateVisibility, bool InUseFadeOutTimer)	 // 0xae1e64;
	void OnInitialized()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_HudMain_C">();
	}
	static class UW_HudMain_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_HudMain_C>();
	}
};
static_assert(alignof(UW_HudMain_C) == 0x000008, "Wrong alignment on UW_HudMain_C");
static_assert(sizeof(UW_HudMain_C) == 0x000988, "Wrong size on UW_HudMain_C");
static_assert(offsetof(UW_HudMain_C, UberGraphFrame) == 0x000938, "Member 'UW_HudMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, WeaponHudFadeOutAnim) == 0x000940, "Member 'UW_HudMain_C::WeaponHudFadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, WeaponHudFadeInAnim) == 0x000948, "Member 'UW_HudMain_C::WeaponHudFadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, Landing) == 0x000950, "Member 'UW_HudMain_C::Landing' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, Jumping) == 0x000958, "Member 'UW_HudMain_C::Jumping' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, HitEffect) == 0x000960, "Member 'UW_HudMain_C::HitEffect' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, W_SmartHealGuide_LowHealth) == 0x000968, "Member 'UW_HudMain_C::W_SmartHealGuide_LowHealth' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, W_SmartHealGuide_Status) == 0x000970, "Member 'UW_HudMain_C::W_SmartHealGuide_Status' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, W_WeaponListHud) == 0x000978, "Member 'UW_HudMain_C::W_WeaponListHud' has a wrong offset!");
static_assert(offsetof(UW_HudMain_C, ACS) == 0x000980, "Member 'UW_HudMain_C::ACS' has a wrong offset!");

}

