#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HudMain_Outgame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Hideout_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HudMain_Outgame.W_HudMain_Outgame_C
// 0x00B0 (0x0798 - 0x06E8)
class UW_HudMain_Outgame_C final : public UP2HUDMain_Hideout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           R_Curved;                                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HudMain_OutgameTop_C*                W_HudMain_OutgameTop;                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyGuide_C*                          W_KeyGuide_237;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SquadNoti_C*                         W_SquadNoti;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FP2SquadMemberInfo                     SelfInfp;                                          // 0x0710(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FP2SquadMemberInfo                     Self_Infp;                                         // 0x0740(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAsyncAction_ListenForGameplayMessage*  TeamChangeAsyncAction;                             // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       Hero;                                              // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialized;                                      // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRunningVR;                                       // 0x0781(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_782[0x6];                                      // 0x0782(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_KeyGuide_C*>                  KeyGuides;                                         // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void RefreshSquadList()	 // 0xae1e64;
	void OnSquadMessageOnBP(const struct FP2SquadMessage& InMsg)	 // 0xae1e64;
	void OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)	 // 0xae1e64;
	void MakeTppWeaponHUD_ImplementableEvent()	 // 0xae1e64;
	void MakeTPPWeaponHUD()	 // 0xae1e64;
	void ExecuteUbergraph_W_HudMain_Outgame(int32 EntryPoint)	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_HudMain_Outgame_C">();
	}
	static class UW_HudMain_Outgame_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_HudMain_Outgame_C>();
	}
};
static_assert(alignof(UW_HudMain_Outgame_C) == 0x000008, "Wrong alignment on UW_HudMain_Outgame_C");
static_assert(sizeof(UW_HudMain_Outgame_C) == 0x000798, "Wrong size on UW_HudMain_Outgame_C");
static_assert(offsetof(UW_HudMain_Outgame_C, UberGraphFrame) == 0x0006E8, "Member 'UW_HudMain_Outgame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, R_Curved) == 0x0006F0, "Member 'UW_HudMain_Outgame_C::R_Curved' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, W_HudMain_OutgameTop) == 0x0006F8, "Member 'UW_HudMain_Outgame_C::W_HudMain_OutgameTop' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, W_KeyGuide_237) == 0x000700, "Member 'UW_HudMain_Outgame_C::W_KeyGuide_237' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, W_SquadNoti) == 0x000708, "Member 'UW_HudMain_Outgame_C::W_SquadNoti' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, SelfInfp) == 0x000710, "Member 'UW_HudMain_Outgame_C::SelfInfp' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, Self_Infp) == 0x000740, "Member 'UW_HudMain_Outgame_C::Self_Infp' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, TeamChangeAsyncAction) == 0x000770, "Member 'UW_HudMain_Outgame_C::TeamChangeAsyncAction' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, Hero) == 0x000778, "Member 'UW_HudMain_Outgame_C::Hero' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, bInitialized) == 0x000780, "Member 'UW_HudMain_Outgame_C::bInitialized' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, IsRunningVR) == 0x000781, "Member 'UW_HudMain_Outgame_C::IsRunningVR' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Outgame_C, KeyGuides) == 0x000788, "Member 'UW_HudMain_Outgame_C::KeyGuides' has a wrong offset!");

}

