#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HudMain_Top

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HudMain_Top.W_HudMain_Top_C
// 0x0060 (0x0378 - 0x0318)
class UW_HudMain_Top_C final : public UP2HUDTop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Landing;                                           // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Jumping;                                           // 0x0328(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URetainerBox*                           R_Curved;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CompassHud_C*                        W_CompassHud;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerExpIndicatorWidget_C*          W_PlayerExpIndicatorWidget;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAbilitySystemComponent*                ACS;                                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UP2AbilityTask_AttributeChanged*        Async_Task;                                        // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Radial_Heal;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AP2HeroCharacter*                       Hero;                                              // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SquadMemberCount;                                  // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  TeameChangedAsyncAction;                           // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddCompassPing(class UP2MapMarkerComponent* InMapMarkerComponent)	 // 0xae1e64;
	void AllWidgetShowOrHide(ESlateVisibility Selection, bool IsUseFadeOutTimer, double InShowTimeSec)	 // 0xae1e64;
	void CollapseAllWidget()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_HudMain_Top(int32 EntryPoint)	 // 0xae1e64;
	void Finished_A05962394F12E06F5D95EA9B668AD80B()	 // 0xae1e64;
	void Finished_A086C87F4420F5CC13A9D3BA4C34C03D()	 // 0xae1e64;
	void GetHealthHudWidget(class UW_HealthHud_C** NewParam)	 // 0xae1e64;
	void OnAllWidgetShowOrHide(const ESlateVisibility InSlateVisibility, bool InUseFadeOutTimer)	 // 0xae1e64;
	void OnInitialized()	 // 0xae1e64;
	void OnInventoryWidget(bool bIsOn)	 // 0xae1e64;
	void OnJumped_ImplementableEvent()	 // 0xae1e64;
	void OnLanded_ImplementableEvent(const struct FHitResult& InHit)	 // 0xae1e64;
	void PlayJumpingAnim()	 // 0xae1e64;
	void PlayLandingAnim()	 // 0xae1e64;
	void RemoveCompassPing(class UP2MapMarkerComponent* InMapMarkerComponent)	 // 0xae1e64;
	void ShowOrHideWidget_Implementable_1(ESlateVisibility InVisibility)	 // 0xae1e64;
	void UpdateACS()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_HudMain_Top_C">();
	}
	static class UW_HudMain_Top_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_HudMain_Top_C>();
	}
};
static_assert(alignof(UW_HudMain_Top_C) == 0x000008, "Wrong alignment on UW_HudMain_Top_C");
static_assert(sizeof(UW_HudMain_Top_C) == 0x000378, "Wrong size on UW_HudMain_Top_C");
static_assert(offsetof(UW_HudMain_Top_C, UberGraphFrame) == 0x000318, "Member 'UW_HudMain_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, Landing) == 0x000320, "Member 'UW_HudMain_Top_C::Landing' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, Jumping) == 0x000328, "Member 'UW_HudMain_Top_C::Jumping' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, R_Curved) == 0x000330, "Member 'UW_HudMain_Top_C::R_Curved' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, W_CompassHud) == 0x000338, "Member 'UW_HudMain_Top_C::W_CompassHud' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, W_PlayerExpIndicatorWidget) == 0x000340, "Member 'UW_HudMain_Top_C::W_PlayerExpIndicatorWidget' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, ACS) == 0x000348, "Member 'UW_HudMain_Top_C::ACS' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, Async_Task) == 0x000350, "Member 'UW_HudMain_Top_C::Async_Task' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, Radial_Heal) == 0x000358, "Member 'UW_HudMain_Top_C::Radial_Heal' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, Hero) == 0x000360, "Member 'UW_HudMain_Top_C::Hero' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, SquadMemberCount) == 0x000368, "Member 'UW_HudMain_Top_C::SquadMemberCount' has a wrong offset!");
static_assert(offsetof(UW_HudMain_Top_C, TeameChangedAsyncAction) == 0x000370, "Member 'UW_HudMain_Top_C::TeameChangedAsyncAction' has a wrong offset!");

}

