#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HudMain_Outgame

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hideout_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_HudMain_Outgame.W_HudMain_Outgame_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_HudMain_Outgame_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_Outgame_C_Tick) == 0x000004, "Wrong alignment on W_HudMain_Outgame_C_Tick");
static_assert(sizeof(W_HudMain_Outgame_C_Tick) == 0x00003C, "Wrong size on W_HudMain_Outgame_C_Tick");
static_assert(offsetof(W_HudMain_Outgame_C_Tick, MyGeometry) == 0x000000, "Member 'W_HudMain_Outgame_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_Tick, InDeltaTime) == 0x000038, "Member 'W_HudMain_Outgame_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_HudMain_Outgame.W_HudMain_Outgame_C.RefreshSquadList
// 0x0004 (0x0004 - 0x0000)
struct W_HudMain_Outgame_C_RefreshSquadList final
{
public:
	int32                                         SquadMemberIndex;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_Outgame_C_RefreshSquadList) == 0x000004, "Wrong alignment on W_HudMain_Outgame_C_RefreshSquadList");
static_assert(sizeof(W_HudMain_Outgame_C_RefreshSquadList) == 0x000004, "Wrong size on W_HudMain_Outgame_C_RefreshSquadList");
static_assert(offsetof(W_HudMain_Outgame_C_RefreshSquadList, SquadMemberIndex) == 0x000000, "Member 'W_HudMain_Outgame_C_RefreshSquadList::SquadMemberIndex' has a wrong offset!");

// Function W_HudMain_Outgame.W_HudMain_Outgame_C.OnSquadMessageOnBP
// 0x0060 (0x0060 - 0x0000)
struct W_HudMain_Outgame_C_OnSquadMessageOnBP final
{
public:
	struct FP2SquadMessage                        InMsg;                                             // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_HudMain_Outgame_C_OnSquadMessageOnBP) == 0x000008, "Wrong alignment on W_HudMain_Outgame_C_OnSquadMessageOnBP");
static_assert(sizeof(W_HudMain_Outgame_C_OnSquadMessageOnBP) == 0x000060, "Wrong size on W_HudMain_Outgame_C_OnSquadMessageOnBP");
static_assert(offsetof(W_HudMain_Outgame_C_OnSquadMessageOnBP, InMsg) == 0x000000, "Member 'W_HudMain_Outgame_C_OnSquadMessageOnBP::InMsg' has a wrong offset!");

// Function W_HudMain_Outgame.W_HudMain_Outgame_C.OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59
// 0x0010 (0x0010 - 0x0000)
struct W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59 final
{
public:
	class UAsyncAction_ListenForGameplayMessage*  ProxyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActualChannel;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59) == 0x000008, "Wrong alignment on W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59");
static_assert(sizeof(W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59) == 0x000010, "Wrong size on W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59");
static_assert(offsetof(W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59, ProxyObject) == 0x000000, "Member 'W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59::ProxyObject' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59, ActualChannel) == 0x000008, "Member 'W_HudMain_Outgame_C_OnMessageReceived_F2603A4D4054019F6CBFFBAE6663DA59::ActualChannel' has a wrong offset!");

// Function W_HudMain_Outgame.W_HudMain_Outgame_C.ExecuteUbergraph_W_HudMain_Outgame
// 0x01D8 (0x01D8 - 0x0000)
struct W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAsyncAction_ListenForGameplayMessage* ProxyObject, const struct FGameplayTag& ActualChannel)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessage*  K2Node_CustomEvent_ProxyObject;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_ActualChannel;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FP2TeamChangedMessage                  Temp_struct_Variable;                              // 0x0028(0x0030)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  Temp_object_Variable;                              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  CallFunc_ListenForGameplayMessages_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0074(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FP2SquadMemberInfo>             CallFunc_GetSquadMembers_ReturnValue;              // 0x00C8(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2PlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2TeamChangedMessage                  Temp_struct_Variable_2;                            // 0x00F8(0x0030)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningVRSimulation_ReturnValue;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPayload_ReturnValue;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_KeyGuide_C*                          K2Node_DynamicCast_AsW_Key_Guide;                  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_KeyGuide_C*                          K2Node_DynamicCast_AsW_Key_Guide_1;                // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2SquadMessage                        K2Node_Event_InMsg;                                // 0x0160(0x0060)(ConstParm)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame) == 0x000008, "Wrong alignment on W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame");
static_assert(sizeof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame) == 0x0001D8, "Wrong size on W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, EntryPoint) == 0x000000, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_CustomEvent_ProxyObject) == 0x000018, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_CustomEvent_ProxyObject' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_CustomEvent_ActualChannel) == 0x000020, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_CustomEvent_ActualChannel' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, Temp_struct_Variable) == 0x000028, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, Temp_struct_Variable_1) == 0x000058, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, Temp_object_Variable) == 0x000060, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_ListenForGameplayMessages_ReturnValue) == 0x000068, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_ListenForGameplayMessages_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, Temp_delegate_Variable) == 0x000074, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_Event_MyGeometry) == 0x000084, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_Event_InDeltaTime) == 0x0000BC, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetSquadMembers_ReturnValue) == 0x0000C8, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetSquadMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000D8, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_IsValid_ReturnValue_1) == 0x0000E4, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E5, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetLocalPlayerState_ReturnValue) == 0x0000E8, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetVisibility_ReturnValue) == 0x0000F1, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F2, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F3, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, Temp_struct_Variable_2) == 0x0000F8, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x000128, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_IsRunningVRSimulation_ReturnValue) == 0x000130, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_IsRunningVRSimulation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetPayload_ReturnValue) == 0x000131, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000132, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_DynamicCast_AsW_Key_Guide) == 0x000138, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_DynamicCast_AsW_Key_Guide' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_DynamicCast_AsW_Key_Guide_1) == 0x000148, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_DynamicCast_AsW_Key_Guide_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_Array_Add_ReturnValue) == 0x000154, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_Array_Add_ReturnValue_1) == 0x000158, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_Event_InMsg) == 0x000160, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_Event_InMsg' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_Array_Add_ReturnValue_2) == 0x0001C0, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_GetPlayerController_ReturnValue) == 0x0001C8, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, K2Node_SwitchEnum_CmpSuccess) == 0x0001D0, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame, CallFunc_PostEvent_ReturnValue) == 0x0001D4, "Member 'W_HudMain_Outgame_C_ExecuteUbergraph_W_HudMain_Outgame::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

}

