#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InteractionWidget_Facility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InteractionWidget_Facility.W_InteractionWidget_Facility_C
// 0x0030 (0x0390 - 0x0360)
class UW_InteractionWidget_Facility_C final : public UP2InteractionMarkerWidget_Facility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Action01_Deco1;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Action02_Deco1;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Action03_Deco1;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Action04_Deco1;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Visible;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_InteractionWidget_Facility(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_InteractionWidget_Facility_C">();
	}
	static class UW_InteractionWidget_Facility_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_InteractionWidget_Facility_C>();
	}
};
static_assert(alignof(UW_InteractionWidget_Facility_C) == 0x000008, "Wrong alignment on UW_InteractionWidget_Facility_C");
static_assert(sizeof(UW_InteractionWidget_Facility_C) == 0x000390, "Wrong size on UW_InteractionWidget_Facility_C");
static_assert(offsetof(UW_InteractionWidget_Facility_C, UberGraphFrame) == 0x000360, "Member 'UW_InteractionWidget_Facility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_Facility_C, Img_Action01_Deco1) == 0x000368, "Member 'UW_InteractionWidget_Facility_C::Img_Action01_Deco1' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_Facility_C, Img_Action02_Deco1) == 0x000370, "Member 'UW_InteractionWidget_Facility_C::Img_Action02_Deco1' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_Facility_C, Img_Action03_Deco1) == 0x000378, "Member 'UW_InteractionWidget_Facility_C::Img_Action03_Deco1' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_Facility_C, Img_Action04_Deco1) == 0x000380, "Member 'UW_InteractionWidget_Facility_C::Img_Action04_Deco1' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_Facility_C, Img_Icon_Visible) == 0x000388, "Member 'UW_InteractionWidget_Facility_C::Img_Icon_Visible' has a wrong offset!");

}

