#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Stash_Tabs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_Stash_Tabs.W_Inventory_Stash_Tabs_C
// 0x0070 (0x0458 - 0x03E8)
class UW_Inventory_Stash_Tabs_C final : public UP2InventoryStashTabWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_BtnHovered;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBg;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         VerticalBoxIndex;                                  // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DefaultDecoTransform;                              // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PatternModifier;                                   // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UnHoverMoveInterpSpeed;                            // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HoverMoveInterpSpeed;                              // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MaxMoveAmount;                                     // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecoModifier;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MinMoveAmount;                                     // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Inventory_Stash_Tabs_Button_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_Stash_Tabs_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BP_OnCheckStateChanged(bool bIsChecked)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_Stash_Tabs(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void UpdateSelectedCheckbox(bool bIsChecked)	 // 0xae1e64;
	void UpdateSelectedDesign(bool InbSelected)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_Stash_Tabs_C">();
	}
	static class UW_Inventory_Stash_Tabs_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_Stash_Tabs_C>();
	}
};
static_assert(alignof(UW_Inventory_Stash_Tabs_C) == 0x000008, "Wrong alignment on UW_Inventory_Stash_Tabs_C");
static_assert(sizeof(UW_Inventory_Stash_Tabs_C) == 0x000458, "Wrong size on UW_Inventory_Stash_Tabs_C");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, UberGraphFrame) == 0x0003E8, "Member 'UW_Inventory_Stash_Tabs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, Img_BtnHovered) == 0x0003F0, "Member 'UW_Inventory_Stash_Tabs_C::Img_BtnHovered' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, Img_SelectedBg) == 0x0003F8, "Member 'UW_Inventory_Stash_Tabs_C::Img_SelectedBg' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, VerticalBoxIndex) == 0x000400, "Member 'UW_Inventory_Stash_Tabs_C::VerticalBoxIndex' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, DefaultDecoTransform) == 0x000408, "Member 'UW_Inventory_Stash_Tabs_C::DefaultDecoTransform' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, PatternModifier) == 0x000418, "Member 'UW_Inventory_Stash_Tabs_C::PatternModifier' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, UnHoverMoveInterpSpeed) == 0x000420, "Member 'UW_Inventory_Stash_Tabs_C::UnHoverMoveInterpSpeed' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, HoverMoveInterpSpeed) == 0x000428, "Member 'UW_Inventory_Stash_Tabs_C::HoverMoveInterpSpeed' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, MaxMoveAmount) == 0x000430, "Member 'UW_Inventory_Stash_Tabs_C::MaxMoveAmount' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, DecoModifier) == 0x000440, "Member 'UW_Inventory_Stash_Tabs_C::DecoModifier' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Stash_Tabs_C, MinMoveAmount) == 0x000448, "Member 'UW_Inventory_Stash_Tabs_C::MinMoveAmount' has a wrong offset!");

}

