#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Slot_General

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_Slot_General.W_Inventory_Slot_General_C
// 0x0018 (0x03D8 - 0x03C0)
class UW_Inventory_Slot_General_C final : public UP2SlotGeneralWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_LockPattern;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Slot;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_Slot_General(int32 EntryPoint)	 // 0xae1e64;
	void InitializeSlotDesign(EP2SlotWidgetType SlotIndex)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateSlotSize()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_Slot_General_C">();
	}
	static class UW_Inventory_Slot_General_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_Slot_General_C>();
	}
};
static_assert(alignof(UW_Inventory_Slot_General_C) == 0x000008, "Wrong alignment on UW_Inventory_Slot_General_C");
static_assert(sizeof(UW_Inventory_Slot_General_C) == 0x0003D8, "Wrong size on UW_Inventory_Slot_General_C");
static_assert(offsetof(UW_Inventory_Slot_General_C, UberGraphFrame) == 0x0003C0, "Member 'UW_Inventory_Slot_General_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Slot_General_C, Img_LockPattern) == 0x0003C8, "Member 'UW_Inventory_Slot_General_C::Img_LockPattern' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Slot_General_C, SzB_Slot) == 0x0003D0, "Member 'UW_Inventory_Slot_General_C::SzB_Slot' has a wrong offset!");

}

