#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InventoryGridMain

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_InventoryGridMain.W_InventoryGridMain_C.ExecuteUbergraph_W_InventoryGridMain
// 0x0028 (0x0028 - 0x0000)
struct W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInLaptop;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UP2InventoryItemWidget* InItemWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2InventoryItemWidget*                 K2Node_CustomEvent_InItemWidget;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain) == 0x000008, "Wrong alignment on W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain");
static_assert(sizeof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain) == 0x000028, "Wrong size on W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain");
static_assert(offsetof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain, EntryPoint) == 0x000000, "Member 'W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain, K2Node_Event_bInLaptop) == 0x000004, "Member 'W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain::K2Node_Event_bInLaptop' has a wrong offset!");
static_assert(offsetof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain, K2Node_CustomEvent_InItemWidget) == 0x000020, "Member 'W_InventoryGridMain_C_ExecuteUbergraph_W_InventoryGridMain::K2Node_CustomEvent_InItemWidget' has a wrong offset!");

// Function W_InventoryGridMain.W_InventoryGridMain_C.OnItemMouseHoverEvent_Event
// 0x0008 (0x0008 - 0x0000)
struct W_InventoryGridMain_C_OnItemMouseHoverEvent_Event final
{
public:
	class UP2InventoryItemWidget*                 InItemWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InventoryGridMain_C_OnItemMouseHoverEvent_Event) == 0x000008, "Wrong alignment on W_InventoryGridMain_C_OnItemMouseHoverEvent_Event");
static_assert(sizeof(W_InventoryGridMain_C_OnItemMouseHoverEvent_Event) == 0x000008, "Wrong size on W_InventoryGridMain_C_OnItemMouseHoverEvent_Event");
static_assert(offsetof(W_InventoryGridMain_C_OnItemMouseHoverEvent_Event, InItemWidget) == 0x000000, "Member 'W_InventoryGridMain_C_OnItemMouseHoverEvent_Event::InItemWidget' has a wrong offset!");

// Function W_InventoryGridMain.W_InventoryGridMain_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_InventoryGridMain_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InventoryGridMain_C_PreConstruct) == 0x000001, "Wrong alignment on W_InventoryGridMain_C_PreConstruct");
static_assert(sizeof(W_InventoryGridMain_C_PreConstruct) == 0x000001, "Wrong size on W_InventoryGridMain_C_PreConstruct");
static_assert(offsetof(W_InventoryGridMain_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_InventoryGridMain_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_InventoryGridMain.W_InventoryGridMain_C.SetInventoryOutgameDimensions
// 0x0001 (0x0001 - 0x0000)
struct W_InventoryGridMain_C_SetInventoryOutgameDimensions final
{
public:
	bool                                          IsHideout;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InventoryGridMain_C_SetInventoryOutgameDimensions) == 0x000001, "Wrong alignment on W_InventoryGridMain_C_SetInventoryOutgameDimensions");
static_assert(sizeof(W_InventoryGridMain_C_SetInventoryOutgameDimensions) == 0x000001, "Wrong size on W_InventoryGridMain_C_SetInventoryOutgameDimensions");
static_assert(offsetof(W_InventoryGridMain_C_SetInventoryOutgameDimensions, IsHideout) == 0x000000, "Member 'W_InventoryGridMain_C_SetInventoryOutgameDimensions::IsHideout' has a wrong offset!");

// Function W_InventoryGridMain.W_InventoryGridMain_C.SetWidgetDesign_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent final
{
public:
	bool                                          bInLaptop;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent) == 0x000001, "Wrong alignment on W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent");
static_assert(sizeof(W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent) == 0x000001, "Wrong size on W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent");
static_assert(offsetof(W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent, bInLaptop) == 0x000000, "Member 'W_InventoryGridMain_C_SetWidgetDesign_ImplementableEvent::bInLaptop' has a wrong offset!");

}

