#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InteractionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InteractionWidget.W_InteractionWidget_C
// 0x0028 (0x04B0 - 0x0488)
class UW_InteractionWidget_C final : public UP2InteractMarkerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0488(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_StackCount_Deco;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Glow;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon_Visible;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_Main;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_InteractionWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_InteractionWidget_C">();
	}
	static class UW_InteractionWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_InteractionWidget_C>();
	}
};
static_assert(alignof(UW_InteractionWidget_C) == 0x000008, "Wrong alignment on UW_InteractionWidget_C");
static_assert(sizeof(UW_InteractionWidget_C) == 0x0004B0, "Wrong size on UW_InteractionWidget_C");
static_assert(offsetof(UW_InteractionWidget_C, UberGraphFrame) == 0x000488, "Member 'UW_InteractionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_C, Bdr_StackCount_Deco) == 0x000490, "Member 'UW_InteractionWidget_C::Bdr_StackCount_Deco' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_C, Img_Icon_Glow) == 0x000498, "Member 'UW_InteractionWidget_C::Img_Icon_Glow' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_C, Img_Icon_Visible) == 0x0004A0, "Member 'UW_InteractionWidget_C::Img_Icon_Visible' has a wrong offset!");
static_assert(offsetof(UW_InteractionWidget_C, RetainerBox_Main) == 0x0004A8, "Member 'UW_InteractionWidget_C::RetainerBox_Main' has a wrong offset!");

}

