#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_TestGearLoadoutTitleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C
// 0x0070 (0x02F8 - 0x0288)
class UW_Inventory_TestGearLoadoutTitleWidget_C final : public UP2TestGearLoadoutTitleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_TestGearUnderline;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_RepGauge;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_TestGearTitle;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CurrentRep;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_MaxRep;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_RepLv;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_TestGearTitle;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_RepGauge;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TestGearTitle;                                     // 0x02D0(0x0018)(Edit, BlueprintVisible)
	bool                                          IsFactionTestGear;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnavailable;                                     // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x2];                                      // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentLv;                                         // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRep;                                        // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxRep;                                            // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTestGearTitle(const class FText& InTitle)	 // 0xae1e64;
	void SetIsUnavailable(bool bIsUnavailable)	 // 0xae1e64;
	void SetIsFactionTestGearTitle(bool bIsFactionTestGearTitle)	 // 0xae1e64;
	void SetFactionReputationValue(int32 InLevel, int32 InReputation, int32 InMaxReputation)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_TestGearLoadoutTitleWidget_C">();
	}
	static class UW_Inventory_TestGearLoadoutTitleWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_TestGearLoadoutTitleWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_TestGearLoadoutTitleWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_TestGearLoadoutTitleWidget_C");
static_assert(sizeof(UW_Inventory_TestGearLoadoutTitleWidget_C) == 0x0002F8, "Wrong size on UW_Inventory_TestGearLoadoutTitleWidget_C");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, UberGraphFrame) == 0x000288, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, Img_TestGearUnderline) == 0x000290, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::Img_TestGearUnderline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, PB_RepGauge) == 0x000298, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::PB_RepGauge' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, SzB_TestGearTitle) == 0x0002A0, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::SzB_TestGearTitle' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, Txt_CurrentRep) == 0x0002A8, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::Txt_CurrentRep' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, Txt_MaxRep) == 0x0002B0, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::Txt_MaxRep' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, Txt_RepLv) == 0x0002B8, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::Txt_RepLv' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, Txt_TestGearTitle) == 0x0002C0, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::Txt_TestGearTitle' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, VB_RepGauge) == 0x0002C8, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::VB_RepGauge' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, TestGearTitle) == 0x0002D0, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::TestGearTitle' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, IsFactionTestGear) == 0x0002E8, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::IsFactionTestGear' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, IsUnavailable) == 0x0002E9, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::IsUnavailable' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, CurrentLv) == 0x0002EC, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::CurrentLv' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, CurrentRep) == 0x0002F0, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::CurrentRep' has a wrong offset!");
static_assert(offsetof(UW_Inventory_TestGearLoadoutTitleWidget_C, MaxRep) == 0x0002F4, "Member 'UW_Inventory_TestGearLoadoutTitleWidget_C::MaxRep' has a wrong offset!");

}

