#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ItemDetailsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_ItemDetailsWidget.W_Inventory_ItemDetailsWidget_C
// 0x0030 (0x0760 - 0x0730)
class UW_Inventory_ItemDetailsWidget_C final : public UP2DetailPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 img_Decoline;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemDetails_InfoTab_C*               InfoTab_Description;                               // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemDetails_InfoTab_C*               InfoTab_Stat;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemWeightUnit;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemDetails_AttachmentGroup_C*       W_ItemDetails_AttachmentGroup;                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_ItemDetailsWidget(int32 EntryPoint)	 // 0xae1e64;
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_ItemDetailsWidget_C">();
	}
	static class UW_Inventory_ItemDetailsWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_ItemDetailsWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_ItemDetailsWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_ItemDetailsWidget_C");
static_assert(sizeof(UW_Inventory_ItemDetailsWidget_C) == 0x000760, "Wrong size on UW_Inventory_ItemDetailsWidget_C");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, UberGraphFrame) == 0x000730, "Member 'UW_Inventory_ItemDetailsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, img_Decoline) == 0x000738, "Member 'UW_Inventory_ItemDetailsWidget_C::img_Decoline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, InfoTab_Description) == 0x000740, "Member 'UW_Inventory_ItemDetailsWidget_C::InfoTab_Description' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, InfoTab_Stat) == 0x000748, "Member 'UW_Inventory_ItemDetailsWidget_C::InfoTab_Stat' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, ItemWeightUnit) == 0x000750, "Member 'UW_Inventory_ItemDetailsWidget_C::ItemWeightUnit' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetailsWidget_C, W_ItemDetails_AttachmentGroup) == 0x000758, "Member 'UW_Inventory_ItemDetailsWidget_C::W_ItemDetails_AttachmentGroup' has a wrong offset!");

}

