#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_SkillSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_SkillSlot.W_Inventory_SkillSlot_C
// 0x0030 (0x0360 - 0x0330)
class UW_Inventory_SkillSlot_C final : public UP2InventorySkillSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_BG;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EmptySlotIcon;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ItemIcon;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_SkillSlot(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetEmptySlot()	 // 0xae1e64;
	void UpdateLayout(int32 CurrentSkillCount)	 // 0xae1e64;
	void UpdateWidgetDesign(int32 CurrentSkillCount)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_SkillSlot_C">();
	}
	static class UW_Inventory_SkillSlot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_SkillSlot_C>();
	}
};
static_assert(alignof(UW_Inventory_SkillSlot_C) == 0x000008, "Wrong alignment on UW_Inventory_SkillSlot_C");
static_assert(sizeof(UW_Inventory_SkillSlot_C) == 0x000360, "Wrong size on UW_Inventory_SkillSlot_C");
static_assert(offsetof(UW_Inventory_SkillSlot_C, UberGraphFrame) == 0x000330, "Member 'UW_Inventory_SkillSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SkillSlot_C, Bdr_BG) == 0x000338, "Member 'UW_Inventory_SkillSlot_C::Bdr_BG' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SkillSlot_C, Img_EmptySlotIcon) == 0x000340, "Member 'UW_Inventory_SkillSlot_C::Img_EmptySlotIcon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SkillSlot_C, Img_ItemIcon) == 0x000348, "Member 'UW_Inventory_SkillSlot_C::Img_ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SkillSlot_C, Img_Outline) == 0x000350, "Member 'UW_Inventory_SkillSlot_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SkillSlot_C, Img_Pattern) == 0x000358, "Member 'UW_Inventory_SkillSlot_C::Img_Pattern' has a wrong offset!");

}

