#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ItemDetails_Chamber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_ItemDetails_Chamber.W_Inventory_ItemDetails_Chamber_C
// 0x0028 (0x02B0 - 0x0288)
class UW_Inventory_ItemDetails_Chamber_C final : public UP2DetailPopupChamberIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ChamberLoaded;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Outline;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_AmmoType;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_ItemDetails_Chamber(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_ItemDetails_Chamber_C">();
	}
	static class UW_Inventory_ItemDetails_Chamber_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_ItemDetails_Chamber_C>();
	}
};
static_assert(alignof(UW_Inventory_ItemDetails_Chamber_C) == 0x000008, "Wrong alignment on UW_Inventory_ItemDetails_Chamber_C");
static_assert(sizeof(UW_Inventory_ItemDetails_Chamber_C) == 0x0002B0, "Wrong size on UW_Inventory_ItemDetails_Chamber_C");
static_assert(offsetof(UW_Inventory_ItemDetails_Chamber_C, UberGraphFrame) == 0x000288, "Member 'UW_Inventory_ItemDetails_Chamber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chamber_C, Bdr_ChamberLoaded) == 0x000290, "Member 'UW_Inventory_ItemDetails_Chamber_C::Bdr_ChamberLoaded' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chamber_C, Bdr_Outline) == 0x000298, "Member 'UW_Inventory_ItemDetails_Chamber_C::Bdr_Outline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chamber_C, Img_Icon) == 0x0002A0, "Member 'UW_Inventory_ItemDetails_Chamber_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chamber_C, Txt_AmmoType) == 0x0002A8, "Member 'UW_Inventory_ItemDetails_Chamber_C::Txt_AmmoType' has a wrong offset!");

}

