#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Stash

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_Stash.W_Inventory_Stash_C.ExecuteUbergraph_W_Inventory_Stash
// 0x0048 (0x0048 - 0x0000)
struct W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UW_Inventory_HeadlineWidget_C*          K2Node_DynamicCast_AsW_Inventory_Headline_Widget;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash) == 0x000008, "Wrong alignment on W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash");
static_assert(sizeof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash) == 0x000048, "Wrong size on W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, EntryPoint) == 0x000000, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000018, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, K2Node_DynamicCast_AsW_Inventory_Headline_Widget) == 0x000030, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::K2Node_DynamicCast_AsW_Inventory_Headline_Widget' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000040, "Member 'W_Inventory_Stash_C_ExecuteUbergraph_W_Inventory_Stash::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");

}

