#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_SkillSlot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_SkillSlot.W_Inventory_SkillSlot_C.ExecuteUbergraph_W_Inventory_SkillSlot
// 0x0008 (0x0008 - 0x0000)
struct W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot) == 0x000004, "Wrong alignment on W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot");
static_assert(sizeof(W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot) == 0x000008, "Wrong size on W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot");
static_assert(offsetof(W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot, EntryPoint) == 0x000000, "Member 'W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Inventory_SkillSlot_C_ExecuteUbergraph_W_Inventory_SkillSlot::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Inventory_SkillSlot.W_Inventory_SkillSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_SkillSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_SkillSlot_C_PreConstruct) == 0x000001, "Wrong alignment on W_Inventory_SkillSlot_C_PreConstruct");
static_assert(sizeof(W_Inventory_SkillSlot_C_PreConstruct) == 0x000001, "Wrong size on W_Inventory_SkillSlot_C_PreConstruct");
static_assert(offsetof(W_Inventory_SkillSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Inventory_SkillSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Inventory_SkillSlot.W_Inventory_SkillSlot_C.SetEmptySlot
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_SkillSlot_C_SetEmptySlot final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_SkillSlot_C_SetEmptySlot) == 0x000001, "Wrong alignment on W_Inventory_SkillSlot_C_SetEmptySlot");
static_assert(sizeof(W_Inventory_SkillSlot_C_SetEmptySlot) == 0x000001, "Wrong size on W_Inventory_SkillSlot_C_SetEmptySlot");
static_assert(offsetof(W_Inventory_SkillSlot_C_SetEmptySlot, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'W_Inventory_SkillSlot_C_SetEmptySlot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_Inventory_SkillSlot.W_Inventory_SkillSlot_C.UpdateLayout
// 0x0220 (0x0220 - 0x0000)
struct W_Inventory_SkillSlot_C_UpdateLayout final
{
public:
	int32                                         CurrentSkillCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x00D0)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0100(0x0014)()
	uint8                                         Pad_114[0xC];                                      // 0x0114(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0120(0x00D0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01F0(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_1;        // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_SkillSlot_C_UpdateLayout) == 0x000010, "Wrong alignment on W_Inventory_SkillSlot_C_UpdateLayout");
static_assert(sizeof(W_Inventory_SkillSlot_C_UpdateLayout) == 0x000220, "Wrong size on W_Inventory_SkillSlot_C_UpdateLayout");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, CurrentSkillCount) == 0x000000, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::CurrentSkillCount' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_SlateBrush) == 0x000020, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000F0, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_SlateColor) == 0x000100, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_SlateBrush_1) == 0x000120, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_SlateColor_1) == 0x0001F0, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_SwitchEnum_CmpSuccess) == 0x000204, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_ImageSize_ImplicitCast) == 0x000208, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_ImageSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateLayout, K2Node_MakeStruct_ImageSize_ImplicitCast_1) == 0x000210, "Member 'W_Inventory_SkillSlot_C_UpdateLayout::K2Node_MakeStruct_ImageSize_ImplicitCast_1' has a wrong offset!");

// Function W_Inventory_SkillSlot.W_Inventory_SkillSlot_C.UpdateWidgetDesign
// 0x0004 (0x0004 - 0x0000)
struct W_Inventory_SkillSlot_C_UpdateWidgetDesign final
{
public:
	int32                                         CurrentSkillCount;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_SkillSlot_C_UpdateWidgetDesign) == 0x000004, "Wrong alignment on W_Inventory_SkillSlot_C_UpdateWidgetDesign");
static_assert(sizeof(W_Inventory_SkillSlot_C_UpdateWidgetDesign) == 0x000004, "Wrong size on W_Inventory_SkillSlot_C_UpdateWidgetDesign");
static_assert(offsetof(W_Inventory_SkillSlot_C_UpdateWidgetDesign, CurrentSkillCount) == 0x000000, "Member 'W_Inventory_SkillSlot_C_UpdateWidgetDesign::CurrentSkillCount' has a wrong offset!");

}

