#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ResupplyItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_ResupplyItemWidget.W_Inventory_ResupplyItemWidget_C
// 0x0030 (0x0708 - 0x06D8)
class UW_Inventory_ResupplyItemWidget_C final : public UP2ResupplyItemTileWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_TypeIconGlow;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_TypeIconShadow;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Minus;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Plus;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ItemPrice;                                         // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemStockCount;                                    // 0x0704(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshStockWidgetOnBP(int32 InStockCount)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_ResupplyItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_QuantityControl_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_QuantityControl_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_Plus_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_Plus_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_Minus_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_ResupplyItemWidget_Btn_Minus_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_ResupplyItemWidget_C">();
	}
	static class UW_Inventory_ResupplyItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_ResupplyItemWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_ResupplyItemWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_ResupplyItemWidget_C");
static_assert(sizeof(UW_Inventory_ResupplyItemWidget_C) == 0x000708, "Wrong size on UW_Inventory_ResupplyItemWidget_C");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, UberGraphFrame) == 0x0006D8, "Member 'UW_Inventory_ResupplyItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, Bdr_TypeIconGlow) == 0x0006E0, "Member 'UW_Inventory_ResupplyItemWidget_C::Bdr_TypeIconGlow' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, Bdr_TypeIconShadow) == 0x0006E8, "Member 'UW_Inventory_ResupplyItemWidget_C::Bdr_TypeIconShadow' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, Img_Minus) == 0x0006F0, "Member 'UW_Inventory_ResupplyItemWidget_C::Img_Minus' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, Img_Plus) == 0x0006F8, "Member 'UW_Inventory_ResupplyItemWidget_C::Img_Plus' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, ItemPrice) == 0x000700, "Member 'UW_Inventory_ResupplyItemWidget_C::ItemPrice' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ResupplyItemWidget_C, ItemStockCount) == 0x000704, "Member 'UW_Inventory_ResupplyItemWidget_C::ItemStockCount' has a wrong offset!");

}

