#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_HeadlineWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_HeadlineWidget.W_Inventory_HeadlineWidget_C
// 0x0048 (0x0370 - 0x0328)
class UW_Inventory_HeadlineWidget_C final : public UP2InventoryHeadlineWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_SortOrderOutline;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Headline;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_LockNotice;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_TitleText;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BottomLine;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_LockIcon;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_SortOrderIcon;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Condition;                                         // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Inventory_HeadlineWidget_Btn_SortOrder_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Inventory_HeadlineWidget_Btn_SortOrder_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_HeadlineWidget(int32 EntryPoint)	 // 0xae1e64;
	void HideTitleText()	 // 0xae1e64;
	void OnContainerLocked(bool bInventoryLocked)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_HeadlineWidget_C">();
	}
	static class UW_Inventory_HeadlineWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_HeadlineWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_HeadlineWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_HeadlineWidget_C");
static_assert(sizeof(UW_Inventory_HeadlineWidget_C) == 0x000370, "Wrong size on UW_Inventory_HeadlineWidget_C");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, UberGraphFrame) == 0x000328, "Member 'UW_Inventory_HeadlineWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, Bdr_SortOrderOutline) == 0x000330, "Member 'UW_Inventory_HeadlineWidget_C::Bdr_SortOrderOutline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, HB_Headline) == 0x000338, "Member 'UW_Inventory_HeadlineWidget_C::HB_Headline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, HB_LockNotice) == 0x000340, "Member 'UW_Inventory_HeadlineWidget_C::HB_LockNotice' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, HB_TitleText) == 0x000348, "Member 'UW_Inventory_HeadlineWidget_C::HB_TitleText' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, Img_BottomLine) == 0x000350, "Member 'UW_Inventory_HeadlineWidget_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, Img_LockIcon) == 0x000358, "Member 'UW_Inventory_HeadlineWidget_C::Img_LockIcon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, WS_SortOrderIcon) == 0x000360, "Member 'UW_Inventory_HeadlineWidget_C::WS_SortOrderIcon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_HeadlineWidget_C, Condition) == 0x000368, "Member 'UW_Inventory_HeadlineWidget_C::Condition' has a wrong offset!");

}

