#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_InternalContainer_Deadbody

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_InternalContainer_Deadbody.W_Inventory_InternalContainer_Deadbody_C
// 0x0020 (0x0300 - 0x02E0)
class UW_Inventory_InternalContainer_Deadbody_C final : public UP2DeadbodyInternalWidget
{
public:
	class UImage*                                 Img_Outline;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ShieldIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_InternalContainer_Deadbody_C">();
	}
	static class UW_Inventory_InternalContainer_Deadbody_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_InternalContainer_Deadbody_C>();
	}
};
static_assert(alignof(UW_Inventory_InternalContainer_Deadbody_C) == 0x000008, "Wrong alignment on UW_Inventory_InternalContainer_Deadbody_C");
static_assert(sizeof(UW_Inventory_InternalContainer_Deadbody_C) == 0x000300, "Wrong size on UW_Inventory_InternalContainer_Deadbody_C");
static_assert(offsetof(UW_Inventory_InternalContainer_Deadbody_C, Img_Outline) == 0x0002E0, "Member 'UW_Inventory_InternalContainer_Deadbody_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_InternalContainer_Deadbody_C, Img_Pattern) == 0x0002E8, "Member 'UW_Inventory_InternalContainer_Deadbody_C::Img_Pattern' has a wrong offset!");
static_assert(offsetof(UW_Inventory_InternalContainer_Deadbody_C, Img_ShieldIcon) == 0x0002F0, "Member 'UW_Inventory_InternalContainer_Deadbody_C::Img_ShieldIcon' has a wrong offset!");
static_assert(offsetof(UW_Inventory_InternalContainer_Deadbody_C, W_Inventory_Container) == 0x0002F8, "Member 'UW_Inventory_InternalContainer_Deadbody_C::W_Inventory_Container' has a wrong offset!");

}

