#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Container

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_Container.W_Inventory_Container_C
// 0x0018 (0x0338 - 0x0320)
class UW_Inventory_Container_C final : public UP2InventoryContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Outline;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Item_C*                    W_Inventory_Item;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_Container(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_Container_C">();
	}
	static class UW_Inventory_Container_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_Container_C>();
	}
};
static_assert(alignof(UW_Inventory_Container_C) == 0x000008, "Wrong alignment on UW_Inventory_Container_C");
static_assert(sizeof(UW_Inventory_Container_C) == 0x000338, "Wrong size on UW_Inventory_Container_C");
static_assert(offsetof(UW_Inventory_Container_C, UberGraphFrame) == 0x000320, "Member 'UW_Inventory_Container_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Container_C, Img_Outline) == 0x000328, "Member 'UW_Inventory_Container_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Container_C, W_Inventory_Item) == 0x000330, "Member 'UW_Inventory_Container_C::W_Inventory_Item' has a wrong offset!");

}

