#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_Item.W_Inventory_Item_C.ExecuteUbergraph_W_Inventory_Item
// 0x02E8 (0x02E8 - 0x0000)
struct W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00A0(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0118(0x0078)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_DT;                             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x01BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              CallFunc_GetP2AbilitySystemComponent_ReturnValue;  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x01FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_1;         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2AbilitySystemComponent*              CallFunc_GetP2AbilitySystemComponent_ReturnValue_1; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Duration;                             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_TimePassed;                           // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_SplitPart;                            // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsUser;                              // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2SlotWidgetType                             K2Node_Event_InSlotType;                           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0254(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsContractRequired;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsWishlist;                          // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BusyDuration_ImplicitCast;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BusyElapsedTime_ImplicitCast;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FCeil_A_ImplicitCast;                     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateBusyProgress_DT_ImplicitCast;       // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item) == 0x000008, "Wrong alignment on W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item");
static_assert(sizeof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item) == 0x0002E8, "Wrong size on W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, EntryPoint) == 0x000000, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_2) == 0x000024, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_3) == 0x000034, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_4) == 0x000044, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_5) == 0x000054, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_MyGeometry_1) == 0x000064, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_MouseEvent_1) == 0x0000A0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_MouseEvent) == 0x000118, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_CustomEvent_DT) == 0x000198, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_CustomEvent_DT' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_6) == 0x0001A0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0001B0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_MakeStruct_Margin_7) == 0x0001BC, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_MakeStruct_Margin_7' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001D0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_2) == 0x0001D8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_FClamp_ReturnValue) == 0x0001E0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x0001E8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_GetP2AbilitySystemComponent_ReturnValue) == 0x0001F0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_GetP2AbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_3) == 0x0001F8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SelectColor_ReturnValue) == 0x0001FC, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_GetLocalPlayerPawn_ReturnValue_1) == 0x000210, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_GetLocalPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_GetP2AbilitySystemComponent_ReturnValue_1) == 0x000218, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_GetP2AbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_4) == 0x000220, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanOR_ReturnValue) == 0x000221, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanAND_ReturnValue) == 0x000222, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanOR_ReturnValue_1) == 0x000223, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanAND_ReturnValue_1) == 0x000224, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanAND_ReturnValue_2) == 0x000225, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SelectFloat_ReturnValue) == 0x000228, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_Duration) == 0x000230, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_TimePassed) == 0x000234, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_TimePassed' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_SplitPart) == 0x000238, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_SplitPart' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_bIsUser) == 0x00023C, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_bIsUser' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_FCeil_ReturnValue) == 0x000240, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000248, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_InSlotType) == 0x000250, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_InSlotType' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_SwitchEnum_CmpSuccess) == 0x000251, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_MyGeometry) == 0x000254, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_InDeltaTime) == 0x00028C, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000290, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000298, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_BooleanOR_ReturnValue_2) == 0x0002A0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x0002A8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_bIsContractRequired) == 0x0002B0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_bIsContractRequired' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_Event_bIsWishlist) == 0x0002B1, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_Event_bIsWishlist' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_5) == 0x0002B2, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_IsValid_ReturnValue_6) == 0x0002B3, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0002B4, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0002B8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0002BC, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_VariableSet_BusyDuration_ImplicitCast) == 0x0002C0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_VariableSet_BusyDuration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, K2Node_VariableSet_BusyElapsedTime_ImplicitCast) == 0x0002C8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::K2Node_VariableSet_BusyElapsedTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_FCeil_A_ImplicitCast) == 0x0002D0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_FCeil_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0002D8, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item, CallFunc_UpdateBusyProgress_DT_ImplicitCast) == 0x0002E0, "Member 'W_Inventory_Item_C_ExecuteUbergraph_W_Inventory_Item::CallFunc_UpdateBusyProgress_DT_ImplicitCast' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.InitializeItemWidgetDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_Item_C_InitializeItemWidgetDesign final
{
public:
	EP2SlotWidgetType                             InSlotType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_InitializeItemWidgetDesign) == 0x000001, "Wrong alignment on W_Inventory_Item_C_InitializeItemWidgetDesign");
static_assert(sizeof(W_Inventory_Item_C_InitializeItemWidgetDesign) == 0x000001, "Wrong size on W_Inventory_Item_C_InitializeItemWidgetDesign");
static_assert(offsetof(W_Inventory_Item_C_InitializeItemWidgetDesign, InSlotType) == 0x000000, "Member 'W_Inventory_Item_C_InitializeItemWidgetDesign::InSlotType' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.OnDragDetected
// 0x00B8 (0x00B8 - 0x0000)
struct W_Inventory_Item_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_OnDragDetected) == 0x000008, "Wrong alignment on W_Inventory_Item_C_OnDragDetected");
static_assert(sizeof(W_Inventory_Item_C_OnDragDetected) == 0x0000B8, "Wrong size on W_Inventory_Item_C_OnDragDetected");
static_assert(offsetof(W_Inventory_Item_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'W_Inventory_Item_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'W_Inventory_Item_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnDragDetected, Operation) == 0x0000B0, "Member 'W_Inventory_Item_C_OnDragDetected::Operation' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.OnMouseButtonDown
// 0x03E0 (0x03E0 - 0x0000)
struct W_Inventory_Item_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0168(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0220(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputEvent                            CallFunc_GetInputEventFromPointerEvent_ReturnValue; // 0x0240(0x0020)()
	bool                                          CallFunc_CanInteractItem_ReturnValue;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputEvent_IsShiftDown_ReturnValue;       // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputEvent_IsAltDown_ReturnValue;         // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InputEvent_IsControlDown_ReturnValue;     // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInternalMagazine_ReturnValue;           // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMagazineSlotItem_ReturnValue;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0270(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0328(0x00B8)()
};
static_assert(alignof(W_Inventory_Item_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on W_Inventory_Item_C_OnMouseButtonDown");
static_assert(sizeof(W_Inventory_Item_C_OnMouseButtonDown) == 0x0003E0, "Wrong size on W_Inventory_Item_C_OnMouseButtonDown");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'W_Inventory_Item_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'W_Inventory_Item_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'W_Inventory_Item_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000168, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000220, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000238, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_GetInputEventFromPointerEvent_ReturnValue) == 0x000240, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_GetInputEventFromPointerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_CanInteractItem_ReturnValue) == 0x000260, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_CanInteractItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_InputEvent_IsShiftDown_ReturnValue) == 0x000261, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_InputEvent_IsShiftDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_InputEvent_IsAltDown_ReturnValue) == 0x000262, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_InputEvent_IsAltDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_InputEvent_IsControlDown_ReturnValue) == 0x000263, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_InputEvent_IsControlDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x000264, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_Not_PreBool_ReturnValue_1) == 0x000265, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_IsInternalMagazine_ReturnValue) == 0x000266, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_IsInternalMagazine_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x000267, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_IsMagazineSlotItem_ReturnValue) == 0x000268, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_IsMagazineSlotItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue_1) == 0x000269, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue_2) == 0x00026A, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_BooleanAND_ReturnValue_3) == 0x00026B, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_BooleanOR_ReturnValue) == 0x00026C, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000270, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue_1) == 0x000328, "Member 'W_Inventory_Item_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct W_Inventory_Item_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Inventory_Item_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_Inventory_Item_C_OnMouseEnter");
static_assert(sizeof(W_Inventory_Item_C_OnMouseEnter) == 0x0000B0, "Wrong size on W_Inventory_Item_C_OnMouseEnter");
static_assert(offsetof(W_Inventory_Item_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_Inventory_Item_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_Inventory_Item_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct W_Inventory_Item_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Inventory_Item_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_Inventory_Item_C_OnMouseLeave");
static_assert(sizeof(W_Inventory_Item_C_OnMouseLeave) == 0x000078, "Wrong size on W_Inventory_Item_C_OnMouseLeave");
static_assert(offsetof(W_Inventory_Item_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_Inventory_Item_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.ShowBusyTimer
// 0x0010 (0x0010 - 0x0000)
struct W_Inventory_Item_C_ShowBusyTimer final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimePassed;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplitPart;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsUser_0;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_ShowBusyTimer) == 0x000004, "Wrong alignment on W_Inventory_Item_C_ShowBusyTimer");
static_assert(sizeof(W_Inventory_Item_C_ShowBusyTimer) == 0x000010, "Wrong size on W_Inventory_Item_C_ShowBusyTimer");
static_assert(offsetof(W_Inventory_Item_C_ShowBusyTimer, Duration) == 0x000000, "Member 'W_Inventory_Item_C_ShowBusyTimer::Duration' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ShowBusyTimer, TimePassed) == 0x000004, "Member 'W_Inventory_Item_C_ShowBusyTimer::TimePassed' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ShowBusyTimer, SplitPart) == 0x000008, "Member 'W_Inventory_Item_C_ShowBusyTimer::SplitPart' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_ShowBusyTimer, bIsUser_0) == 0x00000C, "Member 'W_Inventory_Item_C_ShowBusyTimer::bIsUser_0' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Inventory_Item_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_Tick) == 0x000004, "Wrong alignment on W_Inventory_Item_C_Tick");
static_assert(sizeof(W_Inventory_Item_C_Tick) == 0x00003C, "Wrong size on W_Inventory_Item_C_Tick");
static_assert(offsetof(W_Inventory_Item_C_Tick, MyGeometry) == 0x000000, "Member 'W_Inventory_Item_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Inventory_Item_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.UpdateBusyProgress
// 0x0008 (0x0008 - 0x0000)
struct W_Inventory_Item_C_UpdateBusyProgress final
{
public:
	double                                        DT;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_UpdateBusyProgress) == 0x000008, "Wrong alignment on W_Inventory_Item_C_UpdateBusyProgress");
static_assert(sizeof(W_Inventory_Item_C_UpdateBusyProgress) == 0x000008, "Wrong size on W_Inventory_Item_C_UpdateBusyProgress");
static_assert(offsetof(W_Inventory_Item_C_UpdateBusyProgress, DT) == 0x000000, "Member 'W_Inventory_Item_C_UpdateBusyProgress::DT' has a wrong offset!");

// Function W_Inventory_Item.W_Inventory_Item_C.UpdateItemMark
// 0x0002 (0x0002 - 0x0000)
struct W_Inventory_Item_C_UpdateItemMark final
{
public:
	bool                                          bIsContractRequired;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsWishlist;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Item_C_UpdateItemMark) == 0x000001, "Wrong alignment on W_Inventory_Item_C_UpdateItemMark");
static_assert(sizeof(W_Inventory_Item_C_UpdateItemMark) == 0x000002, "Wrong size on W_Inventory_Item_C_UpdateItemMark");
static_assert(offsetof(W_Inventory_Item_C_UpdateItemMark, bIsContractRequired) == 0x000000, "Member 'W_Inventory_Item_C_UpdateItemMark::bIsContractRequired' has a wrong offset!");
static_assert(offsetof(W_Inventory_Item_C_UpdateItemMark, bIsWishlist) == 0x000001, "Member 'W_Inventory_Item_C_UpdateItemMark::bIsWishlist' has a wrong offset!");

}

