#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Slot_General

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_Slot_General.W_Inventory_Slot_General_C.ExecuteUbergraph_W_Inventory_Slot_General
// 0x0120 (0x0120 - 0x0000)
struct W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_4;                        // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_5;                        // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_6;                        // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_7;                        // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_8;                        // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_9;                        // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_10;                       // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EP2SlotWidgetType                             K2Node_Event_SlotIndex;                            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_11;                       // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_12;                       // 0x00DC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_13;                       // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_14;                       // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_15;                       // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General) == 0x000008, "Wrong alignment on W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General");
static_assert(sizeof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General) == 0x000120, "Wrong size on W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, EntryPoint) == 0x000000, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_1) == 0x000014, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_2) == 0x000024, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_3) == 0x000034, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_4) == 0x000044, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_4' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_5) == 0x000054, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_5' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_6) == 0x000064, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_6' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_7) == 0x000074, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_7' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_8) == 0x000084, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_8' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_9) == 0x000094, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_9' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_10) == 0x0000A4, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_10' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000B8, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0000C0, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_Event_SlotIndex) == 0x0000C8, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_Event_SlotIndex' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_SwitchEnum_CmpSuccess) == 0x0000C9, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_Event_IsDesignTime) == 0x0000CA, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_11) == 0x0000CC, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_11' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_12) == 0x0000DC, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_12' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_13) == 0x0000EC, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_13' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_14) == 0x0000FC, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_14' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General, K2Node_MakeStruct_Margin_15) == 0x00010C, "Member 'W_Inventory_Slot_General_C_ExecuteUbergraph_W_Inventory_Slot_General::K2Node_MakeStruct_Margin_15' has a wrong offset!");

// Function W_Inventory_Slot_General.W_Inventory_Slot_General_C.InitializeSlotDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_Slot_General_C_InitializeSlotDesign final
{
public:
	EP2SlotWidgetType                             SlotIndex;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Slot_General_C_InitializeSlotDesign) == 0x000001, "Wrong alignment on W_Inventory_Slot_General_C_InitializeSlotDesign");
static_assert(sizeof(W_Inventory_Slot_General_C_InitializeSlotDesign) == 0x000001, "Wrong size on W_Inventory_Slot_General_C_InitializeSlotDesign");
static_assert(offsetof(W_Inventory_Slot_General_C_InitializeSlotDesign, SlotIndex) == 0x000000, "Member 'W_Inventory_Slot_General_C_InitializeSlotDesign::SlotIndex' has a wrong offset!");

// Function W_Inventory_Slot_General.W_Inventory_Slot_General_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_Slot_General_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Slot_General_C_PreConstruct) == 0x000001, "Wrong alignment on W_Inventory_Slot_General_C_PreConstruct");
static_assert(sizeof(W_Inventory_Slot_General_C_PreConstruct) == 0x000001, "Wrong size on W_Inventory_Slot_General_C_PreConstruct");
static_assert(offsetof(W_Inventory_Slot_General_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Inventory_Slot_General_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Inventory_Slot_General.W_Inventory_Slot_General_C.UpdateSlotSize
// 0x0018 (0x0018 - 0x0000)
struct W_Inventory_Slot_General_C_UpdateSlotSize final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_Slot_General_C_UpdateSlotSize) == 0x000008, "Wrong alignment on W_Inventory_Slot_General_C_UpdateSlotSize");
static_assert(sizeof(W_Inventory_Slot_General_C_UpdateSlotSize) == 0x000018, "Wrong size on W_Inventory_Slot_General_C_UpdateSlotSize");
static_assert(offsetof(W_Inventory_Slot_General_C_UpdateSlotSize, CallFunc_BreakVector2D_X) == 0x000000, "Member 'W_Inventory_Slot_General_C_UpdateSlotSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_UpdateSlotSize, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'W_Inventory_Slot_General_C_UpdateSlotSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_UpdateSlotSize, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000010, "Member 'W_Inventory_Slot_General_C_UpdateSlotSize::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Inventory_Slot_General_C_UpdateSlotSize, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000014, "Member 'W_Inventory_Slot_General_C_UpdateSlotSize::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

