#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_Interact_Wearable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_Interact_Wearable.W_Inventory_Interact_Wearable_C
// 0x0030 (0x02E0 - 0x02B0)
class UW_Inventory_Interact_Wearable_C final : public UP2InteractWearableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               ContainerBgOverlay;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_InventorySlotGroup;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_HeadlineWidget_C*          Headline_BackpackSlot;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_C*               W_Inventory_Container;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Item_C*                    W_Inventory_Item;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_Interact_Wearable(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_Interact_Wearable_C">();
	}
	static class UW_Inventory_Interact_Wearable_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_Interact_Wearable_C>();
	}
};
static_assert(alignof(UW_Inventory_Interact_Wearable_C) == 0x000008, "Wrong alignment on UW_Inventory_Interact_Wearable_C");
static_assert(sizeof(UW_Inventory_Interact_Wearable_C) == 0x0002E0, "Wrong size on UW_Inventory_Interact_Wearable_C");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, UberGraphFrame) == 0x0002B0, "Member 'UW_Inventory_Interact_Wearable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, ContainerBgOverlay) == 0x0002B8, "Member 'UW_Inventory_Interact_Wearable_C::ContainerBgOverlay' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, HB_InventorySlotGroup) == 0x0002C0, "Member 'UW_Inventory_Interact_Wearable_C::HB_InventorySlotGroup' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, Headline_BackpackSlot) == 0x0002C8, "Member 'UW_Inventory_Interact_Wearable_C::Headline_BackpackSlot' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, W_Inventory_Container) == 0x0002D0, "Member 'UW_Inventory_Interact_Wearable_C::W_Inventory_Container' has a wrong offset!");
static_assert(offsetof(UW_Inventory_Interact_Wearable_C, W_Inventory_Item) == 0x0002D8, "Member 'UW_Inventory_Interact_Wearable_C::W_Inventory_Item' has a wrong offset!");

}

