#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InteractionWidget_Facility

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_InteractionWidget_Facility.W_InteractionWidget_Facility_C.ExecuteUbergraph_W_InteractionWidget_Facility
// 0x0008 (0x0008 - 0x0000)
struct W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility) == 0x000004, "Wrong alignment on W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility");
static_assert(sizeof(W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility) == 0x000008, "Wrong size on W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility");
static_assert(offsetof(W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility, EntryPoint) == 0x000000, "Member 'W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_InteractionWidget_Facility_C_ExecuteUbergraph_W_InteractionWidget_Facility::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_InteractionWidget_Facility.W_InteractionWidget_Facility_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_InteractionWidget_Facility_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_InteractionWidget_Facility_C_PreConstruct) == 0x000001, "Wrong alignment on W_InteractionWidget_Facility_C_PreConstruct");
static_assert(sizeof(W_InteractionWidget_Facility_C_PreConstruct) == 0x000001, "Wrong size on W_InteractionWidget_Facility_C_PreConstruct");
static_assert(offsetof(W_InteractionWidget_Facility_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_InteractionWidget_Facility_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

