#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_InventoryGridMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_InventoryGridMain.W_InventoryGridMain_C
// 0x0140 (0x08F0 - 0x07B0)
class UW_InventoryGridMain_C final : public UP2InventoryMainWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BB_Inventory;                                      // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_InventoryBg;                                   // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_KeyguideBg;                                    // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_TestGearNoticeBg;                              // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_DropZone_C*                DropZone_Interact;                                 // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_DropZone_C*                DropZone_Inventory;                                // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_InventoryMain;                                  // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BottomLine;                                    // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EquipmentDivider;                              // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_FastAccessDivider;                             // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_GNB_Line;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SecuredDivider;                                // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlowAccessDivider;                             // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Vignette_BL;                                   // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Vignette_BR;                                   // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Vignette_TL;                                   // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Vignette_TR;                                   // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_InventoryBg;                                   // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           R_Curved_Deco;                                     // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_C*            Slot_Facegear;                                     // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_C*            Slot_Headset;                                      // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Containers;                                    // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_InventorySlots;                                // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Loadout;                                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Root;                                          // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ResupplyErrorMsg;                              // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Title;                                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_SkillSlot_C*               W_DroneSlot;                                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_DeadBodyWidget_C*          W_Inventory_DeadBodyWidget;                        // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_DropZone_C*                W_Inventory_DropZone;                              // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Stash_C*                   W_Inventory_Stash;                                 // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_ContextMenu;                            // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_MoveItem;                               // 0x08B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_SkillSlot_C*               W_MultitoolSlot;                                   // 0x08C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerBalanceWidget_C*               W_PlayerBalanceWidget;                             // 0x08C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerLevelWidget_C*                 W_PlayerLevelWidget;                               // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SystemMenuButton_C*                  W_SystemMenuButton;                                // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_NoticeText;                                     // 0x08E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHideoutTest;                                     // 0x08E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeactivated()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_InventoryGridMain(int32 EntryPoint)	 // 0xae1e64;
	void OnItemMouseHoverEvent_Event(class UP2InventoryItemWidget* InItemWidget)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetInventoryOutgameDimensions(bool IsHideout)	 // 0xae1e64;
	void SetWidgetDesign_ImplementableEvent(bool bInLaptop)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_InventoryGridMain_C">();
	}
	static class UW_InventoryGridMain_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_InventoryGridMain_C>();
	}
};
static_assert(alignof(UW_InventoryGridMain_C) == 0x000008, "Wrong alignment on UW_InventoryGridMain_C");
static_assert(sizeof(UW_InventoryGridMain_C) == 0x0008F0, "Wrong size on UW_InventoryGridMain_C");
static_assert(offsetof(UW_InventoryGridMain_C, UberGraphFrame) == 0x0007B0, "Member 'UW_InventoryGridMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, BB_Inventory) == 0x0007B8, "Member 'UW_InventoryGridMain_C::BB_Inventory' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Bdr_InventoryBg) == 0x0007C0, "Member 'UW_InventoryGridMain_C::Bdr_InventoryBg' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Bdr_KeyguideBg) == 0x0007C8, "Member 'UW_InventoryGridMain_C::Bdr_KeyguideBg' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Bdr_TestGearNoticeBg) == 0x0007D0, "Member 'UW_InventoryGridMain_C::Bdr_TestGearNoticeBg' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, DropZone_Interact) == 0x0007D8, "Member 'UW_InventoryGridMain_C::DropZone_Interact' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, DropZone_Inventory) == 0x0007E0, "Member 'UW_InventoryGridMain_C::DropZone_Inventory' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, HB_InventoryMain) == 0x0007E8, "Member 'UW_InventoryGridMain_C::HB_InventoryMain' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_BottomLine) == 0x0007F0, "Member 'UW_InventoryGridMain_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_EquipmentDivider) == 0x0007F8, "Member 'UW_InventoryGridMain_C::Img_EquipmentDivider' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_FastAccessDivider) == 0x000800, "Member 'UW_InventoryGridMain_C::Img_FastAccessDivider' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_GNB_Line) == 0x000808, "Member 'UW_InventoryGridMain_C::Img_GNB_Line' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_SecuredDivider) == 0x000810, "Member 'UW_InventoryGridMain_C::Img_SecuredDivider' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_SlowAccessDivider) == 0x000818, "Member 'UW_InventoryGridMain_C::Img_SlowAccessDivider' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_Vignette_BL) == 0x000820, "Member 'UW_InventoryGridMain_C::Img_Vignette_BL' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_Vignette_BR) == 0x000828, "Member 'UW_InventoryGridMain_C::Img_Vignette_BR' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_Vignette_TL) == 0x000830, "Member 'UW_InventoryGridMain_C::Img_Vignette_TL' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Img_Vignette_TR) == 0x000838, "Member 'UW_InventoryGridMain_C::Img_Vignette_TR' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Ovr_InventoryBg) == 0x000840, "Member 'UW_InventoryGridMain_C::Ovr_InventoryBg' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, R_Curved_Deco) == 0x000848, "Member 'UW_InventoryGridMain_C::R_Curved_Deco' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Slot_Facegear) == 0x000850, "Member 'UW_InventoryGridMain_C::Slot_Facegear' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Slot_Headset) == 0x000858, "Member 'UW_InventoryGridMain_C::Slot_Headset' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, SzB_Containers) == 0x000860, "Member 'UW_InventoryGridMain_C::SzB_Containers' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, SzB_InventorySlots) == 0x000868, "Member 'UW_InventoryGridMain_C::SzB_InventorySlots' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, SzB_Loadout) == 0x000870, "Member 'UW_InventoryGridMain_C::SzB_Loadout' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, SzB_Root) == 0x000878, "Member 'UW_InventoryGridMain_C::SzB_Root' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Txt_ResupplyErrorMsg) == 0x000880, "Member 'UW_InventoryGridMain_C::Txt_ResupplyErrorMsg' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, Txt_Title) == 0x000888, "Member 'UW_InventoryGridMain_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_DroneSlot) == 0x000890, "Member 'UW_InventoryGridMain_C::W_DroneSlot' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_Inventory_DeadBodyWidget) == 0x000898, "Member 'UW_InventoryGridMain_C::W_Inventory_DeadBodyWidget' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_Inventory_DropZone) == 0x0008A0, "Member 'UW_InventoryGridMain_C::W_Inventory_DropZone' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_Inventory_Stash) == 0x0008A8, "Member 'UW_InventoryGridMain_C::W_Inventory_Stash' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_Keyguide_ContextMenu) == 0x0008B0, "Member 'UW_InventoryGridMain_C::W_Keyguide_ContextMenu' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_Keyguide_MoveItem) == 0x0008B8, "Member 'UW_InventoryGridMain_C::W_Keyguide_MoveItem' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_MultitoolSlot) == 0x0008C0, "Member 'UW_InventoryGridMain_C::W_MultitoolSlot' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_PlayerBalanceWidget) == 0x0008C8, "Member 'UW_InventoryGridMain_C::W_PlayerBalanceWidget' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_PlayerLevelWidget) == 0x0008D0, "Member 'UW_InventoryGridMain_C::W_PlayerLevelWidget' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, W_SystemMenuButton) == 0x0008D8, "Member 'UW_InventoryGridMain_C::W_SystemMenuButton' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, WS_NoticeText) == 0x0008E0, "Member 'UW_InventoryGridMain_C::WS_NoticeText' has a wrong offset!");
static_assert(offsetof(UW_InventoryGridMain_C, IsHideoutTest) == 0x0008E8, "Member 'UW_InventoryGridMain_C::IsHideoutTest' has a wrong offset!");

}

