#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ContextMenu_ListSubWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget
// 0x0070 (0x0070 - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsWishlist;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ContextMenuStatus                          K2Node_Event_InContextMenuStatus;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget) == 0x000004, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget) == 0x000070, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, EntryPoint) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_Event_bIsWishlist) == 0x000004, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_Event_bIsWishlist' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_Event_MyGeometry) == 0x000030, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_Event_InDeltaTime) == 0x000068, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_Event_InContextMenuStatus) == 0x00006C, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_Event_InContextMenuStatus' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget, K2Node_SwitchEnum_CmpSuccess) == 0x00006D, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_ExecuteUbergraph_W_Inventory_ContextMenu_ListSubWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.IsEnabled
// 0x0018 (0x0018 - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2Consumable*                          K2Node_DynamicCast_AsP2Consumable;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeConsumed_ReturnValue;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled) == 0x000008, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled) == 0x000018, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled, Value) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled::Value' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled, K2Node_DynamicCast_AsP2Consumable) == 0x000008, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled::K2Node_DynamicCast_AsP2Consumable' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled, CallFunc_CanBeConsumed_ReturnValue) == 0x000012, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_IsEnabled::CallFunc_CanBeConsumed_ReturnValue' has a wrong offset!");

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.NativeConstruct_WishList
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList final
{
public:
	bool                                          bIsWishlist;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList) == 0x000001, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList) == 0x000001, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList, bIsWishlist) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_NativeConstruct_WishList::bIsWishlist' has a wrong offset!");

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.SetEnabled
// 0x0003 (0x0003 - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled) == 0x000001, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled) == 0x000003, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled, bEnabled) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled::bEnabled' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled, CallFunc_GetIsEnabled_ReturnValue) == 0x000001, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000002, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_SetEnabled::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.SetStatus_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent final
{
public:
	EP2ContextMenuStatus                          InContextMenuStatus;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent) == 0x000001, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent) == 0x000001, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent, InContextMenuStatus) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_SetStatus_ImplementableEvent::InContextMenuStatus' has a wrong offset!");

// Function W_Inventory_ContextMenu_ListSubWidget.W_Inventory_ContextMenu_ListSubWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Inventory_ContextMenu_ListSubWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ContextMenu_ListSubWidget_C_Tick) == 0x000004, "Wrong alignment on W_Inventory_ContextMenu_ListSubWidget_C_Tick");
static_assert(sizeof(W_Inventory_ContextMenu_ListSubWidget_C_Tick) == 0x00003C, "Wrong size on W_Inventory_ContextMenu_ListSubWidget_C_Tick");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Inventory_ContextMenu_ListSubWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Inventory_ContextMenu_ListSubWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

