#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_TestGearLoadoutTitleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.SetTestGearTitle
// 0x0018 (0x0018 - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle) == 0x000008, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle) == 0x000018, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle, InTitle) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetTestGearTitle::InTitle' has a wrong offset!");

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.SetIsUnavailable
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable final
{
public:
	bool                                          bIsUnavailable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable) == 0x000001, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable) == 0x000001, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable, bIsUnavailable) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetIsUnavailable::bIsUnavailable' has a wrong offset!");

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.SetIsFactionTestGearTitle
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle final
{
public:
	bool                                          bIsFactionTestGearTitle;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle) == 0x000001, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle) == 0x000001, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle, bIsFactionTestGearTitle) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetIsFactionTestGearTitle::bIsFactionTestGearTitle' has a wrong offset!");

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.SetFactionReputationValue
// 0x000C (0x000C - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InReputation;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxReputation;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue) == 0x000004, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue) == 0x00000C, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue, InLevel) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue::InLevel' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue, InReputation) == 0x000004, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue::InReputation' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue, InMaxReputation) == 0x000008, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_SetFactionReputationValue::InMaxReputation' has a wrong offset!");

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Inventory_TestGearLoadoutTitleWidget.W_Inventory_TestGearLoadoutTitleWidget_C.ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget
// 0x01A0 (0x01A0 - 0x0000)
struct W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InTitle;                              // 0x0008(0x0018)(ConstParm)
	bool                                          K2Node_Event_bIsFactionTestGearTitle;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsUnavailable;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InLevel;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InReputation;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxReputation;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0158(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0170(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0184(0x0014)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget) == 0x000008, "Wrong alignment on W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget");
static_assert(sizeof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget) == 0x0001A0, "Wrong size on W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, EntryPoint) == 0x000000, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_InTitle) == 0x000008, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_InTitle' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_bIsFactionTestGearTitle) == 0x000020, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_bIsFactionTestGearTitle' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_bIsUnavailable) == 0x000021, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_bIsUnavailable' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_InLevel) == 0x000024, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_InLevel' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_InReputation) == 0x000028, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_InReputation' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_Event_InMaxReputation) == 0x00002C, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_Event_InMaxReputation' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000040, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000098, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeArray_Array) == 0x0000A0, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000E0, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000F8, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeArray_Array_1) == 0x000148, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_Format_ReturnValue_1) == 0x000158, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeStruct_SlateColor) == 0x000170, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, K2Node_MakeStruct_SlateColor_1) == 0x000184, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000198, "Member 'W_Inventory_TestGearLoadoutTitleWidget_C_ExecuteUbergraph_W_Inventory_TestGearLoadoutTitleWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

}

