#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ContextMenu_ListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_ContextMenu_ListWidget.W_Inventory_ContextMenu_ListWidget_C
// 0x0040 (0x0678 - 0x0638)
class UW_Inventory_ContextMenu_ListWidget_C final : public UP2ContextMenuListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                VB_ContextMenuBg;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Item*                                MyItem;                                            // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                MyInventory;                                       // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        MouseOffset;                                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ScreenSize;                                        // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsHover;                                          // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_ContextMenu_ListWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)	 // 0xae1e64;
	void OnMouseLeave(const struct FPointerEvent& MouseEvent)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_ContextMenu_ListWidget_C">();
	}
	static class UW_Inventory_ContextMenu_ListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_ContextMenu_ListWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_ContextMenu_ListWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_ContextMenu_ListWidget_C");
static_assert(sizeof(UW_Inventory_ContextMenu_ListWidget_C) == 0x000678, "Wrong size on UW_Inventory_ContextMenu_ListWidget_C");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, UberGraphFrame) == 0x000638, "Member 'UW_Inventory_ContextMenu_ListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, VB_ContextMenuBg) == 0x000640, "Member 'UW_Inventory_ContextMenu_ListWidget_C::VB_ContextMenuBg' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, MyItem) == 0x000648, "Member 'UW_Inventory_ContextMenu_ListWidget_C::MyItem' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, MyInventory) == 0x000650, "Member 'UW_Inventory_ContextMenu_ListWidget_C::MyInventory' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, MouseOffset) == 0x000658, "Member 'UW_Inventory_ContextMenu_ListWidget_C::MouseOffset' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, ScreenSize) == 0x000660, "Member 'UW_Inventory_ContextMenu_ListWidget_C::ScreenSize' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ContextMenu_ListWidget_C, bIsHover) == 0x000670, "Member 'UW_Inventory_ContextMenu_ListWidget_C::bIsHover' has a wrong offset!");

}

