#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ResupplyItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Inventory_ResupplyItemWidget.W_Inventory_ResupplyItemWidget_C.RefreshStockWidgetOnBP
// 0x0004 (0x0004 - 0x0000)
struct W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP final
{
public:
	int32                                         InStockCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP) == 0x000004, "Wrong alignment on W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP");
static_assert(sizeof(W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP) == 0x000004, "Wrong size on W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP, InStockCount) == 0x000000, "Member 'W_Inventory_ResupplyItemWidget_C_RefreshStockWidgetOnBP::InStockCount' has a wrong offset!");

// Function W_Inventory_ResupplyItemWidget.W_Inventory_ResupplyItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_ResupplyItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ResupplyItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Inventory_ResupplyItemWidget_C_PreConstruct");
static_assert(sizeof(W_Inventory_ResupplyItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Inventory_ResupplyItemWidget_C_PreConstruct");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Inventory_ResupplyItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Inventory_ResupplyItemWidget.W_Inventory_ResupplyItemWidget_C.ExecuteUbergraph_W_Inventory_ResupplyItemWidget
// 0x0038 (0x0038 - 0x0000)
struct W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InStockCount;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget) == 0x000004, "Wrong alignment on W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget");
static_assert(sizeof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget) == 0x000038, "Wrong size on W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, EntryPoint) == 0x000000, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, K2Node_Event_InStockCount) == 0x000030, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::K2Node_Event_InStockCount' has a wrong offset!");
static_assert(offsetof(W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'W_Inventory_ResupplyItemWidget_C_ExecuteUbergraph_W_Inventory_ResupplyItemWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

