#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_SplitItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_SplitItem.W_Inventory_SplitItem_C
// 0x0048 (0x0618 - 0x05D0)
class UW_Inventory_SplitItem_C final : public UP2SplitItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Bg;                                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_SplitItemPopup;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Item*                                MyItemToSplit;                                     // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UP2Container*                           MyContainer;                                       // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FPositionInfo                          MyItemPositionInfo;                                // 0x05F8(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UP2Item* InItem, int32 InAmount, bool InResult, class UUserWidget* InWidget, class UP2Container* InContainer, const struct FPositionInfo& InItemPositionInfo, bool InShoudDrop)> OnSplitItemFinish; // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	bool                                          bShouldDrop;                                       // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OldSliderValue;                                    // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__W_Inventory_SplitItem_SplitSlider_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value)	 // 0xae1e64;
	void BndEvt__W_SplitItemWidget_Btn_Accept_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_SplitItemWidget_Btn_Cancel_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Inventory_SplitItem(int32 EntryPoint)	 // 0xae1e64;
	int32 GetMaxAmount()	 // 0xae1e64;
	void GetSize(struct FVector2D* OutSize)	 // 0xae1e64;
	void OnBackAction_1()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_SplitItem_C">();
	}
	static class UW_Inventory_SplitItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_SplitItem_C>();
	}
};
static_assert(alignof(UW_Inventory_SplitItem_C) == 0x000008, "Wrong alignment on UW_Inventory_SplitItem_C");
static_assert(sizeof(UW_Inventory_SplitItem_C) == 0x000618, "Wrong size on UW_Inventory_SplitItem_C");
static_assert(offsetof(UW_Inventory_SplitItem_C, UberGraphFrame) == 0x0005D0, "Member 'UW_Inventory_SplitItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, Img_Bg) == 0x0005D8, "Member 'UW_Inventory_SplitItem_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, SzB_SplitItemPopup) == 0x0005E0, "Member 'UW_Inventory_SplitItem_C::SzB_SplitItemPopup' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, MyItemToSplit) == 0x0005E8, "Member 'UW_Inventory_SplitItem_C::MyItemToSplit' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, MyContainer) == 0x0005F0, "Member 'UW_Inventory_SplitItem_C::MyContainer' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, MyItemPositionInfo) == 0x0005F8, "Member 'UW_Inventory_SplitItem_C::MyItemPositionInfo' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, OnSplitItemFinish) == 0x000600, "Member 'UW_Inventory_SplitItem_C::OnSplitItemFinish' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, bShouldDrop) == 0x000610, "Member 'UW_Inventory_SplitItem_C::bShouldDrop' has a wrong offset!");
static_assert(offsetof(UW_Inventory_SplitItem_C, OldSliderValue) == 0x000614, "Member 'UW_Inventory_SplitItem_C::OldSliderValue' has a wrong offset!");

}

