#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_HeadlineWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Inventory_HeadlineWidget.W_Inventory_HeadlineWidget_C.ExecuteUbergraph_W_Inventory_HeadlineWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInventoryLocked;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget) == 0x000004, "Wrong alignment on W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget");
static_assert(sizeof(W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget) == 0x000008, "Wrong size on W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget");
static_assert(offsetof(W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget, EntryPoint) == 0x000000, "Member 'W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget, K2Node_Event_bInventoryLocked) == 0x000005, "Member 'W_Inventory_HeadlineWidget_C_ExecuteUbergraph_W_Inventory_HeadlineWidget::K2Node_Event_bInventoryLocked' has a wrong offset!");

// Function W_Inventory_HeadlineWidget.W_Inventory_HeadlineWidget_C.OnContainerLocked
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_HeadlineWidget_C_OnContainerLocked final
{
public:
	bool                                          bInventoryLocked;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_HeadlineWidget_C_OnContainerLocked) == 0x000001, "Wrong alignment on W_Inventory_HeadlineWidget_C_OnContainerLocked");
static_assert(sizeof(W_Inventory_HeadlineWidget_C_OnContainerLocked) == 0x000001, "Wrong size on W_Inventory_HeadlineWidget_C_OnContainerLocked");
static_assert(offsetof(W_Inventory_HeadlineWidget_C_OnContainerLocked, bInventoryLocked) == 0x000000, "Member 'W_Inventory_HeadlineWidget_C_OnContainerLocked::bInventoryLocked' has a wrong offset!");

// Function W_Inventory_HeadlineWidget.W_Inventory_HeadlineWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_HeadlineWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_HeadlineWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Inventory_HeadlineWidget_C_PreConstruct");
static_assert(sizeof(W_Inventory_HeadlineWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Inventory_HeadlineWidget_C_PreConstruct");
static_assert(offsetof(W_Inventory_HeadlineWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Inventory_HeadlineWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

