#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_ItemDetails_Chambers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_ItemDetails_Chambers.W_Inventory_ItemDetails_Chambers_C
// 0x0028 (0x02E0 - 0x02B8)
class UW_Inventory_ItemDetails_Chambers_C final : public UP2DetailPopupChambersWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AttachmentSlotTitleText;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_MagEmpty;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_AttachmentSlots;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_DetailsAttachmentSlot_C*   W_Inventory_DetailsAttachmentSlot;                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_ItemDetails_Chambers(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_ItemDetails_Chambers_C">();
	}
	static class UW_Inventory_ItemDetails_Chambers_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_ItemDetails_Chambers_C>();
	}
};
static_assert(alignof(UW_Inventory_ItemDetails_Chambers_C) == 0x000008, "Wrong alignment on UW_Inventory_ItemDetails_Chambers_C");
static_assert(sizeof(UW_Inventory_ItemDetails_Chambers_C) == 0x0002E0, "Wrong size on UW_Inventory_ItemDetails_Chambers_C");
static_assert(offsetof(UW_Inventory_ItemDetails_Chambers_C, UberGraphFrame) == 0x0002B8, "Member 'UW_Inventory_ItemDetails_Chambers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chambers_C, AttachmentSlotTitleText) == 0x0002C0, "Member 'UW_Inventory_ItemDetails_Chambers_C::AttachmentSlotTitleText' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chambers_C, Img_MagEmpty) == 0x0002C8, "Member 'UW_Inventory_ItemDetails_Chambers_C::Img_MagEmpty' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chambers_C, SzB_AttachmentSlots) == 0x0002D0, "Member 'UW_Inventory_ItemDetails_Chambers_C::SzB_AttachmentSlots' has a wrong offset!");
static_assert(offsetof(UW_Inventory_ItemDetails_Chambers_C, W_Inventory_DetailsAttachmentSlot) == 0x0002D8, "Member 'UW_Inventory_ItemDetails_Chambers_C::W_Inventory_DetailsAttachmentSlot' has a wrong offset!");

}

