#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_WearableSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_WearableSlot.W_Inventory_WearableSlot_C
// 0x0028 (0x0368 - 0x0340)
class UW_Inventory_WearableSlot_C final : public UP2WearableSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_InventorySlotGroup;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_Container_Wearable_C*      W_Inventory_Container_Wearable;                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_ExtraSlot_C*               W_Inventory_ExtraSlot;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInactive;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Inventory_WearableSlot(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UpdateEquipState(bool IsEquippedState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_WearableSlot_C">();
	}
	static class UW_Inventory_WearableSlot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_WearableSlot_C>();
	}
};
static_assert(alignof(UW_Inventory_WearableSlot_C) == 0x000008, "Wrong alignment on UW_Inventory_WearableSlot_C");
static_assert(sizeof(UW_Inventory_WearableSlot_C) == 0x000368, "Wrong size on UW_Inventory_WearableSlot_C");
static_assert(offsetof(UW_Inventory_WearableSlot_C, UberGraphFrame) == 0x000340, "Member 'UW_Inventory_WearableSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Inventory_WearableSlot_C, HB_InventorySlotGroup) == 0x000348, "Member 'UW_Inventory_WearableSlot_C::HB_InventorySlotGroup' has a wrong offset!");
static_assert(offsetof(UW_Inventory_WearableSlot_C, W_Inventory_Container_Wearable) == 0x000350, "Member 'UW_Inventory_WearableSlot_C::W_Inventory_Container_Wearable' has a wrong offset!");
static_assert(offsetof(UW_Inventory_WearableSlot_C, W_Inventory_ExtraSlot) == 0x000358, "Member 'UW_Inventory_WearableSlot_C::W_Inventory_ExtraSlot' has a wrong offset!");
static_assert(offsetof(UW_Inventory_WearableSlot_C, bIsInactive) == 0x000360, "Member 'UW_Inventory_WearableSlot_C::bIsInactive' has a wrong offset!");

}

