#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_AttachmentIndicator

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Inventory_AttachmentIndicator.W_Inventory_AttachmentIndicator_C.ExecuteUbergraph_W_Inventory_AttachmentIndicator
// 0x0008 (0x0008 - 0x0000)
struct W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsEquipped;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator) == 0x000004, "Wrong alignment on W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator");
static_assert(sizeof(W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator) == 0x000008, "Wrong size on W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator");
static_assert(offsetof(W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator, EntryPoint) == 0x000000, "Member 'W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator, K2Node_Event_bIsEquipped) == 0x000004, "Member 'W_Inventory_AttachmentIndicator_C_ExecuteUbergraph_W_Inventory_AttachmentIndicator::K2Node_Event_bIsEquipped' has a wrong offset!");

// Function W_Inventory_AttachmentIndicator.W_Inventory_AttachmentIndicator_C.SetIsEquipped_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent final
{
public:
	bool                                          bIsEquipped;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent) == 0x000001, "Wrong alignment on W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent");
static_assert(sizeof(W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent) == 0x000001, "Wrong size on W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent");
static_assert(offsetof(W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent, bIsEquipped) == 0x000000, "Member 'W_Inventory_AttachmentIndicator_C_SetIsEquipped_ImplementableEvent::bIsEquipped' has a wrong offset!");

}

