#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Inventory_DeadBodyWidget

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Inventory_DeadBodyWidget.W_Inventory_DeadBodyWidget_C
// 0x0040 (0x0300 - 0x02C0)
class UW_Inventory_DeadBodyWidget_C final : public UP2InventoryDeadbodyWidget
{
public:
	class UW_Inventory_WearableSlot_DeadBody_C*   ArmArmorSlotWidget;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_DeadBody_C*   HelmetSlotWidget;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_DeadBody_C*   LegArmorSlotWidget;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_DeadBody_C*   Slot_Facegear;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_WearableSlot_DeadBody_C*   Slot_Headset;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_InternalContainer_Deadbody_C* W_Inventory_DroneSlot;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_InternalContainer_Deadbody_C* W_Inventory_InternalContainer_Deadbody;         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Inventory_DeadBodyWidget_C">();
	}
	static class UW_Inventory_DeadBodyWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Inventory_DeadBodyWidget_C>();
	}
};
static_assert(alignof(UW_Inventory_DeadBodyWidget_C) == 0x000008, "Wrong alignment on UW_Inventory_DeadBodyWidget_C");
static_assert(sizeof(UW_Inventory_DeadBodyWidget_C) == 0x000300, "Wrong size on UW_Inventory_DeadBodyWidget_C");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, ArmArmorSlotWidget) == 0x0002C0, "Member 'UW_Inventory_DeadBodyWidget_C::ArmArmorSlotWidget' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, HelmetSlotWidget) == 0x0002C8, "Member 'UW_Inventory_DeadBodyWidget_C::HelmetSlotWidget' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, Img_Pattern) == 0x0002D0, "Member 'UW_Inventory_DeadBodyWidget_C::Img_Pattern' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, LegArmorSlotWidget) == 0x0002D8, "Member 'UW_Inventory_DeadBodyWidget_C::LegArmorSlotWidget' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, Slot_Facegear) == 0x0002E0, "Member 'UW_Inventory_DeadBodyWidget_C::Slot_Facegear' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, Slot_Headset) == 0x0002E8, "Member 'UW_Inventory_DeadBodyWidget_C::Slot_Headset' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, W_Inventory_DroneSlot) == 0x0002F0, "Member 'UW_Inventory_DeadBodyWidget_C::W_Inventory_DroneSlot' has a wrong offset!");
static_assert(offsetof(UW_Inventory_DeadBodyWidget_C, W_Inventory_InternalContainer_Deadbody) == 0x0002F8, "Member 'UW_Inventory_DeadBodyWidget_C::W_Inventory_InternalContainer_Deadbody' has a wrong offset!");

}

