#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_ItemWidget.W_ItemProduction_ItemWidget_C
// 0x00B0 (0x0468 - 0x03B8)
class UW_ItemProduction_ItemWidget_C final : public UP2ProductionItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_BonusInfo;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Close;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_CloseGroup;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_GroupNum;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_ItemName;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Quantity;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Time;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Unavailable;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_CloseIcon;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_Bottom;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Deco_Right;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotBg;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotOutline;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TimeIcon;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_GroupNum;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected_0;                                      // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAvailable_0;                                     // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty_0;                                         // 0x0442(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsItemGroup_0;                                     // 0x0443(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRightSided_0;                                    // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ItemGradeColor;                                    // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ItemGradeGradientColor;                            // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void SetState(bool IsSelected_0, bool IsItemGroup_0, bool IsAvailable_0, bool IsLocked_0)	 // 0xae1e64;
	void SetItemGroupNum(bool IsItemGroup_0, bool IsSelected_0)	 // 0xae1e64;
	void SetItemGradeColor(const struct FLinearColor& ItemGradeColor_0, const struct FLinearColor& ItemGradeGradientColor_0)	 // 0xae1e64;
	void SetEmptyState(bool IsEmpty_0)	 // 0xae1e64;
	void SetBonusInfo(bool HasBonusInfo_0)	 // 0xae1e64;
	void RepositionItemGroupWidgetOnBP(EP2ProductionItemGroupDirection InDirection)	 // 0xae1e64;
	void RefreshWidgetOnBP()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_ItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void BndEvt__W_Crafting_ItemWidget_Btn_Item_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Crafting_ItemWidget_Btn_Item_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_ItemWidget_C">();
	}
	static class UW_ItemProduction_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_ItemWidget_C>();
	}
};
static_assert(alignof(UW_ItemProduction_ItemWidget_C) == 0x000008, "Wrong alignment on UW_ItemProduction_ItemWidget_C");
static_assert(sizeof(UW_ItemProduction_ItemWidget_C) == 0x000468, "Wrong size on UW_ItemProduction_ItemWidget_C");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, UberGraphFrame) == 0x0003B8, "Member 'UW_ItemProduction_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_BonusInfo) == 0x0003C0, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_BonusInfo' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_Close) == 0x0003C8, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_Close' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_CloseGroup) == 0x0003D0, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_CloseGroup' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_GroupNum) == 0x0003D8, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_GroupNum' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_ItemName) == 0x0003E0, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_ItemName' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_Quantity) == 0x0003E8, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_Quantity' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_Time) == 0x0003F0, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_Time' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Bdr_Unavailable) == 0x0003F8, "Member 'UW_ItemProduction_ItemWidget_C::Bdr_Unavailable' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_CloseIcon) == 0x000400, "Member 'UW_ItemProduction_ItemWidget_C::Img_CloseIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_Deco_Bottom) == 0x000408, "Member 'UW_ItemProduction_ItemWidget_C::Img_Deco_Bottom' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_Deco_Right) == 0x000410, "Member 'UW_ItemProduction_ItemWidget_C::Img_Deco_Right' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_SlotBg) == 0x000418, "Member 'UW_ItemProduction_ItemWidget_C::Img_SlotBg' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_SlotOutline) == 0x000420, "Member 'UW_ItemProduction_ItemWidget_C::Img_SlotOutline' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, Img_TimeIcon) == 0x000428, "Member 'UW_ItemProduction_ItemWidget_C::Img_TimeIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, SzB_GroupNum) == 0x000430, "Member 'UW_ItemProduction_ItemWidget_C::SzB_GroupNum' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, W_CommonItemWidget) == 0x000438, "Member 'UW_ItemProduction_ItemWidget_C::W_CommonItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, IsSelected_0) == 0x000440, "Member 'UW_ItemProduction_ItemWidget_C::IsSelected_0' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, IsAvailable_0) == 0x000441, "Member 'UW_ItemProduction_ItemWidget_C::IsAvailable_0' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, IsEmpty_0) == 0x000442, "Member 'UW_ItemProduction_ItemWidget_C::IsEmpty_0' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, IsItemGroup_0) == 0x000443, "Member 'UW_ItemProduction_ItemWidget_C::IsItemGroup_0' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, IsRightSided_0) == 0x000444, "Member 'UW_ItemProduction_ItemWidget_C::IsRightSided_0' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, ItemGradeColor) == 0x000448, "Member 'UW_ItemProduction_ItemWidget_C::ItemGradeColor' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemWidget_C, ItemGradeGradientColor) == 0x000458, "Member 'UW_ItemProduction_ItemWidget_C::ItemGradeGradientColor' has a wrong offset!");

}

