#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ResultListWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_ItemProduction_ResultListWidget.W_ItemProduction_ResultListWidget_C.RefreshClaimStateOnBP
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP final
{
public:
	bool                                          InClaimed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP) == 0x000001, "Wrong alignment on W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP");
static_assert(sizeof(W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP) == 0x000001, "Wrong size on W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP, InClaimed) == 0x000000, "Member 'W_ItemProduction_ResultListWidget_C_RefreshClaimStateOnBP::InClaimed' has a wrong offset!");

// Function W_ItemProduction_ResultListWidget.W_ItemProduction_ResultListWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ResultListWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ResultListWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ItemProduction_ResultListWidget_C_PreConstruct");
static_assert(sizeof(W_ItemProduction_ResultListWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ItemProduction_ResultListWidget_C_PreConstruct");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ItemProduction_ResultListWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ItemProduction_ResultListWidget.W_ItemProduction_ResultListWidget_C.ExecuteUbergraph_W_ItemProduction_ResultListWidget
// 0x0008 (0x0008 - 0x0000)
struct W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InClaimed;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget) == 0x000004, "Wrong alignment on W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget");
static_assert(sizeof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget) == 0x000008, "Wrong size on W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget, EntryPoint) == 0x000000, "Member 'W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget, K2Node_Event_InClaimed) == 0x000005, "Member 'W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget::K2Node_Event_InClaimed' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget, K2Node_Event_IsDesignTime) == 0x000006, "Member 'W_ItemProduction_ResultListWidget_C_ExecuteUbergraph_W_ItemProduction_ResultListWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

