#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_QueueSlotWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"


namespace SDK::Params
{

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.SetSelectedState
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_SetSelectedState final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_SetSelectedState) == 0x000001, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_SetSelectedState");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_SetSelectedState) == 0x000001, "Wrong size on W_ItemProduction_QueueSlotWidget_C_SetSelectedState");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetSelectedState, IsSelected_0) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_SetSelectedState::IsSelected_0' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.SetQueueSlotState
// 0x0008 (0x0008 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState final
{
public:
	int32                                         QueueSlotStateInt_0;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState) == 0x000004, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState) == 0x000008, "Wrong size on W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState, QueueSlotStateInt_0) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState::QueueSlotStateInt_0' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'W_ItemProduction_QueueSlotWidget_C_SetQueueSlotState::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.SetProgress
// 0x00B0 (0x00B0 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_SetProgress final
{
public:
	double                                        ProgressFloat_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_SetProgress) == 0x000008, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_SetProgress");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_SetProgress) == 0x0000B0, "Wrong size on W_ItemProduction_QueueSlotWidget_C_SetProgress");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, ProgressFloat_0) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::ProgressFloat_0' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000008, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000018, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, K2Node_MakeArray_Array) == 0x000080, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, CallFunc_Format_ReturnValue) == 0x000090, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000A8, "Member 'W_ItemProduction_QueueSlotWidget_C_SetProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.SetIsSelected_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent) == 0x000001, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent) == 0x000001, "Wrong size on W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent, InIsSelected) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_SetIsSelected_ImplementableEvent::InIsSelected' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_PreConstruct");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ItemProduction_QueueSlotWidget_C_PreConstruct");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.ExecuteUbergraph_W_ItemProduction_QueueSlotWidget
// 0x000C (0x000C - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelected;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ProductionQueueSlotState                   K2Node_Event_InProductionQueueSlotState;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget) == 0x000004, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget) == 0x00000C, "Wrong size on W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, EntryPoint) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, K2Node_Event_InIsSelected) == 0x000004, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::K2Node_Event_InIsSelected' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, K2Node_Event_IsDesignTime) == 0x000005, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000006, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, K2Node_Event_InProductionQueueSlotState) == 0x000007, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::K2Node_Event_InProductionQueueSlotState' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'W_ItemProduction_QueueSlotWidget_C_ExecuteUbergraph_W_ItemProduction_QueueSlotWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C.BP_QueueSlotStateDesign
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign final
{
public:
	EP2ProductionQueueSlotState                   InProductionQueueSlotState;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign) == 0x000001, "Wrong alignment on W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign");
static_assert(sizeof(W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign) == 0x000001, "Wrong size on W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign");
static_assert(offsetof(W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign, InProductionQueueSlotState) == 0x000000, "Member 'W_ItemProduction_QueueSlotWidget_C_BP_QueueSlotStateDesign::InProductionQueueSlotState' has a wrong offset!");

}

