#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemSkinContainer_Picker

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemSkinContainer_Picker.W_ItemSkinContainer_Picker_C
// 0x0030 (0x0308 - 0x02D8)
class UW_ItemSkinContainer_Picker_C final : public UP2ItemSkinContainerPicker
{
public:
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button_1;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button_2;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button_3;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button_4;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CharacterSkinItem_Button_C*          W_CharacterSkinItem_Button_5;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemSkinContainer_Picker_C">();
	}
	static class UW_ItemSkinContainer_Picker_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemSkinContainer_Picker_C>();
	}
};
static_assert(alignof(UW_ItemSkinContainer_Picker_C) == 0x000008, "Wrong alignment on UW_ItemSkinContainer_Picker_C");
static_assert(sizeof(UW_ItemSkinContainer_Picker_C) == 0x000308, "Wrong size on UW_ItemSkinContainer_Picker_C");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button) == 0x0002D8, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button' has a wrong offset!");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button_1) == 0x0002E0, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button_1' has a wrong offset!");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button_2) == 0x0002E8, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button_2' has a wrong offset!");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button_3) == 0x0002F0, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button_3' has a wrong offset!");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button_4) == 0x0002F8, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button_4' has a wrong offset!");
static_assert(offsetof(UW_ItemSkinContainer_Picker_C, W_CharacterSkinItem_Button_5) == 0x000300, "Member 'UW_ItemSkinContainer_Picker_C::W_CharacterSkinItem_Button_5' has a wrong offset!");

}

