#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_QueueSlotWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_QueueSlotWidget.W_ItemProduction_QueueSlotWidget_C
// 0x0038 (0x0370 - 0x0338)
class UW_ItemProduction_QueueSlotWidget_C final : public UP2ProductionQueueSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ItemGroupLockedPattern;                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_QueueSlotOutline;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Empty;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         QueueSlotStateInt;                                 // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ProgressFloat;                                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSelectedState(bool IsSelected_0)	 // 0xae1e64;
	void SetQueueSlotState(int32 QueueSlotStateInt_0)	 // 0xae1e64;
	void SetProgress(double ProgressFloat_0)	 // 0xae1e64;
	void SetIsSelected_ImplementableEvent(bool InIsSelected)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_QueueSlotWidget(int32 EntryPoint)	 // 0xae1e64;
	void BP_QueueSlotStateDesign(EP2ProductionQueueSlotState InProductionQueueSlotState)	 // 0xae1e64;
	void BndEvt__W_ItemProduction_QueueSlotWidget_Btn_Item_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_ItemProduction_QueueSlotWidget_Btn_Item_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_QueueSlotWidget_C">();
	}
	static class UW_ItemProduction_QueueSlotWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_QueueSlotWidget_C>();
	}
};
static_assert(alignof(UW_ItemProduction_QueueSlotWidget_C) == 0x000008, "Wrong alignment on UW_ItemProduction_QueueSlotWidget_C");
static_assert(sizeof(UW_ItemProduction_QueueSlotWidget_C) == 0x000370, "Wrong size on UW_ItemProduction_QueueSlotWidget_C");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, UberGraphFrame) == 0x000338, "Member 'UW_ItemProduction_QueueSlotWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, Bdr_ItemGroupLockedPattern) == 0x000340, "Member 'UW_ItemProduction_QueueSlotWidget_C::Bdr_ItemGroupLockedPattern' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, Bdr_QueueSlotOutline) == 0x000348, "Member 'UW_ItemProduction_QueueSlotWidget_C::Bdr_QueueSlotOutline' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, Img_Empty) == 0x000350, "Member 'UW_ItemProduction_QueueSlotWidget_C::Img_Empty' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, Img_Selected) == 0x000358, "Member 'UW_ItemProduction_QueueSlotWidget_C::Img_Selected' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, QueueSlotStateInt) == 0x000360, "Member 'UW_ItemProduction_QueueSlotWidget_C::QueueSlotStateInt' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, IsSelected) == 0x000364, "Member 'UW_ItemProduction_QueueSlotWidget_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_QueueSlotWidget_C, ProgressFloat) == 0x000368, "Member 'UW_ItemProduction_QueueSlotWidget_C::ProgressFloat' has a wrong offset!");

}

