#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Item_Stat_ValueWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Item_Stat_ValueWidget.W_Item_Stat_ValueWidget_C.ExecuteUbergraph_W_Item_Stat_ValueWidget
// 0x0040 (0x0040 - 0x0000)
struct W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHigherIsBetter;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDelta;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget) == 0x000008, "Wrong alignment on W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget");
static_assert(sizeof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget) == 0x000040, "Wrong size on W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, EntryPoint) == 0x000000, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, K2Node_Event_bHigherIsBetter) == 0x000019, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::K2Node_Event_bHigherIsBetter' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, K2Node_Event_InDelta) == 0x00001C, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::K2Node_Event_InDelta' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000020, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000021, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'W_Item_Stat_ValueWidget_C_ExecuteUbergraph_W_Item_Stat_ValueWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_Item_Stat_ValueWidget.W_Item_Stat_ValueWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Item_Stat_ValueWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ValueWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Item_Stat_ValueWidget_C_PreConstruct");
static_assert(sizeof(W_Item_Stat_ValueWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Item_Stat_ValueWidget_C_PreConstruct");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Item_Stat_ValueWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Item_Stat_ValueWidget.W_Item_Stat_ValueWidget_C.UpdateDesignByDelta
// 0x0008 (0x0008 - 0x0000)
struct W_Item_Stat_ValueWidget_C_UpdateDesignByDelta final
{
public:
	bool                                          bHigherIsBetter;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDelta;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ValueWidget_C_UpdateDesignByDelta) == 0x000004, "Wrong alignment on W_Item_Stat_ValueWidget_C_UpdateDesignByDelta");
static_assert(sizeof(W_Item_Stat_ValueWidget_C_UpdateDesignByDelta) == 0x000008, "Wrong size on W_Item_Stat_ValueWidget_C_UpdateDesignByDelta");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_UpdateDesignByDelta, bHigherIsBetter) == 0x000000, "Member 'W_Item_Stat_ValueWidget_C_UpdateDesignByDelta::bHigherIsBetter' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ValueWidget_C_UpdateDesignByDelta, InDelta) == 0x000004, "Member 'W_Item_Stat_ValueWidget_C_UpdateDesignByDelta::InDelta' has a wrong offset!");

}

