#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemResultWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_ItemProduction_ItemResultWidget.W_ItemProduction_ItemResultWidget_C.RefreshClaimStateOnBP
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP final
{
public:
	bool                                          InClaimed;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP) == 0x000001, "Wrong alignment on W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP");
static_assert(sizeof(W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP) == 0x000001, "Wrong size on W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP, InClaimed) == 0x000000, "Member 'W_ItemProduction_ItemResultWidget_C_RefreshClaimStateOnBP::InClaimed' has a wrong offset!");

// Function W_ItemProduction_ItemResultWidget.W_ItemProduction_ItemResultWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ItemResultWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemResultWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ItemProduction_ItemResultWidget_C_PreConstruct");
static_assert(sizeof(W_ItemProduction_ItemResultWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ItemProduction_ItemResultWidget_C_PreConstruct");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ItemProduction_ItemResultWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ItemProduction_ItemResultWidget.W_ItemProduction_ItemResultWidget_C.ExecuteUbergraph_W_ItemProduction_ItemResultWidget
// 0x0018 (0x0018 - 0x0000)
struct W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InClaimed;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget) == 0x000008, "Wrong alignment on W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget");
static_assert(sizeof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget) == 0x000018, "Wrong size on W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, EntryPoint) == 0x000000, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, K2Node_Event_InClaimed) == 0x000004, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::K2Node_Event_InClaimed' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, K2Node_Event_IsDesignTime) == 0x000006, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'W_ItemProduction_ItemResultWidget_C_ExecuteUbergraph_W_ItemProduction_ItemResultWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

