#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemGroupItemWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ItemGroupItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemGroupItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_ItemProduction_ItemGroupItemWidget_C_PreConstruct");
static_assert(sizeof(W_ItemProduction_ItemGroupItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_ItemProduction_ItemGroupItemWidget_C_PreConstruct");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ItemProduction_ItemGroupItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C.ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget
// 0x0008 (0x0008 - 0x0000)
struct W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget) == 0x000004, "Wrong alignment on W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget");
static_assert(sizeof(W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget) == 0x000008, "Wrong size on W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget, EntryPoint) == 0x000000, "Member 'W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_ItemProduction_ItemGroupItemWidget_C_ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C.SetEmptyState
// 0x0001 (0x0001 - 0x0000)
struct W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState final
{
public:
	bool                                          IsEmpty_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState) == 0x000001, "Wrong alignment on W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState");
static_assert(sizeof(W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState) == 0x000001, "Wrong size on W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState, IsEmpty_0) == 0x000000, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetEmptyState::IsEmpty_0' has a wrong offset!");

// Function W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C.SetItemGradeColor
// 0x0020 (0x0020 - 0x0000)
struct W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor final
{
public:
	struct FLinearColor                           ItemGradeColor;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ItemGradeGradientColor;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor) == 0x000004, "Wrong alignment on W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor");
static_assert(sizeof(W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor) == 0x000020, "Wrong size on W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor, ItemGradeColor) == 0x000000, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor::ItemGradeColor' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor, ItemGradeGradientColor) == 0x000010, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemGradeColor::ItemGradeGradientColor' has a wrong offset!");

// Function W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C.SetItemState
// 0x00B8 (0x00B8 - 0x0000)
struct W_ItemProduction_ItemGroupItemWidget_C_SetItemState final
{
public:
	bool                                          IsSelectedState_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAvailable_0;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocked;                                          // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x007C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0090(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x00A4(0x0014)()
};
static_assert(alignof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState) == 0x000004, "Wrong alignment on W_ItemProduction_ItemGroupItemWidget_C_SetItemState");
static_assert(sizeof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState) == 0x0000B8, "Wrong size on W_ItemProduction_ItemGroupItemWidget_C_SetItemState");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, IsSelectedState_0) == 0x000000, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::IsSelectedState_0' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, IsAvailable_0) == 0x000001, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::IsAvailable_0' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, IsLocked) == 0x000002, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::IsLocked' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_4) == 0x000054, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_5) == 0x000068, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_6) == 0x00007C, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_7) == 0x000090, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(W_ItemProduction_ItemGroupItemWidget_C_SetItemState, K2Node_MakeStruct_SlateColor_8) == 0x0000A4, "Member 'W_ItemProduction_ItemGroupItemWidget_C_SetItemState::K2Node_MakeStruct_SlateColor_8' has a wrong offset!");

}

