#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Item_Stat_ProtectionValueWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Item_Stat_ProtectionValueWidget.W_Item_Stat_ProtectionValueWidget_C.ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget
// 0x0040 (0x0040 - 0x0000)
struct W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasDamageZone;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHigherIsBetter;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDelta;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget) == 0x000008, "Wrong alignment on W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget");
static_assert(sizeof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget) == 0x000040, "Wrong size on W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, EntryPoint) == 0x000000, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_Event_bHasDamageZone) == 0x000005, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_Event_bHasDamageZone' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_Event_bHigherIsBetter) == 0x000006, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_Event_bHigherIsBetter' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_Event_InDelta) == 0x000008, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_Event_InDelta' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00000C, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00000D, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'W_Item_Stat_ProtectionValueWidget_C_ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_Item_Stat_ProtectionValueWidget.W_Item_Stat_ProtectionValueWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Item_Stat_ProtectionValueWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ProtectionValueWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Item_Stat_ProtectionValueWidget_C_PreConstruct");
static_assert(sizeof(W_Item_Stat_ProtectionValueWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Item_Stat_ProtectionValueWidget_C_PreConstruct");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Item_Stat_ProtectionValueWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Item_Stat_ProtectionValueWidget.W_Item_Stat_ProtectionValueWidget_C.SetProtectionDamageZone
// 0x0001 (0x0001 - 0x0000)
struct W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone final
{
public:
	bool                                          bHasDamageZone;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone) == 0x000001, "Wrong alignment on W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone");
static_assert(sizeof(W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone) == 0x000001, "Wrong size on W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone, bHasDamageZone) == 0x000000, "Member 'W_Item_Stat_ProtectionValueWidget_C_SetProtectionDamageZone::bHasDamageZone' has a wrong offset!");

// Function W_Item_Stat_ProtectionValueWidget.W_Item_Stat_ProtectionValueWidget_C.UpdateDesignByDelta
// 0x0008 (0x0008 - 0x0000)
struct W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta final
{
public:
	bool                                          bHigherIsBetter;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDelta;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta) == 0x000004, "Wrong alignment on W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta");
static_assert(sizeof(W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta) == 0x000008, "Wrong size on W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta, bHigherIsBetter) == 0x000000, "Member 'W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta::bHigherIsBetter' has a wrong offset!");
static_assert(offsetof(W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta, InDelta) == 0x000004, "Member 'W_Item_Stat_ProtectionValueWidget_C_UpdateDesignByDelta::InDelta' has a wrong offset!");

}

