#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Item_Stat_ProtectionValueWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Item_Stat_ProtectionValueWidget.W_Item_Stat_ProtectionValueWidget_C
// 0x0018 (0x02A8 - 0x0290)
class UW_Item_Stat_ProtectionValueWidget_C final : public UP2ArmorProtectionStatValueWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_Bracket_L;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Bracket_R;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Item_Stat_ProtectionValueWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetProtectionDamageZone(bool bHasDamageZone)	 // 0xae1e64;
	void UpdateDesignByDelta(bool bHigherIsBetter, float InDelta)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Item_Stat_ProtectionValueWidget_C">();
	}
	static class UW_Item_Stat_ProtectionValueWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Item_Stat_ProtectionValueWidget_C>();
	}
};
static_assert(alignof(UW_Item_Stat_ProtectionValueWidget_C) == 0x000008, "Wrong alignment on UW_Item_Stat_ProtectionValueWidget_C");
static_assert(sizeof(UW_Item_Stat_ProtectionValueWidget_C) == 0x0002A8, "Wrong size on UW_Item_Stat_ProtectionValueWidget_C");
static_assert(offsetof(UW_Item_Stat_ProtectionValueWidget_C, UberGraphFrame) == 0x000290, "Member 'UW_Item_Stat_ProtectionValueWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_ProtectionValueWidget_C, Txt_Bracket_L) == 0x000298, "Member 'UW_Item_Stat_ProtectionValueWidget_C::Txt_Bracket_L' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_ProtectionValueWidget_C, Txt_Bracket_R) == 0x0002A0, "Member 'UW_Item_Stat_ProtectionValueWidget_C::Txt_Bracket_R' has a wrong offset!");

}

