#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemResultWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_ItemResultWidget.W_ItemProduction_ItemResultWidget_C
// 0x0040 (0x0370 - 0x0330)
class UW_ItemProduction_ItemResultWidget_C final : public UP2ProductionResultItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Claimed;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ClaimedIcon;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Highlight;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_MaxAnimGlow;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMax;                                             // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClaimed;                                         // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshClaimStateOnBP(bool InClaimed)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnRefreshWidgetOnBP()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_ItemResultWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_ItemResultWidget_C">();
	}
	static class UW_ItemProduction_ItemResultWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_ItemResultWidget_C>();
	}
};
static_assert(alignof(UW_ItemProduction_ItemResultWidget_C) == 0x000008, "Wrong alignment on UW_ItemProduction_ItemResultWidget_C");
static_assert(sizeof(UW_ItemProduction_ItemResultWidget_C) == 0x000370, "Wrong size on UW_ItemProduction_ItemResultWidget_C");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, UberGraphFrame) == 0x000330, "Member 'UW_ItemProduction_ItemResultWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, Init) == 0x000338, "Member 'UW_ItemProduction_ItemResultWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, FadeInAnim) == 0x000340, "Member 'UW_ItemProduction_ItemResultWidget_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, Bdr_Claimed) == 0x000348, "Member 'UW_ItemProduction_ItemResultWidget_C::Bdr_Claimed' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, Img_ClaimedIcon) == 0x000350, "Member 'UW_ItemProduction_ItemResultWidget_C::Img_ClaimedIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, Img_Highlight) == 0x000358, "Member 'UW_ItemProduction_ItemResultWidget_C::Img_Highlight' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, Img_MaxAnimGlow) == 0x000360, "Member 'UW_ItemProduction_ItemResultWidget_C::Img_MaxAnimGlow' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, IsMax) == 0x000368, "Member 'UW_ItemProduction_ItemResultWidget_C::IsMax' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemResultWidget_C, IsClaimed) == 0x000369, "Member 'UW_ItemProduction_ItemResultWidget_C::IsClaimed' has a wrong offset!");

}

