#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Item_Stat_GaugeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Item_Stat_GaugeWidget.W_Item_Stat_GaugeWidget_C
// 0x0058 (0x05D0 - 0x0578)
class UW_Item_Stat_GaugeWidget_C final : public UP2ItemStatGaugeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   StatTitle;                                         // 0x0580(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             StatIcon;                                          // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        StatValue;                                         // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatMinValue;                                      // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatMaxValue;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatUnit;                                          // 0x05B8(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_W_Item_Stat_GaugeWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Item_Stat_GaugeWidget_C">();
	}
	static class UW_Item_Stat_GaugeWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Item_Stat_GaugeWidget_C>();
	}
};
static_assert(alignof(UW_Item_Stat_GaugeWidget_C) == 0x000008, "Wrong alignment on UW_Item_Stat_GaugeWidget_C");
static_assert(sizeof(UW_Item_Stat_GaugeWidget_C) == 0x0005D0, "Wrong size on UW_Item_Stat_GaugeWidget_C");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, UberGraphFrame) == 0x000578, "Member 'UW_Item_Stat_GaugeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatTitle) == 0x000580, "Member 'UW_Item_Stat_GaugeWidget_C::StatTitle' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatIcon) == 0x000598, "Member 'UW_Item_Stat_GaugeWidget_C::StatIcon' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatValue) == 0x0005A0, "Member 'UW_Item_Stat_GaugeWidget_C::StatValue' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatMinValue) == 0x0005A8, "Member 'UW_Item_Stat_GaugeWidget_C::StatMinValue' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatMaxValue) == 0x0005B0, "Member 'UW_Item_Stat_GaugeWidget_C::StatMaxValue' has a wrong offset!");
static_assert(offsetof(UW_Item_Stat_GaugeWidget_C, StatUnit) == 0x0005B8, "Member 'UW_Item_Stat_GaugeWidget_C::StatUnit' has a wrong offset!");

}

