#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemDetails_InfoTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemDetails_InfoTab.W_ItemDetails_InfoTab_C
// 0x00D8 (0x0378 - 0x02A0)
class UW_ItemDetails_InfoTab_C final : public UP2ItemDetailsInfoTabWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonVisualAttachment*                Attach_SelectMark;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBar;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Select;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         SelectedTitleFont;                                 // 0x02C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         NormalTitleFont;                                   // 0x0320(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_OnCheckStateChanged(bool bIsChecked)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemDetails_InfoTab(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemDetails_InfoTab_C">();
	}
	static class UW_ItemDetails_InfoTab_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemDetails_InfoTab_C>();
	}
};
static_assert(alignof(UW_ItemDetails_InfoTab_C) == 0x000008, "Wrong alignment on UW_ItemDetails_InfoTab_C");
static_assert(sizeof(UW_ItemDetails_InfoTab_C) == 0x000378, "Wrong size on UW_ItemDetails_InfoTab_C");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, UberGraphFrame) == 0x0002A0, "Member 'UW_ItemDetails_InfoTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, Attach_SelectMark) == 0x0002A8, "Member 'UW_ItemDetails_InfoTab_C::Attach_SelectMark' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, Img_SelectedBar) == 0x0002B0, "Member 'UW_ItemDetails_InfoTab_C::Img_SelectedBar' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, Txt_Select) == 0x0002B8, "Member 'UW_ItemDetails_InfoTab_C::Txt_Select' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, IsSelected) == 0x0002C0, "Member 'UW_ItemDetails_InfoTab_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, SelectedTitleFont) == 0x0002C8, "Member 'UW_ItemDetails_InfoTab_C::SelectedTitleFont' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_InfoTab_C, NormalTitleFont) == 0x000320, "Member 'UW_ItemDetails_InfoTab_C::NormalTitleFont' has a wrong offset!");

}

