#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemFacilityIconWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemFacilityIconWidget.W_ItemFacilityIconWidget_C
// 0x0030 (0x02C0 - 0x0290)
class UW_ItemFacilityIconWidget_C final : public UP2ItemFacilityIconWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_ItemIcon;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         IconHeight;                                        // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconWidth;                                         // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ItemIcon;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Crafting_Item_C*                     MyCraftWidget;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemFacilityIconWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemFacilityIconWidget_C">();
	}
	static class UW_ItemFacilityIconWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemFacilityIconWidget_C>();
	}
};
static_assert(alignof(UW_ItemFacilityIconWidget_C) == 0x000008, "Wrong alignment on UW_ItemFacilityIconWidget_C");
static_assert(sizeof(UW_ItemFacilityIconWidget_C) == 0x0002C0, "Wrong size on UW_ItemFacilityIconWidget_C");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, UberGraphFrame) == 0x000290, "Member 'UW_ItemFacilityIconWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, SzB_ItemIcon) == 0x000298, "Member 'UW_ItemFacilityIconWidget_C::SzB_ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, IconHeight) == 0x0002A0, "Member 'UW_ItemFacilityIconWidget_C::IconHeight' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, IconWidth) == 0x0002A4, "Member 'UW_ItemFacilityIconWidget_C::IconWidth' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, ItemIcon) == 0x0002A8, "Member 'UW_ItemFacilityIconWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, IsDisabled) == 0x0002B0, "Member 'UW_ItemFacilityIconWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_ItemFacilityIconWidget_C, MyCraftWidget) == 0x0002B8, "Member 'UW_ItemFacilityIconWidget_C::MyCraftWidget' has a wrong offset!");

}

