#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemDetails_ItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C
// 0x0198 (0x0418 - 0x0280)
class UW_ItemDetails_ItemInfo_C final : public UP2DetailInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ItemInfo;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTxt_ItemInfo;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StyleIndexByType;                                  // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         RTxt_Item_Info;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   UsageContract;                                     // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageFacilityInstall;                              // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageResearch;                                     // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageOffer;                                        // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceLoot;                                        // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceResearch;                                    // 0x0328(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceStore;                                       // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceCrafting;                                    // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageClothingUpgrade;                              // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageCrafting;                                     // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceFactionStore;                                // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageFacilityUpgrade;                              // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceBarter;                                      // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SourceSalvage;                                     // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UsageSalvage;                                      // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_ItemDetails_ItemInfo(int32 EntryPoint)	 // 0xae1e64;
	void GetItemInfoDetailsText(const struct FGameplayTagContainer& InGameplayTagContainer, class FText* DetailsText)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void RefreshDetailInfoWidgetOnBP(const struct FGameplayTag& DetailInfoTag)	 // 0xae1e64;
	void RefreshDetailInfoWidgetWithTagContainer(const struct FGameplayTag& DetailInfoTag, const struct FGameplayTagContainer& DetailInfoContainer)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemDetails_ItemInfo_C">();
	}
	static class UW_ItemDetails_ItemInfo_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemDetails_ItemInfo_C>();
	}
};
static_assert(alignof(UW_ItemDetails_ItemInfo_C) == 0x000008, "Wrong alignment on UW_ItemDetails_ItemInfo_C");
static_assert(sizeof(UW_ItemDetails_ItemInfo_C) == 0x000418, "Wrong size on UW_ItemDetails_ItemInfo_C");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UberGraphFrame) == 0x000280, "Member 'UW_ItemDetails_ItemInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, Bdr_ItemInfo) == 0x000288, "Member 'UW_ItemDetails_ItemInfo_C::Bdr_ItemInfo' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, Img_Icon) == 0x000290, "Member 'UW_ItemDetails_ItemInfo_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, RTxt_ItemInfo) == 0x000298, "Member 'UW_ItemDetails_ItemInfo_C::RTxt_ItemInfo' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, StyleIndexByType) == 0x0002A0, "Member 'UW_ItemDetails_ItemInfo_C::StyleIndexByType' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, RTxt_Item_Info) == 0x0002A8, "Member 'UW_ItemDetails_ItemInfo_C::RTxt_Item_Info' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageContract) == 0x0002B0, "Member 'UW_ItemDetails_ItemInfo_C::UsageContract' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageFacilityInstall) == 0x0002C8, "Member 'UW_ItemDetails_ItemInfo_C::UsageFacilityInstall' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageResearch) == 0x0002E0, "Member 'UW_ItemDetails_ItemInfo_C::UsageResearch' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageOffer) == 0x0002F8, "Member 'UW_ItemDetails_ItemInfo_C::UsageOffer' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceLoot) == 0x000310, "Member 'UW_ItemDetails_ItemInfo_C::SourceLoot' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceResearch) == 0x000328, "Member 'UW_ItemDetails_ItemInfo_C::SourceResearch' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceStore) == 0x000340, "Member 'UW_ItemDetails_ItemInfo_C::SourceStore' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceCrafting) == 0x000358, "Member 'UW_ItemDetails_ItemInfo_C::SourceCrafting' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageClothingUpgrade) == 0x000370, "Member 'UW_ItemDetails_ItemInfo_C::UsageClothingUpgrade' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageCrafting) == 0x000388, "Member 'UW_ItemDetails_ItemInfo_C::UsageCrafting' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceFactionStore) == 0x0003A0, "Member 'UW_ItemDetails_ItemInfo_C::SourceFactionStore' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageFacilityUpgrade) == 0x0003B8, "Member 'UW_ItemDetails_ItemInfo_C::UsageFacilityUpgrade' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceBarter) == 0x0003D0, "Member 'UW_ItemDetails_ItemInfo_C::SourceBarter' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, SourceSalvage) == 0x0003E8, "Member 'UW_ItemDetails_ItemInfo_C::SourceSalvage' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_ItemInfo_C, UsageSalvage) == 0x000400, "Member 'UW_ItemDetails_ItemInfo_C::UsageSalvage' has a wrong offset!");

}

