#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemGroupItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_ItemGroupItemWidget.W_ItemProduction_ItemGroupItemWidget_C
// 0x0050 (0x0370 - 0x0320)
class UW_ItemProduction_ItemGroupItemWidget_C final : public UP2ProductionItemGroupItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Empty;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Item;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Quantity;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Unavailable;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_ItemGroupItem;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Empty;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ItemGradeColor;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ItemGradeGradient;                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlotOutline;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_ItemGroupItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void RefreshWidgetOnBP()	 // 0xae1e64;
	void SetEmptyState(bool IsEmpty_0)	 // 0xae1e64;
	void SetItemGradeColor(const struct FLinearColor& ItemGradeColor, const struct FLinearColor& ItemGradeGradientColor)	 // 0xae1e64;
	void SetItemState(bool IsSelectedState_0, bool IsAvailable_0, bool IsLocked)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_ItemGroupItemWidget_C">();
	}
	static class UW_ItemProduction_ItemGroupItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_ItemGroupItemWidget_C>();
	}
};
static_assert(alignof(UW_ItemProduction_ItemGroupItemWidget_C) == 0x000008, "Wrong alignment on UW_ItemProduction_ItemGroupItemWidget_C");
static_assert(sizeof(UW_ItemProduction_ItemGroupItemWidget_C) == 0x000370, "Wrong size on UW_ItemProduction_ItemGroupItemWidget_C");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, UberGraphFrame) == 0x000320, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Bdr_Empty) == 0x000328, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Bdr_Empty' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Bdr_Item) == 0x000330, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Bdr_Item' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Bdr_Quantity) == 0x000338, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Bdr_Quantity' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Bdr_Unavailable) == 0x000340, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Bdr_Unavailable' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, GP_ItemGroupItem) == 0x000348, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::GP_ItemGroupItem' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Img_Empty) == 0x000350, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Img_Empty' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Img_ItemGradeColor) == 0x000358, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Img_ItemGradeColor' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Img_ItemGradeGradient) == 0x000360, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Img_ItemGradeGradient' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroupItemWidget_C, Img_SlotOutline) == 0x000368, "Member 'UW_ItemProduction_ItemGroupItemWidget_C::Img_SlotOutline' has a wrong offset!");

}

