#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemDetails_MainStat_Firemode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemDetails_MainStat_Firemode.W_ItemDetails_MainStat_Firemode_C
// 0x0040 (0x05B0 - 0x0570)
class UW_ItemDetails_MainStat_Firemode_C final : public UP2WeaponStatFireModeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_StatIcon;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StatTitle;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StatTitle;                                         // 0x0588(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             StatIcon;                                          // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSingle;                                          // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is2RdBurst;                                        // 0x05A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is3RdBurst;                                        // 0x05AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullAuto;                                        // 0x05AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_ItemDetails_MainStat_Firemode(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemDetails_MainStat_Firemode_C">();
	}
	static class UW_ItemDetails_MainStat_Firemode_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemDetails_MainStat_Firemode_C>();
	}
};
static_assert(alignof(UW_ItemDetails_MainStat_Firemode_C) == 0x000008, "Wrong alignment on UW_ItemDetails_MainStat_Firemode_C");
static_assert(sizeof(UW_ItemDetails_MainStat_Firemode_C) == 0x0005B0, "Wrong size on UW_ItemDetails_MainStat_Firemode_C");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, UberGraphFrame) == 0x000570, "Member 'UW_ItemDetails_MainStat_Firemode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, Img_StatIcon) == 0x000578, "Member 'UW_ItemDetails_MainStat_Firemode_C::Img_StatIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, Txt_StatTitle) == 0x000580, "Member 'UW_ItemDetails_MainStat_Firemode_C::Txt_StatTitle' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, StatTitle) == 0x000588, "Member 'UW_ItemDetails_MainStat_Firemode_C::StatTitle' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, StatIcon) == 0x0005A0, "Member 'UW_ItemDetails_MainStat_Firemode_C::StatIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, IsSingle) == 0x0005A8, "Member 'UW_ItemDetails_MainStat_Firemode_C::IsSingle' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, Is2RdBurst) == 0x0005A9, "Member 'UW_ItemDetails_MainStat_Firemode_C::Is2RdBurst' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, Is3RdBurst) == 0x0005AA, "Member 'UW_ItemDetails_MainStat_Firemode_C::Is3RdBurst' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_MainStat_Firemode_C, IsFullAuto) == 0x0005AB, "Member 'UW_ItemDetails_MainStat_Firemode_C::IsFullAuto' has a wrong offset!");

}

