#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemDetails_ItemInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C.ExecuteUbergraph_W_ItemDetails_ItemInfo
// 0x02B8 (0x02B8 - 0x0000)
struct W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_DetailInfoTag_1;                      // 0x0008(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_DetailInfoTag;                        // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DetailInfoContainer;                  // 0x0020(0x0020)(ConstParm)
	class FText                                   CallFunc_GetItemInfoDetailsText_DetailsText;       // 0x0040(0x0018)()
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0120(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0170(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01C0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x01D0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01E0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0230(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0240(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0270(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0288(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x02A0(0x0018)()
};
static_assert(alignof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo) == 0x000008, "Wrong alignment on W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo");
static_assert(sizeof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo) == 0x0002B8, "Wrong size on W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, EntryPoint) == 0x000000, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_Event_DetailInfoTag_1) == 0x000008, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_Event_DetailInfoTag_1' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_Event_DetailInfoTag) == 0x000014, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_Event_DetailInfoTag' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_Event_DetailInfoContainer) == 0x000020, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_Event_DetailInfoContainer' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_GetItemInfoDetailsText_DetailsText) == 0x000040, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_GetItemInfoDetailsText_DetailsText' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x000058, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeArray_Array) == 0x000100, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeArray_Array_1) == 0x000110, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeStruct_FormatArgumentData_2) == 0x000120, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeStruct_FormatArgumentData_3) == 0x000170, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeArray_Array_2) == 0x0001C0, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeArray_Array_3) == 0x0001D0, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001E0, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, K2Node_MakeArray_Array_4) == 0x000230, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_Format_ReturnValue) == 0x000240, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_Format_ReturnValue_1) == 0x000258, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_Format_ReturnValue_2) == 0x000270, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_Format_ReturnValue_3) == 0x000288, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo, CallFunc_Format_ReturnValue_4) == 0x0002A0, "Member 'W_ItemDetails_ItemInfo_C_ExecuteUbergraph_W_ItemDetails_ItemInfo::CallFunc_Format_ReturnValue_4' has a wrong offset!");

// Function W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C.GetItemInfoDetailsText
// 0x00F0 (0x00F0 - 0x0000)
struct W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText final
{
public:
	struct FGameplayTagContainer                  InGameplayTagContainer;                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   DetailsText;                                       // 0x0020(0x0018)(Parm, OutParm)
	TArray<class FString>                         InfoDetailList;                                    // 0x0038(0x0010)(Edit, BlueprintVisible)
	class FText                                   OutText;                                           // 0x0048(0x0018)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameTagDisplayText_ReturnValue;        // 0x0080(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText) == 0x000008, "Wrong alignment on W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText");
static_assert(sizeof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText) == 0x0000F0, "Wrong size on W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, InGameplayTagContainer) == 0x000000, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::InGameplayTagContainer' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, DetailsText) == 0x000020, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::DetailsText' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, InfoDetailList) == 0x000038, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::InfoDetailList' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, OutText) == 0x000048, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::OutText' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000060, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, Temp_int_Array_Index_Variable) == 0x000070, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Array_Get_Item) == 0x000078, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_GetGameTagDisplayText_ReturnValue) == 0x000080, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_GetGameTagDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_TextIsEmpty_ReturnValue) == 0x0000B8, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Not_PreBool_ReturnValue) == 0x0000B9, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_JoinStringArray_ReturnValue) == 0x0000C0, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText, CallFunc_Array_AddUnique_ReturnValue) == 0x0000E8, "Member 'W_ItemDetails_ItemInfo_C_GetItemInfoDetailsText::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ItemDetails_ItemInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemDetails_ItemInfo_C_PreConstruct) == 0x000001, "Wrong alignment on W_ItemDetails_ItemInfo_C_PreConstruct");
static_assert(sizeof(W_ItemDetails_ItemInfo_C_PreConstruct) == 0x000001, "Wrong size on W_ItemDetails_ItemInfo_C_PreConstruct");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ItemDetails_ItemInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C.RefreshDetailInfoWidgetOnBP
// 0x0008 (0x0008 - 0x0000)
struct W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP final
{
public:
	struct FGameplayTag                           DetailInfoTag;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP) == 0x000004, "Wrong alignment on W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP");
static_assert(sizeof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP) == 0x000008, "Wrong size on W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP, DetailInfoTag) == 0x000000, "Member 'W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetOnBP::DetailInfoTag' has a wrong offset!");

// Function W_ItemDetails_ItemInfo.W_ItemDetails_ItemInfo_C.RefreshDetailInfoWidgetWithTagContainer
// 0x0028 (0x0028 - 0x0000)
struct W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer final
{
public:
	struct FGameplayTag                           DetailInfoTag;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DetailInfoContainer;                               // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer) == 0x000008, "Wrong alignment on W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer");
static_assert(sizeof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer) == 0x000028, "Wrong size on W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer, DetailInfoTag) == 0x000000, "Member 'W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer::DetailInfoTag' has a wrong offset!");
static_assert(offsetof(W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer, DetailInfoContainer) == 0x000008, "Member 'W_ItemDetails_ItemInfo_C_RefreshDetailInfoWidgetWithTagContainer::DetailInfoContainer' has a wrong offset!");

}

