#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ResultListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_ResultListWidget.W_ItemProduction_ResultListWidget_C
// 0x0078 (0x0350 - 0x02D8)
class UW_ItemProduction_ResultListWidget_C final : public UP2ProductionResultListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x02E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Output;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            Btn_Claimed;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DotLineL;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DotLineR;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_OutcomeIcon;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_MaterialItemWidget_C*       W_Crafting_MaterialItemWidget;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_MaterialItemWidget_C*       W_Crafting_MaterialItemWidget_1;                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_MaterialItemWidget_C*       W_Crafting_MaterialItemWidget_2;                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_MaterialItemWidget_C*       W_Crafting_MaterialItemWidget_3;                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Crafting_MaterialItemWidget_C*       W_Crafting_MaterialItemWidget_4;                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemResultWidget_C*   W_ItemProduction_ItemResultWidget;                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsClaimed;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshClaimStateOnBP(bool InClaimed)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnRefreshWidgetOnBP()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_ResultListWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_ResultListWidget_C">();
	}
	static class UW_ItemProduction_ResultListWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_ResultListWidget_C>();
	}
};
static_assert(alignof(UW_ItemProduction_ResultListWidget_C) == 0x000008, "Wrong alignment on UW_ItemProduction_ResultListWidget_C");
static_assert(sizeof(UW_ItemProduction_ResultListWidget_C) == 0x000350, "Wrong size on UW_ItemProduction_ResultListWidget_C");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, UberGraphFrame) == 0x0002D8, "Member 'UW_ItemProduction_ResultListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Init) == 0x0002E0, "Member 'UW_ItemProduction_ResultListWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, FadeInAnim) == 0x0002E8, "Member 'UW_ItemProduction_ResultListWidget_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Bdr_Output) == 0x0002F0, "Member 'UW_ItemProduction_ResultListWidget_C::Bdr_Output' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Btn_Claimed) == 0x0002F8, "Member 'UW_ItemProduction_ResultListWidget_C::Btn_Claimed' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Img_DotLineL) == 0x000300, "Member 'UW_ItemProduction_ResultListWidget_C::Img_DotLineL' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Img_DotLineR) == 0x000308, "Member 'UW_ItemProduction_ResultListWidget_C::Img_DotLineR' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, Img_OutcomeIcon) == 0x000310, "Member 'UW_ItemProduction_ResultListWidget_C::Img_OutcomeIcon' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_Crafting_MaterialItemWidget) == 0x000318, "Member 'UW_ItemProduction_ResultListWidget_C::W_Crafting_MaterialItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_Crafting_MaterialItemWidget_1) == 0x000320, "Member 'UW_ItemProduction_ResultListWidget_C::W_Crafting_MaterialItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_Crafting_MaterialItemWidget_2) == 0x000328, "Member 'UW_ItemProduction_ResultListWidget_C::W_Crafting_MaterialItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_Crafting_MaterialItemWidget_3) == 0x000330, "Member 'UW_ItemProduction_ResultListWidget_C::W_Crafting_MaterialItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_Crafting_MaterialItemWidget_4) == 0x000338, "Member 'UW_ItemProduction_ResultListWidget_C::W_Crafting_MaterialItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, W_ItemProduction_ItemResultWidget) == 0x000340, "Member 'UW_ItemProduction_ResultListWidget_C::W_ItemProduction_ItemResultWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ResultListWidget_C, IsClaimed) == 0x000348, "Member 'UW_ItemProduction_ResultListWidget_C::IsClaimed' has a wrong offset!");

}

