#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemDetails_Stats

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemDetails_Stats.W_ItemDetails_Stats_C
// 0x0028 (0x02D8 - 0x02B0)
class UW_ItemDetails_Stats_C final : public UP2DetailPopupStatsWidget
{
public:
	class UW_ItemDetails_MainStat_Firemode_C*     W_ItemDetails_MainStat_Firemode_C_0;               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Item_Stat_GaugeWidget_C*             W_ItemDetails_MainStat_Gauge;                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Item_Stat_GaugeWidget_C*             W_ItemDetails_MainStat_Gauge_1;                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Item_Stat_ValueWidget_C*             W_ItemDetails_MainStat_Value_2;                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Item_Stat_ValueWidget_C*             W_ItemDetails_MainStat_Value_3;                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemDetails_Stats_C">();
	}
	static class UW_ItemDetails_Stats_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemDetails_Stats_C>();
	}
};
static_assert(alignof(UW_ItemDetails_Stats_C) == 0x000008, "Wrong alignment on UW_ItemDetails_Stats_C");
static_assert(sizeof(UW_ItemDetails_Stats_C) == 0x0002D8, "Wrong size on UW_ItemDetails_Stats_C");
static_assert(offsetof(UW_ItemDetails_Stats_C, W_ItemDetails_MainStat_Firemode_C_0) == 0x0002B0, "Member 'UW_ItemDetails_Stats_C::W_ItemDetails_MainStat_Firemode_C_0' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_Stats_C, W_ItemDetails_MainStat_Gauge) == 0x0002B8, "Member 'UW_ItemDetails_Stats_C::W_ItemDetails_MainStat_Gauge' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_Stats_C, W_ItemDetails_MainStat_Gauge_1) == 0x0002C0, "Member 'UW_ItemDetails_Stats_C::W_ItemDetails_MainStat_Gauge_1' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_Stats_C, W_ItemDetails_MainStat_Value_2) == 0x0002C8, "Member 'UW_ItemDetails_Stats_C::W_ItemDetails_MainStat_Value_2' has a wrong offset!");
static_assert(offsetof(UW_ItemDetails_Stats_C, W_ItemDetails_MainStat_Value_3) == 0x0002D0, "Member 'UW_ItemDetails_Stats_C::W_ItemDetails_MainStat_Value_3' has a wrong offset!");

}

