#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ItemProduction_ItemGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ItemProduction_ItemGroup.W_ItemProduction_ItemGroup_C
// 0x0058 (0x0668 - 0x0610)
class UW_ItemProduction_ItemGroup_C final : public UP2ProductionItemGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Bg;                                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Close;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ItemGroup;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget;             // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget_1;           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget_2;           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget_3;           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget_4;           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemProduction_ItemGroupItemWidget_C* W_ItemProduction_ItemGroupItemWidget_5;           // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExitWidgetEvent()	 // 0xae1e64;
	void ExecuteUbergraph_W_ItemProduction_ItemGroup(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ItemProduction_ItemGroup_C">();
	}
	static class UW_ItemProduction_ItemGroup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ItemProduction_ItemGroup_C>();
	}
};
static_assert(alignof(UW_ItemProduction_ItemGroup_C) == 0x000008, "Wrong alignment on UW_ItemProduction_ItemGroup_C");
static_assert(sizeof(UW_ItemProduction_ItemGroup_C) == 0x000668, "Wrong size on UW_ItemProduction_ItemGroup_C");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, UberGraphFrame) == 0x000610, "Member 'UW_ItemProduction_ItemGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, Img_Bg) == 0x000618, "Member 'UW_ItemProduction_ItemGroup_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, Img_Outline) == 0x000620, "Member 'UW_ItemProduction_ItemGroup_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, Keyguide_Close) == 0x000628, "Member 'UW_ItemProduction_ItemGroup_C::Keyguide_Close' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, SzB_ItemGroup) == 0x000630, "Member 'UW_ItemProduction_ItemGroup_C::SzB_ItemGroup' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget) == 0x000638, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget_1) == 0x000640, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget_2) == 0x000648, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget_3) == 0x000650, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget_4) == 0x000658, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_ItemProduction_ItemGroup_C, W_ItemProduction_ItemGroupItemWidget_5) == 0x000660, "Member 'UW_ItemProduction_ItemGroup_C::W_ItemProduction_ItemGroupItemWidget_5' has a wrong offset!");

}

