#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Keybind_Key

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Keybind_Key.W_Keybind_Key_C.ExecuteUbergraph_W_Keybind_Key
// 0x00A0 (0x00A0 - 0x0000)
struct W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InKeyTexture;                         // 0x0018(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InKeyShadowTexture;                   // 0x0048(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InKeyName;                            // 0x0078(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key) == 0x000008, "Wrong alignment on W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key");
static_assert(sizeof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key) == 0x0000A0, "Wrong size on W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, EntryPoint) == 0x000000, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000010, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, K2Node_Event_InKeyTexture) == 0x000018, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::K2Node_Event_InKeyTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, K2Node_Event_InKeyShadowTexture) == 0x000048, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::K2Node_Event_InKeyShadowTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, K2Node_Event_InKeyName) == 0x000078, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::K2Node_Event_InKeyName' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, K2Node_Event_IsDesignTime) == 0x000090, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000094, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000098, "Member 'W_Keybind_Key_C_ExecuteUbergraph_W_Keybind_Key::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function W_Keybind_Key.W_Keybind_Key_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Keybind_Key_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_C_PreConstruct) == 0x000001, "Wrong alignment on W_Keybind_Key_C_PreConstruct");
static_assert(sizeof(W_Keybind_Key_C_PreConstruct) == 0x000001, "Wrong size on W_Keybind_Key_C_PreConstruct");
static_assert(offsetof(W_Keybind_Key_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Keybind_Key_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Keybind_Key.W_Keybind_Key_C.SetMainText_ImplementableEvent
// 0x0018 (0x0018 - 0x0000)
struct W_Keybind_Key_C_SetMainText_ImplementableEvent final
{
public:
	class FText                                   InKeyName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Keybind_Key_C_SetMainText_ImplementableEvent) == 0x000008, "Wrong alignment on W_Keybind_Key_C_SetMainText_ImplementableEvent");
static_assert(sizeof(W_Keybind_Key_C_SetMainText_ImplementableEvent) == 0x000018, "Wrong size on W_Keybind_Key_C_SetMainText_ImplementableEvent");
static_assert(offsetof(W_Keybind_Key_C_SetMainText_ImplementableEvent, InKeyName) == 0x000000, "Member 'W_Keybind_Key_C_SetMainText_ImplementableEvent::InKeyName' has a wrong offset!");

// Function W_Keybind_Key.W_Keybind_Key_C.SetMouseIcon_ImplementableEvent
// 0x0060 (0x0060 - 0x0000)
struct W_Keybind_Key_C_SetMouseIcon_ImplementableEvent final
{
public:
	TSoftObjectPtr<class UTexture2D>              InKeyTexture;                                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              InKeyShadowTexture;                                // 0x0030(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_C_SetMouseIcon_ImplementableEvent) == 0x000008, "Wrong alignment on W_Keybind_Key_C_SetMouseIcon_ImplementableEvent");
static_assert(sizeof(W_Keybind_Key_C_SetMouseIcon_ImplementableEvent) == 0x000060, "Wrong size on W_Keybind_Key_C_SetMouseIcon_ImplementableEvent");
static_assert(offsetof(W_Keybind_Key_C_SetMouseIcon_ImplementableEvent, InKeyTexture) == 0x000000, "Member 'W_Keybind_Key_C_SetMouseIcon_ImplementableEvent::InKeyTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_C_SetMouseIcon_ImplementableEvent, InKeyShadowTexture) == 0x000030, "Member 'W_Keybind_Key_C_SetMouseIcon_ImplementableEvent::InKeyShadowTexture' has a wrong offset!");

}

