#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeyguideWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeyguideWidget.W_KeyguideWidget_C
// 0x00A8 (0x03A8 - 0x0300)
class UW_KeyguideWidget_C final : public UP2KeyGuideWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Keyguide;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ActionDisplayName;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlayerMappableOptionsName;                         // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         DisplayNameFont;                                   // 0x0330(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bOverrideDescription;                              // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OverrideDescriptionText;                           // 0x0390(0x0018)(Edit, BlueprintVisible)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_KeyguideWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_KeyguideWidget_C">();
	}
	static class UW_KeyguideWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_KeyguideWidget_C>();
	}
};
static_assert(alignof(UW_KeyguideWidget_C) == 0x000008, "Wrong alignment on UW_KeyguideWidget_C");
static_assert(sizeof(UW_KeyguideWidget_C) == 0x0003A8, "Wrong size on UW_KeyguideWidget_C");
static_assert(offsetof(UW_KeyguideWidget_C, UberGraphFrame) == 0x000300, "Member 'UW_KeyguideWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, Bdr_Keyguide) == 0x000308, "Member 'UW_KeyguideWidget_C::Bdr_Keyguide' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, Txt_ActionDisplayName) == 0x000310, "Member 'UW_KeyguideWidget_C::Txt_ActionDisplayName' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, InputAction) == 0x000318, "Member 'UW_KeyguideWidget_C::InputAction' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, PlayerMappableOptionsName) == 0x000320, "Member 'UW_KeyguideWidget_C::PlayerMappableOptionsName' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, IsDisabled) == 0x000328, "Member 'UW_KeyguideWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, DisplayNameFont) == 0x000330, "Member 'UW_KeyguideWidget_C::DisplayNameFont' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, bOverrideDescription) == 0x000388, "Member 'UW_KeyguideWidget_C::bOverrideDescription' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_C, OverrideDescriptionText) == 0x000390, "Member 'UW_KeyguideWidget_C::OverrideDescriptionText' has a wrong offset!");

}

