#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeybindWidget_Interaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeybindWidget_Interaction.W_KeybindWidget_Interaction_C
// 0x0070 (0x0328 - 0x02B8)
class UW_KeybindWidget_Interaction_C final : public UP2InteractKeybindWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoldTriangle;                                      // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Keybind_Outline;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow_Shadow;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_glow;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Keybind_Shadow;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           InputAction_2;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   FindKey;                                           // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FindActionName;                                    // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_KeybindWidget_Interaction(int32 EntryPoint)	 // 0xae1e64;
	void GetKeyName(class UInputAction* InInputAction, class FText* KeyName, class FText* ActionName)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void UpdateKeyBindWidget()	 // 0xae1e64;
	void UpdateWidget_ImplementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_KeybindWidget_Interaction_C">();
	}
	static class UW_KeybindWidget_Interaction_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_KeybindWidget_Interaction_C>();
	}
};
static_assert(alignof(UW_KeybindWidget_Interaction_C) == 0x000008, "Wrong alignment on UW_KeybindWidget_Interaction_C");
static_assert(sizeof(UW_KeybindWidget_Interaction_C) == 0x000328, "Wrong size on UW_KeybindWidget_Interaction_C");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, UberGraphFrame) == 0x0002B8, "Member 'UW_KeybindWidget_Interaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, HoldTriangle) == 0x0002C0, "Member 'UW_KeybindWidget_Interaction_C::HoldTriangle' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, Bdr_Keybind_Outline) == 0x0002C8, "Member 'UW_KeybindWidget_Interaction_C::Bdr_Keybind_Outline' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, Img_Arrow_Shadow) == 0x0002D0, "Member 'UW_KeybindWidget_Interaction_C::Img_Arrow_Shadow' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, img_glow) == 0x0002D8, "Member 'UW_KeybindWidget_Interaction_C::img_glow' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, Img_Keybind_Shadow) == 0x0002E0, "Member 'UW_KeybindWidget_Interaction_C::Img_Keybind_Shadow' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, IsHold) == 0x0002E8, "Member 'UW_KeybindWidget_Interaction_C::IsHold' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, IsDisabled) == 0x0002E9, "Member 'UW_KeybindWidget_Interaction_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, InputAction_2) == 0x0002F0, "Member 'UW_KeybindWidget_Interaction_C::InputAction_2' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, FindKey) == 0x0002F8, "Member 'UW_KeybindWidget_Interaction_C::FindKey' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_Interaction_C, FindActionName) == 0x000310, "Member 'UW_KeybindWidget_Interaction_C::FindActionName' has a wrong offset!");

}

