#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeyGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeyGuide.W_KeyGuide_C
// 0x0050 (0x02D0 - 0x0280)
class UW_KeyGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_KeybindWidget_C*                     KeyBind;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Keybind;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Laptop;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShowOwner;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ActionName;                                        // 0x02A8(0x0018)(Edit, BlueprintVisible)
	class UInputAction*                           InputAction;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlayerMappableOptionsName;                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_KeyGuide(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_KeyGuide_C">();
	}
	static class UW_KeyGuide_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_KeyGuide_C>();
	}
};
static_assert(alignof(UW_KeyGuide_C) == 0x000008, "Wrong alignment on UW_KeyGuide_C");
static_assert(sizeof(UW_KeyGuide_C) == 0x0002D0, "Wrong size on UW_KeyGuide_C");
static_assert(offsetof(UW_KeyGuide_C, UberGraphFrame) == 0x000280, "Member 'UW_KeyGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, KeyBind) == 0x000288, "Member 'UW_KeyGuide_C::KeyBind' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, Ovr_Keybind) == 0x000290, "Member 'UW_KeyGuide_C::Ovr_Keybind' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, Txt_Laptop) == 0x000298, "Member 'UW_KeyGuide_C::Txt_Laptop' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, IsShowOwner) == 0x0002A0, "Member 'UW_KeyGuide_C::IsShowOwner' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, ActionName) == 0x0002A8, "Member 'UW_KeyGuide_C::ActionName' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, InputAction) == 0x0002C0, "Member 'UW_KeyGuide_C::InputAction' has a wrong offset!");
static_assert(offsetof(UW_KeyGuide_C, PlayerMappableOptionsName) == 0x0002C8, "Member 'UW_KeyGuide_C::PlayerMappableOptionsName' has a wrong offset!");

}

