#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeybindWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeybindWidget.W_KeybindWidget_C
// 0x0150 (0x0420 - 0x02D0)
class UW_KeybindWidget_C final : public UP2KeyBindWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsDisabled;                                        // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            PlusColor;                                         // 0x02DC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         PlusFont;                                          // 0x02F0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            PlusStrike;                                        // 0x0350(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_KeybindWidget(int32 EntryPoint)	 // 0xae1e64;
	void GetKeyName(class UInputAction* InInputAction, class FText* KeyName, class FText* ActionName)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetPlusTextBlock_ImplementableEvent(class UTextBlock* InPlusTextBlock)	 // 0xae1e64;
	void UpdateKeyBindWidget()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_KeybindWidget_C">();
	}
	static class UW_KeybindWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_KeybindWidget_C>();
	}
};
static_assert(alignof(UW_KeybindWidget_C) == 0x000010, "Wrong alignment on UW_KeybindWidget_C");
static_assert(sizeof(UW_KeybindWidget_C) == 0x000420, "Wrong size on UW_KeybindWidget_C");
static_assert(offsetof(UW_KeybindWidget_C, UberGraphFrame) == 0x0002D0, "Member 'UW_KeybindWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_C, IsDisabled) == 0x0002D8, "Member 'UW_KeybindWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_C, PlusColor) == 0x0002DC, "Member 'UW_KeybindWidget_C::PlusColor' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_C, PlusFont) == 0x0002F0, "Member 'UW_KeybindWidget_C::PlusFont' has a wrong offset!");
static_assert(offsetof(UW_KeybindWidget_C, PlusStrike) == 0x000350, "Member 'UW_KeybindWidget_C::PlusStrike' has a wrong offset!");

}

