#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeyguideWidget_Reverse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeyguideWidget_Reverse.W_KeyguideWidget_Reverse_C
// 0x0030 (0x0330 - 0x0300)
class UW_KeyguideWidget_Reverse_C final : public UP2KeyGuideWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Keyguide;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ActionDisplayName;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputAction*                           InputAction;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PlayerMappableOptionsName;                         // 0x0324(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_KeyguideWidget_Reverse(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_KeyguideWidget_Reverse_C">();
	}
	static class UW_KeyguideWidget_Reverse_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_KeyguideWidget_Reverse_C>();
	}
};
static_assert(alignof(UW_KeyguideWidget_Reverse_C) == 0x000008, "Wrong alignment on UW_KeyguideWidget_Reverse_C");
static_assert(sizeof(UW_KeyguideWidget_Reverse_C) == 0x000330, "Wrong size on UW_KeyguideWidget_Reverse_C");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, UberGraphFrame) == 0x000300, "Member 'UW_KeyguideWidget_Reverse_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, Bdr_Keyguide) == 0x000308, "Member 'UW_KeyguideWidget_Reverse_C::Bdr_Keyguide' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, Txt_ActionDisplayName) == 0x000310, "Member 'UW_KeyguideWidget_Reverse_C::Txt_ActionDisplayName' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, InputAction) == 0x000318, "Member 'UW_KeyguideWidget_Reverse_C::InputAction' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, IsDisabled) == 0x000320, "Member 'UW_KeyguideWidget_Reverse_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_KeyguideWidget_Reverse_C, PlayerMappableOptionsName) == 0x000324, "Member 'UW_KeyguideWidget_Reverse_C::PlayerMappableOptionsName' has a wrong offset!");

}

