#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeyguideWidget_Reverse

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_KeyguideWidget_Reverse.W_KeyguideWidget_Reverse_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_KeyguideWidget_Reverse_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_KeyguideWidget_Reverse_C_PreConstruct) == 0x000001, "Wrong alignment on W_KeyguideWidget_Reverse_C_PreConstruct");
static_assert(sizeof(W_KeyguideWidget_Reverse_C_PreConstruct) == 0x000001, "Wrong size on W_KeyguideWidget_Reverse_C_PreConstruct");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_KeyguideWidget_Reverse_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_KeyguideWidget_Reverse.W_KeyguideWidget_Reverse_C.ExecuteUbergraph_W_KeyguideWidget_Reverse
// 0x0058 (0x0058 - 0x0000)
struct W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetInputActionNameFromInputAction_ReturnValue; // 0x0040(0x0018)(ConstParm)
};
static_assert(alignof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse) == 0x000008, "Wrong alignment on W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse");
static_assert(sizeof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse) == 0x000058, "Wrong size on W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, EntryPoint) == 0x000000, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, Temp_name_Variable) == 0x00002C, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, K2Node_Event_IsDesignTime) == 0x000034, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse, CallFunc_GetInputActionNameFromInputAction_ReturnValue) == 0x000040, "Member 'W_KeyguideWidget_Reverse_C_ExecuteUbergraph_W_KeyguideWidget_Reverse::CallFunc_GetInputActionNameFromInputAction_ReturnValue' has a wrong offset!");

}

