#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Keybind_Key_FixedShadow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Keybind_Key_FixedShadow.W_Keybind_Key_FixedShadow_C.ExecuteUbergraph_W_Keybind_Key_FixedShadow
// 0x0118 (0x0118 - 0x0000)
struct W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InKeyName;                            // 0x0020(0x0018)(ConstParm)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InKeyTexture;                         // 0x0038(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_InKeyShadowTexture;                   // 0x0068(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00DC(0x0014)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow) == 0x000008, "Wrong alignment on W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow");
static_assert(sizeof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow) == 0x000118, "Wrong size on W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, EntryPoint) == 0x000000, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_Event_InKeyName) == 0x000020, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_Event_InKeyName' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_Event_InKeyTexture) == 0x000038, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_Event_InKeyTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_Event_InKeyShadowTexture) == 0x000068, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_Event_InKeyShadowTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000098, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_DynamicCast_AsTexture_2D) == 0x0000A0, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x0000AC, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000B0, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x0000B8, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000C0, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x0000C8, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0000D0, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_SwitchString_CmpSuccess) == 0x0000D8, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, K2Node_MakeStruct_SlateColor_1) == 0x0000DC, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0000F0, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000100, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000108, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast) == 0x00010C, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_SetMinDesiredWidth_InMinDesiredWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000110, "Member 'W_Keybind_Key_FixedShadow_C_ExecuteUbergraph_W_Keybind_Key_FixedShadow::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function W_Keybind_Key_FixedShadow.W_Keybind_Key_FixedShadow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Keybind_Key_FixedShadow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_FixedShadow_C_PreConstruct) == 0x000001, "Wrong alignment on W_Keybind_Key_FixedShadow_C_PreConstruct");
static_assert(sizeof(W_Keybind_Key_FixedShadow_C_PreConstruct) == 0x000001, "Wrong size on W_Keybind_Key_FixedShadow_C_PreConstruct");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Keybind_Key_FixedShadow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Keybind_Key_FixedShadow.W_Keybind_Key_FixedShadow_C.SetMainText_ImplementableEvent
// 0x0018 (0x0018 - 0x0000)
struct W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent final
{
public:
	class FText                                   InKeyName;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent) == 0x000008, "Wrong alignment on W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent");
static_assert(sizeof(W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent) == 0x000018, "Wrong size on W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent, InKeyName) == 0x000000, "Member 'W_Keybind_Key_FixedShadow_C_SetMainText_ImplementableEvent::InKeyName' has a wrong offset!");

// Function W_Keybind_Key_FixedShadow.W_Keybind_Key_FixedShadow_C.SetMouseIcon_ImplementableEvent
// 0x0060 (0x0060 - 0x0000)
struct W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent final
{
public:
	TSoftObjectPtr<class UTexture2D>              InKeyTexture;                                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              InKeyShadowTexture;                                // 0x0030(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent) == 0x000008, "Wrong alignment on W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent");
static_assert(sizeof(W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent) == 0x000060, "Wrong size on W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent, InKeyTexture) == 0x000000, "Member 'W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent::InKeyTexture' has a wrong offset!");
static_assert(offsetof(W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent, InKeyShadowTexture) == 0x000030, "Member 'W_Keybind_Key_FixedShadow_C_SetMouseIcon_ImplementableEvent::InKeyShadowTexture' has a wrong offset!");

}

