#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LaptopPopup

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function W_LaptopPopup.W_LaptopPopup_C.ActiveInputAction_Implementable
// 0x0030 (0x0030 - 0x0000)
struct W_LaptopPopup_C_ActiveInputAction_Implementable final
{
public:
	const class UInputAction*                     InInputAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InInputTag;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      InputActionValue;                                  // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_LaptopPopup_C_ActiveInputAction_Implementable) == 0x000008, "Wrong alignment on W_LaptopPopup_C_ActiveInputAction_Implementable");
static_assert(sizeof(W_LaptopPopup_C_ActiveInputAction_Implementable) == 0x000030, "Wrong size on W_LaptopPopup_C_ActiveInputAction_Implementable");
static_assert(offsetof(W_LaptopPopup_C_ActiveInputAction_Implementable, InInputAction) == 0x000000, "Member 'W_LaptopPopup_C_ActiveInputAction_Implementable::InInputAction' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ActiveInputAction_Implementable, InInputTag) == 0x000008, "Member 'W_LaptopPopup_C_ActiveInputAction_Implementable::InInputTag' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ActiveInputAction_Implementable, InputActionValue) == 0x000010, "Member 'W_LaptopPopup_C_ActiveInputAction_Implementable::InputActionValue' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct W_LaptopPopup_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopPopup_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on W_LaptopPopup_C_BP_OnHandleBackAction");
static_assert(sizeof(W_LaptopPopup_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on W_LaptopPopup_C_BP_OnHandleBackAction");
static_assert(offsetof(W_LaptopPopup_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_LaptopPopup_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.ExecuteUbergraph_W_LaptopPopup
// 0x00A0 (0x00A0 - 0x0000)
struct W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     K2Node_Event_InInputAction;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InInputTag;                           // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_Event_InputActionValue;                     // 0x0018(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupStyle                                   K2Node_Event_PopupStyle;                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0040(0x0018)(ConstParm)
	class FText                                   K2Node_Event_BodyMessage;                          // 0x0058(0x0018)(ConstParm)
	class FText                                   K2Node_Event_SubMessage;                           // 0x0070(0x0018)(ConstParm)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_PressedDelegate;                      // 0x0088(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup) == 0x000008, "Wrong alignment on W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup");
static_assert(sizeof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup) == 0x0000A0, "Wrong size on W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, EntryPoint) == 0x000000, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_InInputAction) == 0x000008, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_InInputAction' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_InInputTag) == 0x000010, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_InInputTag' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_InputActionValue) == 0x000018, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_InputActionValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_PopupStyle) == 0x000039, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_PopupStyle' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_Title) == 0x000040, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_BodyMessage) == 0x000058, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_BodyMessage' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_SubMessage) == 0x000070, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_SubMessage' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_PressedDelegate) == 0x000088, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_PressedDelegate' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup, K2Node_Event_IsDesignTime) == 0x000098, "Member 'W_LaptopPopup_C_ExecuteUbergraph_W_LaptopPopup::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_LaptopPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopPopup_C_PreConstruct) == 0x000001, "Wrong alignment on W_LaptopPopup_C_PreConstruct");
static_assert(sizeof(W_LaptopPopup_C_PreConstruct) == 0x000001, "Wrong size on W_LaptopPopup_C_PreConstruct");
static_assert(offsetof(W_LaptopPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_LaptopPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.SetPopup
// 0x0060 (0x0060 - 0x0000)
struct W_LaptopPopup_C_SetPopup final
{
public:
	EPopupStyle                                   PopupStyle;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   BodyMessage;                                       // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   SubMessage;                                        // 0x0038(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(EPopupButtonID ButtonID)>      PressedDelegate;                                   // 0x0050(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopPopup_C_SetPopup) == 0x000008, "Wrong alignment on W_LaptopPopup_C_SetPopup");
static_assert(sizeof(W_LaptopPopup_C_SetPopup) == 0x000060, "Wrong size on W_LaptopPopup_C_SetPopup");
static_assert(offsetof(W_LaptopPopup_C_SetPopup, PopupStyle) == 0x000000, "Member 'W_LaptopPopup_C_SetPopup::PopupStyle' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopup, Title) == 0x000008, "Member 'W_LaptopPopup_C_SetPopup::Title' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopup, BodyMessage) == 0x000020, "Member 'W_LaptopPopup_C_SetPopup::BodyMessage' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopup, SubMessage) == 0x000038, "Member 'W_LaptopPopup_C_SetPopup::SubMessage' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopup, PressedDelegate) == 0x000050, "Member 'W_LaptopPopup_C_SetPopup::PressedDelegate' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.SetPopupStyle
// 0x0118 (0x0118 - 0x0000)
struct W_LaptopPopup_C_SetPopupStyle final
{
public:
	EPopupStyle                                   Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlsdCommonButtonWidget_C*            PlasButton_Default;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            PlsdButton_Cancel;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_PlsdCommonButtonWidget_C*            K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0048(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0060(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0078(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0090(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x00A8(0x0018)()
	class UW_PlsdCommonButtonWidget_C*            K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget_1; // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x00D0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x00E8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x0100(0x0018)()
};
static_assert(alignof(W_LaptopPopup_C_SetPopupStyle) == 0x000008, "Wrong alignment on W_LaptopPopup_C_SetPopupStyle");
static_assert(sizeof(W_LaptopPopup_C_SetPopupStyle) == 0x000118, "Wrong size on W_LaptopPopup_C_SetPopupStyle");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, Selection) == 0x000000, "Member 'W_LaptopPopup_C_SetPopupStyle::Selection' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, PlasButton_Default) == 0x000008, "Member 'W_LaptopPopup_C_SetPopupStyle::PlasButton_Default' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, PlsdButton_Cancel) == 0x000010, "Member 'W_LaptopPopup_C_SetPopupStyle::PlsdButton_Cancel' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'W_LaptopPopup_C_SetPopupStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget) == 0x000020, "Member 'W_LaptopPopup_C_SetPopupStyle::K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_LaptopPopup_C_SetPopupStyle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue) == 0x000030, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000048, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000060, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000078, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000090, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0000A8, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget_1) == 0x0000C0, "Member 'W_LaptopPopup_C_SetPopupStyle::K2Node_DynamicCast_AsW_Plsd_Common_Button_Widget_1' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, K2Node_DynamicCast_bSuccess_1) == 0x0000C8, "Member 'W_LaptopPopup_C_SetPopupStyle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0000D0, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_7) == 0x0000E8, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_8) == 0x000100, "Member 'W_LaptopPopup_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");

// Function W_LaptopPopup.W_LaptopPopup_C.ValidateNickName
// 0x0050 (0x0050 - 0x0000)
struct W_LaptopPopup_C_ValidateNickName final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          NewParam1;                                         // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FilterString_OutResult;                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FilterString_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopPopup_C_ValidateNickName) == 0x000008, "Wrong alignment on W_LaptopPopup_C_ValidateNickName");
static_assert(sizeof(W_LaptopPopup_C_ValidateNickName) == 0x000050, "Wrong size on W_LaptopPopup_C_ValidateNickName");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, NewParam) == 0x000000, "Member 'W_LaptopPopup_C_ValidateNickName::NewParam' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, NewParam1) == 0x000018, "Member 'W_LaptopPopup_C_ValidateNickName::NewParam1' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_FilterString_OutResult) == 0x000030, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_FilterString_OutResult' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_FilterString_ReturnValue) == 0x000040, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_FilterString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_Len_ReturnValue) == 0x000044, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopPopup_C_ValidateNickName, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'W_LaptopPopup_C_ValidateNickName::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

