#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LaptopMain

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_LaptopMain.W_LaptopMain_C.ExecuteUbergraph_W_LaptopMain
// 0x0090 (0x0090 - 0x0000)
struct W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HUD*                                 CallFunc_GetHudFromWorld_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0010(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AP2HUD_Hideout*                         K2Node_DynamicCast_AsP2HUD_Hideout;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2RadioButton*                         CallFunc_GetRadioButton_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain) == 0x000008, "Wrong alignment on W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain");
static_assert(sizeof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain) == 0x000090, "Wrong size on W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, EntryPoint) == 0x000000, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_GetHudFromWorld_ReturnValue) == 0x000008, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_GetHudFromWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_MakeStruct_SlateChildSize) == 0x000010, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_DynamicCast_AsP2HUD_Hideout) == 0x000020, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_DynamicCast_AsP2HUD_Hideout' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_Event_MyGeometry) == 0x00002C, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_Event_InDeltaTime) == 0x000064, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_GetRadioButton_ReturnValue) == 0x000078, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_GetRadioButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000080, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'W_LaptopMain_C_ExecuteUbergraph_W_LaptopMain::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function W_LaptopMain.W_LaptopMain_C.OnGNBButtonSelected_ImplementableEvent
// 0x0002 (0x0002 - 0x0000)
struct W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent final
{
public:
	ELaptopGNBType                                InLaptopGNBType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent) == 0x000001, "Wrong alignment on W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent");
static_assert(sizeof(W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent) == 0x000002, "Wrong size on W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent");
static_assert(offsetof(W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent, InLaptopGNBType) == 0x000000, "Member 'W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent::InLaptopGNBType' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'W_LaptopMain_C_OnGNBButtonSelected_ImplementableEvent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_LaptopMain.W_LaptopMain_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_LaptopMain_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LaptopMain_C_Tick) == 0x000004, "Wrong alignment on W_LaptopMain_C_Tick");
static_assert(sizeof(W_LaptopMain_C_Tick) == 0x00003C, "Wrong size on W_LaptopMain_C_Tick");
static_assert(offsetof(W_LaptopMain_C_Tick, MyGeometry) == 0x000000, "Member 'W_LaptopMain_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_LaptopMain_C_Tick, InDeltaTime) == 0x000038, "Member 'W_LaptopMain_C_Tick::InDeltaTime' has a wrong offset!");

}

