#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LaptopMain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LaptopMain.W_LaptopMain_C
// 0x0048 (0x0720 - 0x06D8)
class UW_LaptopMain_C final : public UP2LaptopMainWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             txt_plus;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_HoldRMB;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_LAlt;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_R;                                      // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RemoveMarker;                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RMB;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RotateMap;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SystemMenuButton_C*                  W_SystemMenuButton;                                // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void EndFadeOutEvent()	 // 0xae1e64;
	void ExecuteUbergraph_W_LaptopMain(int32 EntryPoint)	 // 0xae1e64;
	void OnFinishAdded()	 // 0xae1e64;
	void OnGNBButtonSelected_ImplementableEvent(ELaptopGNBType InLaptopGNBType)	 // 0xae1e64;
	void SequenceEvent__ENTRYPOINTW_LaptopMain()	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LaptopMain_C">();
	}
	static class UW_LaptopMain_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LaptopMain_C>();
	}
};
static_assert(alignof(UW_LaptopMain_C) == 0x000008, "Wrong alignment on UW_LaptopMain_C");
static_assert(sizeof(UW_LaptopMain_C) == 0x000720, "Wrong size on UW_LaptopMain_C");
static_assert(offsetof(UW_LaptopMain_C, UberGraphFrame) == 0x0006D8, "Member 'UW_LaptopMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, txt_plus) == 0x0006E0, "Member 'UW_LaptopMain_C::txt_plus' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_HoldRMB) == 0x0006E8, "Member 'UW_LaptopMain_C::W_Keyguide_HoldRMB' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_LAlt) == 0x0006F0, "Member 'UW_LaptopMain_C::W_Keyguide_LAlt' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_R) == 0x0006F8, "Member 'UW_LaptopMain_C::W_Keyguide_R' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_RemoveMarker) == 0x000700, "Member 'UW_LaptopMain_C::W_Keyguide_RemoveMarker' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_RMB) == 0x000708, "Member 'UW_LaptopMain_C::W_Keyguide_RMB' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_Keyguide_RotateMap) == 0x000710, "Member 'UW_LaptopMain_C::W_Keyguide_RotateMap' has a wrong offset!");
static_assert(offsetof(UW_LaptopMain_C, W_SystemMenuButton) == 0x000718, "Member 'UW_LaptopMain_C::W_SystemMenuButton' has a wrong offset!");

}

