#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Laptop_CommonBtnWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Laptop_CommonBtnWidget.W_Laptop_CommonBtnWidget_C
// 0x1040 (0x1400 - 0x03C0)
class UW_Laptop_CommonBtnWidget_C final : public UP2CommonButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Button;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DotPattern;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Button;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Deco;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonName;                                        // 0x03F0(0x0018)(Edit, BlueprintVisible)
	EPopupButtonID                                ButtonID;                                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           YesOkBtnStyle;                                     // 0x0410(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           CancelNoBtnStyle;                                  // 0x0800(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DefaultBtnStyle;                                   // 0x0BF0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DisabledBtnStyle;                                  // 0x0FE0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BtnWidth;                                          // 0x13D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13D4[0x4];                                     // 0x13D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnButtonHovered;                                   // 0x13D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnButtonUnhovered;                                 // 0x13E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        BtnHeight;                                         // 0x13F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveKeyFocus()	 // 0xae1e64;
	void BndEvt__W_Laptop_CommonBtnWidget_Btn_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Laptop_CommonBtnWidget_Btn_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void DeActiveKeyFocus()	 // 0xae1e64;
	void ExecuteUbergraph_W_Laptop_CommonBtnWidget(int32 EntryPoint)	 // 0xae1e64;
	void Hovered_lementableEvent()	 // 0xae1e64;
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent)	 // 0xae1e64;
	void OnMouseLeave(const struct FPointerEvent& MouseEvent)	 // 0xae1e64;
	void OnSetButtonEnabled_ImplementableEvent(bool InIsEnable)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetButtonEnabled(bool IsEnabled)	 // 0xae1e64;
	void UnHovered_lementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Laptop_CommonBtnWidget_C">();
	}
	static class UW_Laptop_CommonBtnWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Laptop_CommonBtnWidget_C>();
	}
};
static_assert(alignof(UW_Laptop_CommonBtnWidget_C) == 0x000010, "Wrong alignment on UW_Laptop_CommonBtnWidget_C");
static_assert(sizeof(UW_Laptop_CommonBtnWidget_C) == 0x001400, "Wrong size on UW_Laptop_CommonBtnWidget_C");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, UberGraphFrame) == 0x0003C0, "Member 'UW_Laptop_CommonBtnWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, Bdr_Button) == 0x0003C8, "Member 'UW_Laptop_CommonBtnWidget_C::Bdr_Button' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, Img_Bracket) == 0x0003D0, "Member 'UW_Laptop_CommonBtnWidget_C::Img_Bracket' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, Img_DotPattern) == 0x0003D8, "Member 'UW_Laptop_CommonBtnWidget_C::Img_DotPattern' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, SzB_Button) == 0x0003E0, "Member 'UW_Laptop_CommonBtnWidget_C::SzB_Button' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, Txt_Deco) == 0x0003E8, "Member 'UW_Laptop_CommonBtnWidget_C::Txt_Deco' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, ButtonName) == 0x0003F0, "Member 'UW_Laptop_CommonBtnWidget_C::ButtonName' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, ButtonID) == 0x000408, "Member 'UW_Laptop_CommonBtnWidget_C::ButtonID' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, IsDisabled) == 0x000409, "Member 'UW_Laptop_CommonBtnWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, YesOkBtnStyle) == 0x000410, "Member 'UW_Laptop_CommonBtnWidget_C::YesOkBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, CancelNoBtnStyle) == 0x000800, "Member 'UW_Laptop_CommonBtnWidget_C::CancelNoBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, DefaultBtnStyle) == 0x000BF0, "Member 'UW_Laptop_CommonBtnWidget_C::DefaultBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, DisabledBtnStyle) == 0x000FE0, "Member 'UW_Laptop_CommonBtnWidget_C::DisabledBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, BtnWidth) == 0x0013D0, "Member 'UW_Laptop_CommonBtnWidget_C::BtnWidth' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, OnButtonHovered) == 0x0013D8, "Member 'UW_Laptop_CommonBtnWidget_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, OnButtonUnhovered) == 0x0013E8, "Member 'UW_Laptop_CommonBtnWidget_C::OnButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UW_Laptop_CommonBtnWidget_C, BtnHeight) == 0x0013F8, "Member 'UW_Laptop_CommonBtnWidget_C::BtnHeight' has a wrong offset!");

}

