#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Laptop_MessageHubBtnWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.ExecuteUbergraph_W_Laptop_MessageHubBtnWidget
// 0x004C (0x004C - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisabled;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNoti;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbSelected;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget) == 0x000004, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget) == 0x00004C, "Wrong size on W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, EntryPoint) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, K2Node_Event_bInDisabled) == 0x000004, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::K2Node_Event_bInDisabled' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, K2Node_Event_MyGeometry) == 0x000008, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, K2Node_Event_InDeltaTime) == 0x000040, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, K2Node_Event_InNoti) == 0x000044, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::K2Node_Event_InNoti' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget, K2Node_Event_InbSelected) == 0x000048, "Member 'W_Laptop_MessageHubBtnWidget_C_ExecuteUbergraph_W_Laptop_MessageHubBtnWidget::K2Node_Event_InbSelected' has a wrong offset!");

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.RefreshNotiWidgetOnBP
// 0x0004 (0x0004 - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP final
{
public:
	int32                                         InNoti;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP) == 0x000004, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP) == 0x000004, "Wrong size on W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP, InNoti) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_RefreshNotiWidgetOnBP::InNoti' has a wrong offset!");

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.SetDisabled
// 0x0001 (0x0001 - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_SetDisabled final
{
public:
	bool                                          bInDisabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_SetDisabled) == 0x000001, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_SetDisabled");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_SetDisabled) == 0x000001, "Wrong size on W_Laptop_MessageHubBtnWidget_C_SetDisabled");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_SetDisabled, bInDisabled) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_SetDisabled::bInDisabled' has a wrong offset!");

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.ShowNoti
// 0x0020 (0x0020 - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_ShowNoti final
{
public:
	int32                                         NewMessagesInt_0;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_ShowNoti) == 0x000008, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_ShowNoti");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_ShowNoti) == 0x000020, "Wrong size on W_Laptop_MessageHubBtnWidget_C_ShowNoti");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ShowNoti, NewMessagesInt_0) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_ShowNoti::NewMessagesInt_0' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ShowNoti, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'W_Laptop_MessageHubBtnWidget_C_ShowNoti::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_ShowNoti, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'W_Laptop_MessageHubBtnWidget_C_ShowNoti::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_Tick) == 0x000004, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_Tick");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_Tick) == 0x00003C, "Wrong size on W_Laptop_MessageHubBtnWidget_C_Tick");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_Laptop_MessageHubBtnWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_Laptop_MessageHubBtnWidget.W_Laptop_MessageHubBtnWidget_C.UpdateSelectedDesign
// 0x0001 (0x0001 - 0x0000)
struct W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign final
{
public:
	bool                                          InbSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign) == 0x000001, "Wrong alignment on W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign");
static_assert(sizeof(W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign) == 0x000001, "Wrong size on W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign");
static_assert(offsetof(W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign, InbSelected) == 0x000000, "Member 'W_Laptop_MessageHubBtnWidget_C_UpdateSelectedDesign::InbSelected' has a wrong offset!");

}

