#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LevelSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_LevelSlot.W_LevelSlot_C.BP_SetActive
// 0x0001 (0x0001 - 0x0000)
struct W_LevelSlot_C_BP_SetActive final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_BP_SetActive) == 0x000001, "Wrong alignment on W_LevelSlot_C_BP_SetActive");
static_assert(sizeof(W_LevelSlot_C_BP_SetActive) == 0x000001, "Wrong size on W_LevelSlot_C_BP_SetActive");
static_assert(offsetof(W_LevelSlot_C_BP_SetActive, bInIsActive) == 0x000000, "Member 'W_LevelSlot_C_BP_SetActive::bInIsActive' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.BP_SetCurrentLevel
// 0x0004 (0x0004 - 0x0000)
struct W_LevelSlot_C_BP_SetCurrentLevel final
{
public:
	int32                                         InCurrentLevel;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_BP_SetCurrentLevel) == 0x000004, "Wrong alignment on W_LevelSlot_C_BP_SetCurrentLevel");
static_assert(sizeof(W_LevelSlot_C_BP_SetCurrentLevel) == 0x000004, "Wrong size on W_LevelSlot_C_BP_SetCurrentLevel");
static_assert(offsetof(W_LevelSlot_C_BP_SetCurrentLevel, InCurrentLevel) == 0x000000, "Member 'W_LevelSlot_C_BP_SetCurrentLevel::InCurrentLevel' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.BP_SetIndex
// 0x0004 (0x0004 - 0x0000)
struct W_LevelSlot_C_BP_SetIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_BP_SetIndex) == 0x000004, "Wrong alignment on W_LevelSlot_C_BP_SetIndex");
static_assert(sizeof(W_LevelSlot_C_BP_SetIndex) == 0x000004, "Wrong size on W_LevelSlot_C_BP_SetIndex");
static_assert(offsetof(W_LevelSlot_C_BP_SetIndex, InIndex) == 0x000000, "Member 'W_LevelSlot_C_BP_SetIndex::InIndex' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.BP_SetShowLine
// 0x0001 (0x0001 - 0x0000)
struct W_LevelSlot_C_BP_SetShowLine final
{
public:
	bool                                          bInShowLine;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_BP_SetShowLine) == 0x000001, "Wrong alignment on W_LevelSlot_C_BP_SetShowLine");
static_assert(sizeof(W_LevelSlot_C_BP_SetShowLine) == 0x000001, "Wrong size on W_LevelSlot_C_BP_SetShowLine");
static_assert(offsetof(W_LevelSlot_C_BP_SetShowLine, bInShowLine) == 0x000000, "Member 'W_LevelSlot_C_BP_SetShowLine::bInShowLine' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.ExecuteUbergraph_W_LevelSlot
// 0x0038 (0x0038 - 0x0000)
struct W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsActive;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InCurrentLevel;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InIndex;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_CustomEvent_Img_SelectedOutline;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShowLine;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot) == 0x000008, "Wrong alignment on W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot");
static_assert(sizeof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot) == 0x000038, "Wrong size on W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, EntryPoint) == 0x000000, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_Event_bInIsSelected) == 0x000004, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_Event_bInIsActive) == 0x000005, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_Event_bInIsActive' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_Event_InCurrentLevel) == 0x000008, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_Event_InCurrentLevel' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_Event_InIndex) == 0x000010, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_Event_InIndex' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000014, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_CustomEvent_Img_SelectedOutline) == 0x000018, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_CustomEvent_Img_SelectedOutline' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, K2Node_Event_bInShowLine) == 0x000020, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::K2Node_Event_bInShowLine' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000030, "Member 'W_LevelSlot_C_ExecuteUbergraph_W_LevelSlot::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.Img_SelectedOutline_Event
// 0x0008 (0x0008 - 0x0000)
struct W_LevelSlot_C_Img_SelectedOutline_Event final
{
public:
	class UImage*                                 Img_SelectedOutline_0;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_Img_SelectedOutline_Event) == 0x000008, "Wrong alignment on W_LevelSlot_C_Img_SelectedOutline_Event");
static_assert(sizeof(W_LevelSlot_C_Img_SelectedOutline_Event) == 0x000008, "Wrong size on W_LevelSlot_C_Img_SelectedOutline_Event");
static_assert(offsetof(W_LevelSlot_C_Img_SelectedOutline_Event, Img_SelectedOutline_0) == 0x000000, "Member 'W_LevelSlot_C_Img_SelectedOutline_Event::Img_SelectedOutline_0' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct W_LevelSlot_C_SetSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_SetSelected) == 0x000001, "Wrong alignment on W_LevelSlot_C_SetSelected");
static_assert(sizeof(W_LevelSlot_C_SetSelected) == 0x000001, "Wrong size on W_LevelSlot_C_SetSelected");
static_assert(offsetof(W_LevelSlot_C_SetSelected, bInIsSelected) == 0x000000, "Member 'W_LevelSlot_C_SetSelected::bInIsSelected' has a wrong offset!");

// Function W_LevelSlot.W_LevelSlot_C.SetSequential
// 0x0001 (0x0001 - 0x0000)
struct W_LevelSlot_C_SetSequential final
{
public:
	bool                                          IsSequential_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LevelSlot_C_SetSequential) == 0x000001, "Wrong alignment on W_LevelSlot_C_SetSequential");
static_assert(sizeof(W_LevelSlot_C_SetSequential) == 0x000001, "Wrong size on W_LevelSlot_C_SetSequential");
static_assert(offsetof(W_LevelSlot_C_SetSequential, IsSequential_0) == 0x000000, "Member 'W_LevelSlot_C_SetSequential::IsSequential_0' has a wrong offset!");

}

