#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeaderBoard

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_LeaderBoard.W_LeaderBoard_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct W_LeaderBoard_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoard_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on W_LeaderBoard_C_BP_OnHandleBackAction");
static_assert(sizeof(W_LeaderBoard_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on W_LeaderBoard_C_BP_OnHandleBackAction");
static_assert(offsetof(W_LeaderBoard_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_LeaderBoard_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function W_LeaderBoard.W_LeaderBoard_C.ExecuteUbergraph_W_LeaderBoard
// 0x0048 (0x0048 - 0x0000)
struct W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0008(0x0008)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2RadioButton*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard) == 0x000008, "Wrong alignment on W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard");
static_assert(sizeof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard) == 0x000048, "Wrong size on W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, EntryPoint) == 0x000000, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, K2Node_MakeStruct_SlateChildSize) == 0x000008, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_GetAllRadioButtons_ReturnValue) == 0x000018, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_GetAllRadioButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard, CallFunc_Less_IntInt_ReturnValue) == 0x000045, "Member 'W_LeaderBoard_C_ExecuteUbergraph_W_LeaderBoard::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

