#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeaderBoardListItem

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_LeaderBoardListItem.W_LeaderBoardListItem_C.ExecuteUbergraph_W_LeaderBoardListItem
// 0x0048 (0x0048 - 0x0000)
struct W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2LeaderboardListItemType                    K2Node_Event_InNewItemType;                        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem) == 0x000004, "Wrong alignment on W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem");
static_assert(sizeof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem) == 0x000048, "Wrong size on W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, EntryPoint) == 0x000000, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_Event_IsDesignTime) == 0x000044, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_Event_InNewItemType) == 0x000045, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_Event_InNewItemType' has a wrong offset!");
static_assert(offsetof(W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem, K2Node_SwitchEnum_CmpSuccess) == 0x000046, "Member 'W_LeaderBoardListItem_C_ExecuteUbergraph_W_LeaderBoardListItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function W_LeaderBoardListItem.W_LeaderBoardListItem_C.OnUpdateItemWidgetTypeIndexOnBP
// 0x0001 (0x0001 - 0x0000)
struct W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP final
{
public:
	EP2LeaderboardListItemType                    InNewItemType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP) == 0x000001, "Wrong alignment on W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP");
static_assert(sizeof(W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP) == 0x000001, "Wrong size on W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP");
static_assert(offsetof(W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP, InNewItemType) == 0x000000, "Member 'W_LeaderBoardListItem_C_OnUpdateItemWidgetTypeIndexOnBP::InNewItemType' has a wrong offset!");

// Function W_LeaderBoardListItem.W_LeaderBoardListItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_LeaderBoardListItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LeaderBoardListItem_C_PreConstruct) == 0x000001, "Wrong alignment on W_LeaderBoardListItem_C_PreConstruct");
static_assert(sizeof(W_LeaderBoardListItem_C_PreConstruct) == 0x000001, "Wrong size on W_LeaderBoardListItem_C_PreConstruct");
static_assert(offsetof(W_LeaderBoardListItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_LeaderBoardListItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

