#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LevelSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LevelSlot.W_LevelSlot_C
// 0x0040 (0x02D8 - 0x0298)
class UW_LevelSlot_C final : public UP2LevelSlotWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Outline;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_SelectedBg;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Inner;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedAnim;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedOutline;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSequential;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_SetActive(bool bInIsActive)	 // 0xae1e64;
	void BP_SetCurrentLevel(int32 InCurrentLevel)	 // 0xae1e64;
	void BP_SetIndex(int32 InIndex)	 // 0xae1e64;
	void BP_SetShowLine(bool bInShowLine)	 // 0xae1e64;
	void ExecuteUbergraph_W_LevelSlot(int32 EntryPoint)	 // 0xae1e64;
	void Img_SelectedOutline_Event(class UImage* Img_SelectedOutline_0)	 // 0xae1e64;
	void SetSelected(bool bInIsSelected)	 // 0xae1e64;
	void SetSequential(bool IsSequential_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LevelSlot_C">();
	}
	static class UW_LevelSlot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LevelSlot_C>();
	}
};
static_assert(alignof(UW_LevelSlot_C) == 0x000008, "Wrong alignment on UW_LevelSlot_C");
static_assert(sizeof(UW_LevelSlot_C) == 0x0002D8, "Wrong size on UW_LevelSlot_C");
static_assert(offsetof(UW_LevelSlot_C, UberGraphFrame) == 0x000298, "Member 'UW_LevelSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, Bdr_Outline) == 0x0002A0, "Member 'UW_LevelSlot_C::Bdr_Outline' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, Bdr_SelectedBg) == 0x0002A8, "Member 'UW_LevelSlot_C::Bdr_SelectedBg' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, Img_Inner) == 0x0002B0, "Member 'UW_LevelSlot_C::Img_Inner' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, img_line) == 0x0002B8, "Member 'UW_LevelSlot_C::img_line' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, Img_SelectedAnim) == 0x0002C0, "Member 'UW_LevelSlot_C::Img_SelectedAnim' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, Img_SelectedOutline) == 0x0002C8, "Member 'UW_LevelSlot_C::Img_SelectedOutline' has a wrong offset!");
static_assert(offsetof(UW_LevelSlot_C, IsSequential) == 0x0002D0, "Member 'UW_LevelSlot_C::IsSequential' has a wrong offset!");

}

