#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadoutPresetSlot

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadoutPresetSlot.W_LoadoutPresetSlot_C
// 0x0038 (0x0370 - 0x0338)
class UW_LoadoutPresetSlot_C final : public UP2LoadoutPresetSlotWidget
{
public:
	class UHorizontalBox*                         HB_InventorySlotGroup;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bg;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_Locked;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonVirtualSlot_C*                 W_BackSlot;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonVirtualSlot_C*                 W_CommonVirtualSlot;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonVirtualSlot_C*                 W_MagSlot;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LoadoutPresetSlot_C">();
	}
	static class UW_LoadoutPresetSlot_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LoadoutPresetSlot_C>();
	}
};
static_assert(alignof(UW_LoadoutPresetSlot_C) == 0x000008, "Wrong alignment on UW_LoadoutPresetSlot_C");
static_assert(sizeof(UW_LoadoutPresetSlot_C) == 0x000370, "Wrong size on UW_LoadoutPresetSlot_C");
static_assert(offsetof(UW_LoadoutPresetSlot_C, HB_InventorySlotGroup) == 0x000338, "Member 'UW_LoadoutPresetSlot_C::HB_InventorySlotGroup' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, Img_Bg) == 0x000340, "Member 'UW_LoadoutPresetSlot_C::Img_Bg' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, img_Locked) == 0x000348, "Member 'UW_LoadoutPresetSlot_C::img_Locked' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, Img_Outline) == 0x000350, "Member 'UW_LoadoutPresetSlot_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, W_BackSlot) == 0x000358, "Member 'UW_LoadoutPresetSlot_C::W_BackSlot' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, W_CommonVirtualSlot) == 0x000360, "Member 'UW_LoadoutPresetSlot_C::W_CommonVirtualSlot' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetSlot_C, W_MagSlot) == 0x000368, "Member 'UW_LoadoutPresetSlot_C::W_MagSlot' has a wrong offset!");

}

