#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadoutPresetItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_LoadoutPresetItem.W_LoadoutPresetItem_C.ExecuteUbergraph_W_LoadoutPresetItem
// 0x0030 (0x0030 - 0x0000)
struct W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem) == 0x000004, "Wrong alignment on W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem");
static_assert(sizeof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem) == 0x000030, "Wrong size on W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem");
static_assert(offsetof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem, EntryPoint) == 0x000000, "Member 'W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'W_LoadoutPresetItem_C_ExecuteUbergraph_W_LoadoutPresetItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

