#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadoutPreset

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadoutPreset.W_LoadoutPreset_C
// 0x00C8 (0x0898 - 0x07D0)
class UW_LoadoutPreset_C final : public UP2LoadoutPresetWidget
{
public:
	class UBorder*                                Bdr_NoMissingItems;                                // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_NoUnavailableItems;                            // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Pocket;                                        // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_HeadlineWidget_C*          FastAccess;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Detail_Outline;                                // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Detail_Underline;                              // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider01;                                     // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider02;                                     // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Edit;                                          // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EquipmentDivider;                              // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_EquipmentDivider02;                            // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_FastAccessDivider;                             // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pocket_Icon;                                   // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pocket_Outline;                                // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pocket_Pattern;                                // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PurchaseDivider;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SlowAccessDivider;                             // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline;                                     // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ValueDivider;                                  // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Inventory_HeadlineWidget_C*          SlowAccess;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_InventorySlots;                                // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Loadout;                                       // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Total;                                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_ValueInfo;                                      // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnInitializeUnavailableItems(bool bHasUnavailableItems)	 // 0xae1e64;
	void OnInitializePurchaseItems(bool bHasPurchaseItems)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LoadoutPreset_C">();
	}
	static class UW_LoadoutPreset_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LoadoutPreset_C>();
	}
};
static_assert(alignof(UW_LoadoutPreset_C) == 0x000008, "Wrong alignment on UW_LoadoutPreset_C");
static_assert(sizeof(UW_LoadoutPreset_C) == 0x000898, "Wrong size on UW_LoadoutPreset_C");
static_assert(offsetof(UW_LoadoutPreset_C, Bdr_NoMissingItems) == 0x0007D0, "Member 'UW_LoadoutPreset_C::Bdr_NoMissingItems' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Bdr_NoUnavailableItems) == 0x0007D8, "Member 'UW_LoadoutPreset_C::Bdr_NoUnavailableItems' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Bdr_Pocket) == 0x0007E0, "Member 'UW_LoadoutPreset_C::Bdr_Pocket' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, FastAccess) == 0x0007E8, "Member 'UW_LoadoutPreset_C::FastAccess' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Detail_Outline) == 0x0007F0, "Member 'UW_LoadoutPreset_C::Img_Detail_Outline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Detail_Underline) == 0x0007F8, "Member 'UW_LoadoutPreset_C::Img_Detail_Underline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Divider01) == 0x000800, "Member 'UW_LoadoutPreset_C::Img_Divider01' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Divider02) == 0x000808, "Member 'UW_LoadoutPreset_C::Img_Divider02' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Edit) == 0x000810, "Member 'UW_LoadoutPreset_C::Img_Edit' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_EquipmentDivider) == 0x000818, "Member 'UW_LoadoutPreset_C::Img_EquipmentDivider' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_EquipmentDivider02) == 0x000820, "Member 'UW_LoadoutPreset_C::Img_EquipmentDivider02' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_FastAccessDivider) == 0x000828, "Member 'UW_LoadoutPreset_C::Img_FastAccessDivider' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Outline) == 0x000830, "Member 'UW_LoadoutPreset_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Pocket_Icon) == 0x000838, "Member 'UW_LoadoutPreset_C::Img_Pocket_Icon' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Pocket_Outline) == 0x000840, "Member 'UW_LoadoutPreset_C::Img_Pocket_Outline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Pocket_Pattern) == 0x000848, "Member 'UW_LoadoutPreset_C::Img_Pocket_Pattern' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_PurchaseDivider) == 0x000850, "Member 'UW_LoadoutPreset_C::Img_PurchaseDivider' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_SlowAccessDivider) == 0x000858, "Member 'UW_LoadoutPreset_C::Img_SlowAccessDivider' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_Underline) == 0x000860, "Member 'UW_LoadoutPreset_C::Img_Underline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Img_ValueDivider) == 0x000868, "Member 'UW_LoadoutPreset_C::Img_ValueDivider' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, SlowAccess) == 0x000870, "Member 'UW_LoadoutPreset_C::SlowAccess' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, SzB_InventorySlots) == 0x000878, "Member 'UW_LoadoutPreset_C::SzB_InventorySlots' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, SzB_Loadout) == 0x000880, "Member 'UW_LoadoutPreset_C::SzB_Loadout' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, Txt_Total) == 0x000888, "Member 'UW_LoadoutPreset_C::Txt_Total' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPreset_C, VB_ValueInfo) == 0x000890, "Member 'UW_LoadoutPreset_C::VB_ValueInfo' has a wrong offset!");

}

