#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadoutPreset

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_LoadoutPreset.W_LoadoutPreset_C.OnInitializeUnavailableItems
// 0x0001 (0x0001 - 0x0000)
struct W_LoadoutPreset_C_OnInitializeUnavailableItems final
{
public:
	bool                                          bHasUnavailableItems;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LoadoutPreset_C_OnInitializeUnavailableItems) == 0x000001, "Wrong alignment on W_LoadoutPreset_C_OnInitializeUnavailableItems");
static_assert(sizeof(W_LoadoutPreset_C_OnInitializeUnavailableItems) == 0x000001, "Wrong size on W_LoadoutPreset_C_OnInitializeUnavailableItems");
static_assert(offsetof(W_LoadoutPreset_C_OnInitializeUnavailableItems, bHasUnavailableItems) == 0x000000, "Member 'W_LoadoutPreset_C_OnInitializeUnavailableItems::bHasUnavailableItems' has a wrong offset!");

// Function W_LoadoutPreset.W_LoadoutPreset_C.OnInitializePurchaseItems
// 0x0001 (0x0001 - 0x0000)
struct W_LoadoutPreset_C_OnInitializePurchaseItems final
{
public:
	bool                                          bHasPurchaseItems;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_LoadoutPreset_C_OnInitializePurchaseItems) == 0x000001, "Wrong alignment on W_LoadoutPreset_C_OnInitializePurchaseItems");
static_assert(sizeof(W_LoadoutPreset_C_OnInitializePurchaseItems) == 0x000001, "Wrong size on W_LoadoutPreset_C_OnInitializePurchaseItems");
static_assert(offsetof(W_LoadoutPreset_C_OnInitializePurchaseItems, bHasPurchaseItems) == 0x000000, "Member 'W_LoadoutPreset_C_OnInitializePurchaseItems::bHasPurchaseItems' has a wrong offset!");

}

