#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LocationTimeCaption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LocationTimeCaption.W_LocationTimeCaption_C
// 0x0048 (0x0318 - 0x02D0)
class UW_LocationTimeCaption_C final : public UP2LocationTimeCaption
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_Coordinates;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Date;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Location;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsColiIsland;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlayerName;                                        // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayerLevel;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_LocationTimeCaption(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LocationTimeCaption_C">();
	}
	static class UW_LocationTimeCaption_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LocationTimeCaption_C>();
	}
};
static_assert(alignof(UW_LocationTimeCaption_C) == 0x000008, "Wrong alignment on UW_LocationTimeCaption_C");
static_assert(sizeof(UW_LocationTimeCaption_C) == 0x000318, "Wrong size on UW_LocationTimeCaption_C");
static_assert(offsetof(UW_LocationTimeCaption_C, UberGraphFrame) == 0x0002D0, "Member 'UW_LocationTimeCaption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, Txt_Coordinates) == 0x0002D8, "Member 'UW_LocationTimeCaption_C::Txt_Coordinates' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, Txt_Date) == 0x0002E0, "Member 'UW_LocationTimeCaption_C::Txt_Date' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, Txt_Location) == 0x0002E8, "Member 'UW_LocationTimeCaption_C::Txt_Location' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, IsColiIsland) == 0x0002F0, "Member 'UW_LocationTimeCaption_C::IsColiIsland' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, PlayerName) == 0x0002F8, "Member 'UW_LocationTimeCaption_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UW_LocationTimeCaption_C, PlayerLevel) == 0x000310, "Member 'UW_LocationTimeCaption_C::PlayerLevel' has a wrong offset!");

}

