#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadoutPresetItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadoutPresetItem.W_LoadoutPresetItem_C
// 0x0020 (0x02B0 - 0x0290)
class UW_LoadoutPresetItem_C final : public UP2LoadoutPresetItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ItemState;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Outline;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ItemState;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateWidgetDesign()	 // 0xae1e64;
	void ExecuteUbergraph_W_LoadoutPresetItem(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_LoadoutPresetItem_C">();
	}
	static class UW_LoadoutPresetItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_LoadoutPresetItem_C>();
	}
};
static_assert(alignof(UW_LoadoutPresetItem_C) == 0x000008, "Wrong alignment on UW_LoadoutPresetItem_C");
static_assert(sizeof(UW_LoadoutPresetItem_C) == 0x0002B0, "Wrong size on UW_LoadoutPresetItem_C");
static_assert(offsetof(UW_LoadoutPresetItem_C, UberGraphFrame) == 0x000290, "Member 'UW_LoadoutPresetItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetItem_C, Bdr_ItemState) == 0x000298, "Member 'UW_LoadoutPresetItem_C::Bdr_ItemState' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetItem_C, Bdr_Outline) == 0x0002A0, "Member 'UW_LoadoutPresetItem_C::Bdr_Outline' has a wrong offset!");
static_assert(offsetof(UW_LoadoutPresetItem_C, Txt_ItemState) == 0x0002A8, "Member 'UW_LoadoutPresetItem_C::Txt_ItemState' has a wrong offset!");

}

