#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MatchmakingTimer

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_MatchmakingTimer.W_MatchmakingTimer_C.ExecuteUbergraph_W_MatchmakingTimer
// 0x0060 (0x0060 - 0x0000)
struct W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer) == 0x000008, "Wrong alignment on W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer");
static_assert(sizeof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer) == 0x000060, "Wrong size on W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, EntryPoint) == 0x000000, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000048, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x000050, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer, K2Node_Event_IsDesignTime) == 0x000059, "Member 'W_MatchmakingTimer_C_ExecuteUbergraph_W_MatchmakingTimer::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_MatchmakingTimer.W_MatchmakingTimer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_MatchmakingTimer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MatchmakingTimer_C_PreConstruct) == 0x000001, "Wrong alignment on W_MatchmakingTimer_C_PreConstruct");
static_assert(sizeof(W_MatchmakingTimer_C_PreConstruct) == 0x000001, "Wrong size on W_MatchmakingTimer_C_PreConstruct");
static_assert(offsetof(W_MatchmakingTimer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_MatchmakingTimer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_MatchmakingTimer.W_MatchmakingTimer_C.SetTimerStyle
// 0x0001 (0x0001 - 0x0000)
struct W_MatchmakingTimer_C_SetTimerStyle final
{
public:
	bool                                          IsMatchmaking;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MatchmakingTimer_C_SetTimerStyle) == 0x000001, "Wrong alignment on W_MatchmakingTimer_C_SetTimerStyle");
static_assert(sizeof(W_MatchmakingTimer_C_SetTimerStyle) == 0x000001, "Wrong size on W_MatchmakingTimer_C_SetTimerStyle");
static_assert(offsetof(W_MatchmakingTimer_C_SetTimerStyle, IsMatchmaking) == 0x000000, "Member 'W_MatchmakingTimer_C_SetTimerStyle::IsMatchmaking' has a wrong offset!");

}

