#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MapMarker_Stem

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MapMarker_Stem.W_MapMarker_Stem_C
// 0x0018 (0x0298 - 0x0280)
class UW_MapMarker_Stem_C final : public UUserWidget
{
public:
	class UImage*                                 Img_Dot;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_double_arrow;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_vertical_line;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_MapMarker_Stem_C">();
	}
	static class UW_MapMarker_Stem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_MapMarker_Stem_C>();
	}
};
static_assert(alignof(UW_MapMarker_Stem_C) == 0x000008, "Wrong alignment on UW_MapMarker_Stem_C");
static_assert(sizeof(UW_MapMarker_Stem_C) == 0x000298, "Wrong size on UW_MapMarker_Stem_C");
static_assert(offsetof(UW_MapMarker_Stem_C, Img_Dot) == 0x000280, "Member 'UW_MapMarker_Stem_C::Img_Dot' has a wrong offset!");
static_assert(offsetof(UW_MapMarker_Stem_C, img_double_arrow) == 0x000288, "Member 'UW_MapMarker_Stem_C::img_double_arrow' has a wrong offset!");
static_assert(offsetof(UW_MapMarker_Stem_C, img_vertical_line) == 0x000290, "Member 'UW_MapMarker_Stem_C::img_vertical_line' has a wrong offset!");

}

