#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "MainMenu_classes.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu.W_MainMenu_C
// 0x0198 (0x07A0 - 0x0608)
class UW_MainMenu_C final : public UP2MainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WelcomeMessage_FadeIn;                             // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Button_LoginType;                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Button_Play;                                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Loadscreen;                                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            Btn_Confirm;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Button_LoginType;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Button_Play;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Level;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Status;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icn_Locked;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_AnimMask;                                      // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RegionIcon;                                    // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_WelcomeAccount_Background;                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Reset;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    Keyguide_Select;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockScreen;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginScreenSwitcher;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                Temp_Btn_NewCreate;                                // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                Temp_Btn_Next;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                Temp_Btn_Previous;                                 // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Temp_HB_Change;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ConnectionAttempt;                            // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 Text_Status;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       TextBox_Name;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_LegalLicenses;                                 // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_CharaterStatus;                                 // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            W_ButtonDelete;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlsdCommonButtonWidget_C*            W_ButtonFpp;                                       // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DecoBG_C*                            W_DecoBG;                                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GameNewsCarousel_C*                  W_GameNewsCarousel;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_KeyguideWidget;                                  // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 PlayerId;                                          // 0x0718(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 StoreSectionName;                                  // 0x0728(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 StoreKeyName;                                      // 0x0738(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 AllowedCharacters;                                 // 0x0748(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HadValidName;                                      // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValidationErrorText;                               // 0x0760(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsLoginViaOss;                                    // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Endpoint;                                          // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          LoadingScreenVisible;                              // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingProcessTask*                    LoadProcessTask_Connecting;                        // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateStatus(const class FString& Status)	 // 0xae1e64;
	void TutorialPopupClosed(bool LoadTutorial)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void StartCreateAccount()	 // 0xae1e64;
	void ShowGlobalError()	 // 0xae1e64;
	void ShowExitToDesktopPopup()	 // 0xae1e64;
	void SetScreenLock(bool bIsLocked)	 // 0xae1e64;
	void RemoveCharacter(EPopupButtonID ButtonID)	 // 0xae1e64;
	void OnRemoveClicked()	 // 0xae1e64;
	void OnPreviewDataApplied()	 // 0xae1e64;
	void OnInitialized()	 // 0xae1e64;
	void OnExitToDesktopKeyGuidePressed()	 // 0xae1e64;
	void OnExitToDesktop(EPopupButtonID ButtonID)	 // 0xae1e64;
	void OnClickSelectCharacter()	 // 0xae1e64;
	void OnClicked_Previous()	 // 0xae1e64;
	void OnClicked_Next()	 // 0xae1e64;
	void OnClicked_NewCreated()	 // 0xae1e64;
	void OnClickCreateCharacter()	 // 0xae1e64;
	void OnAccountCreated(bool bSuccess, bool bAlreadyExist)	 // 0xae1e64;
	void LoginSuccess()	 // 0xae1e64;
	void InitLoadScreen()	 // 0xae1e64;
	void HudMessageError(const class FText& InText)	 // 0xae1e64;
	void HideLoadScreen()	 // 0xae1e64;
	void GetDefaultUserName(class FString* Name_0, bool* IsNameValid)	 // 0xae1e64;
	void FadeOutFinished()	 // 0xae1e64;
	void ExecuteUbergraph_W_MainMenu(int32 EntryPoint)	 // 0xae1e64;
	void Error_Message_Timer()	 // 0xae1e64;
	void CreateCharacter()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ConnectSuccess(const class FString& Endpoint_0, const class FString& AccountID, const class FString& CharacterId)	 // 0xae1e64;
	void ConnectFail(const class FText& Error)	 // 0xae1e64;
	void CanChangeUserName(bool* Result)	 // 0xae1e64;
	void BP_OnUpdatePreviewData()	 // 0xae1e64;
	void BP_OnPreviewDataReceived()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void BP_OnAccountArchivedResponse(bool bSuccess)	 // 0xae1e64;
	void BndEvt__W_MainMenu_TextBox_Name_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod)	 // 0xae1e64;
	void BndEvt__W_MainMenu_TextBox_Name_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text)	 // 0xae1e64;
	void BndEvt__W_MainMenu_Button_Play_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_MainMenu_Button_LoginType_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_MainMenu_Btn_LegalLicenses_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_MainMenu_Btn_LegalLicenses_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BindLoginEvents()	 // 0xae1e64;
	void AutoLoginSteam()	 // 0xae1e64;
	void AccountNotFound()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_MainMenu_C">();
	}
	static class UW_MainMenu_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_MainMenu_C>();
	}
};
static_assert(alignof(UW_MainMenu_C) == 0x000008, "Wrong alignment on UW_MainMenu_C");
static_assert(sizeof(UW_MainMenu_C) == 0x0007A0, "Wrong size on UW_MainMenu_C");
static_assert(offsetof(UW_MainMenu_C, UberGraphFrame) == 0x000608, "Member 'UW_MainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, WelcomeMessage_FadeIn) == 0x000610, "Member 'UW_MainMenu_C::WelcomeMessage_FadeIn' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, FadeOut) == 0x000618, "Member 'UW_MainMenu_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Bdr_Button_LoginType) == 0x000620, "Member 'UW_MainMenu_C::Bdr_Button_LoginType' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Bdr_Button_Play) == 0x000628, "Member 'UW_MainMenu_C::Bdr_Button_Play' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Bdr_Loadscreen) == 0x000630, "Member 'UW_MainMenu_C::Bdr_Loadscreen' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Btn_Confirm) == 0x000638, "Member 'UW_MainMenu_C::Btn_Confirm' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Button_LoginType) == 0x000640, "Member 'UW_MainMenu_C::Button_LoginType' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Button_Play) == 0x000648, "Member 'UW_MainMenu_C::Button_Play' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, HB_Level) == 0x000650, "Member 'UW_MainMenu_C::HB_Level' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, HB_Status) == 0x000658, "Member 'UW_MainMenu_C::HB_Status' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, icn_Locked) == 0x000660, "Member 'UW_MainMenu_C::icn_Locked' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, img_AnimMask) == 0x000668, "Member 'UW_MainMenu_C::img_AnimMask' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Img_RegionIcon) == 0x000670, "Member 'UW_MainMenu_C::Img_RegionIcon' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, img_WelcomeAccount_Background) == 0x000678, "Member 'UW_MainMenu_C::img_WelcomeAccount_Background' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Keyguide_Reset) == 0x000680, "Member 'UW_MainMenu_C::Keyguide_Reset' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Keyguide_Select) == 0x000688, "Member 'UW_MainMenu_C::Keyguide_Select' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LockScreen) == 0x000690, "Member 'UW_MainMenu_C::LockScreen' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LoginScreenSwitcher) == 0x000698, "Member 'UW_MainMenu_C::LoginScreenSwitcher' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, MainSwitcher) == 0x0006A0, "Member 'UW_MainMenu_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Temp_Btn_NewCreate) == 0x0006A8, "Member 'UW_MainMenu_C::Temp_Btn_NewCreate' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Temp_Btn_Next) == 0x0006B0, "Member 'UW_MainMenu_C::Temp_Btn_Next' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Temp_Btn_Previous) == 0x0006B8, "Member 'UW_MainMenu_C::Temp_Btn_Previous' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Temp_HB_Change) == 0x0006C0, "Member 'UW_MainMenu_C::Temp_HB_Change' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Text_ConnectionAttempt) == 0x0006C8, "Member 'UW_MainMenu_C::Text_ConnectionAttempt' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Text_Status) == 0x0006D0, "Member 'UW_MainMenu_C::Text_Status' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, TextBox_Name) == 0x0006D8, "Member 'UW_MainMenu_C::TextBox_Name' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Txt_LegalLicenses) == 0x0006E0, "Member 'UW_MainMenu_C::Txt_LegalLicenses' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, VB_CharaterStatus) == 0x0006E8, "Member 'UW_MainMenu_C::VB_CharaterStatus' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_ButtonDelete) == 0x0006F0, "Member 'UW_MainMenu_C::W_ButtonDelete' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_ButtonFpp) == 0x0006F8, "Member 'UW_MainMenu_C::W_ButtonFpp' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_DecoBG) == 0x000700, "Member 'UW_MainMenu_C::W_DecoBG' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_GameNewsCarousel) == 0x000708, "Member 'UW_MainMenu_C::W_GameNewsCarousel' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, W_KeyguideWidget) == 0x000710, "Member 'UW_MainMenu_C::W_KeyguideWidget' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, PlayerId) == 0x000718, "Member 'UW_MainMenu_C::PlayerId' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, StoreSectionName) == 0x000728, "Member 'UW_MainMenu_C::StoreSectionName' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, StoreKeyName) == 0x000738, "Member 'UW_MainMenu_C::StoreKeyName' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, AllowedCharacters) == 0x000748, "Member 'UW_MainMenu_C::AllowedCharacters' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, HadValidName) == 0x000758, "Member 'UW_MainMenu_C::HadValidName' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, ValidationErrorText) == 0x000760, "Member 'UW_MainMenu_C::ValidationErrorText' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, bIsLoginViaOss) == 0x000778, "Member 'UW_MainMenu_C::bIsLoginViaOss' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, Endpoint) == 0x000780, "Member 'UW_MainMenu_C::Endpoint' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LoadingScreenVisible) == 0x000790, "Member 'UW_MainMenu_C::LoadingScreenVisible' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_C, LoadProcessTask_Connecting) == 0x000798, "Member 'UW_MainMenu_C::LoadProcessTask_Connecting' has a wrong offset!");

}

