#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MessageHub_MessageItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MessageHub_MessageItem.W_MessageHub_MessageItem_C
// 0x0858 (0x0BE0 - 0x0388)
class UW_MessageHub_MessageItem_C final : public UP2MessageHubMessageItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonVisualAttachment*                Attach_ItemNum;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Items;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_MessageBg;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_MessageOutline;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                Btn_Claimed;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonButtonWidget_C*                Btn_Survey;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_AttachItem;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_CheckedIcon;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_NewIcon;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SampleIconSpacer;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Items;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_MessageItem;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_TextBody;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Item;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FButtonStyle                           HoverLayerStyle;                                   // 0x0400(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           NoHoverLayerStyle;                                 // 0x07F0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_MessageHub_MessageItem(int32 EntryPoint)	 // 0xae1e64;
	void OnClickedBtnSurvey()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void RefreshWidgetOnBP(EP2MessageState InNewState, EP2MessageClaimState InClaimedState)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_MessageHub_MessageItem_C">();
	}
	static class UW_MessageHub_MessageItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_MessageHub_MessageItem_C>();
	}
};
static_assert(alignof(UW_MessageHub_MessageItem_C) == 0x000010, "Wrong alignment on UW_MessageHub_MessageItem_C");
static_assert(sizeof(UW_MessageHub_MessageItem_C) == 0x000BE0, "Wrong size on UW_MessageHub_MessageItem_C");
static_assert(offsetof(UW_MessageHub_MessageItem_C, UberGraphFrame) == 0x000388, "Member 'UW_MessageHub_MessageItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Attach_ItemNum) == 0x000390, "Member 'UW_MessageHub_MessageItem_C::Attach_ItemNum' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Bdr_Items) == 0x000398, "Member 'UW_MessageHub_MessageItem_C::Bdr_Items' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Bdr_MessageBg) == 0x0003A0, "Member 'UW_MessageHub_MessageItem_C::Bdr_MessageBg' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Bdr_MessageOutline) == 0x0003A8, "Member 'UW_MessageHub_MessageItem_C::Bdr_MessageOutline' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Btn_Claimed) == 0x0003B0, "Member 'UW_MessageHub_MessageItem_C::Btn_Claimed' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Btn_Survey) == 0x0003B8, "Member 'UW_MessageHub_MessageItem_C::Btn_Survey' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, HB_AttachItem) == 0x0003C0, "Member 'UW_MessageHub_MessageItem_C::HB_AttachItem' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Img_CheckedIcon) == 0x0003C8, "Member 'UW_MessageHub_MessageItem_C::Img_CheckedIcon' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Img_NewIcon) == 0x0003D0, "Member 'UW_MessageHub_MessageItem_C::Img_NewIcon' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, SampleIconSpacer) == 0x0003D8, "Member 'UW_MessageHub_MessageItem_C::SampleIconSpacer' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, SzB_Items) == 0x0003E0, "Member 'UW_MessageHub_MessageItem_C::SzB_Items' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, SzB_MessageItem) == 0x0003E8, "Member 'UW_MessageHub_MessageItem_C::SzB_MessageItem' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, SzB_TextBody) == 0x0003F0, "Member 'UW_MessageHub_MessageItem_C::SzB_TextBody' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, Txt_Item) == 0x0003F8, "Member 'UW_MessageHub_MessageItem_C::Txt_Item' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, HoverLayerStyle) == 0x000400, "Member 'UW_MessageHub_MessageItem_C::HoverLayerStyle' has a wrong offset!");
static_assert(offsetof(UW_MessageHub_MessageItem_C, NoHoverLayerStyle) == 0x0007F0, "Member 'UW_MessageHub_MessageItem_C::NoHoverLayerStyle' has a wrong offset!");

}

