#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MessageHub_CategoryWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_MessageHub_CategoryWidget.W_MessageHub_CategoryWidget_C.ExecuteUbergraph_W_MessageHub_CategoryWidget
// 0x0058 (0x0058 - 0x0000)
struct W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelected;                         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsSelected;                    // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget) == 0x000004, "Wrong alignment on W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget");
static_assert(sizeof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget) == 0x000058, "Wrong size on W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, EntryPoint) == 0x000000, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_Event_IsDesignTime) == 0x000054, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_Event_InIsSelected) == 0x000055, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_Event_InIsSelected' has a wrong offset!");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget, K2Node_CustomEvent_bIsSelected) == 0x000056, "Member 'W_MessageHub_CategoryWidget_C_ExecuteUbergraph_W_MessageHub_CategoryWidget::K2Node_CustomEvent_bIsSelected' has a wrong offset!");

// Function W_MessageHub_CategoryWidget.W_MessageHub_CategoryWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_MessageHub_CategoryWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MessageHub_CategoryWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_MessageHub_CategoryWidget_C_PreConstruct");
static_assert(sizeof(W_MessageHub_CategoryWidget_C_PreConstruct) == 0x000001, "Wrong size on W_MessageHub_CategoryWidget_C_PreConstruct");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_MessageHub_CategoryWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_MessageHub_CategoryWidget.W_MessageHub_CategoryWidget_C.SetSelectedOnBP
// 0x0001 (0x0001 - 0x0000)
struct W_MessageHub_CategoryWidget_C_SetSelectedOnBP final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MessageHub_CategoryWidget_C_SetSelectedOnBP) == 0x000001, "Wrong alignment on W_MessageHub_CategoryWidget_C_SetSelectedOnBP");
static_assert(sizeof(W_MessageHub_CategoryWidget_C_SetSelectedOnBP) == 0x000001, "Wrong size on W_MessageHub_CategoryWidget_C_SetSelectedOnBP");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_SetSelectedOnBP, InIsSelected) == 0x000000, "Member 'W_MessageHub_CategoryWidget_C_SetSelectedOnBP::InIsSelected' has a wrong offset!");

// Function W_MessageHub_CategoryWidget.W_MessageHub_CategoryWidget_C.SetWidgetStyle
// 0x0001 (0x0001 - 0x0000)
struct W_MessageHub_CategoryWidget_C_SetWidgetStyle final
{
public:
	bool                                          bIsSelected_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MessageHub_CategoryWidget_C_SetWidgetStyle) == 0x000001, "Wrong alignment on W_MessageHub_CategoryWidget_C_SetWidgetStyle");
static_assert(sizeof(W_MessageHub_CategoryWidget_C_SetWidgetStyle) == 0x000001, "Wrong size on W_MessageHub_CategoryWidget_C_SetWidgetStyle");
static_assert(offsetof(W_MessageHub_CategoryWidget_C_SetWidgetStyle, bIsSelected_0) == 0x000000, "Member 'W_MessageHub_CategoryWidget_C_SetWidgetStyle::bIsSelected_0' has a wrong offset!");

}

