#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_AttributeWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Modding_ItemDetails_AttributeWidget.W_Modding_ItemDetails_AttributeWidget_C.CompareStatWidget_ImplementableEvent
// 0x0130 (0x0130 - 0x0000)
struct W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent final
{
public:
	float                                         InOriginalValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCompareValue;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2ItemStatAccessorParams              InParams;                                          // 0x0008(0x0128)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent) == 0x000008, "Wrong alignment on W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent");
static_assert(sizeof(W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent) == 0x000130, "Wrong size on W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent, InOriginalValue) == 0x000000, "Member 'W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent::InOriginalValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent, InCompareValue) == 0x000004, "Member 'W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent::InCompareValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent, InParams) == 0x000008, "Member 'W_Modding_ItemDetails_AttributeWidget_C_CompareStatWidget_ImplementableEvent::InParams' has a wrong offset!");

// Function W_Modding_ItemDetails_AttributeWidget.W_Modding_ItemDetails_AttributeWidget_C.ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget
// 0x01B8 (0x01B8 - 0x0000)
struct W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InOriginalValue;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InCompareValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FP2ItemStatAccessorParams              K2Node_Event_InParams;                             // 0x0028(0x0128)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0150(0x0014)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0184(0x0014)()
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget) == 0x000008, "Wrong alignment on W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget");
static_assert(sizeof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget) == 0x0001B8, "Wrong size on W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, EntryPoint) == 0x000000, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_Event_IsDesignTime) == 0x000018, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_Event_InOriginalValue) == 0x00001C, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_Event_InOriginalValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_Event_InCompareValue) == 0x000020, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_Event_InCompareValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_Event_InParams) == 0x000028, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_Event_InParams' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_MakeStruct_SlateColor_1) == 0x000150, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000164, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000168, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000170, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000178, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000180, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, K2Node_MakeStruct_SlateColor_2) == 0x000184, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000198, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0001A0, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast) == 0x0001A8, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001B0, "Member 'W_Modding_ItemDetails_AttributeWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_AttributeWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_Modding_ItemDetails_AttributeWidget.W_Modding_ItemDetails_AttributeWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemDetails_AttributeWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemDetails_AttributeWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_ItemDetails_AttributeWidget_C_PreConstruct");
static_assert(sizeof(W_Modding_ItemDetails_AttributeWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_ItemDetails_AttributeWidget_C_PreConstruct");
static_assert(offsetof(W_Modding_ItemDetails_AttributeWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_ItemDetails_AttributeWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

