#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_ProtectionValueWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetails_ProtectionValueWidget.W_Modding_ItemDetails_ProtectionValueWidget_C
// 0x0070 (0x0300 - 0x0290)
class UW_Modding_ItemDetails_ProtectionValueWidget_C final : public UP2ModdingItemDetailsProtectionValue
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_Bracket_L;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Bracket_R;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             AttributeIcon;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   AttributeName;                                     // 0x02B0(0x0018)(Edit, BlueprintVisible)
	class FText                                   AttributeValue;                                    // 0x02C8(0x0018)(Edit, BlueprintVisible)
	class FText                                   AttributeUnit;                                     // 0x02E0(0x0018)(Edit, BlueprintVisible)
	bool                                          HasAttributeUnit;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Modding_ItemDetails_ProtectionValueWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetProtectionDamageZone(bool bHasDamageZone)	 // 0xae1e64;
	void UpdateDesignByDelta(bool bHigherIsBetter, float InDelta)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetails_ProtectionValueWidget_C">();
	}
	static class UW_Modding_ItemDetails_ProtectionValueWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetails_ProtectionValueWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetails_ProtectionValueWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetails_ProtectionValueWidget_C");
static_assert(sizeof(UW_Modding_ItemDetails_ProtectionValueWidget_C) == 0x000300, "Wrong size on UW_Modding_ItemDetails_ProtectionValueWidget_C");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, UberGraphFrame) == 0x000290, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, Txt_Bracket_L) == 0x000298, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::Txt_Bracket_L' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, Txt_Bracket_R) == 0x0002A0, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::Txt_Bracket_R' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, AttributeIcon) == 0x0002A8, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::AttributeIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, AttributeName) == 0x0002B0, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::AttributeName' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, AttributeValue) == 0x0002C8, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::AttributeValue' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, AttributeUnit) == 0x0002E0, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::AttributeUnit' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionValueWidget_C, HasAttributeUnit) == 0x0002F8, "Member 'UW_Modding_ItemDetails_ProtectionValueWidget_C::HasAttributeUnit' has a wrong offset!");

}

