#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_MainStatWidget

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Modding_ItemDetails_MainStatWidget.W_Modding_ItemDetails_MainStatWidget_C.CompareStatWidget_ImplementableEvent
// 0x0130 (0x0130 - 0x0000)
struct W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent final
{
public:
	float                                         InOriginalValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCompareValue;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2ItemStatAccessorParams              InParams;                                          // 0x0008(0x0128)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent) == 0x000008, "Wrong alignment on W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent");
static_assert(sizeof(W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent) == 0x000130, "Wrong size on W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent, InOriginalValue) == 0x000000, "Member 'W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent::InOriginalValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent, InCompareValue) == 0x000004, "Member 'W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent::InCompareValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent, InParams) == 0x000008, "Member 'W_Modding_ItemDetails_MainStatWidget_C_CompareStatWidget_ImplementableEvent::InParams' has a wrong offset!");

// Function W_Modding_ItemDetails_MainStatWidget.W_Modding_ItemDetails_MainStatWidget_C.ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget
// 0x01D0 (0x01D0 - 0x0000)
struct W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InOriginalValue;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InCompareValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FP2ItemStatAccessorParams              K2Node_Event_InParams;                             // 0x0038(0x0128)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0160(0x0014)()
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_B_ImplicitCast;                // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget) == 0x000008, "Wrong alignment on W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget");
static_assert(sizeof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget) == 0x0001D0, "Wrong size on W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, EntryPoint) == 0x000000, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_Event_InOriginalValue) == 0x000030, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_Event_InOriginalValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_Event_InCompareValue) == 0x000034, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_Event_InCompareValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_Event_InParams) == 0x000038, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_Event_InParams' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, K2Node_MakeStruct_SlateColor_2) == 0x000160, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000178, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_SafeDivide_ReturnValue) == 0x000180, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000188, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000190, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000191, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000192, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast) == 0x000198, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0001A0, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast) == 0x0001A8, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_SafeDivide_A_ImplicitCast) == 0x0001B0, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001B8, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_SafeDivide_B_ImplicitCast) == 0x0001C0, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_SafeDivide_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0001C8, "Member 'W_Modding_ItemDetails_MainStatWidget_C_ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function W_Modding_ItemDetails_MainStatWidget.W_Modding_ItemDetails_MainStatWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemDetails_MainStatWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemDetails_MainStatWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_ItemDetails_MainStatWidget_C_PreConstruct");
static_assert(sizeof(W_Modding_ItemDetails_MainStatWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_ItemDetails_MainStatWidget_C_PreConstruct");
static_assert(offsetof(W_Modding_ItemDetails_MainStatWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_ItemDetails_MainStatWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

