#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_TargetItemWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.SetSize
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_SetSize final
{
public:
	bool                                          IsModdingScreen;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_SetSize) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_SetSize");
static_assert(sizeof(W_Modding_TargetItemWidget_C_SetSize) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_SetSize");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSize, IsModdingScreen) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_SetSize::IsModdingScreen' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.SetSelectedState
// 0x0110 (0x0110 - 0x0000)
struct W_Modding_TargetItemWidget_C_SetSelectedState final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsModdingScreen;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         DefaultNameFont;                                   // 0x0008(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         SelectedNameFont;                                  // 0x0060(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B8(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00CC(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00E0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00F4(0x0014)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_SetSelectedState) == 0x000008, "Wrong alignment on W_Modding_TargetItemWidget_C_SetSelectedState");
static_assert(sizeof(W_Modding_TargetItemWidget_C_SetSelectedState) == 0x000110, "Wrong size on W_Modding_TargetItemWidget_C_SetSelectedState");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, IsSelected_0) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::IsSelected_0' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, IsModdingScreen) == 0x000001, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::IsModdingScreen' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, DefaultNameFont) == 0x000008, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::DefaultNameFont' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, SelectedNameFont) == 0x000060, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::SelectedNameFont' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor) == 0x0000B8, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_1) == 0x0000CC, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_2) == 0x0000E0, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, K2Node_MakeStruct_SlateColor_3) == 0x0000F4, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetSelectedState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000108, "Member 'W_Modding_TargetItemWidget_C_SetSelectedState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.SetItemType
// 0x0008 (0x0008 - 0x0000)
struct W_Modding_TargetItemWidget_C_SetItemType final
{
public:
	int32                                         ItemType_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_SetItemType) == 0x000004, "Wrong alignment on W_Modding_TargetItemWidget_C_SetItemType");
static_assert(sizeof(W_Modding_TargetItemWidget_C_SetItemType) == 0x000008, "Wrong size on W_Modding_TargetItemWidget_C_SetItemType");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetItemType, ItemType_0) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_SetItemType::ItemType_0' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetItemType, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'W_Modding_TargetItemWidget_C_SetItemType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.SetItemStatus
// 0x0008 (0x0008 - 0x0000)
struct W_Modding_TargetItemWidget_C_SetItemStatus final
{
public:
	int32                                         ItemStatus_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_SetItemStatus) == 0x000004, "Wrong alignment on W_Modding_TargetItemWidget_C_SetItemStatus");
static_assert(sizeof(W_Modding_TargetItemWidget_C_SetItemStatus) == 0x000008, "Wrong size on W_Modding_TargetItemWidget_C_SetItemStatus");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetItemStatus, ItemStatus_0) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_SetItemStatus::ItemStatus_0' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetItemStatus, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'W_Modding_TargetItemWidget_C_SetItemStatus::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.SetButtonState
// 0x0005 (0x0005 - 0x0000)
struct W_Modding_TargetItemWidget_C_SetButtonState final
{
public:
	bool                                          Is_Modding_Screen;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_SetButtonState) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_SetButtonState");
static_assert(sizeof(W_Modding_TargetItemWidget_C_SetButtonState) == 0x000005, "Wrong size on W_Modding_TargetItemWidget_C_SetButtonState");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetButtonState, Is_Modding_Screen) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_SetButtonState::Is_Modding_Screen' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetButtonState, Temp_bool_Variable) == 0x000001, "Member 'W_Modding_TargetItemWidget_C_SetButtonState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetButtonState, Temp_byte_Variable) == 0x000002, "Member 'W_Modding_TargetItemWidget_C_SetButtonState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetButtonState, Temp_byte_Variable_1) == 0x000003, "Member 'W_Modding_TargetItemWidget_C_SetButtonState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_SetButtonState, K2Node_Select_Default) == 0x000004, "Member 'W_Modding_TargetItemWidget_C_SetButtonState::K2Node_Select_Default' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_PreConstruct");
static_assert(sizeof(W_Modding_TargetItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_PreConstruct");
static_assert(offsetof(W_Modding_TargetItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.OnSetSelect_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent");
static_assert(sizeof(W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent");
static_assert(offsetof(W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_OnSetSelect_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.OnSetModdingScreen_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent final
{
public:
	bool                                          InIsModdingScreen;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent");
static_assert(sizeof(W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent");
static_assert(offsetof(W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent, InIsModdingScreen) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_OnSetModdingScreen_ImplementableEvent::InIsModdingScreen' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.OnSetCustomizationAvailable_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent final
{
public:
	bool                                          InIsAvailable;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent");
static_assert(sizeof(W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent");
static_assert(offsetof(W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent, InIsAvailable) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_OnSetCustomizationAvailable_ImplementableEvent::InIsAvailable' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.OnSetCustomization_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent final
{
public:
	bool                                          InIsCustomization;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent");
static_assert(sizeof(W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent");
static_assert(offsetof(W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent, InIsCustomization) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_OnSetCustomization_ImplementableEvent::InIsCustomization' has a wrong offset!");

// Function W_Modding_TargetItemWidget.W_Modding_TargetItemWidget_C.ExecuteUbergraph_W_Modding_TargetItemWidget
// 0x000C (0x000C - 0x0000)
struct W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsAvailable;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsModdingScreen;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsCustomization;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget) == 0x000004, "Wrong alignment on W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget");
static_assert(sizeof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget) == 0x00000C, "Wrong size on W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, EntryPoint) == 0x000000, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, K2Node_Event_InIsAvailable) == 0x000004, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::K2Node_Event_InIsAvailable' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, K2Node_Event_InIsSelect) == 0x000005, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::K2Node_Event_InIsSelect' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, K2Node_Event_InIsModdingScreen) == 0x000006, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::K2Node_Event_InIsModdingScreen' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, K2Node_Event_IsDesignTime) == 0x000007, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget, K2Node_Event_InIsCustomization) == 0x000008, "Member 'W_Modding_TargetItemWidget_C_ExecuteUbergraph_W_Modding_TargetItemWidget::K2Node_Event_InIsCustomization' has a wrong offset!");

}

