#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_InventorySizeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetails_InventorySizeWidget.W_Modding_ItemDetails_InventorySizeWidget_C
// 0x0028 (0x0598 - 0x0570)
class UW_Modding_ItemDetails_InventorySizeWidget_C final : public UP2ModdingItemDetailsItemSize
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             AttributeIcon;                                     // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   AttributeName;                                     // 0x0580(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_Modding_ItemDetails_InventorySizeWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetails_InventorySizeWidget_C">();
	}
	static class UW_Modding_ItemDetails_InventorySizeWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetails_InventorySizeWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetails_InventorySizeWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetails_InventorySizeWidget_C");
static_assert(sizeof(UW_Modding_ItemDetails_InventorySizeWidget_C) == 0x000598, "Wrong size on UW_Modding_ItemDetails_InventorySizeWidget_C");
static_assert(offsetof(UW_Modding_ItemDetails_InventorySizeWidget_C, UberGraphFrame) == 0x000570, "Member 'UW_Modding_ItemDetails_InventorySizeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_InventorySizeWidget_C, AttributeIcon) == 0x000578, "Member 'UW_Modding_ItemDetails_InventorySizeWidget_C::AttributeIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_InventorySizeWidget_C, AttributeName) == 0x000580, "Member 'UW_Modding_ItemDetails_InventorySizeWidget_C::AttributeName' has a wrong offset!");

}

