#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_SlotGroupHeaderWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Modding_SlotGroupHeaderWidget.W_Modding_SlotGroupHeaderWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_SlotGroupHeaderWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_SlotGroupHeaderWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_SlotGroupHeaderWidget_C_PreConstruct");
static_assert(sizeof(W_Modding_SlotGroupHeaderWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_SlotGroupHeaderWidget_C_PreConstruct");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_SlotGroupHeaderWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Modding_SlotGroupHeaderWidget.W_Modding_SlotGroupHeaderWidget_C.ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget
// 0x0080 (0x0080 - 0x0000)
struct W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0058(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x006C(0x0014)()
};
static_assert(alignof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget) == 0x000004, "Wrong alignment on W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget");
static_assert(sizeof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget) == 0x000080, "Wrong size on W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, EntryPoint) == 0x000000, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor_4) == 0x000058, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget, K2Node_MakeStruct_SlateColor_5) == 0x00006C, "Member 'W_Modding_SlotGroupHeaderWidget_C_ExecuteUbergraph_W_Modding_SlotGroupHeaderWidget::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");

}

