#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetailsWidget

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetailsWidget.W_Modding_ItemDetailsWidget_C
// 0x00B0 (0x0360 - 0x02B0)
class UW_Modding_ItemDetailsWidget_C final : public UP2ModdingItemDetailsWidget
{
public:
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_Caliber;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_Caliber_1;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_FiremodeWidget_C* Attribute_Firemode;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_FiremodeWidget_C* Attribute_Firemode_1;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_InventorySizeWidget_C* Attribute_InvenSize;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_InventorySizeWidget_C* Attribute_InvenSize_1;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_MuzzleVelocity;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_MuzzleVelocity_1;                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_RoF;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_RoF_1;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_Weight;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_AttributeWidget_C* Attribute_Weight_1;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CategoryBackBracket;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CategoryFrontBracket;                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget;             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_1;           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_2;           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_3;           // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_4;           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_5;           // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_6;           // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemDetails_MainStatWidget_C* W_Modding_ItemDetails_MainStatWidget_7;           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetailsWidget_C">();
	}
	static class UW_Modding_ItemDetailsWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetailsWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetailsWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetailsWidget_C");
static_assert(sizeof(UW_Modding_ItemDetailsWidget_C) == 0x000360, "Wrong size on UW_Modding_ItemDetailsWidget_C");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Caliber) == 0x0002B0, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Caliber' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Caliber_1) == 0x0002B8, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Caliber_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Firemode) == 0x0002C0, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Firemode' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Firemode_1) == 0x0002C8, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Firemode_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_InvenSize) == 0x0002D0, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_InvenSize' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_InvenSize_1) == 0x0002D8, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_InvenSize_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_MuzzleVelocity) == 0x0002E0, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_MuzzleVelocity' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_MuzzleVelocity_1) == 0x0002E8, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_MuzzleVelocity_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_RoF) == 0x0002F0, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_RoF' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_RoF_1) == 0x0002F8, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_RoF_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Weight) == 0x000300, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Weight' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Attribute_Weight_1) == 0x000308, "Member 'UW_Modding_ItemDetailsWidget_C::Attribute_Weight_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Txt_CategoryBackBracket) == 0x000310, "Member 'UW_Modding_ItemDetailsWidget_C::Txt_CategoryBackBracket' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, Txt_CategoryFrontBracket) == 0x000318, "Member 'UW_Modding_ItemDetailsWidget_C::Txt_CategoryFrontBracket' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget) == 0x000320, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_1) == 0x000328, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_1' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_2) == 0x000330, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_2' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_3) == 0x000338, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_3' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_4) == 0x000340, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_4' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_5) == 0x000348, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_5' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_6) == 0x000350, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_6' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetailsWidget_C, W_Modding_ItemDetails_MainStatWidget_7) == 0x000358, "Member 'UW_Modding_ItemDetailsWidget_C::W_Modding_ItemDetails_MainStatWidget_7' has a wrong offset!");

}

