#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ModdingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ModdingWidget.W_ModdingWidget_C
// 0x00E0 (0x0810 - 0x0730)
class UW_ModdingWidget_C final : public UP2ModdingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Title_Line;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotGroupHeaderWidget_C*     SlotGroupHeader_Skin;                              // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemWidget_C*                W_Modding_ItemWidget;                              // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemWidget_C*                W_Modding_ItemWidget_1;                            // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemWidget_C*                W_Modding_ItemWidget_2;                            // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemWidget_C*                W_Modding_ItemWidget_3;                            // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_ItemWidget_C*                W_Modding_ItemWidget_4;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget;                              // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_1;                            // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_9;                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_10;                           // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_11;                           // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_12;                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_13;                           // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_SlotWidget_C*                W_Modding_SlotWidget_14;                           // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget;                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_1;                      // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_2;                      // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_3;                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_4;                      // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_5;                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_6;                      // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_7;                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Modding_TargetItemWidget_C*          W_Modding_TargetItemWidget_8;                      // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_MainButton;                                     // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_ModdingSkins;                                   // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMouseDown;                                       // 0x0808(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldRotateHoloItemActor;                        // 0x0809(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_ModdingWidget(int32 EntryPoint)	 // 0xae1e64;
	void OnModdingDepthChanged(int32 InModdingDepth)	 // 0xae1e64;
	void OnSetCustomization_ImplementableEvent(bool bIsCustomization)	 // 0xae1e64;
	void OnSetModdingStatus_ImplementableEvent(EP2ModdingStatusType InModdingStatusType)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ModdingWidget_C">();
	}
	static class UW_ModdingWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ModdingWidget_C>();
	}
};
static_assert(alignof(UW_ModdingWidget_C) == 0x000008, "Wrong alignment on UW_ModdingWidget_C");
static_assert(sizeof(UW_ModdingWidget_C) == 0x000810, "Wrong size on UW_ModdingWidget_C");
static_assert(offsetof(UW_ModdingWidget_C, UberGraphFrame) == 0x000730, "Member 'UW_ModdingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, Img_Title_Line) == 0x000738, "Member 'UW_ModdingWidget_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, SlotGroupHeader_Skin) == 0x000740, "Member 'UW_ModdingWidget_C::SlotGroupHeader_Skin' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_ItemWidget) == 0x000748, "Member 'UW_ModdingWidget_C::W_Modding_ItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_ItemWidget_1) == 0x000750, "Member 'UW_ModdingWidget_C::W_Modding_ItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_ItemWidget_2) == 0x000758, "Member 'UW_ModdingWidget_C::W_Modding_ItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_ItemWidget_3) == 0x000760, "Member 'UW_ModdingWidget_C::W_Modding_ItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_ItemWidget_4) == 0x000768, "Member 'UW_ModdingWidget_C::W_Modding_ItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget) == 0x000770, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_1) == 0x000778, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_9) == 0x000780, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_9' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_10) == 0x000788, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_10' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_11) == 0x000790, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_11' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_12) == 0x000798, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_12' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_13) == 0x0007A0, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_13' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_SlotWidget_14) == 0x0007A8, "Member 'UW_ModdingWidget_C::W_Modding_SlotWidget_14' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget) == 0x0007B0, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_1) == 0x0007B8, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_2) == 0x0007C0, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_3) == 0x0007C8, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_4) == 0x0007D0, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_4' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_5) == 0x0007D8, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_5' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_6) == 0x0007E0, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_6' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_7) == 0x0007E8, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_7' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, W_Modding_TargetItemWidget_8) == 0x0007F0, "Member 'UW_ModdingWidget_C::W_Modding_TargetItemWidget_8' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, WS_MainButton) == 0x0007F8, "Member 'UW_ModdingWidget_C::WS_MainButton' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, WS_ModdingSkins) == 0x000800, "Member 'UW_ModdingWidget_C::WS_ModdingSkins' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, IsMouseDown) == 0x000808, "Member 'UW_ModdingWidget_C::IsMouseDown' has a wrong offset!");
static_assert(offsetof(UW_ModdingWidget_C, bShouldRotateHoloItemActor) == 0x000809, "Member 'UW_ModdingWidget_C::bShouldRotateHoloItemActor' has a wrong offset!");

}

