#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_FiremodeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetails_FiremodeWidget.W_Modding_ItemDetails_FiremodeWidget_C
// 0x0028 (0x0598 - 0x0570)
class UW_Modding_ItemDetails_FiremodeWidget_C final : public UP2ModdingItemDetailsFiremode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_StatIcon;                                      // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_StatIcon;                                      // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_StatName;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HasSingleFire;                                     // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has2RndBurst;                                      // 0x0591(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has3RndBurst;                                      // 0x0592(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasFullAuto;                                       // 0x0593(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Modding_ItemDetails_FiremodeWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetails_FiremodeWidget_C">();
	}
	static class UW_Modding_ItemDetails_FiremodeWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetails_FiremodeWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetails_FiremodeWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetails_FiremodeWidget_C");
static_assert(sizeof(UW_Modding_ItemDetails_FiremodeWidget_C) == 0x000598, "Wrong size on UW_Modding_ItemDetails_FiremodeWidget_C");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, UberGraphFrame) == 0x000570, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, Bdr_StatIcon) == 0x000578, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::Bdr_StatIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, Img_StatIcon) == 0x000580, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::Img_StatIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, Txt_StatName) == 0x000588, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::Txt_StatName' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, HasSingleFire) == 0x000590, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::HasSingleFire' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, Has2RndBurst) == 0x000591, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::Has2RndBurst' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, Has3RndBurst) == 0x000592, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::Has3RndBurst' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_FiremodeWidget_C, HasFullAuto) == 0x000593, "Member 'UW_Modding_ItemDetails_FiremodeWidget_C::HasFullAuto' has a wrong offset!");

}

