#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemListHeader

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Modding_ItemListHeader.W_Modding_ItemListHeader_C.ExecuteUbergraph_W_Modding_ItemListHeader
// 0x005C (0x005C - 0x0000)
struct W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsModPart;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader) == 0x000004, "Wrong alignment on W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader");
static_assert(sizeof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader) == 0x00005C, "Wrong size on W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, EntryPoint) == 0x000000, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_Event_InIsModPart) == 0x000004, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_Event_InIsModPart' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader, K2Node_Event_IsDesignTime) == 0x000058, "Member 'W_Modding_ItemListHeader_C_ExecuteUbergraph_W_Modding_ItemListHeader::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Modding_ItemListHeader.W_Modding_ItemListHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemListHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemListHeader_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_ItemListHeader_C_PreConstruct");
static_assert(sizeof(W_Modding_ItemListHeader_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_ItemListHeader_C_PreConstruct");
static_assert(offsetof(W_Modding_ItemListHeader_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_ItemListHeader_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Modding_ItemListHeader.W_Modding_ItemListHeader_C.SstIsModPart_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent final
{
public:
	bool                                          InIsModPart;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent");
static_assert(sizeof(W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent");
static_assert(offsetof(W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent, InIsModPart) == 0x000000, "Member 'W_Modding_ItemListHeader_C_SstIsModPart_ImplementableEvent::InIsModPart' has a wrong offset!");

}

