#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemWidget.W_Modding_ItemWidget_C
// 0x0820 (0x0B50 - 0x0330)
class UW_Modding_ItemWidget_C final : public UP2ModdingItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Item;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_NoSlot;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Equipped;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_ItemInfo;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsNoSlot;                                          // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnavailable;                                     // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsModPart;                                         // 0x0362(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0363(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquipped;                                        // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0xB];                                      // 0x0365(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ModPartStyle;                                      // 0x0370(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           AttachPartStyle;                                   // 0x0760(0x03F0)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnSetIsNoSlot_ImplementableEvent(bool InIsNoSlot)	 // 0xae1e64;
	void OnSetIsModPart_ImplementableEvent(bool InModpart)	 // 0xae1e64;
	void ExecuteUbergraph_W_Modding_ItemWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemWidget_C">();
	}
	static class UW_Modding_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemWidget_C) == 0x000010, "Wrong alignment on UW_Modding_ItemWidget_C");
static_assert(sizeof(UW_Modding_ItemWidget_C) == 0x000B50, "Wrong size on UW_Modding_ItemWidget_C");
static_assert(offsetof(UW_Modding_ItemWidget_C, UberGraphFrame) == 0x000330, "Member 'UW_Modding_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, Bdr_Item) == 0x000338, "Member 'UW_Modding_ItemWidget_C::Bdr_Item' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, Bdr_NoSlot) == 0x000340, "Member 'UW_Modding_ItemWidget_C::Bdr_NoSlot' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, Img_Equipped) == 0x000348, "Member 'UW_Modding_ItemWidget_C::Img_Equipped' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, Img_Outline) == 0x000350, "Member 'UW_Modding_ItemWidget_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, Ovr_ItemInfo) == 0x000358, "Member 'UW_Modding_ItemWidget_C::Ovr_ItemInfo' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, IsNoSlot) == 0x000360, "Member 'UW_Modding_ItemWidget_C::IsNoSlot' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, IsUnavailable) == 0x000361, "Member 'UW_Modding_ItemWidget_C::IsUnavailable' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, IsModPart) == 0x000362, "Member 'UW_Modding_ItemWidget_C::IsModPart' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, IsSelected) == 0x000363, "Member 'UW_Modding_ItemWidget_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, IsEquipped) == 0x000364, "Member 'UW_Modding_ItemWidget_C::IsEquipped' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, ModPartStyle) == 0x000370, "Member 'UW_Modding_ItemWidget_C::ModPartStyle' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemWidget_C, AttachPartStyle) == 0x000760, "Member 'UW_Modding_ItemWidget_C::AttachPartStyle' has a wrong offset!");

}

