#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ModdingWidget

#include "Basic.hpp"

#include "Hideout_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ModdingWidget.W_ModdingWidget_C.ExecuteUbergraph_W_ModdingWidget
// 0x0044 (0x0044 - 0x0000)
struct W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InModdingDepth;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2ModdingStatusType                          K2Node_Event_InModdingStatusType;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsCustomization;                     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0014)()
};
static_assert(alignof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget) == 0x000004, "Wrong alignment on W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget");
static_assert(sizeof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget) == 0x000044, "Wrong size on W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, EntryPoint) == 0x000000, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_bool_Variable) == 0x000004, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_byte_Variable) == 0x000005, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_byte_Variable_1) == 0x000006, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_bool_Variable_1) == 0x000007, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_byte_Variable_2) == 0x000008, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, Temp_byte_Variable_3) == 0x000009, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_Event_InModdingDepth) == 0x00000C, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_Event_InModdingDepth' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_Event_InModdingStatusType) == 0x000011, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_Event_InModdingStatusType' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_Event_bIsCustomization) == 0x000013, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_Event_bIsCustomization' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_Select_Default) == 0x000014, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_Select_Default_1) == 0x000015, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, CallFunc_SelectInt_ReturnValue) == 0x000018, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_MakeStruct_SlateColor) == 0x00001C, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'W_ModdingWidget_C_ExecuteUbergraph_W_ModdingWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_ModdingWidget.W_ModdingWidget_C.OnModdingDepthChanged
// 0x0004 (0x0004 - 0x0000)
struct W_ModdingWidget_C_OnModdingDepthChanged final
{
public:
	int32                                         InModdingDepth;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModdingWidget_C_OnModdingDepthChanged) == 0x000004, "Wrong alignment on W_ModdingWidget_C_OnModdingDepthChanged");
static_assert(sizeof(W_ModdingWidget_C_OnModdingDepthChanged) == 0x000004, "Wrong size on W_ModdingWidget_C_OnModdingDepthChanged");
static_assert(offsetof(W_ModdingWidget_C_OnModdingDepthChanged, InModdingDepth) == 0x000000, "Member 'W_ModdingWidget_C_OnModdingDepthChanged::InModdingDepth' has a wrong offset!");

// Function W_ModdingWidget.W_ModdingWidget_C.OnSetCustomization_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_ModdingWidget_C_OnSetCustomization_ImplementableEvent final
{
public:
	bool                                          bIsCustomization;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModdingWidget_C_OnSetCustomization_ImplementableEvent) == 0x000001, "Wrong alignment on W_ModdingWidget_C_OnSetCustomization_ImplementableEvent");
static_assert(sizeof(W_ModdingWidget_C_OnSetCustomization_ImplementableEvent) == 0x000001, "Wrong size on W_ModdingWidget_C_OnSetCustomization_ImplementableEvent");
static_assert(offsetof(W_ModdingWidget_C_OnSetCustomization_ImplementableEvent, bIsCustomization) == 0x000000, "Member 'W_ModdingWidget_C_OnSetCustomization_ImplementableEvent::bIsCustomization' has a wrong offset!");

// Function W_ModdingWidget.W_ModdingWidget_C.OnSetModdingStatus_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent final
{
public:
	EP2ModdingStatusType                          InModdingStatusType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent) == 0x000001, "Wrong alignment on W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent");
static_assert(sizeof(W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent) == 0x000001, "Wrong size on W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent");
static_assert(offsetof(W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent, InModdingStatusType) == 0x000000, "Member 'W_ModdingWidget_C_OnSetModdingStatus_ImplementableEvent::InModdingStatusType' has a wrong offset!");

}

