#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemListHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemListHeader.W_Modding_ItemListHeader_C
// 0x0038 (0x02D0 - 0x0298)
class UW_Modding_ItemListHeader_C final : public UP2ModdingItemListHeader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ListHeader;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsModPart;                                         // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SlotName;                                          // 0x02B0(0x0018)(Edit, BlueprintVisible)
	int32                                         ItemCount;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Modding_ItemListHeader(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SstIsModPart_ImplementableEvent(bool InIsModPart)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemListHeader_C">();
	}
	static class UW_Modding_ItemListHeader_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemListHeader_C>();
	}
};
static_assert(alignof(UW_Modding_ItemListHeader_C) == 0x000008, "Wrong alignment on UW_Modding_ItemListHeader_C");
static_assert(sizeof(UW_Modding_ItemListHeader_C) == 0x0002D0, "Wrong size on UW_Modding_ItemListHeader_C");
static_assert(offsetof(UW_Modding_ItemListHeader_C, UberGraphFrame) == 0x000298, "Member 'UW_Modding_ItemListHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemListHeader_C, Bdr_ListHeader) == 0x0002A0, "Member 'UW_Modding_ItemListHeader_C::Bdr_ListHeader' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemListHeader_C, IsModPart) == 0x0002A8, "Member 'UW_Modding_ItemListHeader_C::IsModPart' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemListHeader_C, SlotName) == 0x0002B0, "Member 'UW_Modding_ItemListHeader_C::SlotName' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemListHeader_C, ItemCount) == 0x0002C8, "Member 'UW_Modding_ItemListHeader_C::ItemCount' has a wrong offset!");

}

