#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_MainStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetails_MainStatWidget.W_Modding_ItemDetails_MainStatWidget_C
// 0x0048 (0x05C0 - 0x0578)
class UW_Modding_ItemDetails_MainStatWidget_C final : public UP2ModdingItemDetailsMainStat
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ModifyValue;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           PB_ModifiedStatGauge;                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ModifiedStatGauge;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_ModifyValue;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ModifyValue;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_EffectIndicator;                                // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             MainStatIcon;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDigits;                                       // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CompareStatWidget_ImplementableEvent(float InOriginalValue, float InCompareValue, const struct FP2ItemStatAccessorParams& InParams)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Modding_ItemDetails_MainStatWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetails_MainStatWidget_C">();
	}
	static class UW_Modding_ItemDetails_MainStatWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetails_MainStatWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetails_MainStatWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetails_MainStatWidget_C");
static_assert(sizeof(UW_Modding_ItemDetails_MainStatWidget_C) == 0x0005C0, "Wrong size on UW_Modding_ItemDetails_MainStatWidget_C");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, UberGraphFrame) == 0x000578, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, Bdr_ModifyValue) == 0x000580, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::Bdr_ModifyValue' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, PB_ModifiedStatGauge) == 0x000588, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::PB_ModifiedStatGauge' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, SzB_ModifiedStatGauge) == 0x000590, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::SzB_ModifiedStatGauge' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, SzB_ModifyValue) == 0x000598, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::SzB_ModifyValue' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, Txt_ModifyValue) == 0x0005A0, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::Txt_ModifyValue' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, VB_EffectIndicator) == 0x0005A8, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::VB_EffectIndicator' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, MainStatIcon) == 0x0005B0, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::MainStatIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_MainStatWidget_C, LocalDigits) == 0x0005B8, "Member 'UW_Modding_ItemDetails_MainStatWidget_C::LocalDigits' has a wrong offset!");

}

