#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Modding_ItemWidget.W_Modding_ItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Modding_ItemWidget_C_PreConstruct");
static_assert(sizeof(W_Modding_ItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Modding_ItemWidget_C_PreConstruct");
static_assert(offsetof(W_Modding_ItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Modding_ItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Modding_ItemWidget.W_Modding_ItemWidget_C.OnSetIsNoSlot_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent final
{
public:
	bool                                          InIsNoSlot;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent");
static_assert(sizeof(W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent");
static_assert(offsetof(W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent, InIsNoSlot) == 0x000000, "Member 'W_Modding_ItemWidget_C_OnSetIsNoSlot_ImplementableEvent::InIsNoSlot' has a wrong offset!");

// Function W_Modding_ItemWidget.W_Modding_ItemWidget_C.OnSetIsModPart_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent final
{
public:
	bool                                          InModpart;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent) == 0x000001, "Wrong alignment on W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent");
static_assert(sizeof(W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent) == 0x000001, "Wrong size on W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent");
static_assert(offsetof(W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent, InModpart) == 0x000000, "Member 'W_Modding_ItemWidget_C_OnSetIsModPart_ImplementableEvent::InModpart' has a wrong offset!");

// Function W_Modding_ItemWidget.W_Modding_ItemWidget_C.ExecuteUbergraph_W_Modding_ItemWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InModpart;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsNoSlot;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget) == 0x000004, "Wrong alignment on W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget");
static_assert(sizeof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget) == 0x000008, "Wrong size on W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget");
static_assert(offsetof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget, EntryPoint) == 0x000000, "Member 'W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget, K2Node_Event_InModpart) == 0x000004, "Member 'W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget::K2Node_Event_InModpart' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget, K2Node_Event_InIsNoSlot) == 0x000005, "Member 'W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget::K2Node_Event_InIsNoSlot' has a wrong offset!");
static_assert(offsetof(W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget, K2Node_Event_IsDesignTime) == 0x000006, "Member 'W_Modding_ItemWidget_C_ExecuteUbergraph_W_Modding_ItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

