#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Modding_ItemDetails_ProtectionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Modding_ItemDetails_ProtectionWidget.W_Modding_ItemDetails_ProtectionWidget_C
// 0x0060 (0x05D8 - 0x0578)
class UW_Modding_ItemDetails_ProtectionWidget_C final : public UP2ModdingItemDetailsProtection
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             AttributeIcon;                                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   AttributeName;                                     // 0x0588(0x0018)(Edit, BlueprintVisible)
	class FText                                   AttributeValue;                                    // 0x05A0(0x0018)(Edit, BlueprintVisible)
	class FText                                   AttributeUnit;                                     // 0x05B8(0x0018)(Edit, BlueprintVisible)
	bool                                          HasAttributeUnit;                                  // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Modding_ItemDetails_ProtectionWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Modding_ItemDetails_ProtectionWidget_C">();
	}
	static class UW_Modding_ItemDetails_ProtectionWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Modding_ItemDetails_ProtectionWidget_C>();
	}
};
static_assert(alignof(UW_Modding_ItemDetails_ProtectionWidget_C) == 0x000008, "Wrong alignment on UW_Modding_ItemDetails_ProtectionWidget_C");
static_assert(sizeof(UW_Modding_ItemDetails_ProtectionWidget_C) == 0x0005D8, "Wrong size on UW_Modding_ItemDetails_ProtectionWidget_C");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, UberGraphFrame) == 0x000578, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, AttributeIcon) == 0x000580, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::AttributeIcon' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, AttributeName) == 0x000588, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::AttributeName' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, AttributeValue) == 0x0005A0, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::AttributeValue' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, AttributeUnit) == 0x0005B8, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::AttributeUnit' has a wrong offset!");
static_assert(offsetof(UW_Modding_ItemDetails_ProtectionWidget_C, HasAttributeUnit) == 0x0005D0, "Member 'UW_Modding_ItemDetails_ProtectionWidget_C::HasAttributeUnit' has a wrong offset!");

}

