#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionsMenu

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function W_OptionsMenu.W_OptionsMenu_C.ActiveInputAction_Implementable
// 0x0030 (0x0030 - 0x0000)
struct W_OptionsMenu_C_ActiveInputAction_Implementable final
{
public:
	const class UInputAction*                     InInputAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InInputTag;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      InputActionValue;                                  // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_OptionsMenu_C_ActiveInputAction_Implementable) == 0x000008, "Wrong alignment on W_OptionsMenu_C_ActiveInputAction_Implementable");
static_assert(sizeof(W_OptionsMenu_C_ActiveInputAction_Implementable) == 0x000030, "Wrong size on W_OptionsMenu_C_ActiveInputAction_Implementable");
static_assert(offsetof(W_OptionsMenu_C_ActiveInputAction_Implementable, InInputAction) == 0x000000, "Member 'W_OptionsMenu_C_ActiveInputAction_Implementable::InInputAction' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ActiveInputAction_Implementable, InInputTag) == 0x000008, "Member 'W_OptionsMenu_C_ActiveInputAction_Implementable::InInputTag' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ActiveInputAction_Implementable, InputActionValue) == 0x000010, "Member 'W_OptionsMenu_C_ActiveInputAction_Implementable::InputActionValue' has a wrong offset!");

// Function W_OptionsMenu.W_OptionsMenu_C.BP_OnHandleBackAction
// 0x0028 (0x0028 - 0x0000)
struct W_OptionsMenu_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OptionsMenu_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on W_OptionsMenu_C_BP_OnHandleBackAction");
static_assert(sizeof(W_OptionsMenu_C_BP_OnHandleBackAction) == 0x000028, "Wrong size on W_OptionsMenu_C_BP_OnHandleBackAction");
static_assert(offsetof(W_OptionsMenu_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_OptionsMenu_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_BP_OnHandleBackAction, Temp_delegate_Variable) == 0x000004, "Member 'W_OptionsMenu_C_BP_OnHandleBackAction::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_BP_OnHandleBackAction, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'W_OptionsMenu_C_BP_OnHandleBackAction::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_BP_OnHandleBackAction, CallFunc_PostEvent_ReturnValue) == 0x000020, "Member 'W_OptionsMenu_C_BP_OnHandleBackAction::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function W_OptionsMenu.W_OptionsMenu_C.CollapseWidget
// 0x0020 (0x0020 - 0x0000)
struct W_OptionsMenu_C_CollapseWidget final
{
public:
	class UW_CommonButtonWidget_C*                K2Node_DynamicCast_AsW_Common_Button_Widget;       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_CommonButtonWidget_C*                K2Node_DynamicCast_AsW_Common_Button_Widget_1;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OptionsMenu_C_CollapseWidget) == 0x000008, "Wrong alignment on W_OptionsMenu_C_CollapseWidget");
static_assert(sizeof(W_OptionsMenu_C_CollapseWidget) == 0x000020, "Wrong size on W_OptionsMenu_C_CollapseWidget");
static_assert(offsetof(W_OptionsMenu_C_CollapseWidget, K2Node_DynamicCast_AsW_Common_Button_Widget) == 0x000000, "Member 'W_OptionsMenu_C_CollapseWidget::K2Node_DynamicCast_AsW_Common_Button_Widget' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_CollapseWidget, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'W_OptionsMenu_C_CollapseWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_CollapseWidget, K2Node_DynamicCast_AsW_Common_Button_Widget_1) == 0x000010, "Member 'W_OptionsMenu_C_CollapseWidget::K2Node_DynamicCast_AsW_Common_Button_Widget_1' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_CollapseWidget, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'W_OptionsMenu_C_CollapseWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function W_OptionsMenu.W_OptionsMenu_C.ExecuteUbergraph_W_OptionsMenu
// 0x0040 (0x0040 - 0x0000)
struct W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UInputAction*                     K2Node_Event_InInputAction;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InInputTag;                           // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_Event_InputActionValue;                     // 0x0018(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu) == 0x000008, "Wrong alignment on W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu");
static_assert(sizeof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu) == 0x000040, "Wrong size on W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, EntryPoint) == 0x000000, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, K2Node_Event_InInputAction) == 0x000008, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::K2Node_Event_InInputAction' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, K2Node_Event_InInputTag) == 0x000010, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::K2Node_Event_InInputTag' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, K2Node_Event_InputActionValue) == 0x000018, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::K2Node_Event_InputActionValue' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu, K2Node_Event_IsDesignTime) == 0x000039, "Member 'W_OptionsMenu_C_ExecuteUbergraph_W_OptionsMenu::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_OptionsMenu.W_OptionsMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OptionsMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OptionsMenu_C_PreConstruct) == 0x000001, "Wrong alignment on W_OptionsMenu_C_PreConstruct");
static_assert(sizeof(W_OptionsMenu_C_PreConstruct) == 0x000001, "Wrong size on W_OptionsMenu_C_PreConstruct");
static_assert(offsetof(W_OptionsMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OptionsMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

