#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionsMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OptionsMenu.W_OptionsMenu_C
// 0x00A0 (0x0758 - 0x06B8)
class UW_OptionsMenu_C final : public UP2OptionsMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Title_Line;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FacilityTitle;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_GroupHeaderWidget_C*         W_Options_GroupHeaderWidget;                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_1;                        // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_2;                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_3;                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_4;                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_5;                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_6;                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_7;                        // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_8;                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_9;                        // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_10;                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_11;                       // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_12;                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_13;                       // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Options_InputKeyWidget_C*            W_Options_InputKeyWidget_14;                       // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveInputAction_Implementable(const class UInputAction* InInputAction, const struct FGameplayTag& InInputTag, const struct FInputActionValue& InputActionValue)	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void CollapseWidget()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_OptionsMenu(int32 EntryPoint)	 // 0xae1e64;
	void IniKeyFocus()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OptionsMenu_C">();
	}
	static class UW_OptionsMenu_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OptionsMenu_C>();
	}
};
static_assert(alignof(UW_OptionsMenu_C) == 0x000008, "Wrong alignment on UW_OptionsMenu_C");
static_assert(sizeof(UW_OptionsMenu_C) == 0x000758, "Wrong size on UW_OptionsMenu_C");
static_assert(offsetof(UW_OptionsMenu_C, UberGraphFrame) == 0x0006B8, "Member 'UW_OptionsMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, Img_Title_Line) == 0x0006C0, "Member 'UW_OptionsMenu_C::Img_Title_Line' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, Txt_FacilityTitle) == 0x0006C8, "Member 'UW_OptionsMenu_C::Txt_FacilityTitle' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_GroupHeaderWidget) == 0x0006D0, "Member 'UW_OptionsMenu_C::W_Options_GroupHeaderWidget' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget) == 0x0006D8, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_1) == 0x0006E0, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_1' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_2) == 0x0006E8, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_2' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_3) == 0x0006F0, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_3' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_4) == 0x0006F8, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_4' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_5) == 0x000700, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_5' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_6) == 0x000708, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_6' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_7) == 0x000710, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_7' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_8) == 0x000718, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_8' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_9) == 0x000720, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_9' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_10) == 0x000728, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_10' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_11) == 0x000730, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_11' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_12) == 0x000738, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_12' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_13) == 0x000740, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_13' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, W_Options_InputKeyWidget_14) == 0x000748, "Member 'UW_OptionsMenu_C::W_Options_InputKeyWidget_14' has a wrong offset!");
static_assert(offsetof(UW_OptionsMenu_C, NewVar_0) == 0x000750, "Member 'UW_OptionsMenu_C::NewVar_0' has a wrong offset!");

}

