#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.ExecuteUbergraph_W_OperationalTask_Item
// 0x0034 (0x0034 - 0x0000)
struct W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsEmpty;                            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect_2;                         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect_1;                         // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompleted_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item) == 0x000004, "Wrong alignment on W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item");
static_assert(sizeof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item) == 0x000034, "Wrong size on W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, EntryPoint) == 0x000000, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_Event_InIsEmpty) == 0x00002D, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_Event_InIsEmpty' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_Event_InIsSelect_2) == 0x00002E, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_Event_InIsSelect_2' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_Event_InIsSelect_1) == 0x00002F, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_Event_InIsSelect_1' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, K2Node_Event_InIsSelect) == 0x000030, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::K2Node_Event_InIsSelect' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item, CallFunc_IsCompleted_ReturnValue) == 0x000031, "Member 'W_OperationalTask_Item_C_ExecuteUbergraph_W_OperationalTask_Item::CallFunc_IsCompleted_ReturnValue' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.OnHovered_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Item_C_OnHovered_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_OnHovered_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_Item_C_OnHovered_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_Item_C_OnHovered_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_Item_C_OnHovered_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_Item_C_OnHovered_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_OperationalTask_Item_C_OnHovered_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.OnSelect_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Item_C_OnSelect_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_OnSelect_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_Item_C_OnSelect_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_Item_C_OnSelect_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_Item_C_OnSelect_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_Item_C_OnSelect_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_OperationalTask_Item_C_OnSelect_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.OnSetEmpty_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent final
{
public:
	bool                                          InIsEmpty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent, InIsEmpty) == 0x000000, "Member 'W_OperationalTask_Item_C_OnSetEmpty_ImplementableEvent::InIsEmpty' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.OnUnHovered_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_OperationalTask_Item_C_OnUnHovered_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_PreConstruct) == 0x000001, "Wrong alignment on W_OperationalTask_Item_C_PreConstruct");
static_assert(sizeof(W_OperationalTask_Item_C_PreConstruct) == 0x000001, "Wrong size on W_OperationalTask_Item_C_PreConstruct");
static_assert(offsetof(W_OperationalTask_Item_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OperationalTask_Item_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OperationalTask_Item.W_OperationalTask_Item_C.UpdateWidget
// 0x0044 (0x0044 - 0x0000)
struct W_OperationalTask_Item_C_UpdateWidget final
{
public:
	bool                                          IsSelect_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	bool                                          CallFunc_IsCompleted_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCompleted_ReturnValue_1;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Item_C_UpdateWidget) == 0x000004, "Wrong alignment on W_OperationalTask_Item_C_UpdateWidget");
static_assert(sizeof(W_OperationalTask_Item_C_UpdateWidget) == 0x000044, "Wrong size on W_OperationalTask_Item_C_UpdateWidget");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, IsSelect_0) == 0x000000, "Member 'W_OperationalTask_Item_C_UpdateWidget::IsSelect_0' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_OperationalTask_Item_C_UpdateWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_OperationalTask_Item_C_UpdateWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_OperationalTask_Item_C_UpdateWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, CallFunc_IsCompleted_ReturnValue) == 0x000040, "Member 'W_OperationalTask_Item_C_UpdateWidget::CallFunc_IsCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Item_C_UpdateWidget, CallFunc_IsCompleted_ReturnValue_1) == 0x000041, "Member 'W_OperationalTask_Item_C_UpdateWidget::CallFunc_IsCompleted_ReturnValue_1' has a wrong offset!");

}

