#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_StageTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OperationalTask_StageTab.W_OperationalTask_StageTab_C
// 0x0028 (0x02D8 - 0x02B0)
class UW_OperationalTask_StageTab_C final : public UP2OperationalTaskStageTab
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Selected;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Outline;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SelectedBar;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stage;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_OperationalTask_StageTab(int32 EntryPoint)	 // 0xae1e64;
	void OnSelect_ImplementableEvent(bool InIsSelect)	 // 0xae1e64;
	void OnSetStageIndex_ImplementableEvent(int32 InStageIndex)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OperationalTask_StageTab_C">();
	}
	static class UW_OperationalTask_StageTab_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OperationalTask_StageTab_C>();
	}
};
static_assert(alignof(UW_OperationalTask_StageTab_C) == 0x000008, "Wrong alignment on UW_OperationalTask_StageTab_C");
static_assert(sizeof(UW_OperationalTask_StageTab_C) == 0x0002D8, "Wrong size on UW_OperationalTask_StageTab_C");
static_assert(offsetof(UW_OperationalTask_StageTab_C, UberGraphFrame) == 0x0002B0, "Member 'UW_OperationalTask_StageTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_StageTab_C, Bdr_Selected) == 0x0002B8, "Member 'UW_OperationalTask_StageTab_C::Bdr_Selected' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_StageTab_C, Img_Outline) == 0x0002C0, "Member 'UW_OperationalTask_StageTab_C::Img_Outline' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_StageTab_C, Img_SelectedBar) == 0x0002C8, "Member 'UW_OperationalTask_StageTab_C::Img_SelectedBar' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_StageTab_C, Img_Stage) == 0x0002D0, "Member 'UW_OperationalTask_StageTab_C::Img_Stage' has a wrong offset!");

}

