#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GroupHeaderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_GroupHeaderWidget.W_Options_GroupHeaderWidget_C
// 0x0028 (0x02A8 - 0x0280)
class UW_Options_GroupHeaderWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_HeaderName;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Header_Name;                                       // 0x0290(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_W_Options_GroupHeaderWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetHeaderName(const class FText& HeaderName)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Options_GroupHeaderWidget_C">();
	}
	static class UW_Options_GroupHeaderWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Options_GroupHeaderWidget_C>();
	}
};
static_assert(alignof(UW_Options_GroupHeaderWidget_C) == 0x000008, "Wrong alignment on UW_Options_GroupHeaderWidget_C");
static_assert(sizeof(UW_Options_GroupHeaderWidget_C) == 0x0002A8, "Wrong size on UW_Options_GroupHeaderWidget_C");
static_assert(offsetof(UW_Options_GroupHeaderWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_Options_GroupHeaderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Options_GroupHeaderWidget_C, Txt_HeaderName) == 0x000288, "Member 'UW_Options_GroupHeaderWidget_C::Txt_HeaderName' has a wrong offset!");
static_assert(offsetof(UW_Options_GroupHeaderWidget_C, Header_Name) == 0x000290, "Member 'UW_Options_GroupHeaderWidget_C::Header_Name' has a wrong offset!");

}

