#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_Detail

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OperationalTask_Detail.W_OperationalTask_Detail_C.ExecuteUbergraph_W_OperationalTask_Detail
// 0x0008 (0x0008 - 0x0000)
struct W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsCompleted;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail) == 0x000004, "Wrong alignment on W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail");
static_assert(sizeof(W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail) == 0x000008, "Wrong size on W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail");
static_assert(offsetof(W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail, EntryPoint) == 0x000000, "Member 'W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail, K2Node_Event_InIsCompleted) == 0x000004, "Member 'W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail::K2Node_Event_InIsCompleted' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail, K2Node_Event_IsDesignTime) == 0x000005, "Member 'W_OperationalTask_Detail_C_ExecuteUbergraph_W_OperationalTask_Detail::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_OperationalTask_Detail.W_OperationalTask_Detail_C.OnTaskCompleted_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent final
{
public:
	bool                                          InIsCompleted;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent, InIsCompleted) == 0x000000, "Member 'W_OperationalTask_Detail_C_OnTaskCompleted_ImplementableEvent::InIsCompleted' has a wrong offset!");

// Function W_OperationalTask_Detail.W_OperationalTask_Detail_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_Detail_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_Detail_C_PreConstruct) == 0x000001, "Wrong alignment on W_OperationalTask_Detail_C_PreConstruct");
static_assert(sizeof(W_OperationalTask_Detail_C_PreConstruct) == 0x000001, "Wrong size on W_OperationalTask_Detail_C_PreConstruct");
static_assert(offsetof(W_OperationalTask_Detail_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OperationalTask_Detail_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

