#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_GroupHeaderWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Options_GroupHeaderWidget.W_Options_GroupHeaderWidget_C.ExecuteUbergraph_W_Options_GroupHeaderWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget) == 0x000004, "Wrong alignment on W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget");
static_assert(sizeof(W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget) == 0x000008, "Wrong size on W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget");
static_assert(offsetof(W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget, EntryPoint) == 0x000000, "Member 'W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Options_GroupHeaderWidget_C_ExecuteUbergraph_W_Options_GroupHeaderWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Options_GroupHeaderWidget.W_Options_GroupHeaderWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Options_GroupHeaderWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_GroupHeaderWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Options_GroupHeaderWidget_C_PreConstruct");
static_assert(sizeof(W_Options_GroupHeaderWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Options_GroupHeaderWidget_C_PreConstruct");
static_assert(offsetof(W_Options_GroupHeaderWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Options_GroupHeaderWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Options_GroupHeaderWidget.W_Options_GroupHeaderWidget_C.SetHeaderName
// 0x0018 (0x0018 - 0x0000)
struct W_Options_GroupHeaderWidget_C_SetHeaderName final
{
public:
	class FText                                   HeaderName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_Options_GroupHeaderWidget_C_SetHeaderName) == 0x000008, "Wrong alignment on W_Options_GroupHeaderWidget_C_SetHeaderName");
static_assert(sizeof(W_Options_GroupHeaderWidget_C_SetHeaderName) == 0x000018, "Wrong size on W_Options_GroupHeaderWidget_C_SetHeaderName");
static_assert(offsetof(W_Options_GroupHeaderWidget_C_SetHeaderName, HeaderName) == 0x000000, "Member 'W_Options_GroupHeaderWidget_C_SetHeaderName::HeaderName' has a wrong offset!");

}

