#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_StageTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OperationalTask_StageTab.W_OperationalTask_StageTab_C.ExecuteUbergraph_W_OperationalTask_StageTab
// 0x000C (0x000C - 0x0000)
struct W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InStageIndex;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab) == 0x000004, "Wrong alignment on W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab");
static_assert(sizeof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab) == 0x00000C, "Wrong size on W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab");
static_assert(offsetof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab, EntryPoint) == 0x000000, "Member 'W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab, K2Node_Event_InStageIndex) == 0x000004, "Member 'W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab::K2Node_Event_InStageIndex' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab, K2Node_Event_InIsSelect) == 0x000009, "Member 'W_OperationalTask_StageTab_C_ExecuteUbergraph_W_OperationalTask_StageTab::K2Node_Event_InIsSelect' has a wrong offset!");

// Function W_OperationalTask_StageTab.W_OperationalTask_StageTab_C.OnSelect_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_OperationalTask_StageTab_C_OnSelect_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_OperationalTask_StageTab.W_OperationalTask_StageTab_C.OnSetStageIndex_ImplementableEvent
// 0x0004 (0x0004 - 0x0000)
struct W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent final
{
public:
	int32                                         InStageIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent) == 0x000004, "Wrong alignment on W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent) == 0x000004, "Wrong size on W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent, InStageIndex) == 0x000000, "Member 'W_OperationalTask_StageTab_C_OnSetStageIndex_ImplementableEvent::InStageIndex' has a wrong offset!");

}

