#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionsSavePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OptionsSavePopup.W_OptionsSavePopup_C
// 0x0020 (0x05E0 - 0x05C0)
class UW_OptionsSavePopup_C final : public UP2GameOptionSavePopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_BottomLine;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Txt_Body;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Title;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_OptionsSavePopup(int32 EntryPoint)	 // 0xae1e64;
	void UpdateDesign(EP2OptionPopupType InOptionPopupType)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OptionsSavePopup_C">();
	}
	static class UW_OptionsSavePopup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OptionsSavePopup_C>();
	}
};
static_assert(alignof(UW_OptionsSavePopup_C) == 0x000008, "Wrong alignment on UW_OptionsSavePopup_C");
static_assert(sizeof(UW_OptionsSavePopup_C) == 0x0005E0, "Wrong size on UW_OptionsSavePopup_C");
static_assert(offsetof(UW_OptionsSavePopup_C, UberGraphFrame) == 0x0005C0, "Member 'UW_OptionsSavePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OptionsSavePopup_C, Img_BottomLine) == 0x0005C8, "Member 'UW_OptionsSavePopup_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_OptionsSavePopup_C, Txt_Body) == 0x0005D0, "Member 'UW_OptionsSavePopup_C::Txt_Body' has a wrong offset!");
static_assert(offsetof(UW_OptionsSavePopup_C, Txt_Title) == 0x0005D8, "Member 'UW_OptionsSavePopup_C::Txt_Title' has a wrong offset!");

}

