#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_ItemGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OperationalTask_ItemGroup.W_OperationalTask_ItemGroup_C
// 0x0048 (0x02F0 - 0x02A8)
class UW_OperationalTask_ItemGroup_C final : public UP2OperationalTaskItemGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_1;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_2;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_3;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_4;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_5;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_6;                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OperationalTask_Item_C*              W_OperationalTask_Item_8;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_OperationalTask_ItemGroup(int32 EntryPoint)	 // 0xae1e64;
	void SetTitleText()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OperationalTask_ItemGroup_C">();
	}
	static class UW_OperationalTask_ItemGroup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OperationalTask_ItemGroup_C>();
	}
};
static_assert(alignof(UW_OperationalTask_ItemGroup_C) == 0x000008, "Wrong alignment on UW_OperationalTask_ItemGroup_C");
static_assert(sizeof(UW_OperationalTask_ItemGroup_C) == 0x0002F0, "Wrong size on UW_OperationalTask_ItemGroup_C");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, UberGraphFrame) == 0x0002A8, "Member 'UW_OperationalTask_ItemGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item) == 0x0002B0, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_1) == 0x0002B8, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_1' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_2) == 0x0002C0, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_2' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_3) == 0x0002C8, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_3' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_4) == 0x0002D0, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_4' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_5) == 0x0002D8, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_5' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_6) == 0x0002E0, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_6' has a wrong offset!");
static_assert(offsetof(UW_OperationalTask_ItemGroup_C, W_OperationalTask_Item_8) == 0x0002E8, "Member 'UW_OperationalTask_ItemGroup_C::W_OperationalTask_Item_8' has a wrong offset!");

}

