#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_DropDownWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_DropDownWidget.W_Options_DropDownWidget_C
// 0x0120 (0x03C8 - 0x02A8)
class UW_Options_DropDownWidget_C final : public UP2GameOptionItemWidget_ComboBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UP2Button*                              Btn_DropDown;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Settings_StepperSelection_C*         W_Settings_StepperSelection;                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingName;                                       // 0x02D0(0x0018)(Edit, BlueprintVisible)
	class FString                                 CurrentSelectItem;                                 // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           OpenDropdownCue;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SelectCue;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkAudioEventOnOpenDropDown;                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AkAudioEventOnSelect;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultFont;                                       // 0x0318(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         HoverFont;                                         // 0x0370(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AddItemComboBox(const class FString& Option)	 // 0xae1e64;
	void AddSound(const struct FGameplayTag& InGameplayCueTag, class UAkAudioEvent* InAkAudioEvent)	 // 0xae1e64;
	void BndEvt__W_Options_DropDownWidget_Btn_DropDown_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Options_DropDownWidget_Btn_DropDown_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Options_DropDownWidget_Btn_DropDown_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Settings_DropDownWidget_Combo_DropDown_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType)	 // 0xae1e64;
	void BndEvt__W_Settings_DropDownWidget_Combo_DropDown_K2Node_ComponentBoundEvent_1_OnOpeningEvent__DelegateSignature()	 // 0xae1e64;
	void Destruct()	 // 0xae1e64;
	void ExecuteUbergraph_W_Options_DropDownWidget(int32 EntryPoint)	 // 0xae1e64;
	void GetSelectComboBox(class FString* OutSelectOption)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetSelectComboBox(const class FString& Option)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Options_DropDownWidget_C">();
	}
	static class UW_Options_DropDownWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Options_DropDownWidget_C>();
	}
};
static_assert(alignof(UW_Options_DropDownWidget_C) == 0x000008, "Wrong alignment on UW_Options_DropDownWidget_C");
static_assert(sizeof(UW_Options_DropDownWidget_C) == 0x0003C8, "Wrong size on UW_Options_DropDownWidget_C");
static_assert(offsetof(UW_Options_DropDownWidget_C, UberGraphFrame) == 0x0002A8, "Member 'UW_Options_DropDownWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, Init) == 0x0002B0, "Member 'UW_Options_DropDownWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, HoverAnim) == 0x0002B8, "Member 'UW_Options_DropDownWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, Btn_DropDown) == 0x0002C0, "Member 'UW_Options_DropDownWidget_C::Btn_DropDown' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, W_Settings_StepperSelection) == 0x0002C8, "Member 'UW_Options_DropDownWidget_C::W_Settings_StepperSelection' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, SettingName) == 0x0002D0, "Member 'UW_Options_DropDownWidget_C::SettingName' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, CurrentSelectItem) == 0x0002E8, "Member 'UW_Options_DropDownWidget_C::CurrentSelectItem' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, OpenDropdownCue) == 0x0002F8, "Member 'UW_Options_DropDownWidget_C::OpenDropdownCue' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, SelectCue) == 0x000300, "Member 'UW_Options_DropDownWidget_C::SelectCue' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, AkAudioEventOnOpenDropDown) == 0x000308, "Member 'UW_Options_DropDownWidget_C::AkAudioEventOnOpenDropDown' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, AkAudioEventOnSelect) == 0x000310, "Member 'UW_Options_DropDownWidget_C::AkAudioEventOnSelect' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, DefaultFont) == 0x000318, "Member 'UW_Options_DropDownWidget_C::DefaultFont' has a wrong offset!");
static_assert(offsetof(UW_Options_DropDownWidget_C, HoverFont) == 0x000370, "Member 'UW_Options_DropDownWidget_C::HoverFont' has a wrong offset!");

}

