#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionItemGroup

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OptionItemGroup.W_OptionItemGroup_C.ExecuteUbergraph_W_OptionItemGroup
// 0x0030 (0x0030 - 0x0000)
struct W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InSubCategory;                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup) == 0x000008, "Wrong alignment on W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup");
static_assert(sizeof(W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup) == 0x000030, "Wrong size on W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup");
static_assert(offsetof(W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup, EntryPoint) == 0x000000, "Member 'W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup, K2Node_Event_InSubCategory) == 0x000008, "Member 'W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup::K2Node_Event_InSubCategory' has a wrong offset!");
static_assert(offsetof(W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'W_OptionItemGroup_C_ExecuteUbergraph_W_OptionItemGroup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function W_OptionItemGroup.W_OptionItemGroup_C.SetSubCategory_ImplementableEvent
// 0x0010 (0x0010 - 0x0000)
struct W_OptionItemGroup_C_SetSubCategory_ImplementableEvent final
{
public:
	class FString                                 InSubCategory;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OptionItemGroup_C_SetSubCategory_ImplementableEvent) == 0x000008, "Wrong alignment on W_OptionItemGroup_C_SetSubCategory_ImplementableEvent");
static_assert(sizeof(W_OptionItemGroup_C_SetSubCategory_ImplementableEvent) == 0x000010, "Wrong size on W_OptionItemGroup_C_SetSubCategory_ImplementableEvent");
static_assert(offsetof(W_OptionItemGroup_C_SetSubCategory_ImplementableEvent, InSubCategory) == 0x000000, "Member 'W_OptionItemGroup_C_SetSubCategory_ImplementableEvent::InSubCategory' has a wrong offset!");

}

