#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_InputKeyWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_InputKeyWidget.W_Options_InputKeyWidget_C
// 0x08D0 (0x0BB0 - 0x02E0)
class UW_Options_InputKeyWidget_C final : public UP2GameOptionItemWidget_InputKey
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindActive;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindDisabledPattern;                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindOutline;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Btn_Keybind;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_PrimaryKeybind;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultFont;                                       // 0x0320(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         HoverFont;                                         // 0x0378(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FButtonStyle                           NormalBtnStyle;                                    // 0x03D0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DisabledBtnStle;                                   // 0x07C0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_Options_KeybindWidget_Btn_Keybind_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Options_KeybindWidget_Btn_Keybind_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Options_InputKeyWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetActionName(const class FText& ActionName)	 // 0xae1e64;
	void SetDisabledState(bool IsDisabled)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Options_InputKeyWidget_C">();
	}
	static class UW_Options_InputKeyWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Options_InputKeyWidget_C>();
	}
};
static_assert(alignof(UW_Options_InputKeyWidget_C) == 0x000010, "Wrong alignment on UW_Options_InputKeyWidget_C");
static_assert(sizeof(UW_Options_InputKeyWidget_C) == 0x000BB0, "Wrong size on UW_Options_InputKeyWidget_C");
static_assert(offsetof(UW_Options_InputKeyWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UW_Options_InputKeyWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Init) == 0x0002E8, "Member 'UW_Options_InputKeyWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, HoverAnim) == 0x0002F0, "Member 'UW_Options_InputKeyWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Bdr_PrimaryKeybindActive) == 0x0002F8, "Member 'UW_Options_InputKeyWidget_C::Bdr_PrimaryKeybindActive' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Bdr_PrimaryKeybindDisabledPattern) == 0x000300, "Member 'UW_Options_InputKeyWidget_C::Bdr_PrimaryKeybindDisabledPattern' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Bdr_PrimaryKeybindOutline) == 0x000308, "Member 'UW_Options_InputKeyWidget_C::Bdr_PrimaryKeybindOutline' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Btn_Keybind) == 0x000310, "Member 'UW_Options_InputKeyWidget_C::Btn_Keybind' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, Ovr_PrimaryKeybind) == 0x000318, "Member 'UW_Options_InputKeyWidget_C::Ovr_PrimaryKeybind' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, DefaultFont) == 0x000320, "Member 'UW_Options_InputKeyWidget_C::DefaultFont' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, HoverFont) == 0x000378, "Member 'UW_Options_InputKeyWidget_C::HoverFont' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, NormalBtnStyle) == 0x0003D0, "Member 'UW_Options_InputKeyWidget_C::NormalBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Options_InputKeyWidget_C, DisabledBtnStle) == 0x0007C0, "Member 'UW_Options_InputKeyWidget_C::DisabledBtnStle' has a wrong offset!");

}

