#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_CheckBoxWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Options_CheckBoxWidget.W_Options_CheckBoxWidget_C.BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'W_Options_CheckBoxWidget_C_BndEvt__W_Settings_CheckBoxWidget_ChkB_SettingCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function W_Options_CheckBoxWidget.W_Options_CheckBoxWidget_C.ExecuteUbergraph_W_Options_CheckBoxWidget
// 0x0020 (0x0020 - 0x0000)
struct W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget) == 0x000008, "Wrong alignment on W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget");
static_assert(sizeof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget) == 0x000020, "Wrong size on W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, EntryPoint) == 0x000000, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, K2Node_ComponentBoundEvent_bIsChecked) == 0x000005, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'W_Options_CheckBoxWidget_C_ExecuteUbergraph_W_Options_CheckBoxWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function W_Options_CheckBoxWidget.W_Options_CheckBoxWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Options_CheckBoxWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Options_CheckBoxWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Options_CheckBoxWidget_C_PreConstruct");
static_assert(sizeof(W_Options_CheckBoxWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Options_CheckBoxWidget_C_PreConstruct");
static_assert(offsetof(W_Options_CheckBoxWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Options_CheckBoxWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

