#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Options_KeybindWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Options_KeybindWidget.W_Options_KeybindWidget_C
// 0x08D8 (0x0C00 - 0x0328)
class UW_Options_KeybindWidget_C final : public UP2GameOptionItemWidget_Keybind
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Init;                                              // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindActive;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindDisabledPattern;                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PrimaryKeybindOutline;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UP2Button*                              Btn_Keybind;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_PrimaryKeybind;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         DefaultFont;                                       // 0x0368(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         HoverFont;                                         // 0x03C0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           NormalBtnStyle;                                    // 0x0420(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DisabledBtnStle;                                   // 0x0810(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__W_Options_KeybindWidget_Btn_Keybind_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void BndEvt__W_Options_KeybindWidget_Btn_Keybind_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature()	 // 0xae1e64;
	void ExecuteUbergraph_W_Options_KeybindWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetActionName(const class FText& ActionName)	 // 0xae1e64;
	void SetDisabledState(bool IsDisabled)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Options_KeybindWidget_C">();
	}
	static class UW_Options_KeybindWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Options_KeybindWidget_C>();
	}
};
static_assert(alignof(UW_Options_KeybindWidget_C) == 0x000010, "Wrong alignment on UW_Options_KeybindWidget_C");
static_assert(sizeof(UW_Options_KeybindWidget_C) == 0x000C00, "Wrong size on UW_Options_KeybindWidget_C");
static_assert(offsetof(UW_Options_KeybindWidget_C, UberGraphFrame) == 0x000328, "Member 'UW_Options_KeybindWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Init) == 0x000330, "Member 'UW_Options_KeybindWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, HoverAnim) == 0x000338, "Member 'UW_Options_KeybindWidget_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Bdr_PrimaryKeybindActive) == 0x000340, "Member 'UW_Options_KeybindWidget_C::Bdr_PrimaryKeybindActive' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Bdr_PrimaryKeybindDisabledPattern) == 0x000348, "Member 'UW_Options_KeybindWidget_C::Bdr_PrimaryKeybindDisabledPattern' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Bdr_PrimaryKeybindOutline) == 0x000350, "Member 'UW_Options_KeybindWidget_C::Bdr_PrimaryKeybindOutline' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Btn_Keybind) == 0x000358, "Member 'UW_Options_KeybindWidget_C::Btn_Keybind' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, Ovr_PrimaryKeybind) == 0x000360, "Member 'UW_Options_KeybindWidget_C::Ovr_PrimaryKeybind' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, DefaultFont) == 0x000368, "Member 'UW_Options_KeybindWidget_C::DefaultFont' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, HoverFont) == 0x0003C0, "Member 'UW_Options_KeybindWidget_C::HoverFont' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, NormalBtnStyle) == 0x000420, "Member 'UW_Options_KeybindWidget_C::NormalBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_Options_KeybindWidget_C, DisabledBtnStle) == 0x000810, "Member 'UW_Options_KeybindWidget_C::DisabledBtnStle' has a wrong offset!");

}

