#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OperationalTask_StageIndicator

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.ExecuteUbergraph_W_OperationalTask_StageIndicator
// 0x000C (0x000C - 0x0000)
struct W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageState                  CallFunc_GetStageState_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsInDetailWidget;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsSelect;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageState                  K2Node_Event_InOperationalTaskStageState;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2OperationalTaskStageState                  CallFunc_GetStageState_ReturnValue_1;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator) == 0x000004, "Wrong alignment on W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator) == 0x00000C, "Wrong size on W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, EntryPoint) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, CallFunc_GetStageState_ReturnValue) == 0x000004, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::CallFunc_GetStageState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, K2Node_Event_IsDesignTime) == 0x000005, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, K2Node_Event_InIsInDetailWidget) == 0x000006, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::K2Node_Event_InIsInDetailWidget' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, K2Node_Event_InIsSelect) == 0x000007, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::K2Node_Event_InIsSelect' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, K2Node_Event_InOperationalTaskStageState) == 0x000008, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::K2Node_Event_InOperationalTaskStageState' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator, CallFunc_GetStageState_ReturnValue_1) == 0x000009, "Member 'W_OperationalTask_StageIndicator_C_ExecuteUbergraph_W_OperationalTask_StageIndicator::CallFunc_GetStageState_ReturnValue_1' has a wrong offset!");

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.OnGetStageState_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent final
{
public:
	EP2OperationalTaskStageState                  InOperationalTaskStageState;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent, InOperationalTaskStageState) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_OnGetStageState_ImplementableEvent::InOperationalTaskStageState' has a wrong offset!");

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.OnSetIsInDetailWidget_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent final
{
public:
	bool                                          InIsInDetailWidget;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent, InIsInDetailWidget) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_OnSetIsInDetailWidget_ImplementableEvent::InIsInDetailWidget' has a wrong offset!");

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.OnSetSelect_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent final
{
public:
	bool                                          InIsSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent) == 0x000001, "Wrong alignment on W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent) == 0x000001, "Wrong size on W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent, InIsSelect) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_OnSetSelect_ImplementableEvent::InIsSelect' has a wrong offset!");

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OperationalTask_StageIndicator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_PreConstruct) == 0x000001, "Wrong alignment on W_OperationalTask_StageIndicator_C_PreConstruct");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_PreConstruct) == 0x000001, "Wrong size on W_OperationalTask_StageIndicator_C_PreConstruct");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OperationalTask_StageIndicator.W_OperationalTask_StageIndicator_C.SetStageState
// 0x0002 (0x0002 - 0x0000)
struct W_OperationalTask_StageIndicator_C_SetStageState final
{
public:
	EP2OperationalTaskStageState                  InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OperationalTask_StageIndicator_C_SetStageState) == 0x000001, "Wrong alignment on W_OperationalTask_StageIndicator_C_SetStageState");
static_assert(sizeof(W_OperationalTask_StageIndicator_C_SetStageState) == 0x000002, "Wrong size on W_OperationalTask_StageIndicator_C_SetStageState");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_SetStageState, InIsActive) == 0x000000, "Member 'W_OperationalTask_StageIndicator_C_SetStageState::InIsActive' has a wrong offset!");
static_assert(offsetof(W_OperationalTask_StageIndicator_C_SetStageState, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'W_OperationalTask_StageIndicator_C_SetStageState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

