#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopup_QuickPurchaseItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OutgamePopup_QuickPurchaseItemWidget.W_OutgamePopup_QuickPurchaseItemWidget_C
// 0x0060 (0x03E8 - 0x0388)
class UW_OutgamePopup_QuickPurchaseItemWidget_C final : public UP2OutgameQuickPurchaseItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_QuickPurchaseInfo;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Req;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Stock;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_StockLimit;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x03B0(0x0018)(Edit, BlueprintVisible)
	int32                                         ItemCount;                                         // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StockCount;                                        // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxStockCount;                                     // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Value;                                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStockLimited;                                    // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnStockLimitedChanged(bool bInIsStockLimited, int32 InCurrentStock, int32 InMaxStock, int32 InRequiredQuantity)	 // 0xae1e64;
	void ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OutgamePopup_QuickPurchaseItemWidget_C">();
	}
	static class UW_OutgamePopup_QuickPurchaseItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OutgamePopup_QuickPurchaseItemWidget_C>();
	}
};
static_assert(alignof(UW_OutgamePopup_QuickPurchaseItemWidget_C) == 0x000008, "Wrong alignment on UW_OutgamePopup_QuickPurchaseItemWidget_C");
static_assert(sizeof(UW_OutgamePopup_QuickPurchaseItemWidget_C) == 0x0003E8, "Wrong size on UW_OutgamePopup_QuickPurchaseItemWidget_C");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, UberGraphFrame) == 0x000388, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, Bdr_QuickPurchaseInfo) == 0x000390, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::Bdr_QuickPurchaseInfo' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, Txt_Req) == 0x000398, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::Txt_Req' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, Txt_Stock) == 0x0003A0, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::Txt_Stock' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, VB_StockLimit) == 0x0003A8, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::VB_StockLimit' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, ItemName) == 0x0003B0, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, ItemCount) == 0x0003C8, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::ItemCount' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, StockCount) == 0x0003CC, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::StockCount' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, MaxStockCount) == 0x0003D0, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::MaxStockCount' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, Value) == 0x0003D8, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::Value' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseItemWidget_C, IsStockLimited) == 0x0003E0, "Member 'UW_OutgamePopup_QuickPurchaseItemWidget_C::IsStockLimited' has a wrong offset!");

}

