#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgameCommonButtonWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OutgameCommonButtonWidget.W_OutgameCommonButtonWidget_C.ExecuteUbergraph_W_OutgameCommonButtonWidget
// 0x0008 (0x0008 - 0x0000)
struct W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsEnable;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget) == 0x000004, "Wrong alignment on W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget");
static_assert(sizeof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget) == 0x000008, "Wrong size on W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget, EntryPoint) == 0x000000, "Member 'W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget, K2Node_Event_InIsEnable) == 0x000004, "Member 'W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget::K2Node_Event_InIsEnable' has a wrong offset!");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget, K2Node_Event_IsDesignTime) == 0x000007, "Member 'W_OutgameCommonButtonWidget_C_ExecuteUbergraph_W_OutgameCommonButtonWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_OutgameCommonButtonWidget.W_OutgameCommonButtonWidget_C.Init
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameCommonButtonWidget_C_Init final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameCommonButtonWidget_C_Init) == 0x000001, "Wrong alignment on W_OutgameCommonButtonWidget_C_Init");
static_assert(sizeof(W_OutgameCommonButtonWidget_C_Init) == 0x000001, "Wrong size on W_OutgameCommonButtonWidget_C_Init");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_Init, IsEnabled) == 0x000000, "Member 'W_OutgameCommonButtonWidget_C_Init::IsEnabled' has a wrong offset!");

// Function W_OutgameCommonButtonWidget.W_OutgameCommonButtonWidget_C.OnSetButtonEnabled_ImplementableEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent final
{
public:
	bool                                          InIsEnable;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent) == 0x000001, "Wrong alignment on W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent");
static_assert(sizeof(W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent) == 0x000001, "Wrong size on W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent, InIsEnable) == 0x000000, "Member 'W_OutgameCommonButtonWidget_C_OnSetButtonEnabled_ImplementableEvent::InIsEnable' has a wrong offset!");

// Function W_OutgameCommonButtonWidget.W_OutgameCommonButtonWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameCommonButtonWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameCommonButtonWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_OutgameCommonButtonWidget_C_PreConstruct");
static_assert(sizeof(W_OutgameCommonButtonWidget_C_PreConstruct) == 0x000001, "Wrong size on W_OutgameCommonButtonWidget_C_PreConstruct");
static_assert(offsetof(W_OutgameCommonButtonWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OutgameCommonButtonWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

