#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopup_QuickPurchaseItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_OutgamePopup_QuickPurchaseItemWidget.W_OutgamePopup_QuickPurchaseItemWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct) == 0x000001, "Wrong size on W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseItemWidget.W_OutgamePopup_QuickPurchaseItemWidget_C.OnStockLimitedChanged
// 0x0010 (0x0010 - 0x0000)
struct W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged final
{
public:
	bool                                          bInIsStockLimited;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InCurrentStock;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxStock;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InRequiredQuantity;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged) == 0x000004, "Wrong alignment on W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged) == 0x000010, "Wrong size on W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged, bInIsStockLimited) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged::bInIsStockLimited' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged, InCurrentStock) == 0x000004, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged::InCurrentStock' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged, InMaxStock) == 0x000008, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged::InMaxStock' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged, InRequiredQuantity) == 0x00000C, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_OnStockLimitedChanged::InRequiredQuantity' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseItemWidget.W_OutgamePopup_QuickPurchaseItemWidget_C.ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget
// 0x0310 (0x0310 - 0x0000)
struct W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0160(0x0018)()
	bool                                          K2Node_Event_bInIsStockLimited;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InCurrentStock;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InMaxStock;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InRequiredQuantity;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0188(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01B8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0208(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0268(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0280(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0298(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x02E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x02F8(0x0018)()
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget) == 0x000008, "Wrong alignment on W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget) == 0x000310, "Wrong size on W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, EntryPoint) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000058, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000C0, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeArray_Array) == 0x0000D8, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Format_ReturnValue) == 0x000138, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeArray_Array_1) == 0x000150, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Format_ReturnValue_1) == 0x000160, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_Event_bInIsStockLimited) == 0x000178, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_Event_bInIsStockLimited' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_Event_InCurrentStock) == 0x00017C, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_Event_InCurrentStock' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_Event_InMaxStock) == 0x000180, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_Event_InMaxStock' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_Event_InRequiredQuantity) == 0x000184, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_Event_InRequiredQuantity' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000188, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0001A0, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001B8, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData_4) == 0x000208, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeArray_Array_2) == 0x000258, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000268, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Format_ReturnValue_2) == 0x000280, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeStruct_FormatArgumentData_5) == 0x000298, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, K2Node_MakeArray_Array_3) == 0x0002E8, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget, CallFunc_Format_ReturnValue_3) == 0x0002F8, "Member 'W_OutgamePopup_QuickPurchaseItemWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseItemWidget::CallFunc_Format_ReturnValue_3' has a wrong offset!");

}

