#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopup_QuickPurchaseWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"
#include "Game_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C
// 0x0068 (0x06E0 - 0x0678)
class UW_OutgamePopup_QuickPurchaseWidget_C final : public UP2OutgameQuickPurchaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ActionTexture;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ActionTexture;                                 // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnCancel;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnDefault;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_WarningIcon;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Total;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OutgamePopup_QuickPurchaseItemWidget_C* W_OutgamePopup_QuickPurchaseItemWidget;         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OutgamePopup_QuickPurchaseItemWidget_C* W_OutgamePopup_QuickPurchaseItemWidget_1;       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OutgamePopup_QuickPurchaseItemWidget_C* W_OutgamePopup_QuickPurchaseItemWidget_2;       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OutgamePopup_QuickPurchaseItemWidget_C* W_OutgamePopup_QuickPurchaseItemWidget_3;       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EP2QuickPurchasePopupState                    PopupState;                                        // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStockLimited;                                    // 0x06D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetPopupState(EP2QuickPurchasePopupState PopupState_0)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void OnStockLimitedChanged(bool bIsStockLimited)	 // 0xae1e64;
	void OnPopupStateChanged(EP2QuickPurchasePopupState InPopupState)	 // 0xae1e64;
	void ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget(int32 EntryPoint)	 // 0xae1e64;
	void CustomEvent(EPopupButtonID ButtonID)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OutgamePopup_QuickPurchaseWidget_C">();
	}
	static class UW_OutgamePopup_QuickPurchaseWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OutgamePopup_QuickPurchaseWidget_C>();
	}
};
static_assert(alignof(UW_OutgamePopup_QuickPurchaseWidget_C) == 0x000008, "Wrong alignment on UW_OutgamePopup_QuickPurchaseWidget_C");
static_assert(sizeof(UW_OutgamePopup_QuickPurchaseWidget_C) == 0x0006E0, "Wrong size on UW_OutgamePopup_QuickPurchaseWidget_C");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, UberGraphFrame) == 0x000678, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, Bdr_ActionTexture) == 0x000680, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::Bdr_ActionTexture' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, Img_ActionTexture) == 0x000688, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::Img_ActionTexture' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, Img_Divider) == 0x000690, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, SzB_BtnCancel) == 0x000698, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::SzB_BtnCancel' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, SzB_BtnDefault) == 0x0006A0, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::SzB_BtnDefault' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, SzB_WarningIcon) == 0x0006A8, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::SzB_WarningIcon' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, Txt_Total) == 0x0006B0, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::Txt_Total' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, W_OutgamePopup_QuickPurchaseItemWidget) == 0x0006B8, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::W_OutgamePopup_QuickPurchaseItemWidget' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, W_OutgamePopup_QuickPurchaseItemWidget_1) == 0x0006C0, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::W_OutgamePopup_QuickPurchaseItemWidget_1' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, W_OutgamePopup_QuickPurchaseItemWidget_2) == 0x0006C8, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::W_OutgamePopup_QuickPurchaseItemWidget_2' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, W_OutgamePopup_QuickPurchaseItemWidget_3) == 0x0006D0, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::W_OutgamePopup_QuickPurchaseItemWidget_3' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, PopupState) == 0x0006D8, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::PopupState' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopup_QuickPurchaseWidget_C, IsStockLimited) == 0x0006D9, "Member 'UW_OutgamePopup_QuickPurchaseWidget_C::IsStockLimited' has a wrong offset!");

}

