#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgameTutorial_CoreEx

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OutgameTutorial_CoreEx.W_OutgameTutorial_CoreEx_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction");
static_assert(sizeof(W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction");
static_assert(offsetof(W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_OutgameTutorial_CoreEx_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function W_OutgameTutorial_CoreEx.W_OutgameTutorial_CoreEx_C.DestroyWidget
// 0x0018 (0x0018 - 0x0000)
struct W_OutgameTutorial_CoreEx_C_DestroyWidget final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameTutorial_CoreEx_C_DestroyWidget) == 0x000008, "Wrong alignment on W_OutgameTutorial_CoreEx_C_DestroyWidget");
static_assert(sizeof(W_OutgameTutorial_CoreEx_C_DestroyWidget) == 0x000018, "Wrong size on W_OutgameTutorial_CoreEx_C_DestroyWidget");
static_assert(offsetof(W_OutgameTutorial_CoreEx_C_DestroyWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_OutgameTutorial_CoreEx_C_DestroyWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_OutgameTutorial_CoreEx_C_DestroyWidget, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'W_OutgameTutorial_CoreEx_C_DestroyWidget::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function W_OutgameTutorial_CoreEx.W_OutgameTutorial_CoreEx_C.ExecuteUbergraph_W_OutgameTutorial_CoreEx
// 0x0010 (0x0010 - 0x0000)
struct W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx) == 0x000008, "Wrong alignment on W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx");
static_assert(sizeof(W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx) == 0x000010, "Wrong size on W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx");
static_assert(offsetof(W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx, EntryPoint) == 0x000000, "Member 'W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'W_OutgameTutorial_CoreEx_C_ExecuteUbergraph_W_OutgameTutorial_CoreEx::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

