#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgameCommonButtonWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OutgameCommonButtonWidget.W_OutgameCommonButtonWidget_C
// 0x1030 (0x13F0 - 0x03C0)
class UW_OutgameCommonButtonWidget_C final : public UP2CommonButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_ButtonBg;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Stroke;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Underline;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Ovr_Button;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_TextScale;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Button;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonName;                                        // 0x03F8(0x0018)(Edit, BlueprintVisible)
	EPopupButtonID                                ButtonID;                                          // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412[0x2];                                      // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextScale;                                         // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           CancelNoBtnStyle;                                  // 0x0420(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           YesOkBtnStyle;                                     // 0x0810(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           NeutralBtnStyle;                                   // 0x0C00(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DefaultBtnStyle;                                   // 0x0FF0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BtnWidth;                                          // 0x13E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BtnHeight;                                         // 0x13E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveKeyFocus()	 // 0xae1e64;
	void DeActiveKeyFocus()	 // 0xae1e64;
	void ExecuteUbergraph_W_OutgameCommonButtonWidget(int32 EntryPoint)	 // 0xae1e64;
	void Hovered_lementableEvent()	 // 0xae1e64;
	void Init(bool IsEnabled)	 // 0xae1e64;
	void OnSetButtonEnabled_ImplementableEvent(bool InIsEnable)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void UnHovered_lementableEvent()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OutgameCommonButtonWidget_C">();
	}
	static class UW_OutgameCommonButtonWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OutgameCommonButtonWidget_C>();
	}
};
static_assert(alignof(UW_OutgameCommonButtonWidget_C) == 0x000010, "Wrong alignment on UW_OutgameCommonButtonWidget_C");
static_assert(sizeof(UW_OutgameCommonButtonWidget_C) == 0x0013F0, "Wrong size on UW_OutgameCommonButtonWidget_C");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, UberGraphFrame) == 0x0003C0, "Member 'UW_OutgameCommonButtonWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, Bdr_ButtonBg) == 0x0003C8, "Member 'UW_OutgameCommonButtonWidget_C::Bdr_ButtonBg' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, Img_Stroke) == 0x0003D0, "Member 'UW_OutgameCommonButtonWidget_C::Img_Stroke' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, Img_Underline) == 0x0003D8, "Member 'UW_OutgameCommonButtonWidget_C::Img_Underline' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, Ovr_Button) == 0x0003E0, "Member 'UW_OutgameCommonButtonWidget_C::Ovr_Button' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, SclB_TextScale) == 0x0003E8, "Member 'UW_OutgameCommonButtonWidget_C::SclB_TextScale' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, SzB_Button) == 0x0003F0, "Member 'UW_OutgameCommonButtonWidget_C::SzB_Button' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, ButtonName) == 0x0003F8, "Member 'UW_OutgameCommonButtonWidget_C::ButtonName' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, ButtonID) == 0x000410, "Member 'UW_OutgameCommonButtonWidget_C::ButtonID' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, IsDisabled) == 0x000411, "Member 'UW_OutgameCommonButtonWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, TextScale) == 0x000414, "Member 'UW_OutgameCommonButtonWidget_C::TextScale' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, CancelNoBtnStyle) == 0x000420, "Member 'UW_OutgameCommonButtonWidget_C::CancelNoBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, YesOkBtnStyle) == 0x000810, "Member 'UW_OutgameCommonButtonWidget_C::YesOkBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, NeutralBtnStyle) == 0x000C00, "Member 'UW_OutgameCommonButtonWidget_C::NeutralBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, DefaultBtnStyle) == 0x000FF0, "Member 'UW_OutgameCommonButtonWidget_C::DefaultBtnStyle' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, BtnWidth) == 0x0013E0, "Member 'UW_OutgameCommonButtonWidget_C::BtnWidth' has a wrong offset!");
static_assert(offsetof(UW_OutgameCommonButtonWidget_C, BtnHeight) == 0x0013E4, "Member 'UW_OutgameCommonButtonWidget_C::BtnHeight' has a wrong offset!");

}

