#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopupWidget_CommonUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C
// 0x0058 (0x0618 - 0x05C0)
class UW_OutgamePopupWidget_CommonUI_C final : public UP2CommonPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_BottomLine;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnCancel;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_BtnDefault;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x05E0(0x0018)(Edit, BlueprintVisible)
	class FText                                   BodyText;                                          // 0x05F8(0x0018)(Edit, BlueprintVisible)
	bool                                          SingleButtonPopup;                                 // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveInputAction_Implementable(const class UInputAction* InInputAction, const struct FGameplayTag& InInputTag, const struct FInputActionValue& InputActionValue)	 // 0xae1e64;
	void BP_OnDeactivated()	 // 0xae1e64;
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_OutgamePopupWidget_CommonUI(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetPopup(EPopupStyle PopupStyle, const class FText& Title, const class FText& BodyMessage, const class FText& SubMessage, const TDelegate<void(EPopupButtonID ButtonID)>& PressedDelegate)	 // 0xae1e64;
	void SetPopupStyle(EPopupStyle Selection)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OutgamePopupWidget_CommonUI_C">();
	}
	static class UW_OutgamePopupWidget_CommonUI_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OutgamePopupWidget_CommonUI_C>();
	}
};
static_assert(alignof(UW_OutgamePopupWidget_CommonUI_C) == 0x000008, "Wrong alignment on UW_OutgamePopupWidget_CommonUI_C");
static_assert(sizeof(UW_OutgamePopupWidget_CommonUI_C) == 0x000618, "Wrong size on UW_OutgamePopupWidget_CommonUI_C");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, UberGraphFrame) == 0x0005C0, "Member 'UW_OutgamePopupWidget_CommonUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, Img_BottomLine) == 0x0005C8, "Member 'UW_OutgamePopupWidget_CommonUI_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, SzB_BtnCancel) == 0x0005D0, "Member 'UW_OutgamePopupWidget_CommonUI_C::SzB_BtnCancel' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, SzB_BtnDefault) == 0x0005D8, "Member 'UW_OutgamePopupWidget_CommonUI_C::SzB_BtnDefault' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, TitleText) == 0x0005E0, "Member 'UW_OutgamePopupWidget_CommonUI_C::TitleText' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, BodyText) == 0x0005F8, "Member 'UW_OutgamePopupWidget_CommonUI_C::BodyText' has a wrong offset!");
static_assert(offsetof(UW_OutgamePopupWidget_CommonUI_C, SingleButtonPopup) == 0x000610, "Member 'UW_OutgamePopupWidget_CommonUI_C::SingleButtonPopup' has a wrong offset!");

}

