#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopup_QuickPurchaseWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Hideout_structs.hpp"
#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.SetPopupState
// 0x00A8 (0x00A8 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState final
{
public:
	EP2QuickPurchasePopupState                    PopupState_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0030(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0044(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0058(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x006C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0080(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0094(0x0014)()
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState) == 0x000004, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState) == 0x0000A8, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, PopupState_0) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::PopupState_0' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_2) == 0x000030, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_3) == 0x000044, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_4) == 0x000058, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_5) == 0x00006C, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_6) == 0x000080, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState, K2Node_MakeStruct_SlateColor_7) == 0x000094, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_SetPopupState::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct) == 0x000001, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.OnStockLimitedChanged
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged final
{
public:
	bool                                          bIsStockLimited;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged) == 0x000001, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged) == 0x000001, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged, bIsStockLimited) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_OnStockLimitedChanged::bIsStockLimited' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.OnPopupStateChanged
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged final
{
public:
	EP2QuickPurchasePopupState                    InPopupState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged) == 0x000001, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged) == 0x000001, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged, InPopupState) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_OnPopupStateChanged::InPopupState' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget
// 0x0080 (0x0080 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x002C(0x0014)()
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0048(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2QuickPurchasePopupState                    K2Node_Event_InPopupState;                         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsStockLimited;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget) == 0x000008, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget) == 0x000080, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, EntryPoint) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, CallFunc_TextIsEmpty_ReturnValue) == 0x000004, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_MakeStruct_SlateColor_1) == 0x00002C, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, Temp_bool_Variable) == 0x000040, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, Temp_text_Variable) == 0x000048, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_Select_Default) == 0x000060, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_Event_IsDesignTime) == 0x000078, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_Event_InPopupState) == 0x000079, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_Event_InPopupState' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_CustomEvent_ButtonID) == 0x00007A, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_SwitchEnum_CmpSuccess) == 0x00007B, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget, K2Node_Event_bIsStockLimited) == 0x00007C, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_ExecuteUbergraph_W_OutgamePopup_QuickPurchaseWidget::K2Node_Event_bIsStockLimited' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.CustomEvent
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent) == 0x000001, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent) == 0x000001, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent, ButtonID) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_CustomEvent::ButtonID' has a wrong offset!");

// Function W_OutgamePopup_QuickPurchaseWidget.W_OutgamePopup_QuickPurchaseWidget_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction, CallFunc_GetObjectName_ReturnValue) == 0x000008, "Member 'W_OutgamePopup_QuickPurchaseWidget_C_BP_OnHandleBackAction::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");

}

