#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgamePopupWidget_CommonUI

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.ActiveInputAction_Implementable
// 0x0030 (0x0030 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable final
{
public:
	const class UInputAction*                     InInputAction;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InInputTag;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      InputActionValue;                                  // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable) == 0x000008, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable) == 0x000030, "Wrong size on W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable, InInputAction) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable::InInputAction' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable, InInputTag) == 0x000008, "Member 'W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable::InInputTag' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable, InputActionValue) == 0x000010, "Member 'W_OutgamePopupWidget_CommonUI_C_ActiveInputAction_Implementable::InputActionValue' has a wrong offset!");

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction, CallFunc_GetObjectName_ReturnValue) == 0x000008, "Member 'W_OutgamePopupWidget_CommonUI_C_BP_OnHandleBackAction::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.ExecuteUbergraph_W_OutgamePopupWidget_CommonUI
// 0x0098 (0x0098 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPopupStyle                                   K2Node_Event_PopupStyle;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0008(0x0018)(ConstParm)
	class FText                                   K2Node_Event_BodyMessage;                          // 0x0020(0x0018)(ConstParm)
	class FText                                   K2Node_Event_SubMessage;                           // 0x0038(0x0018)(ConstParm)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_PressedDelegate;                      // 0x0050(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_Event_InInputAction;                        // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InInputTag;                           // 0x0068(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_Event_InputActionValue;                     // 0x0070(0x0020)(ConstParm, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI) == 0x000008, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI) == 0x000098, "Wrong size on W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, EntryPoint) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_PopupStyle) == 0x000005, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_PopupStyle' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_Title) == 0x000008, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_Title' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_BodyMessage) == 0x000020, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_BodyMessage' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_SubMessage) == 0x000038, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_SubMessage' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_PressedDelegate) == 0x000050, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_PressedDelegate' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_InInputAction) == 0x000060, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_InInputAction' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_InInputTag) == 0x000068, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_InInputTag' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, K2Node_Event_InputActionValue) == 0x000070, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::K2Node_Event_InputActionValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'W_OutgamePopupWidget_CommonUI_C_ExecuteUbergraph_W_OutgamePopupWidget_CommonUI::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_PreConstruct) == 0x000001, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_PreConstruct");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_PreConstruct) == 0x000001, "Wrong size on W_OutgamePopupWidget_CommonUI_C_PreConstruct");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.SetPopup
// 0x0060 (0x0060 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_SetPopup final
{
public:
	EPopupStyle                                   PopupStyle;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   BodyMessage;                                       // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   SubMessage;                                        // 0x0038(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TDelegate<void(EPopupButtonID ButtonID)>      PressedDelegate;                                   // 0x0050(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_SetPopup) == 0x000008, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_SetPopup");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_SetPopup) == 0x000060, "Wrong size on W_OutgamePopupWidget_CommonUI_C_SetPopup");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopup, PopupStyle) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopup::PopupStyle' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopup, Title) == 0x000008, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopup::Title' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopup, BodyMessage) == 0x000020, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopup::BodyMessage' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopup, SubMessage) == 0x000038, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopup::SubMessage' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopup, PressedDelegate) == 0x000050, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopup::PressedDelegate' has a wrong offset!");

// Function W_OutgamePopupWidget_CommonUI.W_OutgamePopupWidget_CommonUI_C.SetPopupStyle
// 0x0128 (0x0128 - 0x0000)
struct W_OutgamePopupWidget_CommonUI_C_SetPopupStyle final
{
public:
	EPopupStyle                                   Selection;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0038(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0050(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0068(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0080(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0098(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x00B0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x00C8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_8;            // 0x00E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_9;            // 0x00F8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_10;           // 0x0110(0x0018)()
};
static_assert(alignof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle) == 0x000008, "Wrong alignment on W_OutgamePopupWidget_CommonUI_C_SetPopupStyle");
static_assert(sizeof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle) == 0x000128, "Wrong size on W_OutgamePopupWidget_CommonUI_C_SetPopupStyle");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, Selection) == 0x000000, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::Selection' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue) == 0x000020, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000038, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000050, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000068, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_4) == 0x000080, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000098, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0000B0, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_7) == 0x0000C8, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_8) == 0x0000E0, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_9) == 0x0000F8, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(W_OutgamePopupWidget_CommonUI_C_SetPopupStyle, CallFunc_MakeLiteralText_ReturnValue_10) == 0x000110, "Member 'W_OutgamePopupWidget_CommonUI_C_SetPopupStyle::CallFunc_MakeLiteralText_ReturnValue_10' has a wrong offset!");

}

