#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgameTutorial_CoreEx

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OutgameTutorial_CoreEx.W_OutgameTutorial_CoreEx_C
// 0x0060 (0x0608 - 0x05A8)
class UW_OutgameTutorial_CoreEx_C final : public UP2OutgameTutorialCoreExWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Bdr_Tutorial;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Bracket;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ButtonBG;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DotPattern;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern_Bottom;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Pattern_Top;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Tutorial;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_Keybind;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Button;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Deco;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction()	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void DestroyWidget()	 // 0xae1e64;
	void ExecuteUbergraph_W_OutgameTutorial_CoreEx(int32 EntryPoint)	 // 0xae1e64;
	void OnFadeoutAnimFinish()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_OutgameTutorial_CoreEx_C">();
	}
	static class UW_OutgameTutorial_CoreEx_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_OutgameTutorial_CoreEx_C>();
	}
};
static_assert(alignof(UW_OutgameTutorial_CoreEx_C) == 0x000008, "Wrong alignment on UW_OutgameTutorial_CoreEx_C");
static_assert(sizeof(UW_OutgameTutorial_CoreEx_C) == 0x000608, "Wrong size on UW_OutgameTutorial_CoreEx_C");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, UberGraphFrame) == 0x0005A8, "Member 'UW_OutgameTutorial_CoreEx_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, FadeIn) == 0x0005B0, "Member 'UW_OutgameTutorial_CoreEx_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Bdr_Tutorial) == 0x0005B8, "Member 'UW_OutgameTutorial_CoreEx_C::Bdr_Tutorial' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_Bracket) == 0x0005C0, "Member 'UW_OutgameTutorial_CoreEx_C::Img_Bracket' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_ButtonBG) == 0x0005C8, "Member 'UW_OutgameTutorial_CoreEx_C::Img_ButtonBG' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_DotPattern) == 0x0005D0, "Member 'UW_OutgameTutorial_CoreEx_C::Img_DotPattern' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_Pattern_Bottom) == 0x0005D8, "Member 'UW_OutgameTutorial_CoreEx_C::Img_Pattern_Bottom' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_Pattern_Top) == 0x0005E0, "Member 'UW_OutgameTutorial_CoreEx_C::Img_Pattern_Top' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Img_Tutorial) == 0x0005E8, "Member 'UW_OutgameTutorial_CoreEx_C::Img_Tutorial' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, SzB_Keybind) == 0x0005F0, "Member 'UW_OutgameTutorial_CoreEx_C::SzB_Keybind' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Txt_Button) == 0x0005F8, "Member 'UW_OutgameTutorial_CoreEx_C::Txt_Button' has a wrong offset!");
static_assert(offsetof(UW_OutgameTutorial_CoreEx_C, Txt_Deco) == 0x000600, "Member 'UW_OutgameTutorial_CoreEx_C::Txt_Deco' has a wrong offset!");

}

