#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OutgameItemIconWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_OutgameItemIconWidget.W_OutgameItemIconWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameItemIconWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameItemIconWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_OutgameItemIconWidget_C_PreConstruct");
static_assert(sizeof(W_OutgameItemIconWidget_C_PreConstruct) == 0x000001, "Wrong size on W_OutgameItemIconWidget_C_PreConstruct");
static_assert(offsetof(W_OutgameItemIconWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_OutgameItemIconWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_OutgameItemIconWidget.W_OutgameItemIconWidget_C.OnRequirementsAreMet_Event
// 0x0001 (0x0001 - 0x0000)
struct W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event final
{
public:
	bool                                          bMet;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event) == 0x000001, "Wrong alignment on W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event");
static_assert(sizeof(W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event) == 0x000001, "Wrong size on W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event");
static_assert(offsetof(W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event, bMet) == 0x000000, "Member 'W_OutgameItemIconWidget_C_OnRequirementsAreMet_Event::bMet' has a wrong offset!");

// Function W_OutgameItemIconWidget.W_OutgameItemIconWidget_C.ExecuteUbergraph_W_OutgameItemIconWidget
// 0x0044 (0x0044 - 0x0000)
struct W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
	TDelegate<void(bool bMet)>                    K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bMet;                           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBuyInStore_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget) == 0x000004, "Wrong alignment on W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget");
static_assert(sizeof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget) == 0x000044, "Wrong size on W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, EntryPoint) == 0x000000, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, K2Node_CustomEvent_bMet) == 0x000040, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::K2Node_CustomEvent_bMet' has a wrong offset!");
static_assert(offsetof(W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget, CallFunc_CanBuyInStore_ReturnValue) == 0x000041, "Member 'W_OutgameItemIconWidget_C_ExecuteUbergraph_W_OutgameItemIconWidget::CallFunc_CanBuyInStore_ReturnValue' has a wrong offset!");

}

