#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PaginationList

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PaginationList.W_PaginationList_C
// 0x0018 (0x0298 - 0x0280)
class UW_PaginationList_C final : public UUserWidget
{
public:
	class W_PaginationItem::UW_PaginationItem_C*  W_PaginationItem;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class W_PaginationItem::UW_PaginationItem_C*  W_PaginationItem_1;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class W_PaginationItem::UW_PaginationItem_C*  W_PaginationItem_2;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PaginationList_C">();
	}
	static class UW_PaginationList_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PaginationList_C>();
	}
};
static_assert(alignof(UW_PaginationList_C) == 0x000008, "Wrong alignment on UW_PaginationList_C");
static_assert(sizeof(UW_PaginationList_C) == 0x000298, "Wrong size on UW_PaginationList_C");
static_assert(offsetof(UW_PaginationList_C, W_PaginationItem) == 0x000280, "Member 'UW_PaginationList_C::W_PaginationItem' has a wrong offset!");
static_assert(offsetof(UW_PaginationList_C, W_PaginationItem_1) == 0x000288, "Member 'UW_PaginationList_C::W_PaginationItem_1' has a wrong offset!");
static_assert(offsetof(UW_PaginationList_C, W_PaginationItem_2) == 0x000290, "Member 'UW_PaginationList_C::W_PaginationItem_2' has a wrong offset!");

}

