#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Plsd

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_Plsd.W_Plsd_C.BP_OnUpdatePLSDTab
// 0x0001 (0x0001 - 0x0000)
struct W_Plsd_C_BP_OnUpdatePLSDTab final
{
public:
	EP2PlsdTab                                    InPlsdTab;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Plsd_C_BP_OnUpdatePLSDTab) == 0x000001, "Wrong alignment on W_Plsd_C_BP_OnUpdatePLSDTab");
static_assert(sizeof(W_Plsd_C_BP_OnUpdatePLSDTab) == 0x000001, "Wrong size on W_Plsd_C_BP_OnUpdatePLSDTab");
static_assert(offsetof(W_Plsd_C_BP_OnUpdatePLSDTab, InPlsdTab) == 0x000000, "Member 'W_Plsd_C_BP_OnUpdatePLSDTab::InPlsdTab' has a wrong offset!");

// Function W_Plsd.W_Plsd_C.ExecuteUbergraph_W_Plsd
// 0x0008 (0x0008 - 0x0000)
struct W_Plsd_C_ExecuteUbergraph_W_Plsd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2PlsdTab                                    K2Node_Event_InPlsdTab;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Plsd_C_ExecuteUbergraph_W_Plsd) == 0x000004, "Wrong alignment on W_Plsd_C_ExecuteUbergraph_W_Plsd");
static_assert(sizeof(W_Plsd_C_ExecuteUbergraph_W_Plsd) == 0x000008, "Wrong size on W_Plsd_C_ExecuteUbergraph_W_Plsd");
static_assert(offsetof(W_Plsd_C_ExecuteUbergraph_W_Plsd, EntryPoint) == 0x000000, "Member 'W_Plsd_C_ExecuteUbergraph_W_Plsd::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Plsd_C_ExecuteUbergraph_W_Plsd, K2Node_Event_InPlsdTab) == 0x000004, "Member 'W_Plsd_C_ExecuteUbergraph_W_Plsd::K2Node_Event_InPlsdTab' has a wrong offset!");
static_assert(offsetof(W_Plsd_C_ExecuteUbergraph_W_Plsd, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'W_Plsd_C_ExecuteUbergraph_W_Plsd::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

