#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Plsd_Contract_ObjectiveWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Plsd_Contract_ObjectiveWidget.W_Plsd_Contract_ObjectiveWidget_C.ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget
// 0x0018 (0x0018 - 0x0000)
struct W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UP2ContractRequirement*           K2Node_Event_InRequirement;                        // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsCompleted;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBeVisibleUI_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget) == 0x000008, "Wrong alignment on W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget");
static_assert(sizeof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget) == 0x000018, "Wrong size on W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget, EntryPoint) == 0x000000, "Member 'W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget, K2Node_Event_InRequirement) == 0x000008, "Member 'W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget::K2Node_Event_InRequirement' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget, K2Node_Event_IsCompleted) == 0x000010, "Member 'W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget::K2Node_Event_IsCompleted' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget, CallFunc_ShouldBeVisibleUI_ReturnValue) == 0x000011, "Member 'W_Plsd_Contract_ObjectiveWidget_C_ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget::CallFunc_ShouldBeVisibleUI_ReturnValue' has a wrong offset!");

// Function W_Plsd_Contract_ObjectiveWidget.W_Plsd_Contract_ObjectiveWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Plsd_Contract_ObjectiveWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Plsd_Contract_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Plsd_Contract_ObjectiveWidget_C_PreConstruct");
static_assert(sizeof(W_Plsd_Contract_ObjectiveWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Plsd_Contract_ObjectiveWidget_C_PreConstruct");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Plsd_Contract_ObjectiveWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Plsd_Contract_ObjectiveWidget.W_Plsd_Contract_ObjectiveWidget_C.RefreshWidget_BP
// 0x0010 (0x0010 - 0x0000)
struct W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP final
{
public:
	const class UP2ContractRequirement*           InRequirement;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCompleted;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP) == 0x000008, "Wrong alignment on W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP");
static_assert(sizeof(W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP) == 0x000010, "Wrong size on W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP, InRequirement) == 0x000000, "Member 'W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP::InRequirement' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP, IsCompleted) == 0x000008, "Member 'W_Plsd_Contract_ObjectiveWidget_C_RefreshWidget_BP::IsCompleted' has a wrong offset!");

// Function W_Plsd_Contract_ObjectiveWidget.W_Plsd_Contract_ObjectiveWidget_C.SetCompleteState
// 0x0054 (0x0054 - 0x0000)
struct W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState final
{
public:
	bool                                          IsComplete_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
};
static_assert(alignof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState) == 0x000004, "Wrong alignment on W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState");
static_assert(sizeof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState) == 0x000054, "Wrong size on W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState, IsComplete_0) == 0x000000, "Member 'W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState::IsComplete_0' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'W_Plsd_Contract_ObjectiveWidget_C_SetCompleteState::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

