#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerStatWidget.W_PlayerStatWidget_C.ExecuteUbergraph_W_PlayerStatWidget
// 0x01F8 (0x01F8 - 0x0000)
struct W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InLevel;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InExperience;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InMaxExperience;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B0(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0140(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0018)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetExperience_InExperience_ImplicitCast;  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetExperience_InMaxExperience_ImplicitCast; // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget) == 0x000008, "Wrong alignment on W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget");
static_assert(sizeof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget) == 0x0001F8, "Wrong size on W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, EntryPoint) == 0x000000, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_Event_IsDesignTime) == 0x000010, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_Event_InLevel) == 0x000014, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_Event_InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_Event_InExperience) == 0x000018, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_Event_InExperience' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_Event_InMaxExperience) == 0x00001C, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_Event_InMaxExperience' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000020, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_MakeArray_Array) == 0x000080, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_FTrunc_ReturnValue) == 0x000090, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Format_ReturnValue) == 0x000098, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x0000B0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000C8, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_FTrunc_ReturnValue_1) == 0x000120, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000128, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_MakeStruct_FormatArgumentData_2) == 0x000140, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000190, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, K2Node_MakeArray_Array_1) == 0x000198, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_SafeDivide_ReturnValue) == 0x0001A8, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x0001C8, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_SetExperience_InExperience_ImplicitCast) == 0x0001D0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_SetExperience_InExperience_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_FTrunc_A_ImplicitCast) == 0x0001D8, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_FTrunc_A_ImplicitCast_1) == 0x0001E0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0001E8, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0001F0, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget, CallFunc_SetExperience_InMaxExperience_ImplicitCast) == 0x0001F4, "Member 'W_PlayerStatWidget_C_ExecuteUbergraph_W_PlayerStatWidget::CallFunc_SetExperience_InMaxExperience_ImplicitCast' has a wrong offset!");

// Function W_PlayerStatWidget.W_PlayerStatWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStatWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStatWidget_C_PreConstruct");
static_assert(sizeof(W_PlayerStatWidget_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStatWidget_C_PreConstruct");
static_assert(offsetof(W_PlayerStatWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStatWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlayerStatWidget.W_PlayerStatWidget_C.SetExperience
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerStatWidget_C_SetExperience final
{
public:
	float                                         InExperience;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxExperience;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatWidget_C_SetExperience) == 0x000004, "Wrong alignment on W_PlayerStatWidget_C_SetExperience");
static_assert(sizeof(W_PlayerStatWidget_C_SetExperience) == 0x000008, "Wrong size on W_PlayerStatWidget_C_SetExperience");
static_assert(offsetof(W_PlayerStatWidget_C_SetExperience, InExperience) == 0x000000, "Member 'W_PlayerStatWidget_C_SetExperience::InExperience' has a wrong offset!");
static_assert(offsetof(W_PlayerStatWidget_C_SetExperience, InMaxExperience) == 0x000004, "Member 'W_PlayerStatWidget_C_SetExperience::InMaxExperience' has a wrong offset!");

// Function W_PlayerStatWidget.W_PlayerStatWidget_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct W_PlayerStatWidget_C_SetLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatWidget_C_SetLevel) == 0x000004, "Wrong alignment on W_PlayerStatWidget_C_SetLevel");
static_assert(sizeof(W_PlayerStatWidget_C_SetLevel) == 0x000004, "Wrong size on W_PlayerStatWidget_C_SetLevel");
static_assert(offsetof(W_PlayerStatWidget_C_SetLevel, InLevel) == 0x000000, "Member 'W_PlayerStatWidget_C_SetLevel::InLevel' has a wrong offset!");

}

