#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStatGroup

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_PlayerStatGroup.W_PlayerStatGroup_C.ExecuteUbergraph_W_PlayerStatGroup
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup) == 0x000004, "Wrong alignment on W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup");
static_assert(sizeof(W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup) == 0x000008, "Wrong size on W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup");
static_assert(offsetof(W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup, EntryPoint) == 0x000000, "Member 'W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_PlayerStatGroup_C_ExecuteUbergraph_W_PlayerStatGroup::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_PlayerStatGroup.W_PlayerStatGroup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStatGroup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatGroup_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStatGroup_C_PreConstruct");
static_assert(sizeof(W_PlayerStatGroup_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStatGroup_C_PreConstruct");
static_assert(offsetof(W_PlayerStatGroup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStatGroup_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

