#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerLevelWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerLevelWidget.W_PlayerLevelWidget_C.ExecuteUbergraph_W_PlayerLevelWidget
// 0x0060 (0x0060 - 0x0000)
struct W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InLevel;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_LevelPercent;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
};
static_assert(alignof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget) == 0x000008, "Wrong alignment on W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget");
static_assert(sizeof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget) == 0x000060, "Wrong size on W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, EntryPoint) == 0x000000, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, K2Node_Event_InLevel) == 0x000040, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::K2Node_Event_InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, K2Node_Event_LevelPercent) == 0x000044, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::K2Node_Event_LevelPercent' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'W_PlayerLevelWidget_C_ExecuteUbergraph_W_PlayerLevelWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function W_PlayerLevelWidget.W_PlayerLevelWidget_C.RefreshPlayerLevelWidgetOnBP
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LevelPercent;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP) == 0x000004, "Wrong alignment on W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP");
static_assert(sizeof(W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP) == 0x000008, "Wrong size on W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP");
static_assert(offsetof(W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP, InLevel) == 0x000000, "Member 'W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP::InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP, LevelPercent) == 0x000004, "Member 'W_PlayerLevelWidget_C_RefreshPlayerLevelWidgetOnBP::LevelPercent' has a wrong offset!");

// Function W_PlayerLevelWidget.W_PlayerLevelWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_PlayerLevelWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevelWidget_C_Tick) == 0x000004, "Wrong alignment on W_PlayerLevelWidget_C_Tick");
static_assert(sizeof(W_PlayerLevelWidget_C_Tick) == 0x00003C, "Wrong size on W_PlayerLevelWidget_C_Tick");
static_assert(offsetof(W_PlayerLevelWidget_C_Tick, MyGeometry) == 0x000000, "Member 'W_PlayerLevelWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_PlayerLevelWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'W_PlayerLevelWidget_C_Tick::InDeltaTime' has a wrong offset!");

}

