#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStat_DetailsBuffEffect_Module

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerStat_DetailsBuffEffect_Module.W_PlayerStat_DetailsBuffEffect_Module_C.ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module
// 0x0068 (0x0068 - 0x0000)
struct W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0040(0x0014)()
	float                                         K2Node_Event_InValue;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module) == 0x000008, "Wrong alignment on W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module");
static_assert(sizeof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module) == 0x000068, "Wrong size on W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, EntryPoint) == 0x000000, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_MakeStruct_SlateColor_1) == 0x000018, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_MakeStruct_SlateColor_2) == 0x00002C, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_MakeStruct_SlateColor_3) == 0x000040, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_Event_InValue) == 0x000054, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, K2Node_Event_IsDesignTime) == 0x000058, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000059, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_ExecuteUbergraph_W_PlayerStat_DetailsBuffEffect_Module::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_PlayerStat_DetailsBuffEffect_Module.W_PlayerStat_DetailsBuffEffect_Module_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct");
static_assert(sizeof(W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlayerStat_DetailsBuffEffect_Module.W_PlayerStat_DetailsBuffEffect_Module_C.SetActiveEffectColor_Implementation
// 0x0004 (0x0004 - 0x0000)
struct W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation) == 0x000004, "Wrong alignment on W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation");
static_assert(sizeof(W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation) == 0x000004, "Wrong size on W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation");
static_assert(offsetof(W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation, InValue) == 0x000000, "Member 'W_PlayerStat_DetailsBuffEffect_Module_C_SetActiveEffectColor_Implementation::InValue' has a wrong offset!");

}

