#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStat_DetailsTooltipWidget

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerStat_DetailsTooltipWidget.W_PlayerStat_DetailsTooltipWidget_C.ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget
// 0x0178 (0x0178 - 0x0000)
struct W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InLevel;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMaxLevel;                          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0090(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_GetSkillTag_ReturnValue;                  // 0x0120(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0128(0x0018)()
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetSkillTag_ReturnValue_1;                // 0x0144(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0150(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0164(0x0014)()
};
static_assert(alignof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget) == 0x000008, "Wrong alignment on W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget");
static_assert(sizeof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget) == 0x000178, "Wrong size on W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, EntryPoint) == 0x000000, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_Event_InLevel) == 0x000008, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_Event_InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_Event_bIsMaxLevel) == 0x00000C, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_Event_bIsMaxLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000D, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000014, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeArray_Array) == 0x000080, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000090, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeArray_Array_1) == 0x000110, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_GetSkillTag_ReturnValue) == 0x000120, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_GetSkillTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_Format_ReturnValue_1) == 0x000128, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_MatchesTag_ReturnValue) == 0x000140, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_GetSkillTag_ReturnValue_1) == 0x000144, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_GetSkillTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, CallFunc_MatchesTag_ReturnValue_1) == 0x00014C, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeStruct_SlateColor) == 0x000150, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget, K2Node_MakeStruct_SlateColor_1) == 0x000164, "Member 'W_PlayerStat_DetailsTooltipWidget_C_ExecuteUbergraph_W_PlayerStat_DetailsTooltipWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_PlayerStat_DetailsTooltipWidget.W_PlayerStat_DetailsTooltipWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStat_DetailsTooltipWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_DetailsTooltipWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStat_DetailsTooltipWidget_C_PreConstruct");
static_assert(sizeof(W_PlayerStat_DetailsTooltipWidget_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStat_DetailsTooltipWidget_C_PreConstruct");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStat_DetailsTooltipWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlayerStat_DetailsTooltipWidget.W_PlayerStat_DetailsTooltipWidget_C.SetLevel
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerStat_DetailsTooltipWidget_C_SetLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsMaxLevel;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_DetailsTooltipWidget_C_SetLevel) == 0x000004, "Wrong alignment on W_PlayerStat_DetailsTooltipWidget_C_SetLevel");
static_assert(sizeof(W_PlayerStat_DetailsTooltipWidget_C_SetLevel) == 0x000008, "Wrong size on W_PlayerStat_DetailsTooltipWidget_C_SetLevel");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_SetLevel, InLevel) == 0x000000, "Member 'W_PlayerStat_DetailsTooltipWidget_C_SetLevel::InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_DetailsTooltipWidget_C_SetLevel, bIsMaxLevel) == 0x000004, "Member 'W_PlayerStat_DetailsTooltipWidget_C_SetLevel::bIsMaxLevel' has a wrong offset!");

}

