#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerClothingBuffWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerClothingBuffWidget.W_PlayerClothingBuffWidget_C
// 0x0040 (0x02F8 - 0x02B8)
class UW_PlayerClothingBuffWidget_C final : public UP2PlayerBuffWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_PlayerStatBg;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PlayerStatOutline;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             StatIcon;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StatLevel;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerClothingBuffWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetLevel(int32 InLevel)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerClothingBuffWidget_C">();
	}
	static class UW_PlayerClothingBuffWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerClothingBuffWidget_C>();
	}
};
static_assert(alignof(UW_PlayerClothingBuffWidget_C) == 0x000008, "Wrong alignment on UW_PlayerClothingBuffWidget_C");
static_assert(sizeof(UW_PlayerClothingBuffWidget_C) == 0x0002F8, "Wrong size on UW_PlayerClothingBuffWidget_C");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UW_PlayerClothingBuffWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, Bdr_PlayerStatBg) == 0x0002C0, "Member 'UW_PlayerClothingBuffWidget_C::Bdr_PlayerStatBg' has a wrong offset!");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, Bdr_PlayerStatOutline) == 0x0002C8, "Member 'UW_PlayerClothingBuffWidget_C::Bdr_PlayerStatOutline' has a wrong offset!");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, StatIcon) == 0x0002D0, "Member 'UW_PlayerClothingBuffWidget_C::StatIcon' has a wrong offset!");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, StatName) == 0x0002D8, "Member 'UW_PlayerClothingBuffWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(UW_PlayerClothingBuffWidget_C, StatLevel) == 0x0002F0, "Member 'UW_PlayerClothingBuffWidget_C::StatLevel' has a wrong offset!");

}

