#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerOverview

#include "Basic.hpp"

#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerOverview.W_PlayerOverview_C
// 0x0068 (0x06E8 - 0x0680)
class UW_PlayerOverview_C final : public UP2PlayerOverviewWidget
{
public:
	class UImage*                                 img_line;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line_1;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line2;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line2_1;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line3;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 img_line3_1;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect;                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_1;                           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_2;                           // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_3;                           // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_4;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_5;                           // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BuffProfile_Effect_C*                W_BuffFacility_Effect_6;                           // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerOverview_C">();
	}
	static class UW_PlayerOverview_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerOverview_C>();
	}
};
static_assert(alignof(UW_PlayerOverview_C) == 0x000008, "Wrong alignment on UW_PlayerOverview_C");
static_assert(sizeof(UW_PlayerOverview_C) == 0x0006E8, "Wrong size on UW_PlayerOverview_C");
static_assert(offsetof(UW_PlayerOverview_C, img_line) == 0x000680, "Member 'UW_PlayerOverview_C::img_line' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, img_line_1) == 0x000688, "Member 'UW_PlayerOverview_C::img_line_1' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, img_line2) == 0x000690, "Member 'UW_PlayerOverview_C::img_line2' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, img_line2_1) == 0x000698, "Member 'UW_PlayerOverview_C::img_line2_1' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, img_line3) == 0x0006A0, "Member 'UW_PlayerOverview_C::img_line3' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, img_line3_1) == 0x0006A8, "Member 'UW_PlayerOverview_C::img_line3_1' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect) == 0x0006B0, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_1) == 0x0006B8, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_1' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_2) == 0x0006C0, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_2' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_3) == 0x0006C8, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_3' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_4) == 0x0006D0, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_4' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_5) == 0x0006D8, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_5' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_C, W_BuffFacility_Effect_6) == 0x0006E0, "Member 'UW_PlayerOverview_C::W_BuffFacility_Effect_6' has a wrong offset!");

}

