#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerBuffGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerBuffGroup.W_PlayerBuffGroup_C
// 0x0038 (0x02E0 - 0x02A8)
class UW_PlayerBuffGroup_C final : public UP2PlayerBuffGroupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_BuffGroup;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerBuffGroupTitle;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerBuffGroupName;                               // 0x02C0(0x0018)(Edit, BlueprintVisible)
	float                                         GroupWidth;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerBuffGroup(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerBuffGroup_C">();
	}
	static class UW_PlayerBuffGroup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerBuffGroup_C>();
	}
};
static_assert(alignof(UW_PlayerBuffGroup_C) == 0x000008, "Wrong alignment on UW_PlayerBuffGroup_C");
static_assert(sizeof(UW_PlayerBuffGroup_C) == 0x0002E0, "Wrong size on UW_PlayerBuffGroup_C");
static_assert(offsetof(UW_PlayerBuffGroup_C, UberGraphFrame) == 0x0002A8, "Member 'UW_PlayerBuffGroup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffGroup_C, SzB_BuffGroup) == 0x0002B0, "Member 'UW_PlayerBuffGroup_C::SzB_BuffGroup' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffGroup_C, Txt_PlayerBuffGroupTitle) == 0x0002B8, "Member 'UW_PlayerBuffGroup_C::Txt_PlayerBuffGroupTitle' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffGroup_C, PlayerBuffGroupName) == 0x0002C0, "Member 'UW_PlayerBuffGroup_C::PlayerBuffGroupName' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffGroup_C, GroupWidth) == 0x0002D8, "Member 'UW_PlayerBuffGroup_C::GroupWidth' has a wrong offset!");

}

