#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlsdCommonButtonWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_PlsdCommonButtonWidget.W_PlsdCommonButtonWidget_C.ExecuteUbergraph_W_PlsdCommonButtonWidget
// 0x000C (0x000C - 0x0000)
struct W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget) == 0x000004, "Wrong alignment on W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget");
static_assert(sizeof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget) == 0x00000C, "Wrong size on W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget, EntryPoint) == 0x000000, "Member 'W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000008, "Member 'W_PlsdCommonButtonWidget_C_ExecuteUbergraph_W_PlsdCommonButtonWidget::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function W_PlsdCommonButtonWidget.W_PlsdCommonButtonWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlsdCommonButtonWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlsdCommonButtonWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlsdCommonButtonWidget_C_PreConstruct");
static_assert(sizeof(W_PlsdCommonButtonWidget_C_PreConstruct) == 0x000001, "Wrong size on W_PlsdCommonButtonWidget_C_PreConstruct");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlsdCommonButtonWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlsdCommonButtonWidget.W_PlsdCommonButtonWidget_C.SetButtonStyle
// 0x0002 (0x0002 - 0x0000)
struct W_PlsdCommonButtonWidget_C_SetButtonStyle final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlsdCommonButtonWidget_C_SetButtonStyle) == 0x000001, "Wrong alignment on W_PlsdCommonButtonWidget_C_SetButtonStyle");
static_assert(sizeof(W_PlsdCommonButtonWidget_C_SetButtonStyle) == 0x000002, "Wrong size on W_PlsdCommonButtonWidget_C_SetButtonStyle");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_SetButtonStyle, IsEnabled) == 0x000000, "Member 'W_PlsdCommonButtonWidget_C_SetButtonStyle::IsEnabled' has a wrong offset!");
static_assert(offsetof(W_PlsdCommonButtonWidget_C_SetButtonStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'W_PlsdCommonButtonWidget_C_SetButtonStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

