#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStat_Tooltip_BallisticProtection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerStat_Tooltip_BallisticProtection.W_PlayerStat_Tooltip_BallisticProtection_C
// 0x0018 (0x0300 - 0x02E8)
class UW_PlayerStat_Tooltip_BallisticProtection_C final : public UP2BallisticProtectionTooltipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_NoArmor;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WS_BallisticProtection;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection(int32 EntryPoint)	 // 0xae1e64;
	void UpdateWidgetDesign(bool bNoArmor)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerStat_Tooltip_BallisticProtection_C">();
	}
	static class UW_PlayerStat_Tooltip_BallisticProtection_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerStat_Tooltip_BallisticProtection_C>();
	}
};
static_assert(alignof(UW_PlayerStat_Tooltip_BallisticProtection_C) == 0x000008, "Wrong alignment on UW_PlayerStat_Tooltip_BallisticProtection_C");
static_assert(sizeof(UW_PlayerStat_Tooltip_BallisticProtection_C) == 0x000300, "Wrong size on UW_PlayerStat_Tooltip_BallisticProtection_C");
static_assert(offsetof(UW_PlayerStat_Tooltip_BallisticProtection_C, UberGraphFrame) == 0x0002E8, "Member 'UW_PlayerStat_Tooltip_BallisticProtection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerStat_Tooltip_BallisticProtection_C, Txt_NoArmor) == 0x0002F0, "Member 'UW_PlayerStat_Tooltip_BallisticProtection_C::Txt_NoArmor' has a wrong offset!");
static_assert(offsetof(UW_PlayerStat_Tooltip_BallisticProtection_C, WS_BallisticProtection) == 0x0002F8, "Member 'UW_PlayerStat_Tooltip_BallisticProtection_C::WS_BallisticProtection' has a wrong offset!");

}

