#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStat_Tooltip_BallisticProtection

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_PlayerStat_Tooltip_BallisticProtection.W_PlayerStat_Tooltip_BallisticProtection_C.ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNoArmor;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection) == 0x000004, "Wrong alignment on W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection");
static_assert(sizeof(W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection) == 0x000008, "Wrong size on W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection");
static_assert(offsetof(W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection, EntryPoint) == 0x000000, "Member 'W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection, K2Node_Event_bNoArmor) == 0x000004, "Member 'W_PlayerStat_Tooltip_BallisticProtection_C_ExecuteUbergraph_W_PlayerStat_Tooltip_BallisticProtection::K2Node_Event_bNoArmor' has a wrong offset!");

// Function W_PlayerStat_Tooltip_BallisticProtection.W_PlayerStat_Tooltip_BallisticProtection_C.UpdateWidgetDesign
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign final
{
public:
	bool                                          bNoArmor;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign) == 0x000001, "Wrong alignment on W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign");
static_assert(sizeof(W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign) == 0x000001, "Wrong size on W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign");
static_assert(offsetof(W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign, bNoArmor) == 0x000000, "Member 'W_PlayerStat_Tooltip_BallisticProtection_C_UpdateWidgetDesign::bNoArmor' has a wrong offset!");

}

