#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerLevel_LevelUp

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerLevel_LevelUp.W_PlayerLevel_LevelUp_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_PlayerLevel_LevelUp_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevel_LevelUp_C_Tick) == 0x000004, "Wrong alignment on W_PlayerLevel_LevelUp_C_Tick");
static_assert(sizeof(W_PlayerLevel_LevelUp_C_Tick) == 0x00003C, "Wrong size on W_PlayerLevel_LevelUp_C_Tick");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Tick, MyGeometry) == 0x000000, "Member 'W_PlayerLevel_LevelUp_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Tick, InDeltaTime) == 0x000038, "Member 'W_PlayerLevel_LevelUp_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_PlayerLevel_LevelUp.W_PlayerLevel_LevelUp_C.Set Level Text
// 0x0040 (0x0040 - 0x0000)
struct W_PlayerLevel_LevelUp_C_Set_Level_Text final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
};
static_assert(alignof(W_PlayerLevel_LevelUp_C_Set_Level_Text) == 0x000008, "Wrong alignment on W_PlayerLevel_LevelUp_C_Set_Level_Text");
static_assert(sizeof(W_PlayerLevel_LevelUp_C_Set_Level_Text) == 0x000040, "Wrong size on W_PlayerLevel_LevelUp_C_Set_Level_Text");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Set_Level_Text, InLevel) == 0x000000, "Member 'W_PlayerLevel_LevelUp_C_Set_Level_Text::InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Set_Level_Text, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'W_PlayerLevel_LevelUp_C_Set_Level_Text::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Set_Level_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'W_PlayerLevel_LevelUp_C_Set_Level_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Set_Level_Text, CallFunc_Clamp_ReturnValue) == 0x000020, "Member 'W_PlayerLevel_LevelUp_C_Set_Level_Text::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Set_Level_Text, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'W_PlayerLevel_LevelUp_C_Set_Level_Text::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function W_PlayerLevel_LevelUp.W_PlayerLevel_LevelUp_C.PlayLevelUpAnimation
// 0x0004 (0x0004 - 0x0000)
struct W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation final
{
public:
	float                                         InDelay;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation) == 0x000004, "Wrong alignment on W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation");
static_assert(sizeof(W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation) == 0x000004, "Wrong size on W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation, InDelay) == 0x000000, "Member 'W_PlayerLevel_LevelUp_C_PlayLevelUpAnimation::InDelay' has a wrong offset!");

// Function W_PlayerLevel_LevelUp.W_PlayerLevel_LevelUp_C.ExecuteUbergraph_W_PlayerLevel_LevelUp
// 0x00C0 (0x00C0 - 0x0000)
struct W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDelay;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Level)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2LevelChanged_AsyncAction*            CallFunc_ListenLevelChangedEvent_ReturnValue;      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp) == 0x000008, "Wrong alignment on W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp");
static_assert(sizeof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp) == 0x0000C0, "Wrong size on W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, EntryPoint) == 0x000000, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_Event_InDelay) == 0x000004, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_Event_InDelay' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_CustomEvent_Level) == 0x000008, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, Temp_int_Variable) == 0x00001C, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_Clamp_ReturnValue) == 0x000034, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_Event_MyGeometry) == 0x000038, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, K2Node_Event_InDeltaTime) == 0x000070, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000078, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_ListenLevelChangedEvent_ReturnValue) == 0x000080, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_ListenLevelChangedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000A0, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0000A8, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0000B0, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'W_PlayerLevel_LevelUp_C_ExecuteUbergraph_W_PlayerLevel_LevelUp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_PlayerLevel_LevelUp.W_PlayerLevel_LevelUp_C.Completed_6D6D893E4F8E41D9B2B0B78296928384
// 0x0004 (0x0004 - 0x0000)
struct W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384 final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384) == 0x000004, "Wrong alignment on W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384");
static_assert(sizeof(W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384) == 0x000004, "Wrong size on W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384");
static_assert(offsetof(W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384, Level) == 0x000000, "Member 'W_PlayerLevel_LevelUp_C_Completed_6D6D893E4F8E41D9B2B0B78296928384::Level' has a wrong offset!");

}

