#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStats

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerStats.W_PlayerStats_C.ExecuteUbergraph_W_PlayerStats
// 0x0080 (0x0080 - 0x0000)
struct W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x001C(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UP2RadioButton*>                 CallFunc_GetAllRadioButtons_ReturnValue;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UP2RadioButton*                         CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats) == 0x000008, "Wrong alignment on W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats");
static_assert(sizeof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats) == 0x000080, "Wrong size on W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, EntryPoint) == 0x000000, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, Temp_string_Variable) == 0x000008, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, K2Node_MakeStruct_SlateChildSize) == 0x00001C, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, Temp_int_Array_Index_Variable) == 0x000034, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, Temp_string_Variable_1) == 0x000038, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, K2Node_Event_IsDesignTime) == 0x000048, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_GetAllRadioButtons_ReturnValue) == 0x000050, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_GetAllRadioButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_Array_Get_Item) == 0x000060, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000070, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'W_PlayerStats_C_ExecuteUbergraph_W_PlayerStats::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_PlayerStats.W_PlayerStats_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStats_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStats_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStats_C_PreConstruct");
static_assert(sizeof(W_PlayerStats_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStats_C_PreConstruct");
static_assert(offsetof(W_PlayerStats_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStats_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

