#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStatTooltip_Source

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerStatTooltip_Source.W_PlayerStatTooltip_Source_C
// 0x0028 (0x02C0 - 0x0298)
class UW_PlayerStatTooltip_Source_C final : public UP2AttributeSourceTextWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   BuffEffectName;                                    // 0x02A0(0x0018)(Edit, BlueprintVisible)
	double                                        BuffEffectValue;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerStatTooltip_Source(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetDeltaColor_Implementation(float InValue, EP2GameplayAttributeDesirableChange InDesirableChange)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerStatTooltip_Source_C">();
	}
	static class UW_PlayerStatTooltip_Source_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerStatTooltip_Source_C>();
	}
};
static_assert(alignof(UW_PlayerStatTooltip_Source_C) == 0x000008, "Wrong alignment on UW_PlayerStatTooltip_Source_C");
static_assert(sizeof(UW_PlayerStatTooltip_Source_C) == 0x0002C0, "Wrong size on UW_PlayerStatTooltip_Source_C");
static_assert(offsetof(UW_PlayerStatTooltip_Source_C, UberGraphFrame) == 0x000298, "Member 'UW_PlayerStatTooltip_Source_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatTooltip_Source_C, BuffEffectName) == 0x0002A0, "Member 'UW_PlayerStatTooltip_Source_C::BuffEffectName' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatTooltip_Source_C, BuffEffectValue) == 0x0002B8, "Member 'UW_PlayerStatTooltip_Source_C::BuffEffectValue' has a wrong offset!");

}

