#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerOverview_LogItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerOverview_LogItem.W_PlayerOverview_LogItem_C
// 0x0058 (0x02E8 - 0x0290)
class UW_PlayerOverview_LogItem_C final : public UP2PlayerOverviewLogItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_Arrow;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_RaidReportItem;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_NextLogValue;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultLogName;                                    // 0x02B0(0x0018)(Edit, BlueprintVisible)
	class FText                                   DefaultLogValue;                                   // 0x02C8(0x0018)(Edit, BlueprintVisible)
	bool                                          IsEmpty;                                           // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDetailsBtn;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_PlayerOverview_LogItem(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetLogValueInt(int32 NewVal)	 // 0xae1e64;
	void SetLogValueLevel(int32 InBaseLevel, int32 InFinalLevel)	 // 0xae1e64;
	void SetLogValueText(const class FText& NewTxt)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerOverview_LogItem_C">();
	}
	static class UW_PlayerOverview_LogItem_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerOverview_LogItem_C>();
	}
};
static_assert(alignof(UW_PlayerOverview_LogItem_C) == 0x000008, "Wrong alignment on UW_PlayerOverview_LogItem_C");
static_assert(sizeof(UW_PlayerOverview_LogItem_C) == 0x0002E8, "Wrong size on UW_PlayerOverview_LogItem_C");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, UberGraphFrame) == 0x000290, "Member 'UW_PlayerOverview_LogItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, SzB_Arrow) == 0x000298, "Member 'UW_PlayerOverview_LogItem_C::SzB_Arrow' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, SzB_RaidReportItem) == 0x0002A0, "Member 'UW_PlayerOverview_LogItem_C::SzB_RaidReportItem' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, Txt_NextLogValue) == 0x0002A8, "Member 'UW_PlayerOverview_LogItem_C::Txt_NextLogValue' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, DefaultLogName) == 0x0002B0, "Member 'UW_PlayerOverview_LogItem_C::DefaultLogName' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, DefaultLogValue) == 0x0002C8, "Member 'UW_PlayerOverview_LogItem_C::DefaultLogValue' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, IsEmpty) == 0x0002E0, "Member 'UW_PlayerOverview_LogItem_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UW_PlayerOverview_LogItem_C, ShowDetailsBtn) == 0x0002E1, "Member 'UW_PlayerOverview_LogItem_C::ShowDetailsBtn' has a wrong offset!");

}

