#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerClothingBuffWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerClothingBuffWidget.W_PlayerClothingBuffWidget_C.ExecuteUbergraph_W_PlayerClothingBuffWidget
// 0x0044 (0x0044 - 0x0000)
struct W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InLevel;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetExternalSkillTag_ReturnValue;          // 0x0010(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x001C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0014)()
};
static_assert(alignof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget) == 0x000004, "Wrong alignment on W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget");
static_assert(sizeof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget) == 0x000044, "Wrong size on W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, EntryPoint) == 0x000000, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, K2Node_Event_InLevel) == 0x000008, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::K2Node_Event_InLevel' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, CallFunc_GetExternalSkillTag_ReturnValue) == 0x000010, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::CallFunc_GetExternalSkillTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, CallFunc_MatchesTag_ReturnValue) == 0x000018, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, K2Node_MakeStruct_SlateColor) == 0x00001C, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'W_PlayerClothingBuffWidget_C_ExecuteUbergraph_W_PlayerClothingBuffWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function W_PlayerClothingBuffWidget.W_PlayerClothingBuffWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerClothingBuffWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerClothingBuffWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerClothingBuffWidget_C_PreConstruct");
static_assert(sizeof(W_PlayerClothingBuffWidget_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerClothingBuffWidget_C_PreConstruct");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerClothingBuffWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlayerClothingBuffWidget.W_PlayerClothingBuffWidget_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct W_PlayerClothingBuffWidget_C_SetLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerClothingBuffWidget_C_SetLevel) == 0x000004, "Wrong alignment on W_PlayerClothingBuffWidget_C_SetLevel");
static_assert(sizeof(W_PlayerClothingBuffWidget_C_SetLevel) == 0x000004, "Wrong size on W_PlayerClothingBuffWidget_C_SetLevel");
static_assert(offsetof(W_PlayerClothingBuffWidget_C_SetLevel, InLevel) == 0x000000, "Member 'W_PlayerClothingBuffWidget_C_SetLevel::InLevel' has a wrong offset!");

}

