#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerBuffWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerBuffWidget.W_PlayerBuffWidget_C
// 0x0050 (0x0308 - 0x02B8)
class UW_PlayerBuffWidget_C final : public UP2PlayerBuffWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Active;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_Inactive;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PlayerStatBg;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Bdr_PlayerStatOutline;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             StatIcon;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StatLevel;                                         // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerBuffWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetLevel(int32 InLevel)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerBuffWidget_C">();
	}
	static class UW_PlayerBuffWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerBuffWidget_C>();
	}
};
static_assert(alignof(UW_PlayerBuffWidget_C) == 0x000008, "Wrong alignment on UW_PlayerBuffWidget_C");
static_assert(sizeof(UW_PlayerBuffWidget_C) == 0x000308, "Wrong size on UW_PlayerBuffWidget_C");
static_assert(offsetof(UW_PlayerBuffWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UW_PlayerBuffWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, Bdr_Active) == 0x0002C0, "Member 'UW_PlayerBuffWidget_C::Bdr_Active' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, Bdr_Inactive) == 0x0002C8, "Member 'UW_PlayerBuffWidget_C::Bdr_Inactive' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, Bdr_PlayerStatBg) == 0x0002D0, "Member 'UW_PlayerBuffWidget_C::Bdr_PlayerStatBg' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, Bdr_PlayerStatOutline) == 0x0002D8, "Member 'UW_PlayerBuffWidget_C::Bdr_PlayerStatOutline' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, StatIcon) == 0x0002E0, "Member 'UW_PlayerBuffWidget_C::StatIcon' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, StatName) == 0x0002E8, "Member 'UW_PlayerBuffWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(UW_PlayerBuffWidget_C, StatLevel) == 0x000300, "Member 'UW_PlayerBuffWidget_C::StatLevel' has a wrong offset!");

}

