#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStatTooltip_Source

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_PlayerStatTooltip_Source.W_PlayerStatTooltip_Source_C.ExecuteUbergraph_W_PlayerStatTooltip_Source
// 0x0060 (0x0060 - 0x0000)
struct W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2GameplayAttributeDesirableChange           K2Node_Event_InDesirableChange;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x000C(0x0014)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0024(0x0014)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source) == 0x000008, "Wrong alignment on W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source");
static_assert(sizeof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source) == 0x000060, "Wrong size on W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, EntryPoint) == 0x000000, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_Event_InValue) == 0x000004, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_Event_InDesirableChange) == 0x000008, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_Event_InDesirableChange' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_MakeStruct_SlateColor) == 0x00000C, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_SwitchEnum_CmpSuccess_1) == 0x000021, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000022, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000023, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_MakeStruct_SlateColor_1) == 0x000024, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_Event_IsDesignTime) == 0x000038, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'W_PlayerStatTooltip_Source_C_ExecuteUbergraph_W_PlayerStatTooltip_Source::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function W_PlayerStatTooltip_Source.W_PlayerStatTooltip_Source_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_PlayerStatTooltip_Source_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatTooltip_Source_C_PreConstruct) == 0x000001, "Wrong alignment on W_PlayerStatTooltip_Source_C_PreConstruct");
static_assert(sizeof(W_PlayerStatTooltip_Source_C_PreConstruct) == 0x000001, "Wrong size on W_PlayerStatTooltip_Source_C_PreConstruct");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_PlayerStatTooltip_Source_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_PlayerStatTooltip_Source.W_PlayerStatTooltip_Source_C.SetDeltaColor_Implementation
// 0x0008 (0x0008 - 0x0000)
struct W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2GameplayAttributeDesirableChange           InDesirableChange;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation) == 0x000004, "Wrong alignment on W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation");
static_assert(sizeof(W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation) == 0x000008, "Wrong size on W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation, InValue) == 0x000000, "Member 'W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation::InValue' has a wrong offset!");
static_assert(offsetof(W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation, InDesirableChange) == 0x000004, "Member 'W_PlayerStatTooltip_Source_C_SetDeltaColor_Implementation::InDesirableChange' has a wrong offset!");

}

