#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStat_DetailsBuffEffectWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerStat_DetailsBuffEffectWidget.W_PlayerStat_DetailsBuffEffectWidget_C
// 0x0028 (0x0650 - 0x0628)
class UW_PlayerStat_DetailsBuffEffectWidget_C final : public UP2PlayerStatDetailBuffEffectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_LevelEffect;                                   // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            In_Color_and_Opacity;                              // 0x0638(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_PlayerStat_DetailsBuffEffectWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetActiveEffectColor_Implementation(float InValue)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerStat_DetailsBuffEffectWidget_C">();
	}
	static class UW_PlayerStat_DetailsBuffEffectWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerStat_DetailsBuffEffectWidget_C>();
	}
};
static_assert(alignof(UW_PlayerStat_DetailsBuffEffectWidget_C) == 0x000008, "Wrong alignment on UW_PlayerStat_DetailsBuffEffectWidget_C");
static_assert(sizeof(UW_PlayerStat_DetailsBuffEffectWidget_C) == 0x000650, "Wrong size on UW_PlayerStat_DetailsBuffEffectWidget_C");
static_assert(offsetof(UW_PlayerStat_DetailsBuffEffectWidget_C, UberGraphFrame) == 0x000628, "Member 'UW_PlayerStat_DetailsBuffEffectWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerStat_DetailsBuffEffectWidget_C, Bdr_LevelEffect) == 0x000630, "Member 'UW_PlayerStat_DetailsBuffEffectWidget_C::Bdr_LevelEffect' has a wrong offset!");
static_assert(offsetof(UW_PlayerStat_DetailsBuffEffectWidget_C, In_Color_and_Opacity) == 0x000638, "Member 'UW_PlayerStat_DetailsBuffEffectWidget_C::In_Color_and_Opacity' has a wrong offset!");

}

