#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Plsd_Contract_ObjectiveWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Plsd_Contract_ObjectiveWidget.W_Plsd_Contract_ObjectiveWidget_C
// 0x0020 (0x0300 - 0x02E0)
class UW_Plsd_Contract_ObjectiveWidget_C final : public UP2ContractObjectiveWidget_PLSD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_EmergentObjective;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Objective;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsComplete;                                        // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Plsd_Contract_ObjectiveWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void RefreshWidget_BP(const class UP2ContractRequirement* InRequirement, bool IsCompleted)	 // 0xae1e64;
	void SetCompleteState(bool IsComplete_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Plsd_Contract_ObjectiveWidget_C">();
	}
	static class UW_Plsd_Contract_ObjectiveWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Plsd_Contract_ObjectiveWidget_C>();
	}
};
static_assert(alignof(UW_Plsd_Contract_ObjectiveWidget_C) == 0x000008, "Wrong alignment on UW_Plsd_Contract_ObjectiveWidget_C");
static_assert(sizeof(UW_Plsd_Contract_ObjectiveWidget_C) == 0x000300, "Wrong size on UW_Plsd_Contract_ObjectiveWidget_C");
static_assert(offsetof(UW_Plsd_Contract_ObjectiveWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UW_Plsd_Contract_ObjectiveWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Plsd_Contract_ObjectiveWidget_C, HB_EmergentObjective) == 0x0002E8, "Member 'UW_Plsd_Contract_ObjectiveWidget_C::HB_EmergentObjective' has a wrong offset!");
static_assert(offsetof(UW_Plsd_Contract_ObjectiveWidget_C, HB_Objective) == 0x0002F0, "Member 'UW_Plsd_Contract_ObjectiveWidget_C::HB_Objective' has a wrong offset!");
static_assert(offsetof(UW_Plsd_Contract_ObjectiveWidget_C, IsComplete) == 0x0002F8, "Member 'UW_Plsd_Contract_ObjectiveWidget_C::IsComplete' has a wrong offset!");

}

