#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Plsd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Plsd.W_Plsd_C
// 0x0048 (0x0648 - 0x0600)
class UW_Plsd_C final : public UP2PlsdWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_Keyguide;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_Esc;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_HoldRMB;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_LAlt;                                   // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_R;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RemoveMarker;                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RMB;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KeyguideWidget_C*                    W_Keyguide_RotateMap;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnUpdatePLSDTab(EP2PlsdTab InPlsdTab)	 // 0xae1e64;
	void ExecuteUbergraph_W_Plsd(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_Plsd_C">();
	}
	static class UW_Plsd_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_Plsd_C>();
	}
};
static_assert(alignof(UW_Plsd_C) == 0x000008, "Wrong alignment on UW_Plsd_C");
static_assert(sizeof(UW_Plsd_C) == 0x000648, "Wrong size on UW_Plsd_C");
static_assert(offsetof(UW_Plsd_C, UberGraphFrame) == 0x000600, "Member 'UW_Plsd_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, HB_Keyguide) == 0x000608, "Member 'UW_Plsd_C::HB_Keyguide' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_Esc) == 0x000610, "Member 'UW_Plsd_C::W_Keyguide_Esc' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_HoldRMB) == 0x000618, "Member 'UW_Plsd_C::W_Keyguide_HoldRMB' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_LAlt) == 0x000620, "Member 'UW_Plsd_C::W_Keyguide_LAlt' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_R) == 0x000628, "Member 'UW_Plsd_C::W_Keyguide_R' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_RemoveMarker) == 0x000630, "Member 'UW_Plsd_C::W_Keyguide_RemoveMarker' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_RMB) == 0x000638, "Member 'UW_Plsd_C::W_Keyguide_RMB' has a wrong offset!");
static_assert(offsetof(UW_Plsd_C, W_Keyguide_RotateMap) == 0x000640, "Member 'UW_Plsd_C::W_Keyguide_RotateMap' has a wrong offset!");

}

