#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerStatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerStatWidget.W_PlayerStatWidget_C
// 0x0048 (0x02F8 - 0x02B0)
class UW_PlayerStatWidget_C final : public UP2PlayerStatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Txt_PlayerStatLevel;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_PlayerStatValue;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             StatIcon;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StatLevel;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStatPoint;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxStatPoint;                                      // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerStatWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetExperience(float InExperience, float InMaxExperience)	 // 0xae1e64;
	void SetLevel(int32 InLevel)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PlayerStatWidget_C">();
	}
	static class UW_PlayerStatWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PlayerStatWidget_C>();
	}
};
static_assert(alignof(UW_PlayerStatWidget_C) == 0x000008, "Wrong alignment on UW_PlayerStatWidget_C");
static_assert(sizeof(UW_PlayerStatWidget_C) == 0x0002F8, "Wrong size on UW_PlayerStatWidget_C");
static_assert(offsetof(UW_PlayerStatWidget_C, UberGraphFrame) == 0x0002B0, "Member 'UW_PlayerStatWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, Txt_PlayerStatLevel) == 0x0002B8, "Member 'UW_PlayerStatWidget_C::Txt_PlayerStatLevel' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, Txt_PlayerStatValue) == 0x0002C0, "Member 'UW_PlayerStatWidget_C::Txt_PlayerStatValue' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, StatIcon) == 0x0002C8, "Member 'UW_PlayerStatWidget_C::StatIcon' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, StatName) == 0x0002D0, "Member 'UW_PlayerStatWidget_C::StatName' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, StatLevel) == 0x0002E8, "Member 'UW_PlayerStatWidget_C::StatLevel' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, CurrentStatPoint) == 0x0002EC, "Member 'UW_PlayerStatWidget_C::CurrentStatPoint' has a wrong offset!");
static_assert(offsetof(UW_PlayerStatWidget_C, MaxStatPoint) == 0x0002F0, "Member 'UW_PlayerStatWidget_C::MaxStatPoint' has a wrong offset!");

}

