#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PopupWidget.W_PopupWidget_C
// 0x0048 (0x05F0 - 0x05A8)
class UW_PopupWidget_C final : public UP2PopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_BottomLine;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x05B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   BodyText;                                          // 0x05D0(0x0018)(Edit, BlueprintVisible)
	bool                                          SingleButtonPopup;                                 // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveInputAction_Implementable(const class UInputAction* InInputAction, const struct FGameplayTag& InInputTag, const struct FInputActionValue& InputActionValue)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void ExecuteUbergraph_W_PopupWidget(int32 EntryPoint)	 // 0xae1e64;
	void InitKeyFocus()	 // 0xae1e64;
	void OnBackAction()	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetPopup(EPopupStyle PopupStyle, const class FText& Title, const class FText& BodyMessage, const class FText& SubMessage, const TDelegate<void(EPopupButtonID ButtonID)>& PressedDelegate)	 // 0xae1e64;
	void SetPopupStyle(EPopupStyle Selection)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_PopupWidget_C">();
	}
	static class UW_PopupWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_PopupWidget_C>();
	}
};
static_assert(alignof(UW_PopupWidget_C) == 0x000008, "Wrong alignment on UW_PopupWidget_C");
static_assert(sizeof(UW_PopupWidget_C) == 0x0005F0, "Wrong size on UW_PopupWidget_C");
static_assert(offsetof(UW_PopupWidget_C, UberGraphFrame) == 0x0005A8, "Member 'UW_PopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PopupWidget_C, Img_BottomLine) == 0x0005B0, "Member 'UW_PopupWidget_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_PopupWidget_C, TitleText) == 0x0005B8, "Member 'UW_PopupWidget_C::TitleText' has a wrong offset!");
static_assert(offsetof(UW_PopupWidget_C, BodyText) == 0x0005D0, "Member 'UW_PopupWidget_C::BodyText' has a wrong offset!");
static_assert(offsetof(UW_PopupWidget_C, SingleButtonPopup) == 0x0005E8, "Member 'UW_PopupWidget_C::SingleButtonPopup' has a wrong offset!");

}

