#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ProgressionPopup_ItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ProgressionPopup_ItemWidget.W_ProgressionPopup_ItemWidget_C.InitWidgetByDataAsset_BP
// 0x0008 (0x0008 - 0x0000)
struct W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP final
{
public:
	const class UPrimaryDataAsset*                InDataAsset;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP) == 0x000008, "Wrong alignment on W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP");
static_assert(sizeof(W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP) == 0x000008, "Wrong size on W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP, InDataAsset) == 0x000000, "Member 'W_ProgressionPopup_ItemWidget_C_InitWidgetByDataAsset_BP::InDataAsset' has a wrong offset!");

// Function W_ProgressionPopup_ItemWidget.W_ProgressionPopup_ItemWidget_C.ExecuteUbergraph_W_ProgressionPopup_ItemWidget
// 0x0060 (0x0060 - 0x0000)
struct W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScaleBoxSlot*                          CallFunc_SlotAsScaleBoxSlot_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	const class UPrimaryDataAsset*                K2Node_Event_InDataAsset;                          // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2SkinSlotPreset*                      K2Node_DynamicCast_AsP2Skin_Slot_Preset;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2ItemSkinContainer*                   K2Node_DynamicCast_AsP2Item_Skin_Container;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_SlotAsGridSlot_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget) == 0x000008, "Wrong alignment on W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget");
static_assert(sizeof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget) == 0x000060, "Wrong size on W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, EntryPoint) == 0x000000, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_MakeStruct_Margin) == 0x000004, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, CallFunc_SlotAsScaleBoxSlot_ReturnValue) == 0x000018, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::CallFunc_SlotAsScaleBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_MakeStruct_Margin_1) == 0x000020, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_Event_InDataAsset) == 0x000030, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_Event_InDataAsset' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_DynamicCast_AsP2Skin_Slot_Preset) == 0x000038, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_DynamicCast_AsP2Skin_Slot_Preset' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_DynamicCast_AsP2Item_Skin_Container) == 0x000048, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_DynamicCast_AsP2Item_Skin_Container' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget, CallFunc_SlotAsGridSlot_ReturnValue) == 0x000058, "Member 'W_ProgressionPopup_ItemWidget_C_ExecuteUbergraph_W_ProgressionPopup_ItemWidget::CallFunc_SlotAsGridSlot_ReturnValue' has a wrong offset!");

}

