#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Production_OutcomeWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_Production_OutcomeWidget.W_Production_OutcomeWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Production_OutcomeWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Production_OutcomeWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_Production_OutcomeWidget_C_PreConstruct");
static_assert(sizeof(W_Production_OutcomeWidget_C_PreConstruct) == 0x000001, "Wrong size on W_Production_OutcomeWidget_C_PreConstruct");
static_assert(offsetof(W_Production_OutcomeWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Production_OutcomeWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Production_OutcomeWidget.W_Production_OutcomeWidget_C.ExecuteUbergraph_W_Production_OutcomeWidget
// 0x0008 (0x0008 - 0x0000)
struct W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget) == 0x000004, "Wrong alignment on W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget");
static_assert(sizeof(W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget) == 0x000008, "Wrong size on W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget");
static_assert(offsetof(W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget, EntryPoint) == 0x000000, "Member 'W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_Production_OutcomeWidget_C_ExecuteUbergraph_W_Production_OutcomeWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_Production_OutcomeWidget.W_Production_OutcomeWidget_C.SetAmountText
// 0x0108 (0x0108 - 0x0000)
struct W_Production_OutcomeWidget_C_SetAmountText final
{
public:
	bool                                          IsRandomAmount_0;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinAmountInt_0;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAmountInt_0;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
};
static_assert(alignof(W_Production_OutcomeWidget_C_SetAmountText) == 0x000008, "Wrong alignment on W_Production_OutcomeWidget_C_SetAmountText");
static_assert(sizeof(W_Production_OutcomeWidget_C_SetAmountText) == 0x000108, "Wrong size on W_Production_OutcomeWidget_C_SetAmountText");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, IsRandomAmount_0) == 0x000000, "Member 'W_Production_OutcomeWidget_C_SetAmountText::IsRandomAmount_0' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, MinAmountInt_0) == 0x000004, "Member 'W_Production_OutcomeWidget_C_SetAmountText::MinAmountInt_0' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, MaxAmountInt_0) == 0x000008, "Member 'W_Production_OutcomeWidget_C_SetAmountText::MaxAmountInt_0' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'W_Production_OutcomeWidget_C_SetAmountText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'W_Production_OutcomeWidget_C_SetAmountText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'W_Production_OutcomeWidget_C_SetAmountText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'W_Production_OutcomeWidget_C_SetAmountText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, K2Node_MakeArray_Array) == 0x0000E0, "Member 'W_Production_OutcomeWidget_C_SetAmountText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Production_OutcomeWidget_C_SetAmountText, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'W_Production_OutcomeWidget_C_SetAmountText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

