#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ProgressionPopup_ItemWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ProgressionPopup_ItemWidget.W_ProgressionPopup_ItemWidget_C
// 0x0048 (0x0350 - 0x0308)
class UW_ProgressionPopup_ItemWidget_C final : public UP2ProgressionPopup_ItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGridPanel*                             GP_Facility;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             GP_SkinItem;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkinColorGradient;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkinIcon;                                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_SkinItem;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              SclB_SkinItem;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_SkinItemName;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonItemWidget_C*                  W_CommonItemWidget;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitWidgetByDataAsset_BP(const class UPrimaryDataAsset* InDataAsset)	 // 0xae1e64;
	void ExecuteUbergraph_W_ProgressionPopup_ItemWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ProgressionPopup_ItemWidget_C">();
	}
	static class UW_ProgressionPopup_ItemWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ProgressionPopup_ItemWidget_C>();
	}
};
static_assert(alignof(UW_ProgressionPopup_ItemWidget_C) == 0x000008, "Wrong alignment on UW_ProgressionPopup_ItemWidget_C");
static_assert(sizeof(UW_ProgressionPopup_ItemWidget_C) == 0x000350, "Wrong size on UW_ProgressionPopup_ItemWidget_C");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, UberGraphFrame) == 0x000308, "Member 'UW_ProgressionPopup_ItemWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, GP_Facility) == 0x000310, "Member 'UW_ProgressionPopup_ItemWidget_C::GP_Facility' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, GP_SkinItem) == 0x000318, "Member 'UW_ProgressionPopup_ItemWidget_C::GP_SkinItem' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, Img_SkinColorGradient) == 0x000320, "Member 'UW_ProgressionPopup_ItemWidget_C::Img_SkinColorGradient' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, Img_SkinIcon) == 0x000328, "Member 'UW_ProgressionPopup_ItemWidget_C::Img_SkinIcon' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, Img_SkinItem) == 0x000330, "Member 'UW_ProgressionPopup_ItemWidget_C::Img_SkinItem' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, SclB_SkinItem) == 0x000338, "Member 'UW_ProgressionPopup_ItemWidget_C::SclB_SkinItem' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, Txt_SkinItemName) == 0x000340, "Member 'UW_ProgressionPopup_ItemWidget_C::Txt_SkinItemName' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_ItemWidget_C, W_CommonItemWidget) == 0x000348, "Member 'UW_ProgressionPopup_ItemWidget_C::W_CommonItemWidget' has a wrong offset!");

}

