#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ProgressionPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ProgressionPopup.W_ProgressionPopup_C
// 0x0078 (0x06E8 - 0x0670)
class UW_ProgressionPopup_C final : public UP2ProgressionPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_Main;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BottomLine;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Divider;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DotPattern;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PopupBg;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Contract;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Facility;                                      // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         EventType;                                         // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PmcOrFactionRepLevel;                              // 0x06B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Faction;                                           // 0x06B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FacilityName;                                      // 0x06C0(0x0018)(Edit, BlueprintVisible)
	int32                                         FactionWagePrev;                                   // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasSkinItem;                                      // 0x06DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DD[0x3];                                      // 0x06DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NextIndex;                                         // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetBody(const struct FGameplayTag& InNotificationTag)	 // 0xae1e64;
	void ExecuteUbergraph_W_ProgressionPopup(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;
	void AddSkinCustomizationReward_BP(const class UP2UnlockContentRewardBase* InReward)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_ProgressionPopup_C">();
	}
	static class UW_ProgressionPopup_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_ProgressionPopup_C>();
	}
};
static_assert(alignof(UW_ProgressionPopup_C) == 0x000008, "Wrong alignment on UW_ProgressionPopup_C");
static_assert(sizeof(UW_ProgressionPopup_C) == 0x0006E8, "Wrong size on UW_ProgressionPopup_C");
static_assert(offsetof(UW_ProgressionPopup_C, UberGraphFrame) == 0x000670, "Member 'UW_ProgressionPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Bdr_Main) == 0x000678, "Member 'UW_ProgressionPopup_C::Bdr_Main' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Img_BottomLine) == 0x000680, "Member 'UW_ProgressionPopup_C::Img_BottomLine' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Img_Divider) == 0x000688, "Member 'UW_ProgressionPopup_C::Img_Divider' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Img_DotPattern) == 0x000690, "Member 'UW_ProgressionPopup_C::Img_DotPattern' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Img_PopupBg) == 0x000698, "Member 'UW_ProgressionPopup_C::Img_PopupBg' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Txt_Contract) == 0x0006A0, "Member 'UW_ProgressionPopup_C::Txt_Contract' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Txt_Facility) == 0x0006A8, "Member 'UW_ProgressionPopup_C::Txt_Facility' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, EventType) == 0x0006B0, "Member 'UW_ProgressionPopup_C::EventType' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, PmcOrFactionRepLevel) == 0x0006B4, "Member 'UW_ProgressionPopup_C::PmcOrFactionRepLevel' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, Faction) == 0x0006B8, "Member 'UW_ProgressionPopup_C::Faction' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, FacilityName) == 0x0006C0, "Member 'UW_ProgressionPopup_C::FacilityName' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, FactionWagePrev) == 0x0006D8, "Member 'UW_ProgressionPopup_C::FactionWagePrev' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, bHasSkinItem) == 0x0006DC, "Member 'UW_ProgressionPopup_C::bHasSkinItem' has a wrong offset!");
static_assert(offsetof(UW_ProgressionPopup_C, NextIndex) == 0x0006E0, "Member 'UW_ProgressionPopup_C::NextIndex' has a wrong offset!");

}

