#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ProgressionPopup

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function W_ProgressionPopup.W_ProgressionPopup_C.SetBody
// 0x000C (0x000C - 0x0000)
struct W_ProgressionPopup_C_SetBody final
{
public:
	struct FGameplayTag                           InNotificationTag;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ProgressionPopup_C_SetBody) == 0x000004, "Wrong alignment on W_ProgressionPopup_C_SetBody");
static_assert(sizeof(W_ProgressionPopup_C_SetBody) == 0x00000C, "Wrong size on W_ProgressionPopup_C_SetBody");
static_assert(offsetof(W_ProgressionPopup_C_SetBody, InNotificationTag) == 0x000000, "Member 'W_ProgressionPopup_C_SetBody::InNotificationTag' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_SetBody, CallFunc_MatchesTag_ReturnValue) == 0x000008, "Member 'W_ProgressionPopup_C_SetBody::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_SetBody, CallFunc_MatchesTag_ReturnValue_1) == 0x000009, "Member 'W_ProgressionPopup_C_SetBody::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_SetBody, CallFunc_MatchesTag_ReturnValue_2) == 0x00000A, "Member 'W_ProgressionPopup_C_SetBody::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");

// Function W_ProgressionPopup.W_ProgressionPopup_C.ExecuteUbergraph_W_ProgressionPopup
// 0x0080 (0x0080 - 0x0000)
struct W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UP2UnlockContentRewardBase*       K2Node_Event_InReward;                             // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UnlockContentReward_SkinCustomization_C* K2Node_DynamicCast_AsBP_Unlock_Content_Reward_Skin_Customization; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UP2SkinSlotPreset*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UP2ItemSkinContainer*                   CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddItemWidget_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AddItemWidget_ReturnValue_1;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup) == 0x000008, "Wrong alignment on W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup");
static_assert(sizeof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup) == 0x000080, "Wrong size on W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, EntryPoint) == 0x000000, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, Temp_delegate_Variable) == 0x000014, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, K2Node_Event_InReward) == 0x000030, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::K2Node_Event_InReward' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_PostEvent_ReturnValue) == 0x000038, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, K2Node_DynamicCast_AsBP_Unlock_Content_Reward_Skin_Customization) == 0x000040, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::K2Node_DynamicCast_AsBP_Unlock_Content_Reward_Skin_Customization' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Array_Get_Item) == 0x000050, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_AddItemWidget_ReturnValue) == 0x000060, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_AddItemWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_AddItemWidget_ReturnValue_1) == 0x000064, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_AddItemWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000075, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'W_ProgressionPopup_C_ExecuteUbergraph_W_ProgressionPopup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_ProgressionPopup.W_ProgressionPopup_C.AddSkinCustomizationReward_BP
// 0x0008 (0x0008 - 0x0000)
struct W_ProgressionPopup_C_AddSkinCustomizationReward_BP final
{
public:
	const class UP2UnlockContentRewardBase*       InReward;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ProgressionPopup_C_AddSkinCustomizationReward_BP) == 0x000008, "Wrong alignment on W_ProgressionPopup_C_AddSkinCustomizationReward_BP");
static_assert(sizeof(W_ProgressionPopup_C_AddSkinCustomizationReward_BP) == 0x000008, "Wrong size on W_ProgressionPopup_C_AddSkinCustomizationReward_BP");
static_assert(offsetof(W_ProgressionPopup_C_AddSkinCustomizationReward_BP, InReward) == 0x000000, "Member 'W_ProgressionPopup_C_AddSkinCustomizationReward_BP::InReward' has a wrong offset!");

}

