#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_RaidSummary_NetGainWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_RaidSummary_NetGainWidget.W_RaidResult_RaidSummary_NetGainWidget_C.SetNetGain
// 0x0168 (0x0168 - 0x0000)
struct W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain final
{
public:
	int32                                         ValueExtract;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueDeploy;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00A8(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C0(0x0014)()
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0128(0x0010)(ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0138(0x0014)()
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0150(0x0018)()
};
static_assert(alignof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain) == 0x000008, "Wrong alignment on W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain");
static_assert(sizeof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain) == 0x000168, "Wrong size on W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, ValueExtract) == 0x000000, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::ValueExtract' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, ValueDeploy) == 0x000004, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::ValueDeploy' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeArray_Array) == 0x000080, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Format_ReturnValue) == 0x000090, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000A8, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeStruct_SlateColor) == 0x0000C0, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeArray_Array_1) == 0x000128, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, K2Node_MakeStruct_SlateColor_1) == 0x000138, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain, CallFunc_Format_ReturnValue_1) == 0x000150, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_SetNetGain::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function W_RaidResult_RaidSummary_NetGainWidget.W_RaidResult_RaidSummary_NetGainWidget_C.RefreshNetGainWidgetOnBP
// 0x0008 (0x0008 - 0x0000)
struct W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP final
{
public:
	int32                                         InValueExtract;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InValueDeploy;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP) == 0x000004, "Wrong alignment on W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP");
static_assert(sizeof(W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP) == 0x000008, "Wrong size on W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP, InValueExtract) == 0x000000, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP::InValueExtract' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP, InValueDeploy) == 0x000004, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_RefreshNetGainWidgetOnBP::InValueDeploy' has a wrong offset!");

// Function W_RaidResult_RaidSummary_NetGainWidget.W_RaidResult_RaidSummary_NetGainWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_RaidSummary_NetGainWidget.W_RaidResult_RaidSummary_NetGainWidget_C.ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget
// 0x0010 (0x0010 - 0x0000)
struct W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InValueExtract;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InValueDeploy;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget) == 0x000004, "Wrong alignment on W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget");
static_assert(sizeof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget) == 0x000010, "Wrong size on W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget, K2Node_Event_InValueExtract) == 0x000008, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget::K2Node_Event_InValueExtract' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget, K2Node_Event_InValueDeploy) == 0x00000C, "Member 'W_RaidResult_RaidSummary_NetGainWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_NetGainWidget::K2Node_Event_InValueDeploy' has a wrong offset!");

}

