#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_RaidSummary_StatWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_RaidResult_RaidSummary_StatWidget.W_RaidResult_RaidSummary_StatWidget_C.SetStat
// 0x0150 (0x0150 - 0x0000)
struct W_RaidResult_RaidSummary_StatWidget_C_SetStat final
{
public:
	class FText                                   StatName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsStatTime;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StatValue;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutHour;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutMinute;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SecondToTimer_OutSecond;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
	float                                         CallFunc_SecondToTimer_Second_ImplicitCast;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_StatWidget_C_SetStat) == 0x000008, "Wrong alignment on W_RaidResult_RaidSummary_StatWidget_C_SetStat");
static_assert(sizeof(W_RaidResult_RaidSummary_StatWidget_C_SetStat) == 0x000150, "Wrong size on W_RaidResult_RaidSummary_StatWidget_C_SetStat");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, StatName) == 0x000000, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::StatName' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, IsStatTime) == 0x000018, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::IsStatTime' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, StatValue) == 0x000020, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::StatValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_SecondToTimer_OutHour) == 0x000028, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_SecondToTimer_OutHour' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_SecondToTimer_OutMinute) == 0x00002C, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_SecondToTimer_OutMinute' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_SecondToTimer_OutSecond) == 0x000030, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_SecondToTimer_OutSecond' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000038, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000B8, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D0, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, K2Node_MakeArray_Array) == 0x000120, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_Format_ReturnValue) == 0x000130, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_SetStat, CallFunc_SecondToTimer_Second_ImplicitCast) == 0x000148, "Member 'W_RaidResult_RaidSummary_StatWidget_C_SetStat::CallFunc_SecondToTimer_Second_ImplicitCast' has a wrong offset!");

// Function W_RaidResult_RaidSummary_StatWidget.W_RaidResult_RaidSummary_StatWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidResult_RaidSummary_StatWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_StatWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidResult_RaidSummary_StatWidget_C_PreConstruct");
static_assert(sizeof(W_RaidResult_RaidSummary_StatWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidResult_RaidSummary_StatWidget_C_PreConstruct");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidResult_RaidSummary_StatWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidResult_RaidSummary_StatWidget.W_RaidResult_RaidSummary_StatWidget_C.ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget
// 0x0008 (0x0008 - 0x0000)
struct W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget) == 0x000004, "Wrong alignment on W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget");
static_assert(sizeof(W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget) == 0x000008, "Wrong size on W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget, EntryPoint) == 0x000000, "Member 'W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidResult_RaidSummary_StatWidget_C_ExecuteUbergraph_W_RaidResult_RaidSummary_StatWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

}

