#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_CombatLogHeaderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_CombatLogHeaderWidget.W_RaidResult_CombatLogHeaderWidget_C
// 0x0038 (0x02B8 - 0x0280)
class UW_RaidResult_CombatLogHeaderWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_Time;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_CombatLogTitle;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Name;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Stat01;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Stat02;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Pmc_Combat_Log;                                 // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetHeader(bool IsPmcCombatLog)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_CombatLogHeaderWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_CombatLogHeaderWidget_C">();
	}
	static class UW_RaidResult_CombatLogHeaderWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_CombatLogHeaderWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_CombatLogHeaderWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_CombatLogHeaderWidget_C");
static_assert(sizeof(UW_RaidResult_CombatLogHeaderWidget_C) == 0x0002B8, "Wrong size on UW_RaidResult_CombatLogHeaderWidget_C");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, UberGraphFrame) == 0x000280, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, SzB_Time) == 0x000288, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::SzB_Time' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, Txt_CombatLogTitle) == 0x000290, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::Txt_CombatLogTitle' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, Txt_Name) == 0x000298, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, Txt_Stat01) == 0x0002A0, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::Txt_Stat01' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, Txt_Stat02) == 0x0002A8, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::Txt_Stat02' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_CombatLogHeaderWidget_C, Is_Pmc_Combat_Log) == 0x0002B0, "Member 'UW_RaidResult_CombatLogHeaderWidget_C::Is_Pmc_Combat_Log' has a wrong offset!");

}

