#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidDeployment_PlayerWidget

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C.ExecuteUbergraph_W_RaidDeployment_PlayerWidget
// 0x0008 (0x0008 - 0x0000)
struct W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget) == 0x000004, "Wrong alignment on W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget");
static_assert(sizeof(W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget) == 0x000008, "Wrong size on W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget, EntryPoint) == 0x000000, "Member 'W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_RaidDeployment_PlayerWidget_C_ExecuteUbergraph_W_RaidDeployment_PlayerWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_RaidDeployment_PlayerWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_PlayerWidget_C_PreConstruct) == 0x000001, "Wrong alignment on W_RaidDeployment_PlayerWidget_C_PreConstruct");
static_assert(sizeof(W_RaidDeployment_PlayerWidget_C_PreConstruct) == 0x000001, "Wrong size on W_RaidDeployment_PlayerWidget_C_PreConstruct");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_RaidDeployment_PlayerWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C.SetEmpty
// 0x0001 (0x0001 - 0x0000)
struct W_RaidDeployment_PlayerWidget_C_SetEmpty final
{
public:
	bool                                          InIsEmpty;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_PlayerWidget_C_SetEmpty) == 0x000001, "Wrong alignment on W_RaidDeployment_PlayerWidget_C_SetEmpty");
static_assert(sizeof(W_RaidDeployment_PlayerWidget_C_SetEmpty) == 0x000001, "Wrong size on W_RaidDeployment_PlayerWidget_C_SetEmpty");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_SetEmpty, InIsEmpty) == 0x000000, "Member 'W_RaidDeployment_PlayerWidget_C_SetEmpty::InIsEmpty' has a wrong offset!");

// Function W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C.SetLeader
// 0x0003 (0x0003 - 0x0000)
struct W_RaidDeployment_PlayerWidget_C_SetLeader final
{
public:
	bool                                          InIsLeader;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EP2MatchCountdownState                        InMatchCountdownState;                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_RaidDeployment_PlayerWidget_C_SetLeader) == 0x000001, "Wrong alignment on W_RaidDeployment_PlayerWidget_C_SetLeader");
static_assert(sizeof(W_RaidDeployment_PlayerWidget_C_SetLeader) == 0x000003, "Wrong size on W_RaidDeployment_PlayerWidget_C_SetLeader");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_SetLeader, InIsLeader) == 0x000000, "Member 'W_RaidDeployment_PlayerWidget_C_SetLeader::InIsLeader' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_SetLeader, InMatchCountdownState) == 0x000001, "Member 'W_RaidDeployment_PlayerWidget_C_SetLeader::InMatchCountdownState' has a wrong offset!");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_SetLeader, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'W_RaidDeployment_PlayerWidget_C_SetLeader::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function W_RaidDeployment_PlayerWidget.W_RaidDeployment_PlayerWidget_C.SetPlayerName
// 0x0018 (0x0018 - 0x0000)
struct W_RaidDeployment_PlayerWidget_C_SetPlayerName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_RaidDeployment_PlayerWidget_C_SetPlayerName) == 0x000008, "Wrong alignment on W_RaidDeployment_PlayerWidget_C_SetPlayerName");
static_assert(sizeof(W_RaidDeployment_PlayerWidget_C_SetPlayerName) == 0x000018, "Wrong size on W_RaidDeployment_PlayerWidget_C_SetPlayerName");
static_assert(offsetof(W_RaidDeployment_PlayerWidget_C_SetPlayerName, InText) == 0x000000, "Member 'W_RaidDeployment_PlayerWidget_C_SetPlayerName::InText' has a wrong offset!");

}

