#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RadialUi_ItemIconWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RadialUi_ItemIconWidget.W_RadialUi_ItemIconWidget_C
// 0x0010 (0x0318 - 0x0308)
class UW_RadialUi_ItemIconWidget_C final : public UP2RadialItemIconWIdget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsDisabled;                                        // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGroupedOption;                                   // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_RadialUi_ItemIconWidget(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime)	 // 0xae1e64;
	void UpdateWidgetByActive_ImplementableEvent(bool Inactive)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RadialUi_ItemIconWidget_C">();
	}
	static class UW_RadialUi_ItemIconWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RadialUi_ItemIconWidget_C>();
	}
};
static_assert(alignof(UW_RadialUi_ItemIconWidget_C) == 0x000008, "Wrong alignment on UW_RadialUi_ItemIconWidget_C");
static_assert(sizeof(UW_RadialUi_ItemIconWidget_C) == 0x000318, "Wrong size on UW_RadialUi_ItemIconWidget_C");
static_assert(offsetof(UW_RadialUi_ItemIconWidget_C, UberGraphFrame) == 0x000308, "Member 'UW_RadialUi_ItemIconWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_ItemIconWidget_C, IsDisabled) == 0x000310, "Member 'UW_RadialUi_ItemIconWidget_C::IsDisabled' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_ItemIconWidget_C, IsSelected) == 0x000311, "Member 'UW_RadialUi_ItemIconWidget_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UW_RadialUi_ItemIconWidget_C, IsGroupedOption) == 0x000312, "Member 'UW_RadialUi_ItemIconWidget_C::IsGroupedOption' has a wrong offset!");

}

