#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_HitInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_HitInfoWidget.W_RaidResult_HitInfoWidget_C
// 0x0058 (0x0368 - 0x0310)
class UW_RaidResult_HitInfoWidget_C final : public UP2RaidResultHitInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_HitValues;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_DamageCause;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SzB_FatalBlowLabel;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Area;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_HitInfo;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HitAreaName;                                       // 0x0340(0x0018)(Edit, BlueprintVisible)
	double                                        DamageValue;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitNumber;                                         // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFatalBlow;                                       // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeftSide;                                        // 0x0365(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNonBallisticDmg;                                 // 0x0366(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void RefreshHitInfoWidgetOnBP(const struct FP2RaidResultHitInfo& InData)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void GetAreaTextWithTag(const struct FGameplayTag& InHitMapZoneTag, class FText* HitMapZoneText)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_HitInfoWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_HitInfoWidget_C">();
	}
	static class UW_RaidResult_HitInfoWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_HitInfoWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_HitInfoWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_HitInfoWidget_C");
static_assert(sizeof(UW_RaidResult_HitInfoWidget_C) == 0x000368, "Wrong size on UW_RaidResult_HitInfoWidget_C");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, UberGraphFrame) == 0x000310, "Member 'UW_RaidResult_HitInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, HB_HitValues) == 0x000318, "Member 'UW_RaidResult_HitInfoWidget_C::HB_HitValues' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, SzB_DamageCause) == 0x000320, "Member 'UW_RaidResult_HitInfoWidget_C::SzB_DamageCause' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, SzB_FatalBlowLabel) == 0x000328, "Member 'UW_RaidResult_HitInfoWidget_C::SzB_FatalBlowLabel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, Txt_Area) == 0x000330, "Member 'UW_RaidResult_HitInfoWidget_C::Txt_Area' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, Txt_HitInfo) == 0x000338, "Member 'UW_RaidResult_HitInfoWidget_C::Txt_HitInfo' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, HitAreaName) == 0x000340, "Member 'UW_RaidResult_HitInfoWidget_C::HitAreaName' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, DamageValue) == 0x000358, "Member 'UW_RaidResult_HitInfoWidget_C::DamageValue' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, HitNumber) == 0x000360, "Member 'UW_RaidResult_HitInfoWidget_C::HitNumber' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, IsFatalBlow) == 0x000364, "Member 'UW_RaidResult_HitInfoWidget_C::IsFatalBlow' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, IsLeftSide) == 0x000365, "Member 'UW_RaidResult_HitInfoWidget_C::IsLeftSide' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_HitInfoWidget_C, IsNonBallisticDmg) == 0x000366, "Member 'UW_RaidResult_HitInfoWidget_C::IsNonBallisticDmg' has a wrong offset!");

}

