#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidReport_SquadContractRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidReport_SquadContractRewards.W_RaidReport_SquadContractRewards_C
// 0x0030 (0x02B0 - 0x0280)
class UW_RaidReport_SquadContractRewards_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bdr_SquadContractRewards;                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_RewardIcon;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Reward;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsExpReward;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RewardValue;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_RaidReport_SquadContractRewards(int32 EntryPoint)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void SetReward(bool InIsEXPReward, double RewardValue_0)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidReport_SquadContractRewards_C">();
	}
	static class UW_RaidReport_SquadContractRewards_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidReport_SquadContractRewards_C>();
	}
};
static_assert(alignof(UW_RaidReport_SquadContractRewards_C) == 0x000008, "Wrong alignment on UW_RaidReport_SquadContractRewards_C");
static_assert(sizeof(UW_RaidReport_SquadContractRewards_C) == 0x0002B0, "Wrong size on UW_RaidReport_SquadContractRewards_C");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, UberGraphFrame) == 0x000280, "Member 'UW_RaidReport_SquadContractRewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, Bdr_SquadContractRewards) == 0x000288, "Member 'UW_RaidReport_SquadContractRewards_C::Bdr_SquadContractRewards' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, Img_RewardIcon) == 0x000290, "Member 'UW_RaidReport_SquadContractRewards_C::Img_RewardIcon' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, Txt_Reward) == 0x000298, "Member 'UW_RaidReport_SquadContractRewards_C::Txt_Reward' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, IsExpReward) == 0x0002A0, "Member 'UW_RaidReport_SquadContractRewards_C::IsExpReward' has a wrong offset!");
static_assert(offsetof(UW_RaidReport_SquadContractRewards_C, RewardValue) == 0x0002A8, "Member 'UW_RaidReport_SquadContractRewards_C::RewardValue' has a wrong offset!");

}

