#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_RaidSummaryWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_RaidSummaryWidget.W_RaidResult_RaidSummaryWidget_C
// 0x0038 (0x05D8 - 0x05A0)
class UW_RaidResult_RaidSummaryWidget_C final : public UP2RaidResultRaidSummaryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ValueExtract;                                      // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValueDeploy;                                       // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PmcKills;                                          // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NpcKills;                                          // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DmgDealt;                                          // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RaidTimeSec;                                       // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ArtifactCount;                                     // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_RaidResult_PlayerExpWidget_C*        As_W_Raid_Result_Player_Exp_Widget;                // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void PlayGaugeExpAnim()	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_RaidSummaryWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_RaidSummaryWidget_C">();
	}
	static class UW_RaidResult_RaidSummaryWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_RaidSummaryWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_RaidSummaryWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_RaidSummaryWidget_C");
static_assert(sizeof(UW_RaidResult_RaidSummaryWidget_C) == 0x0005D8, "Wrong size on UW_RaidResult_RaidSummaryWidget_C");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, UberGraphFrame) == 0x0005A0, "Member 'UW_RaidResult_RaidSummaryWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, ValueExtract) == 0x0005A8, "Member 'UW_RaidResult_RaidSummaryWidget_C::ValueExtract' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, ValueDeploy) == 0x0005AC, "Member 'UW_RaidResult_RaidSummaryWidget_C::ValueDeploy' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, PmcKills) == 0x0005B0, "Member 'UW_RaidResult_RaidSummaryWidget_C::PmcKills' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, NpcKills) == 0x0005B4, "Member 'UW_RaidResult_RaidSummaryWidget_C::NpcKills' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, DmgDealt) == 0x0005B8, "Member 'UW_RaidResult_RaidSummaryWidget_C::DmgDealt' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, RaidTimeSec) == 0x0005C0, "Member 'UW_RaidResult_RaidSummaryWidget_C::RaidTimeSec' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, ArtifactCount) == 0x0005C8, "Member 'UW_RaidResult_RaidSummaryWidget_C::ArtifactCount' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_RaidSummaryWidget_C, As_W_Raid_Result_Player_Exp_Widget) == 0x0005D0, "Member 'UW_RaidResult_RaidSummaryWidget_C::As_W_Raid_Result_Player_Exp_Widget' has a wrong offset!");

}

