#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_EnemyInfoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_EnemyInfoWidget.W_RaidResult_EnemyInfoWidget_C
// 0x0030 (0x08E0 - 0x08B0)
class UW_RaidResult_EnemyInfoWidget_C final : public UP2RaidResultEnemyInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAnim;                                       // 0x08B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Init;                                              // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAnim;                                        // 0x08C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               SzB_BackBtn;                                       // 0x08D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_EnemyInfoTitle;                                // 0x08D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnClickedCommonBtn_BackOnBP()	 // 0xae1e64;
	void Finished_FC555B3A40143D4F2752219C53ED0662()	 // 0xae1e64;
	void Finished_80730DA84201E953E87CF1BF7BD3302C()	 // 0xae1e64;
	void Finished_3F7EE33947977E53600768B760040A3A()	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_EnemyInfoWidget(int32 EntryPoint)	 // 0xae1e64;
	void Construct()	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_EnemyInfoWidget_C">();
	}
	static class UW_RaidResult_EnemyInfoWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_EnemyInfoWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_EnemyInfoWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_EnemyInfoWidget_C");
static_assert(sizeof(UW_RaidResult_EnemyInfoWidget_C) == 0x0008E0, "Wrong size on UW_RaidResult_EnemyInfoWidget_C");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, UberGraphFrame) == 0x0008B0, "Member 'UW_RaidResult_EnemyInfoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, FadeOutAnim) == 0x0008B8, "Member 'UW_RaidResult_EnemyInfoWidget_C::FadeOutAnim' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, Init) == 0x0008C0, "Member 'UW_RaidResult_EnemyInfoWidget_C::Init' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, FadeInAnim) == 0x0008C8, "Member 'UW_RaidResult_EnemyInfoWidget_C::FadeInAnim' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, SzB_BackBtn) == 0x0008D0, "Member 'UW_RaidResult_EnemyInfoWidget_C::SzB_BackBtn' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_EnemyInfoWidget_C, Txt_EnemyInfoTitle) == 0x0008D8, "Member 'UW_RaidResult_EnemyInfoWidget_C::Txt_EnemyInfoTitle' has a wrong offset!");

}

