#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RaidResult_LootingLogWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Hideout_structs.hpp"
#include "Hideout_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RaidResult_LootingLogWidget.W_RaidResult_LootingLogWidget_C
// 0x0078 (0x0340 - 0x02C8)
class UW_RaidResult_LootingLogWidget_C final : public UP2RaidResultLootingLogWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SzB_ArtifactLabel;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_ItemValue;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Location;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Name;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Quantity;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Status;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Item_Name;                                         // 0x0300(0x0018)(Edit, BlueprintVisible)
	int32                                         Item_Value;                                        // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Location;                                          // 0x0320(0x0018)(Edit, BlueprintVisible)
	bool                                          Is_Artifact;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Looted;                                         // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetItemLogInfo(const class FText& ItemName, int32 ItemQuantity, int32 ItemValue, const class FText& Location_0, EFP2ItemLootState LootState)	 // 0xae1e64;
	void SetArtifactLabel(bool IsArtifact)	 // 0xae1e64;
	void RefreshLootingLogWidgetOnBP(const struct FP2RaidResultLootingLogInfo& InData)	 // 0xae1e64;
	void PreConstruct(bool IsDesignTime)	 // 0xae1e64;
	void ExecuteUbergraph_W_RaidResult_LootingLogWidget(int32 EntryPoint)	 // 0xae1e64;

public:
	static class UClass* StaticClass()	 // 0x0
	{
		return StaticBPGeneratedClassImpl<"W_RaidResult_LootingLogWidget_C">();
	}
	static class UW_RaidResult_LootingLogWidget_C* GetDefaultObj()	 // 0x0
	{
		return GetDefaultObjImpl<UW_RaidResult_LootingLogWidget_C>();
	}
};
static_assert(alignof(UW_RaidResult_LootingLogWidget_C) == 0x000008, "Wrong alignment on UW_RaidResult_LootingLogWidget_C");
static_assert(sizeof(UW_RaidResult_LootingLogWidget_C) == 0x000340, "Wrong size on UW_RaidResult_LootingLogWidget_C");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, UberGraphFrame) == 0x0002C8, "Member 'UW_RaidResult_LootingLogWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, SzB_ArtifactLabel) == 0x0002D0, "Member 'UW_RaidResult_LootingLogWidget_C::SzB_ArtifactLabel' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Txt_ItemValue) == 0x0002D8, "Member 'UW_RaidResult_LootingLogWidget_C::Txt_ItemValue' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Txt_Location) == 0x0002E0, "Member 'UW_RaidResult_LootingLogWidget_C::Txt_Location' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Txt_Name) == 0x0002E8, "Member 'UW_RaidResult_LootingLogWidget_C::Txt_Name' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Txt_Quantity) == 0x0002F0, "Member 'UW_RaidResult_LootingLogWidget_C::Txt_Quantity' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Txt_Status) == 0x0002F8, "Member 'UW_RaidResult_LootingLogWidget_C::Txt_Status' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Item_Name) == 0x000300, "Member 'UW_RaidResult_LootingLogWidget_C::Item_Name' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Item_Value) == 0x000318, "Member 'UW_RaidResult_LootingLogWidget_C::Item_Value' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Location) == 0x000320, "Member 'UW_RaidResult_LootingLogWidget_C::Location' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Is_Artifact) == 0x000338, "Member 'UW_RaidResult_LootingLogWidget_C::Is_Artifact' has a wrong offset!");
static_assert(offsetof(UW_RaidResult_LootingLogWidget_C, Is_Looted) == 0x000339, "Member 'UW_RaidResult_LootingLogWidget_C::Is_Looted' has a wrong offset!");

}

